[can you attach the relevant broker and client logs and xml configuration? , here is an example error logged at one of our mule instances. it's allways the same error that gets logged:

ERROR 2010-09-07 04:03:26,844 [ActiveMQ Connection Executor: tcp:///w.x.y.z:61616] [] [] org.mule.retry.notifiers.ConnectNotifier: Failed to connect/reconnect: jms://topic:my.app.topic
    Root Exception was: Channel was inactive for too long: /w.x.y.z:61616. Type: class org.apache.activemq.transport.InactivityIOException

i cannot find any error log entry in the logs of the activemq brokers that look to be related to this problem. the xml config of the broker is attached. for the client i do not have one beside the mule configuration. do you want to see this, too?, are you using the failover: transport on the Mule side to connect to activemq?, no we don't. mule implements its own reconnect strategy by using the mul retryPolicies construct., the following looks interessting to me, too. we've got a durable topic consumer configured in our muleInstanze. once the broker dies the durable topic consumer is connected to, the consumer tries to reconnect and gets forwarded to the second broker by the load balancer. the second broker than refuses the connection because it thinks that there is allready a client using the specific durable topic consumer id. this looks to me like the second broker does not know that the first one has died and therefore does not clean up the clientIds which it knows are used for connections to the first broker.

of course the ids used are unique through all instances that are running. heres the log entry from our mule instance:

ERROR 2010-10-25 08:46:35,081 [ActiveMQ Connection Executor: tcp:///w.x.y.z:61616] [] [] org.mule.retry.notifiers.ConnectNotifier: Failed to connect/reconnect: jms://topic:our.cool.topic. Root Exception was: Durable consumer is in use for client: ourSystem.activemq-connector.f542389b-624a-4eec-85a7-cecadb5ec4ae and subscriptionName: our.durable.topic.consumer#f542399b-624a-4eec-85a7-cecadb2ec4ae(JMS Code: null). Type: class javax.jms.JMSException, facing this problem we are not able to use activeMq as a reliable jms infrastructure....]