[This is the workaround i have found which seems to get it to work:

{noformat}
            BrokerService _broker.setStartAsync(true);
            org.apache.activemq.broker.Broker tmpBroker = _broker.getBroker();
            org.apache.activemq.broker.Broker tmpRegBroker = _broker.getRegionBroker();
            ((org.apache.activemq.broker.jmx.ManagedRegionBroker)tmpRegBroker).setContextBroker(tmpBroker);
            _broker.start();
{noformat}, If you can provide a unit test that reproduces that would be helpful., Attached a unit test which exhibits the NPE., I'm brand new to ActiveMQ, but am interested in contributing, so I decided to take a stab at this ticket.

It seems that there may be a bit of a race condition when using the async start option on an embedded broker. I ran the provided unit test, and noticed that the NPE did not appear when I added a short delay between starting the broker and then initiating the connection to the broker. Specifically, what happens is that the main thread attempts to connect to the broker before the broker start up thread has completed (i.e. the broker has set its broker service instance).

I haven't diffed the 5.9 and 5.9.1 versions so I'm not sure what could have caused this to become a new issue.

As mentioned, I don't know much about the internal workings of ActiveMQ. However, as a suggestion, if the above is an accurate explanation of this issue, perhaps one possible fix would be to the TransportConnection class to wait until the broker has fully started to initiate the connection -- something along the lines of adding a "while (!broker.getBrokerService().isStarted()) " with that method already provided by the library.

Any thoughts?, One way to start is to try and find the commit that broke what was apparently working before.  You could try using the git bisect command to run the your test code on each commit between 5.9.0 and 5.9.1 to see where things broke.  

If you look into the BrokerServer.java code at the start method and various aspect of the async option it should give you some insights into how things work there.  The main issue seems to be that the broker is getting registered in the BrokerRegistry prior to having become fully started which allows your VM based transport to get ahead of the starting broker.  , There was actually already a race condition on async startup, as i reported in the related issue, it just got worse in 5.9.1.  i don't think there is necessarily a need for an isStarted loop.  the connector already does something to that affect _after_ it gets a valid handle to the broker.  the gist of the problem is that there are a few "key" broker references which _must_ be initialized before the asynchronous startup part proceeds (i.e. before the start() method call returns).  if you look at the  workaround i posted, you can see which references need to be initialized before the start method returns., If I'm reading it correctly (for which there is a high probability that I'm not), the current check to see if the broker has started in the VMTransportFactory's lookupBroker method are bypassed during async startup, because as Timothy mentioned, the broker is registered just as the broker startup, and before initialization of key references, begins. Consequently, the incoming VM transport will not wait for the specified period of time nor wait until the broker is started to proceed with initiating the connection. 
{code}
            broker = registry.lookup(brokerName);
            if (broker == null && waitForStart > 0) {
                final long expiry = System.currentTimeMillis() + waitForStart;
                while ((broker == null || !broker.isStarted()) && expiry > System.currentTimeMillis()) {
{code}
It appears that perhaps 1) the broker registration in the registry should somehow be postponed until the end of the async startup, 2) the required broker references should be initialized before the async startup begins a version of which is done in James' workaround, or 3) the broker.isStarted() check can always be required in the lookupBroker method, not just when the broker can't yet be found in the registry.

Incidentally, I saw a comment on an old ticket saying, "Brokers agains start synchronously by default, which is needed for vm transport embedded case"  (https://issues.apache.org/jira/browse/AMQ-3696). ]