[
Confirmed to be caused by the netscaler VIP checking every 5 seconds to see if the broker is still alive.
Changing the algorithm on the load balancer to use ping checking instead of the default tcp connection testing resolved the issue.

Still probably worth investigating why the tcp connection ping causes the STOMP connector to exaust all memory.

Joel Schaubert
, I can reproduce this.

This actually is affecting our business. When the AMQ is up for 7 to 10 days (a quite short time) with 18m to 22m of messages, this errors occurs and we have to restart it manually.

Would love to have a patch instead of waiting for 5.4 which is way ahead (5.2 is just out), Hi Loc,
We traced this down to a problem with the way the monitoring system was
checking to see if the broker was alive.   The monitor was pinging the
broker in a way that caused the broker to open up and dedicate resources for
a new connection,  but the monitor did not do what was necessary to allow
the broker to finish.

If you have some ping/monitor looking at your broker you should try changing
the method it uses to do its health checking.

Can I ask what kind of application you are using ActiveMQ for?

Joel Schaubert



, Oh, I see your point. I may have misunderstood that sadly.

We are using ActiveMQ to collect a large number of information from clients such as download, real time click  tracking, real time client IP (the country uses dynamic IPs).

Anyway, I got the same exact error as reported which is out of memory. We didn't let the AMQ to get too many pending messages (at first we thought this is the problem), but this error keeps happening.

Additional information: The "WARN  ManagedTransportConnection     - Failed to register MBean: org.apache.activemq:BrokerName=localhost,Type=Connection,ConnectorName=stomp,ViewType" error is actually the last error in our AMQ log but it doesn't "die". I've seen this many times before. It's also the last error log we got when it "dies", Configuration issue, a broker can't accept new connections when it runs out of memory or OS file descriptors etc.  ]