[It sounds like we have to install commons-pool2 bundle. Let me take a look., The {{commons-pool2}} bundle is installed (as part of {{activemq-client}} feature) and the package containing the missing class is exported by the bundle

{code}
karaf@root()> exports | grep org.apache.commons.pool2.impl
org.apache.commons.pool2.impl                          | 2.3.0                              | 100 | org.apache.commons.pool2 
{code}

Moreover, it seems to be correctly resolved by the {{activemq-osgi}} bundle

{code}
karaf@root()> imports | grep org.apache.commons.pool2.impl
(&(osgi.wiring.package=org.apache.commons.pool2.impl)(version>=2.3.0)(!(version>=3.0.0)))                         | optional | 104 | org.apache.activemq.activemq-osgi                           | true 
{code}, The problem seems to be introduced in Commons Pool 2.3.0 by this change https://github.com/apache/commons-pool/commit/3a3e763c90aa6bc04a0537b4480f9e005a45ba22. After the change the evictionPolicyClass is loaded using the ContextClassLoader. The problem has been probably solved by this change https://github.com/apache/commons-pool/commit/b10ac03321076bb6a71fac9d2124220abdbbcd3c which is available in 2.4.0., I have replaced Commons Pool 2.3.0 by 2.4.2 (2.4.0 has another problem) and it solved the problem. Commons Pool needs to be upgraded to 2.4.2., GitHub user sobkowiak opened a pull request:

    https://github.com/apache/activemq/pull/139

    AMQ-5861: Unable to create connection factory using jms:create

    This is a patch for 5.12.x. Please see https://issues.apache.org/jira/browse/AMQ-5861 for details. Please merge this change to master as well.

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/sobkowiak/activemq AMQ-5861

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/activemq/pull/139.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #139
    
----
commit 4e073f5b6eebc12c619db4c11bd5ef4565467a55
Author: Krzysztof Sobkowiak <krzys.sobkowiak@gmail.com>
Date:   2015-08-11T04:42:37Z

    AMQ-5861: Unable to create connection factory using jms:create

----
, Github user asfgit closed the pull request at:

    https://github.com/apache/activemq/pull/139
, The commons-pool2 dep has been updated, please resolve this if the issue is now fixed., Tested with current {{5.12.x}} and {{master}} snapshots on Karaf {{3.0.4}} and {{4.0.0}}. The problem seems to be fixed.]