[One thing you might want to do is create a version of this test in the amqp test source and dump some broker info for that destination to see why the second browser thinks there are still two messages on the Queue, they should have been ack'd I think. , I ran this last night and noticed that if you run them alone the test passes so looks like a timing issue. , Yea, I think we had the same behavior with AMQ-4376.  I'll have to look at how Hiram fixed that.
, Seems like this might be more on the QPid side.  It appears that Acks sent back aren't synchronous so the test can move on from a message receive and create a new QueueBrowser before all the messages that were read have been Ack'd at the broker side.  , Should I just add a sleep to the test?  Both pass if I add a one second sleep before calling browser.getEnumeration.
, You can try that, what it looks like is that since the acks are fired and it doesn't wait for a response the NIO worker interleaves the work for the connection and processes an ack sometimes and then gets to the other connections new browser request before going back to process the other ack.  , I submitted a pull request for joram-jms-tests which should fix this. , After joram-jms-tests are updated, we need to update their version in the pom., I think in the case of these tests we should probably just disable those for now as the issue lies on the QPid JMS client side and not the broker side, perhaps open an issue there indicating that the client is behaving badly as a JMS client and doing async operations when it should be sync.  , This patch replaces the existing JoramJmsNioTest with one that doesn't run QueueBrowserTest.  After applying, you can close this bug, as I have updated AMQ-4375 to include all instances where test fail because of the qpid client.

(I've also included a minor change here to JoramSslTest.  It removes a redundant test declaration and and unneeded dependency on the Junit 3 TestCase class.  If you'd prefer I can open another bug and submit it separately.), Applied latest patches.]