[There's a separate minor change in the attached patch, which ensures that the Content-Type header is always set to 'text/xml'.

In current svn code, this header is only set when a message is delivered.  When a timeout occurs (and an empty <ajax-response></ajax-response> is returned), the Content-Type header is set to 'text/plain'.  The jQuery adapter attempts to parse the responseXML property of the response, which is not populated due to the Content-Type header being set to 'text/plain'.

This is seen in FIrebug as a 200 response resulting in a parseerror.  (Successful response which fired the error-handling ajax callback!), We have observed that ActiveMQ running with this patch does not clean up session data as quickly as we expected.  (Every reload of a browser window which uses the clientId parameter creates 5 new threads in the JVM, and these do not appear to be cleaned up.)  We're going to investigate this a bit more and possibly submit a revised patch., This patch replaces the original one I attached to this ticket.

Changes since original patch:
 - private MessageListenerServlet.ClientConsumerState class refactored to AjaxWebClient (extends WebClient).
 - private MessageListenerServlet.Listener class refactored to AjaxListener.  AjaxWebClient uses an instance of Listener/AjaxListener, so this needs to be public.
 - AjaxWebClient & associated data for each client are now stored in a MessageListenerServlet instance variable (ajaxWebClients) rather than in sessions.
 - Timer/TimerTask code added to examine ajaxWebClients and clean up clients which have not been accessed in the past minute.  This solves the thread-leakage we were seeing in my initial patch.
 - JavaScript to append clientId parameter to all requests moved to amq.js, so no changes are required to the jquery, prototype, or dojo adapters.

New patch also includes a new JS test, and an updated chat.html which uses a clientId (so you can open chat.html in multiple windows in the same browser) for a quick test., Committed with svn revision 1022071. Thanks a lot for a great work.

I think there's two things left to be done to complete Ajax improvements:

* Documentation on Ajax is way out of date, so we should update it with these new features - http://activemq.apache.org/ajax.html
* We should automate JS tests and include them in our unit testing suite with something like WebDriver (http://code.google.com/p/selenium/wiki/GettingStarted), Hi,
I have a auction application being developed and have multiple users login at the same time for bidding. I understand that clientId in amq.init is the unique parameter that distincts each users window. Say for example, user U1 is logged in IE and user U2 is logged in Chrome at the same time. When they bid, the messages and updated price information are passing to both the users. However, when U1 logs out of the application and logs in back for bidding, he doesnt see the updated price information in his screen, which is weird. Can you please let me know if this is really an issue or I am doing something wrong, please? I use ActiveMQ 5.6.0 with Java and Spring Framework. Appreciate your response.

Saravanan Thoppan, Slight change in my words - However, when U1 logs out of the application and logs in back for bidding and when he starts bidding, the update doesnt come to his winidow but the other users U2 sees the price information being updated on his.

Saravanan Thoppan]