[What kind of issues can be triggered by this?, No specific issue...just noticed as I ran through some testing. That's why I was asking if there was a good reason why they values do not correlate? To me, it would make sense if they matched up., Actually, this is an issue for us. We are capturing metrics from the advisory messages and this is causing our metrics to be off., [~tabish121],

I noticed this issue the other day and it's a bit odd to me that advisory messages relating to user actions (such as new connection or consumer, etc)  set the {{originBrokerURL}} property with a default URL and not the actual transport URL that was used.  For example, I ran a test and set up a broker with two transports, one nio and one tcp.  I connected using nio but the algorithm picked the tcp transport url to set as the originBrokerURL property when the new connection advisory message was fired.  It would make more sense to me to set the originBrokerUrl property as the nio URL since that was the URL used.  

This would be a pretty easy change as the ConnectionContext has a reference to the Connector used and we could get the publishable connection string from that if the connector has been set. For advisory messages that don't contain the connector (such as internal things like message expiration) a default URL can still be chosen in the same manor as it is now.

Do you have any issue with changing this behavior? The other option is to keep the originBrokerURL behavior as is and add a new property to contain the actual transport url used by the client to connect.  That would prevent issues for existing users which might be relying on the current behavior of how the originBrokerURL property is set. 
, Wouldn't bother me, I just haven't had time to look at this one other than to see it and agree that it makes sense that the value should probably match the connector., Alright, thanks for the input. I'll push up a PR later today with this change., GitHub user cshannon opened a pull request:

    https://github.com/apache/activemq/pull/117

    https://issues.apache.org/jira/browse/AMQ-5705

    Modifing the AdivsoryBroker to set the originBrokerURL to the transport connector's
    URL if it has been set versus using a default URL.

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/cshannon/activemq AMQ-5705

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/activemq/pull/117.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #117
    
----
commit fc3e0261229bb90edbcf4eaeabc5ee2e1b57894d
Author: Christopher L. Shannon (cshannon) <christopher.l.shannon@gmail.com>
Date:   2015-06-17T17:47:24Z

    https://issues.apache.org/jira/browse/AMQ-5705
    
    Modifing the AdivsoryBroker to set the originBrokerURL to the transport connector's
    URL if it has been set versus using a default URL.

----
, Github user asfgit closed the pull request at:

    https://github.com/apache/activemq/pull/117
, Patch looks good, applied with thanks!, this patch breaks org.apache.activemq.network.FailoverStaticNetworkTest

the PublishedAddressPolicy is now applying to the vm connector and the usage of broker name with A_B (an underscore it) fails to be converted into a valid url, blowing up with an exception. Our vm urls very loose, I think PublishedAddressPolicy needs to be a little more aware of the vm scheme. Working on a fix., fix for test regression in http://git-wip-us.apache.org/repos/asf/activemq/commit/37c46b9b

transforming vm urls does not make any sense because they container the brokerName]