[Unit test that reproduces the problem.
, The trick is figuring out how to return the exception to the amqp client, currently its not obvious how that's supposed to work.  , We need to update to version 0.5 of proton in order to fix this.  Then we can call setCondition on the proton connection to send the error back to the client.
 , This patch should fix this issue in proton 0.5 (or 1.0-SNAPSHOT), although it causes the AMQ-4563Test to fail.
, For me if I add in this code to the onActiveMQCommand's handling of MessageDispatch commands then everything seems to work.

{code}
                if (md.getMessage() != null) {
                    Message message = md.getMessage();
                    if (!message.getProperties().containsKey("JMS_AMQP_MESSAGE_FORMAT")) {
                        message.setProperty("JMS_AMQP_MESSAGE_FORMAT", 0);
                    }
                }
{code}

I couldn't really find anything that informs on the values this property should have but from the code it appears that zero is the not set fall-back so it might be safe enough. , This patch contains Tim's suggested change, plus a couple of other minor updates.  The constructors we were using for protonConnection (ConnectionImpl) and protonTransport (TransportImpl) have both been deprecated so I updated those definitions.
, Not quite sure at this point what the right patches are since I get some conflicts on the third one, can you make on big rollup patch or clue me in on what I should be applying?, Sorry, I'll get it straightened out either this evening or tomorrow morning and upload a single patch.
, Tim, this patch should work correctly.  Please note a couple of things:

1. This includes the code change for AMQ4696, so you should probably apply that first, or ask me for another update.
2. Besides the changes for this bug (which occurs at line 405) there are several other changes for things that were either deprecated in or removed from proton-jms 0.5
, Not sure what I'm doing wrong but after applying AMQ-4696 and then trying to apply this one I get a bunch of errors trying to compile. Things like AmqpTransport not defined etc., Sorry, that's bizarre.  I recreated it, and tested it on a freshly checkedout version of the code.  If you still have problems please ping me.
, Patch applied cleanly this time, tests look good. ]