[ActiveMQ 5.14.1 is built and tested against Jetty v9.2.13.v20150730 so we know it works there, newer versions of jetty may break., Hi Timothy, thanks for the clarification! I think you are right regarding jetty9.2 and indeed jetty 9.3 does not work as explained. Does this mean that jetty 9.3.x support is currently not on the roadmap? I am on Java 8 and would like to use http2. jetty 9.2 is for java 7 and does not support http2. 
regards,
Carsten, We can target support for Jetty 9.3.x (and maybe Jetty 9.2.x backwards compatibility) with the 5.15.0 release as that is the first release that will require Java 8.  The 5.14.x release branch still supports Java 7 so we can't upgrade to Jetty 9.3.x in a 5.14.x release., Thanks, that would be great!, It might still be possible to let this work with jetty 9.3 on 5.14.x but we'll need test out a few changes to see for sure., Commit 80f46a80560b2b2ed9fb418c33df75136bc3dc52 in activemq's branch refs/heads/master from [~cshannon]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=80f46a8 ]

https://issues.apache.org/jira/browse/AMQ-6521

Adding support for Jetty 9.3 by re-adding in the logic to dynamically
load the correct GzipHandler depending on the version
, Commit 4cdd188ef22524391d8801e865a4c9eed8c8eb06 in activemq's branch refs/heads/activemq-5.14.x from [~cshannon]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=4cdd188 ]

https://issues.apache.org/jira/browse/AMQ-6521

Adding support for Jetty 9.3 by re-adding in the logic to dynamically
load the correct GzipHandler depending on the version

(cherry picked from commit 80f46a80560b2b2ed9fb418c33df75136bc3dc52)
, I was able to make this work for 9.3 by using reflection to search for the correct GzipHandler.  It will go into the 5.14.2 release., Great, I would like to try it out with the next release but I did not find a planned release date for the 5.14.2 release in jira. Seems the Roadmap Gadget in the Jira Dashboard is not used in ActiveMQ. Do you know when the next release is available?, Soon, I plan on doing a release either this week or next week if no blocking issues come up., Unfortunately the fix is wrong. This issue should be reopened. The code now looks like that:

private void addGzipHandler(ServletContextHandler contextHandler) throws Exception {
        Handler handler = null;
        try {
            handler = (Handler) forName("org.eclipse.jetty.server.handler.GzipHandler").newInstance();
        } catch (Throwable t) {
            handler = (Handler) forName("org.eclipse.jetty.servlets.gzip.GzipHandler").newInstance();
        }
        contextHandler.setHandler(handler);
    }

But the real class name seems to be (as is written in this issues description)

org.eclipse.jetty.server.handler.gzip.GzipHandler

and not one of these

org.eclipse.jetty.server.handler.GzipHandler
org.eclipse.jetty.servlets.gzip.GzipHandler

I guess it is difficult to provide a test for this, right?, I am sorry that I did not find this earlier, but it is very difficult for me to push snapshot versions into my test environment, Oops, I thought I had tested this properly but apparently not. Looks like when I reverted the previous commit it had restored the check for Jetty 8.x and Jetty 9.2 but not Jetty 9.3.  I retested this again and there is actually one more change that is needed for this to work with Jetty 9.3.  I will push a new commit with the changes.

Yes it is difficult to test right now because our broker pulls in only Jetty 9.2.x.  So our tests just run against 9.2.x as that is the main version supported in 5.14.x.  In 5.15.x I am planning to upgrade to 9.3 so that will get all the tests run against it then.  

To run tests against both 9.2 and 9.3 we'd probably need to create another subproject and override the Jetty dependency to be 9.3 and re-run the Http tests. That is something that could be looked at in 5.15.0 if we decide to provide support for more than one version of Jetty besides just 9.3.0, Commit 29b4db5c34fbb7087bc6a08f3e393da32b39ce66 in activemq's branch refs/heads/master from [~cshannon]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=29b4db5 ]

https://issues.apache.org/jira/browse/AMQ-6521

Fixing support for Jetty 9.3 and Jetty 9.2.  The previous attempt at a
fix had the wrong class instance.
, Commit 80b5fdcf2ff48f4ac55cabd86addc0267478573e in activemq's branch refs/heads/activemq-5.14.x from [~cshannon]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=80b5fdc ]

https://issues.apache.org/jira/browse/AMQ-6521

Fixing support for Jetty 9.3 and Jetty 9.2.  The previous attempt at a
fix had the wrong class instance.

(cherry picked from commit 29b4db5c34fbb7087bc6a08f3e393da32b39ce66)
, Ok I think this is fixed for real this time.  I know you said that it is difficult to test against snapshots so if you can't do that it would be helpful if you could at least verify that the commit looks ok with the correct class this time., I would say it matches http://download.eclipse.org/jetty/9.3.12.v20160915/apidocs/org/eclipse/jetty/server/handler/gzip/GzipHandler.html. I hope I will be able to work on my ci build soon so that it will be easier to test with snapshot version. But I cannot promise that currently..]