[I changed my configuration the way Rob asked (I think) but no joy yet.  

I have three clients, two durably consuming a topic, one producing the topic.  All three connect to the broker with this URL: failover:(tcp://<hostname>:<port>)?maxReconnectAttempts=1

What happens now is that, when I kill the master, one of the clients dies when calling MessageProducer.send(Message) - the JMSException contains a ConnectException which says "Connection refused: connect".  The other two clients just keep waiting on MessageConsumer.receive().  The slave broker prints messages that make it look like it's ready for action - "Master failed, starting all connectors", etc. - but never gets the chance, apparently.

I'll attach a stack trace, broker logs, and the config files for the brokers after I post this., the stack trace from the client that failed, Config file for the slave broker, Config file for the master broker, A capture of the log from the master.  Next time I'll try to specify a log file..., The log from the slave broker.  I've left in the results of a lot of runs, but you can find the last one by looking for the text "THE LAST FAILURE STARTS HERE"., FYI, I've done some tracing, and in this case, the failure is detected, but it doesn't look like the client was ever apprised of the slave URL.  On the client, in the onCommand(Command) method of the subclass of TransportListener that's an anonymous inner class of FailoverTransport, the value returned from BrokerInfo.getPeerBrokerInfos() is a null array.  I'm new at this code, but it seems like it ought to have the URL for the slave broker there., I've verified that the same problems occur when the master is on Windows and the slave on Solaris, or vice versa., I think from our IRC conversations that this is working now right? 

Let us know if its not and we can reopen. If you find other issues it might be easier to track to open new JIRAs?, GitHub user czobrisky opened a pull request:

    https://github.com/apache/activemq/pull/149

    AMQ-593 - Updated jodatime to 2.8.2

    https://issues.apache.org/jira/browse/AMQ-5931

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/czobrisky/activemq AMQ-5931

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/activemq/pull/149.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #149
    
----
commit 10c68966567759dd25904c52c40c379c8d188019
Author: Chad Zobrisky <czobrisky@gmail.com>
Date:   2015-10-06T15:54:44Z

    Updated jodatime to 2.8.2

----
]