[This doesn't really seem like a bug...it just seems like the documentation needs to be improved so that it is clear that the default is 1024 entries before eviction starts if nothing is specified.  A policy can easily be configured to increase the size if more entries are needed or to use the SimpleMessageGroupMapFactory for unlimited entries. 

Also, I don't think it would be a good idea to throw an error if more than 1024 entries are added.  The LRU cache is designed to evict the oldest ones so it's not supposed to be an error condition to put more entries in there...the old ones just go away as intended.  However, a log statement could be added on eviction to warn that an entry is being evicted so it is at least clear what is happening., [~cshannon] - if these were simply performance issues, then I'd agree...improve the docs and recommend alternate configs.  but, this factory completely breaks the message group algorithm under common scenarios w/o any indication...even the stock quote example on the message group feature page would exceed 1024 groups and break.

overall, this is a bug because the factory does NOT guarantee single threaded processing or dispatch ordering by JMSXGroupId...the primary reasons to use message groups.  the fact that workarounds exist doesn't excuse the implementation...the runtime should prevent using a feature that simply won't do what its designed to under higher volume scenarios.  

, [~boday], Seems like maybe the best thing to do here is to just switch the default implementation to SimpleMessageGroupMapFactory instead of an LRU cache (as you mentioned in the original description) to prevent confusion and then document the ability to use an LRU cache through configuration if desired.

[~tabish121], any reason you can think of not to switch out the default LRU implementation?  My main concern would be breaking existing users who are expecting an LRUCache to be used by default but I'm not sure how much of an issue that really is. , [~cshannon] My guess would be the current configuration was chosen to produce a predictable memory footprint instead of the unbounded growth potential of the SimpleMessageGroupMapFactory.  , Yeah I figured the LRU cache was chosen for a reason which was my initial hesitation to change it.  So do you think this is something worth changing or do you just want to leave it as is and document it?  I suppose the default size of 1024 could also be increased as another option but not sure what a good default size would be., Based on my initial thoughts on this and after discussing this issue with [~tabish121], I don't think we should change this.  We don't want to leave a potential for unbounded memory usage in the broker. Plus, the current expectation is that the LRU implementation is the default.  We should update the documentation to describe this so that if someone needs more than 1024 groups they can change the policy configuration to increase the number of groups or to use a different implementation such as SimpleMessageGroupMapFactory., I'd don't buy the memory usage argument...many default configs are unbounded (destination memoryLimit comes to mind)...and a memory issue would be preferable/easier to diagnose than silently causing concurrent/out of order processing...the whole reason to use message groups in the first place...

at the very least, it should throw an error in the logs when the max LRU cache size is exceeded stating just that...

]