[Recommend you create a unit test that demonstrates your issue.  , Tim,

I already tried to reproduce the issue. For unit test there is only one xml file for creation of listeners which you can see below:
Just suspecting : Can there be any problem because of using "PooledConnectionFactory" for more than one connections for durable subscribers ?

client.xml:

 <bean id="jmsFactory" class="org.apache.activemq.pool.PooledConnectionFactory" 
      destroy-method="stop">
      <property name="connectionFactory">
          <bean class="org.apache.activemq.ActiveMQConnectionFactory">
      <property name="brokerURL">
      <value>${jms.broker.url}</value>
      </property>
      </bean>
      </property>
      <property name="maxConnections" value="3" />
      
and my listener is using it as: 
   <bean id="listenerContainer1"  class="org.springframework.jms.listener.DefaultMessageListenerContainer">
          <property name="connectionFactory" ref="jmsFactory" />
          <property name="destination" ref="topic_pnlCompleteTopic1" />
          <property name="durableSubscriptionName" value="FAGCompletion1" />
          <property name="pubSubDomain" value="true" />
          <property name="subscriptionDurable" value="true" />
          <property name="clientId" value="jms.fagsListener.clientId.1" />
          <property name="messageListener" ref="pnlMessageListener1" />
     </bean>



   <bean id="listenerContainer2"  class="org.springframework.jms.listener.DefaultMessageListenerContainer">
          <property name="connectionFactory" ref="jmsFactory" />
          <property name="destination" ref="topic_pnlCompleteTopic2" />
          <property name="durableSubscriptionName" value="FAGCompletion2" />
          <property name="pubSubDomain" value="true" />
          <property name="subscriptionDurable" value="true" />
          <property name="clientId" value="jms.fagsListener.clientId2" />
          <property name="messageListener" ref="pnlMessageListener2" />
     </bean>

   <bean id="listenerContainer3"  class="org.springframework.jms.listener.DefaultMessageListenerContainer">
          <property name="connectionFactory" ref="jmsFactory" />
          <property name="destination" ref="topic_pnlCompleteTopic3" />
          <property name="durableSubscriptionName" value="FAGCompletion3" />
          <property name="pubSubDomain" value="true" />
          <property name="subscriptionDurable" value="true" />
          <property name="clientId" value="jms.fagsListener.clientId3" />
          <property name="messageListener" ref="pnlMessageListener3" />
     </bean>



Thanks,
Anuj, From the information given it seems like it's working as designed for durable topics subscriptions, you cannot have multiple connections with the same client Id connected to the Broker. , Yes. Each client has different client ID.

I am also not able to reproduce this issues but as I mentioned the issue happens sometimes for long connecting clients...sometimes when clients restarts after long time.. at that time this issue occurs and that too not for all 3 listeners. 
I see two listeners are connecting fine but 3rd listener is not able to connect because broker shows stale client id already connected. 
I also discussed this issue here  http://activemq.2283324.n4.nabble.com/javax-jms-InvalidClientIDException-for-durable-subscription-on-broker-restart-td4684381.html#a4684743 
 

Thanks,
Anuj



, Would recommend you test against 5.11-SNAPSHOT as this could be a symptom of AMQ-5258 or AMQ-5226 , Hi Tim,

I have tried to reproduce. It's not the exact test case but kind of similar problem. 

1. I have my own local plugin "ActiveMQLoggingPlugin extends BrokerPluginSupport" and override "removeConnections" and "removeSession" functions.
2. I returned from the functions without passing it to super class for example: 
-----------
    public void removeConnection(ConnectionContext context, ConnectionInfo info, Throwable error) throws Exception
    {
        if (info.toString() != "hello") {
            return; // It's a hack so that it always return from here. 
        }
        super.removeConnection(context, info, error);
    }

3. Now when I run the client application(consumers) which is using pooledConnectionFactory with maxConnection=5. it is creating 5 different connections using different client ids. Each listeners is a durable subscriber and I am setting different client id for each of them (It is using the configuration mentioned in previous comment)

4. It is able to connect and work properly. Now I stop the client application. I can see that connections are gone and applciation is stopped. I checked that broker is not connecting to any client now. 

5 Now when I start the client application. I get the invalidclientIDexception by saying that this client is already connected to the broker. 
I think since broker is not closing the connection, it keeps the client id associated with it and does not clear the connection state. and when next time application starts, it says that client is already connected even if no client is actually connected to the broker. 

Thanks,
Anuj 

, Hi Tim,

I have seen a new feature "allowLinkStealing" with ActiveMQv5.10. This is supposed to be used with mqtt transport.
but this options seems to be working for my issue. I tested when a normal durable client is connecting to the borker and if other client tries with the same client id, it still throws exception saying "javax.jms.JMSException: Durable consumer is in use for client: Test and subscriptionName: ActiveMQConsumer"

But when broker keeps stale entries of client ids and actually no client is connected, then the new client is able to connect properly.

I just want to know that can I use it for normal tcp transport or will there be some consequence ?


Thanks,
Anuj ]