[Please help review the patch, thanks., Im noticing this behavior as well.  This is an important security problem for us. Please resolve ASAP., I applied the patch in rev 749464.  I think Hiram is a bit unconvinced about this patch but the removed code is clearly wrong and I can't see anythign wrong with the patch., One other thing to think about: I'm pretty sure that tcp://localhost... is all over the documentation. You may want to consider whether the documentation will need to be updated after this fix., the patch killed a unit test: org.apache.activemq.transport.tcp.SslContextNBrokerServiceTest
The connector URI did not match the address bound. Just committed a fix.

To listen on all interfaces on a host, use the wildcard address: tcp://0.0.0.0:61616, I was running some testing with 5.3 today and noticed that specifying localhost no longer binds to 0.0.0.0 (meaning that folks who have configured their brokers to be accessible from other hosts via localhost will no longer be able to connect). From looking at the issue, it seems like the more appropriate fix would be:

localhost --> bind to 0.0.0.0 (e.g. still bind to wildcard)
127.0.0.1 --> bind to 127.0.0.0 (only loopback)
actual host name --> bind to actual ip

        host = (host == null || host.length() == 0) ? "localhost" : host;
        InetAddress addr = InetAddress.getByName(host);

        try {
            if (host.trim().equals("localhost")) {
                this.serverSocket = serverSocketFactory.createServerSocket(bind.getPort(), backlog);
                addr = InetAddress.getLocalHost();
            } else {
                this.serverSocket = serverSocketFactory.createServerSocket(bind.getPort(), backlog, addr);
            }
            configureServerSocket(this.serverSocket);

        }

The question is would the ability of specifying 127.0.0.1 explicitly without it resolving to 0.0.0.0 be enough to resolve this?, Or how about:

{noformat}
0.0.0.0 --> bind to 0.0.0.0 (e.g. still bind to wildcard)
localhost or 127.0.0.1 --> bind to 127.0.0.1 (only loopback)
actual host name or actual ip --> bind to actual ip
{noformat}

I vote that correct behavior is more important than backwards compatibility.  Adjusting configs/etc is a normal part of the upgrade process., Just to add to this, with this change clustering in servicemix requires another step, namely that you've got to change the config to point to 0.0.0.0 instead of localhost, otherwise you see connection refused exceptions as the brokers fail to connect to each other.  The configuration file out of the box should probably specify 0.0.0.0 instead of localhost, that way the previous behavior is preserved (you can connect to the broker remotely) but it's also the correct behavior with regards to the configuration., I updated the default xml configuration to use the wildcard 0.0.0.0 address. r790100, +1 to Jeff and leaving the change in place. Localhost != 0.0.0.0  - http://en.wikipedia.org/wiki/Localhost, I think this one is done for 5.3 - am closing off., method resolveHostName assumes lookup performed by   InetAddress.getLocalHost() is unambiguous .  
There is some workaround code at the link below that might be of use. 
https://issues.apache.org/jira/browse/JCS-40]