[
Our testing system now also shows this strange behaviour.
The Webmonitor lists correctly the 25 pending messages.
Browsing the lists shows them to be empty -- which is obviously not true,
as revealed by a direct select to the database storage in table 'activemq_msgs'.

I attached the screenshots from the web monitor and the db select.

The broker simply forgets some messages.
The only workaround seems to constantly reboot the broker, which is really annoying
and not the kind of thing we'd like to do in a productive environment.

This issue is really is realy urgent!
, I also added the JConsole for the IMPORT_READY queue.

It shows the correct queue size of 1, but the message ist still stuck in the queue., Problem solved:

Eventually we started not only one but actually four brokers.
All of them had the same datasource in the DB. 
The main mistake was that we had the following setting which prevented the exclusive DB Table lock for a valid master/slave configuration:

    <bean id="persistenceAdapter" class="org.apache.activemq.store.jdbc.JDBCPersistenceAdapter">
        <property name="dataSource" ref="brokerDataSource"/>
        <property name="useDatabaseLock" value="false"/>
    </bean>

After shutting down the additional brokers we do not experience hanging massages any more.


, This looks fixed now - thanks Norbert, Unfortunately we are experiencing the prblem again -- now with a single standalone broker.

The hanging mesages are listed in the database but not in the visible in the webconsole (browse).

Restarting the connector (using JMX) seems to to be a hotfix (but obvoiously not a solution to the problem).

The listeners wait receiving (as stated by a thread dump), so it seems not to be a client code problem.

BTW: Still using activemq 5.1

http://issues.apache.org/activemq/browse/AMQ-1918 may be related to this problem., Hi Norbert - we don't do patches to the 5.1 branch - is this an issue with 5.3 (trunk currently) ? If not can you close it ?, As long as we can see it's an issue somehow related to the database persistance. We still did not get any pin on it.
Currently we use 5.1, so as Dave mentioned in the comment above I'll close it. , It seems that we do not get any clear solution for this bug for version 5.1.]