[Hi Lionel,

I can reproduce this. What are you trying to access at j4p? There's a brief explanation how to access ActiveMQ MBean information using Jolokia here

http://activemq.apache.org/rest.html#REST-RestManagement

For more info on url syntax, take a look at Jolokia manual.



, Dejan,

Thanks for your reply and the link to some doc.

The error came in fact from an old installation on jmx4perl (agent). I've now cleaned it. The /j4p/ path is because we use a proxy with this path, ActiveMQ is queried with /api/jolokia/.

I can now access JMX information via Jolokia but I still have two problems.

(1) I tried to use ${activemq.conf} in web.xml to specify which access file Jolokia should use but this syntax does not seem to be accepted. Is there a way to put Java property names in web.xml? IMHO, it would make sense to configure Jolokia from files under ${activemq.conf}.

(2) It seems the MBean paths have changed and this kills our Nagios monitoring. For instance, to get the broker version, we have to use:
 - for ActiveMQ 5.5: org.apache.activemq:Type=Broker,BrokerName=<name>
 - for ActiveMQ 5.8: org.apache.activemq:type=Broker,brokerName=<name>
Is this case change intentional?
, In fact, there is a third problem, linked to MBean names too.

In 5.5, we can see: org.apache.activemq:BrokerName=<name>,Type=Queue,Destination=ActiveMQ.DLQ
But in 5.8: org.apache.activemq:type=Broker,brokerName=<name>,destinationType=Queue,destinationName=ActiveMQ.DLQ

Why do we have type=Broker for a queue?, The change is intentional, see AMQ-4237.  , As for the (1) I don't know of a way to use system properties in web.xml, but I think you can achieve the same using classpath:, as conf/ folder is in the classpath., Dejan, I will investigate further but it seems that conf is not in the classpath. We use the service wrapper and your conf/wrapper.conf contains only:

wrapper.java.classpath.1=%ACTIVEMQ_HOME%/bin/wrapper.jar
wrapper.java.classpath.2=%ACTIVEMQ_HOME%/bin/activemq.jar
, In fact, even with the Java service wrapper, ${activemq.conf} is indeed in the classpath so a value of "classpath:foo" indeed points to "foo" under ${activemq.conf}. Thanks!, With the classpath: prefix trick I can now use Jolokia without problems.

The only thing left is the MBean names changes but this is being tracked/discussed in AMQ-4237., Hi Lionel, thanks for closing the loop.]