[Hi

May I know what is the status for this one?
I want to contribute.

Please let me kniow.
Thanks, This issue is awaiting someone knowledgeable to work on it and provide a patch and some tests to validate.  If you'd like to contribute we welcome your efforts. , Thank you for your answer.
Yes, I would like to contribute.
Please let me know in which version should this be fixed?
5.13.2?

Thanks , You should always work off of the master branch, then once fixed we might backport the change to a 5.13.x branch if any additional releases go out there and the change isn't to risky. , The problem happened on version 5.13.2, [UNABLE TO REPRODUCE]
Hi

I have tried with latest source code (June-14-2016) and could not reproduce.
I tried with:
- offline consumer and sent 30 messages using CURL using REST
- online consumer and sent 20 messages using CURL using REST

my curl I tested with:
curl -u admin:admin -d "body=message" http://andromeda:8161/api/message/TEST.FOO?type=queue

on console under connections I was able to see only the consumer connection.
and after closing the consumer connection the connection was gone on console as well. 

@Arnaud Marchand could you please:
1.  provide more details, was the consumer running at the moment the messages were sent
2. could you please provide your code for consumer

Thanks, It seems the same with my issue #AMQ-6233, actually you can add clientId=XXX to fix it, and you should unsubscribe your client when done, That's easy to reproduce on an UNIX box with something like that:

for i in `seq 1 1000`;  do curl -u admin:admin -d "body=message" http://127.0.0.1:8161/api/message/TEST.FOO?type=queue; done

===> Result:

<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"/>
<title>Error 500 Server Error</title>
</head>
<body><h2>HTTP ERROR 500</h2>
<p>Problem accessing /api/message/TEST.FOO. Reason:
<pre>    Server Error</pre></p><h3>Caused by:</h3><pre>java.lang.OutOfMemoryError: unable to create new native thread
	at java.lang.Thread.start0(Native Method)
	at java.lang.Thread.start(Thread.java:713)
	at java.util.concurrent.ThreadPoolExecutor.addWorker(ThreadPoolExecutor.java:949)
	at java.util.concurrent.ThreadPoolExecutor.execute(ThreadPoolExecutor.java:1371)
	at org.apache.activemq.thread.PooledTaskRunner.wakeup(PooledTaskRunner.java:83)
	at org.apache.activemq.transport.vm.VMTransport.wakeup(VMTransport.java:246)


On my side, it crashes after 3000 CURLs.

http://www.pi2s.be/JIRA/Screen%20Shot%20AMQJIRA1.jpg, So here we have an Out of memory issue, because of failing to create a native thread.

Please 
1. consider to increase the maximum of JVM memory (xmx option)

2. refer to
Reducing Threads and/or Reducing Memory Consumption section at following link
http://activemq.apache.org/scaling-queues.html

Also it is interesting to look at this link 
https://plumbr.eu/outofmemoryerror/unable-to-create-new-native-thread
pay attention comparison between  mac and linux max thread count

Thanks, [~tabish121] I think this issue should be closed as a environment problem., I don't totally agree. Probably adding a default client ID when there is none specified could be an acceptable fix. But not doing anything just let all the ActiveMQ servers unsecured. A DOS attack written in less than 3 lines of shell script crashes the full system in less than 10 seconds.

, [~a.marchand@progeri.com] please provide:
1. the platform - are you running on mac?
2. what is the amount of RAM?
3. can you monitor what is thread count and memory usage for activemq before crash?
     please use
     cat /proc/<PROCESS_PID>/status

In my case max thread count was around 450,
even if I send 6000 messages, while message consumer is not running.

Let's keep in mind the error is out of memory while creating native thread.

4. is your message consumer running?
does it consume the messages?

Thanks]