[Issue has been fixed already in AMQ-3857, I downloaded the apache-activemq-5.7-20120922.031357-5-bin.zip file, extracted it, invoked bin\activmq, but I still don't see that it is fixed.  Maybe I am doing something wrong.  Did you try the java test pgm I attacted to this jira?  Does it work for you?  I still do not see a correlation header in the response.
, I believe the JMSCorrelationID is a message header field, not a message property.  While I see the following code excerpt from MessageServlet.java spins through the message properties and adds HTTP response headers, I don't believe that includes the JMSCorrelationID.

---------
   protected void setResponseHeaders(HttpServletResponse response, Message message) throws JMSException {
       response.setHeader("destination", message.getJMSDestination().toString());
       response.setHeader("id", message.getJMSMessageID());
 
       // Return JMS properties as header values.
       for(Enumeration names = message.getPropertyNames(); names.hasMoreElements();) {
           String name = (String) names.nextElement();
           response.setHeader(name , message.getObjectProperty(name).toString());
       }
   }
---------
, I believe the JMSCorrelationID is a message header field, not a message property. While I see the following code excerpt from MessageServlet.java spins through the message properties and adds HTTP response headers, I don't believe that includes the JMSCorrelationID.
---------
protected void setResponseHeaders(HttpServletResponse response, Message message) throws JMSException {
response.setHeader("destination", message.getJMSDestination().toString());
response.setHeader("id", message.getJMSMessageID());
// Return JMS properties as header values.
for(Enumeration names = message.getPropertyNames(); names.hasMoreElements() { String name = (String) names.nextElement(); response.setHeader(name , message.getObjectProperty(name).toString()); }
}
---------, I had an ugly mistake in the Java test program I attached.  The reason that test didn't show me the correlation ID, is because due to an accidentally placed post increment, the loop prints every other header.  Once I correct the test program, I do see it sending back a correlationId when using that Java test.  For example:
------------
Set-Cookie: JSESSIONID=1b82fgs19r3ay7k9hzklej070;Path=/demo
Expires: Thu, 01 Jan 1970 00:00:00 GMT
Content-Type: text/plain;charset=ISO-8859-1
destination: queue://myqueue
id: ID:d22275-4049-1348541259944-1:1:1:1:1
correlationId: Resty 123
Transfer-Encoding: chunked
Server: Jetty(7.6.7.v20120910)
HTTP/1.1 200 OK
Hello
------------

However, that test pgm calls "resonse.getAllHeaders()".  I am puzzled about the header -vs- property thing I read, and I don't understand why my C-based client is getting all but the correlationId.  I guess "resonse.getAllHeaders()" is doing more than my C-based client.
, Rather than "response.getAllHeaders()", I assume it is "HttpResponse response = httpClient.execute(httpget);" in the Java test, which is doing more than my C-based client., Maybe this is clue.  When I run the java test, the "correlationId" header follows the message "id" header.  However, when I run my C-based client, I receive a "clientId" header in place of the correlationId header.  For example, I get:

     clientId: BA3CB329-3A27-4328-B3F7-E0E4F5655B69


What is that "clientId" and do you happen do know why I get that instead of the correlation ID?

Here is an excerpt from the boker log:

2012-09-25 00:23:00,777 | TRACE | Run task done: org.apache.activemq.ActiveMQSessionExecutor@15004dd | org.apache.activemq.thread.PooledTaskRunner | ActiveMQ Session Task-2
2012-09-25 00:23:00,777 | TRACE | ID:d22275-4226-1348543308113-3:11:1:1 received message: MessageDispatch {commandId = 6, responseRequired = false, consumerId = ID:d22275-4226-1348543308113-3:11:1:1, destination = queue://testq, message = ActiveMQTextMessage {commandId = 5, responseRequired = true, messageId = ID:d22275-4226-1348543308113-3:10:1:1:1, originalDestination = null, originalTransactionId = null, producerId = ID:d22275-4226-1348543308113-3:10:1:1, destination = queue://testq, transactionId = null, expiration = 0, timestamp = 1348546980730, arrival = 0, brokerInTime = 1348546980730, brokerOutTime = 1348546980777, correlationId = XXXXABCDEFGhijklm, replyTo = null, persistent = true, type = null, priority = 5, groupID = null, groupSequence = 0, targetConsumerId = null, compressed = false, userID = null, content = org.apache.activemq.util.ByteSequence@50a492, marshalledProperties = org.apache.activemq.util.ByteSequence@6481eb, dataStructure = null, redeliveryCounter = 0, size = 1134, properties = {clientId=BA3CB329-3A27-4328-B3F7-E0E4F5655B69}, readOnlyProperties = true, readOnlyBody = true, droppable = false, text = 1 This is a test msg sent at 25SEP2012:00:23:00.71. Xyz}, redeliveryCounter = 0} | org.apache.activemq.ActiveMQMessageConsumer | qtp3980107-29 - /demo/message?type=queue&destination=testq&type=queue&clientId=9A16B3C8-D98B-410C-B974-499137C5044D&readTimeout=1000
2012-09-25 00:23:00,777 | TRACE | Running task iteration 0 - vm://localhost#21 | org.apache.activemq.thread.PooledTaskRunner | ActiveMQ VMTransport: vm://localhost#21-2
2012-09-25 00:23:00,777 | TRACE | ack:MessageAck {commandId = 5, responseRequired = false, ackType = 2, consumerId = ID:d22275-4226-1348543308113-3:11:1:1, firstMessageId = ID:d22275-4226-1348543308113-3:10:1:1:1, lastMessageId = ID:d22275-4226-1348543308113-3:10:1:1:1, destination = queue://testq, transactionId = null, messageCount = 1, poisonCause = null} | org.apache.activemq.broker.region.PrefetchSubscription | ActiveMQ VMTransport: vm://localhost#21-2
, I just realized something else about that java test pgm I attached.  It was setting a string property named correlationId as well as setting the correlation ID header field.  Specifically:

    message.setStringProperty( "correlationId", correlId );
    message.setJMSCorrelationID( correlId );

Since the MessageServlet's setResponseHeaders gets properties, that is why the HTTP response contains a "correlationId" header.  If I comment-out the setting of the string property, and only make the setJMSCorrelationID call, then the Java pgm does *not* receive a correlationId header in the response.  That makes sense now.

While the fix for https://issues.apache.org/jira/browse/AMQ-3857 does enable the MessageServlet to send message properties back by way of HTTP response headers.  It is not a fix for this jira, which is asking for the JMSCorrelationID message header to be sent back in the response.  I assume it should go back by way of a HTTP response header, but should take precedence over a message property having the same name., This brings me back to a question I have posed to the User form in the past, but have not noticed an answer.  What is the best way for a RESTful HTTP client supposed to POST a message having a correlation ID?  I am able to do it using a JMSCorrelationID query parameter in the URL.  If I want to vary the correlation ID on a per message basis within a given session, then I must use a content-type of "application/x-www-form-urlencoded", where I have a JMSCorrelationID query parameter as part of the message body.  That is the way I have been POSTing messages with correlation IDs when using my RESTful HTTP client, and why my client has not been seeing the correlation IDs in response headers -- because I have not been POSTing the message with the correlation ID as a property., When the MessageServlet is updated to send the JMSCorrelationID message header back in a response header name:value pair, I assume the name will be "JMSCorrelationID".  Correct?  If so, I would like to update my client code in anticipation of seeing a response header by that name.  If that is not going to happen, please let me know by way of this jira.  I would love for this to make it in 5.7 if it is not too late.  Thanks in advance. , If my HTTP client were to make a POST request containing a header such as "JMSCorrelationID: mycorelID", it would be great if the MessageServlet would notice it and call message.setJMSCorrelationID.  Is that something that could be considered?  I would love to be able to make many POST requests within the same session with varying correlation IDs, and not have to use a content-type of "application/x-www-form-urlencoded".  , Another possibility would be to update MessageServlet to notice a "JMSCorrelationID: <mycorelID>" request header, and add it to the message properties.  That way, subsequent GET requests occurring at 5.7+ would get the correlation in a response header. Thanks in advance., Stephen. 

Do you mind working on a patch. That may help us understand what you want. ,    I would like that, but finding the time will be difficult.  I am currently under the gun with respect to some deadlines, so can't be anytime soon.  

   With respect to the needs of my client app, I should mention it is a C-based client.  In the past, I already developed C-based interfaces that hop over through JNI to a JVM where I load a JMS provider.  However, now I am developing C-based interfaces that avoid a client-side JVM.  If I understand things, my two top choices are to access the ActiveMQ broker RESTfully over HTTP, or develop a C-wrapper to the ActiveMQ-CPP client library.  The latter seems involved and includes dependencies on open source client libraries such as ActiveMQ-CPP and the APR.  Given that someone else in my organization has already developed some C-based HTTP interfaces, I thought it would be best to choose the former, and make use of the HTTP protocol.

   The C-based HTTP client code I call, establishes a connection using a URL.  Once connected, I can make many POST and GET requests, but I am encountering problems with respect to correlation ID's.  I cannot change the URL unless I re-connect, and I don't want to do that.  So, the only way I have found to POST messages within the same session/connection and with varying correlation ID's, is to use a content-type of "application/x-www-form-urlencoded".  That is a bit restrictive because then my users have to make sure the data is formatted correctly.  For example, you can't just send any text, without having to worry about special characters such as ampersand("&").  Also, the only way I have found to obtain the correlation ID when GETting a message, is when the correlation ID was actually put in the message as a string property, and I must know the name of the property.  Making use of the JMSCorrelationID header field would be ideal, but the current MessageServlet doesn't support it with respect to the pattern I mention above.

Thanks,
sv, If you really need a C based wrapper for ActiveMQ-CPP there already is one on GitHub here: https://github.com/fusesource/fusemq-c, Thanks for the suggestion.  I do sincerely appreciate the help.  I just took a quick look at fusemq-c.  At a glance, I see UNIX, Windows and Mac; but not z/OS.  We still have many customers running applications on 31-bit MVS mainframes.  Being able to support those customers played a part in my decision to go with HTTP.  I assume the fusemq-c client may have some code that assumes an ASCII character set, and probably depends on the C run-time library.  Even if fusemq-c has not dependencies on ASCII, if it has many C runtime dependencies, it would take a significant amount of work to over-come if I wanted to use it on MVS., Seems you only option then is to come up with some tests and potentially some patches so that we can understand what you use case is exactly and try to provide a solution. , I realize that the open source community relies on contributors and I should contribute more than this jira.  My management sets my priorities, and like most, I have more on my plate than I have time for.  I do appreciate the help I received, and I hope I can contribute some time in the future.  I sincerely do wish to.

The goal of this comment is provide more information regarding my use case.  The main purpose of this jira, is to report that a message's JMSCorrelationID header field, does not flow back along with the response headers.  The attached java test illustrates that issue.  I realize that beginning with 5.7, message "properties" will flow back as headers in the response.  However, the JMSCorrelationID does not because it is not property.  My use case hinges on the customers that expect my application to be able to obtain the correlation ID.  Given that I have chosen to implement my application using the HTTP interface, my application is currently unable to obtain the JMSCorrelationID.

Aside from getting the JMSCorrelationID in the response to a GET request, another use case involves POSTing a message that contains a correlation ID.  Using an url-encoded content-type, or specifying the JMSCorrelationID in a query parameter are two says to post a message with a JMSCorrelationID.  However, both of those mechanisms have limitations.

In one use case, see a customer using a client that is able to set the JMSCorrelationID when putting a message on the queue, and then expecting my client application to obtain it when  getting the message off of the queue.  I also see a use case where I want to post many messages containing different correlation IDs, all from a single connection to the broker. , I believe I found a way for me to POST many messages on the same connection but with varying correlation IDs.  I have learned that the first/start line of a HTTP request message begins with the method, followed by the identifier of the resource, and then the protocol version in use.  For example:

   POST /demo/message?destination=myqueue&type=queue HTTP/1.1

Even though that URI is what I specified at connection time, I am apparently allowed to modify it on subsequent POSTs.  For example, adding/updating a JMSCorrelationID pparameter seems to be allowed.  I have asked the person supporting our HTTP client layer to allow me to add parameters when making requests.  Unfortunately, he is over-booked and tells me it must wait until our next release.  Bummer.

Even if I were to accidentally mess-up the  resource portion of the start line, I assume I would just get a "not found" error, or something else that will hopefully be harmless.  If you know of any reasons why it is bad to change the URI on POSTS, please let me know., I updated my C-based client application with the ability to add a &JMSCorrelationID= query parameter to the URI found in the start-line(first header) of my POST requests.  This allows my app to POST msgs with a correlation ID within the same session and without having to use a content-type of "application/x-www-form-urlencoded".  I also updated my application with the ability to specify a "selector" header.  This allows me to GET messages based on correlation ID, but it still would be nice if the JMSCorrelationID header field would also come back as a response header.  BTW, I it appears that within a session, the first "selector:" header I send with a GET request is honored, but I am unable to change that selector on subsequent GET requests within the same session.  Am I out-of-luck, or is there a way to have subsequent GET requests on the same session(having different selector values) be recognized/honored?  Thanks in advance., Another thing I notice when I add a &JMSCorrelationID= query parameter to the URI found in the start-line(first HTTP header) of the HTTP POST request, is that when I quote the value of the JMSCorrelationID= parameter, the quotes are treated as part of value.  If I remove the quotes, it works, but then I must be careful to handle special characters such as blank, ampersand, etc.  Given that the query parameter is within a URI, I assume my app must take care when it comes to what is added to the URI.  , No test cases or patches provided to help us understand what you need here. , I know I talked about many things in this jira, but one of the outstanding issues is something I think REST API client apps will find important -- having the response from a GET request include the JMSCorrelationID in a response header.  Given that a JMS message's correlation ID is actually a header field, not a property, the correlation ID is currently not accessible to REST API clients that GET a message containing a correlation ID.  I consider correlation IDs as an important feature, and it seems odd that REST API clients do not see correlation IDs in the response to a GET request unless the producing application actually adds the correlation ID as a message property instead of simply setting the correlation ID header field.

Another outstanding issue I mention in this jira, pertains to a REST API client app wanting to change the selector within the scope of a session.  When the first GET request of a session causes the broker to create a consumer on behalf of the client, it does honor the selector header of that originating GET request.  However, subsequent GET requests within the session that have a different selector header do not cause the broker to re-create the consumer using the new selector.  That issue is important to me than the correlation ID issue.

I did not attach a test program to illustrate the selector issue, but the Java client test program I attached to this jira can be used to illustrate the correllation ID issue., Regarding the selector issue, in that last comment, I meant to say it is not as important as the correlation ID issue., I added a test on 25Sep2012.  If you have any questions, let me know., Updating the MessageServlet to have the JMSCorrelationID message header field added as a response header(as is done with the message properties) would be great.  That will allow my client app to make the *real* JMSCorrelationID *field* available to my users without depending on the originators of the messages creating a correlation ID message *property* as a circumvention.  Thanks in advance., I checked version 5.12.1 and this problem seems to be unresolved. I also notice this bug concerns as well others default JMS mesasge properties (despite custom properties working well).

Thanks to comment [#comment-13462365]  added by [~steve.v] I was able to create simple patch fixing this problem.

I done my best to keep backward compatibility but You may like to reconsider changing old header names form destination to JMSDestination and id to JMSMessageID to be more compatible with documentation at http://activemq.apache.org/activemq-message-properties.html]