[Hi Arjen,

can you turn on debugging on the stomp connector and trace stomp frames coming to the broker

http://activemq.apache.org/stomp.html#Stomp-Debugging, I did (it gave me 105MB of logfile) but it all looks correct to me, all of them are like:

-----
2010-08-17 13:36:00,176 [10.0.1.15:34486] TRACE StompTransportFilter           - Received:
CONNECT
passcode:
login:


2010-08-17 13:36:00,176 [10.0.1.15:34486] TRACE StompTransportFilter           - Sending:
CONNECTED
session:ID:argus-54091-1282044328525-2:39536


2010-08-17 13:36:00,176 [10.0.1.15:34486] TRACE StompTransportFilter           - Received:
SEND
destination:/topic/pw_cache_products

bogus
2010-08-17 13:36:00,177 [10.0.1.15:34486] TRACE StompTransportFilter           - Received:
DISCONNECT


2010-08-17 13:36:00,206 [10.0.1.33:37464] TRACE StompTransportFilter           - Received:
CONNECT
passcode:
login:

-----, Btw, I can only reproduce the behaviour when multiple listeners are connected to the test-topic. A single one doesn't exhibit the behaviour. When it does happen then, all listeners get the null-message., I believe, "Stomp" in the subject is misleading: the problem is on the consumer side, with consumers connected via OpenWire. 

We face the same problem without using Stomp at all: both the producer and the multiple consumers are Java clients connected via OpenWire., in addition to 5.3.2, the same is reproduced on 5.4.1, Actually, in my bug investigation it was neither the consumer nor producer side, the Broker just lost the contents somewhere in those occasions. So when printing the received contents of the message, the body was there. But tracing the dataflow afterwards, when it was sent to either a OpenWire or Stomp consumer, it had no body anymore.

I was only able to reproduce it in a very complicated scenario using Stomp-producers, but if you have a scenario where OpenWire-producers yield the same result... than its appearanlty somewhere deeper inside ActiveMQ., Several fixes in trunk may have resolved this issue, such as AMQ-2966.  Reopen if you can provide a test case that shows the error using a 5.6 SNAPSHOT build.]