[Am thinking that producerFlowControll should be off by default. It is an advanced option that allows producers to block such that the entire queue does not block on the broker side. So it is relevant when blocking is the desired behavior.

I think the default should be to use disk space rather than to block. Blocking should only happen when disk space is exhausted. To enable this, the pending message policy needs to be configured to spool message indexes to disk.

From my experience, producer flow control is experienced as "this broker is getting slower" where as it should be experienced as the solution to: I have configured a queue limit but I don't want to block all producers, just fast ones. Disabling it by default will lead users to it when they need it., I concur with disabling producer flow control because I've heard the same comments from many users due to the fact that it is enabled by default. 

I concur with the use of disk space instead of blocking. I see that this requires a {{<pendingSubscriberPolicy>}} and a {{<pendingQueuePolicy>}} in the config, but shouldn't a {{<fileCursor />}} and a {{<fileQueueCursor />}} be used instead of a {{<vmCursor />}} and a {{<vmQueueCursor />}} to achieve disk usage? 

Both of these changes would allow the broker to run in an unencumbered state by default. This is what most users expect. We just need to make sure that this is adequately documented in the config. , I didn't realize that this issue was not included in the 5.4.2 release so I'm attaching an updated patch that provides the following:

* Disables flow control 
* Enables the {{<systemUsage>}} element by default (so that these settings are explicit and not buried in code) 
* Syncs the values of the {{<systemUsage>}} element with the hard-coded default values in the {{BrokerService.getSystemUsage()}} method , Can we close this out now?  The default config now has the systemUsage settings in it.  Flow control is still on by default though. , This appears to now be fixed as the default config basically matches what's requested here, with commented out sections showing other configuration options that can be applied.  ]