[Any related tickets, threads about this? Should not be a huge fix unless i'm missing something.
Thanks!

ps: my message on activemq-users http://activemq.2283324.n4.nabble.com/Integer-header-in-STOMP-submitted-message-for-numeric-selector-header-gt-n-string-td3444817.html, The Stomp Spec 1.0 / 1.1 doesn't yet define encoding for numeric types in the headers.  You might want to get involved in the Stomp Spec mailing list to push for this in v2.0 of the spec.  See: http://stomp.github.com/index.html, Thanks, i will, and it would indeed make a great addition to the spec.. However, i see this particular problem as being outside the JMS ( specifically, what subset of SQL92 is used for selectors - if that is defined in there at all ) and STOMP specifications. I haven't had a look yet, but i assume all custom (non-JMS) message headers from a STOMP message are being saved into a string type property. Wouldn't it make sense to try and make an educated guess about the intended type of the STOMP header based on its content? At least as far as numeric and string types go. ( This functionality could depend on configuration to isolate a possible performance hit )

in the mean time i'll familiarize myself with the STOMP transport, maybe i can come up with a patch to better illustrate this ( if it is at all feasible )

regards,
Andras, @Andras_Szerdahelyi Wow, I filed this bug report in 2009 with the EXACT same expectations and intent that you are expressing now. I just want to commend you and second your intent to solve this problem in some way that is perhaps separable or orthogonal to the JMS or STOMP designs. This is absolutely just a question of "allowing" the user to pass information *through* STOMP into the JMS headers that would otherwise simply work.

I continue to agree with you that the solution is either:
  * Best guess at typing, as you suggested, OR
  * A mechanism for explicit casting

Looking forward to seeing this issue eventually solved.
-Marc, This is a limitation of the Stomp specification.  Suggest getting active on the Stomp group and requesting this sort of thing be added to the next Stomp spec., Hi,

First off, the STOMP spec does not define how selectors work.  So this is purely a ActiveMQ extension to the STOMP spec and I think we should be able to make it just work as expected even if the type info is not part of each header.  

The approach that Apollo took was to auto convert String header values to right numeric type in the comparison operation., Back port of the Apollo version of the comparison filter.  Added tests to stomp tests to show the numeric selectors in action.]