[It would be useful if you could create and attach a JUnit test case that demonstrates your issue.  This will allow for quicker turnaround and ensure that the fix stays into the future.  , test case.unzip and put it the src/test/java, I've created a testcase.The PolicyEntry configure the DurableTopicSubscription correctly when there's nothing for the topic in the Kaha storage.When KahaDB contains some messages for that topic,Destination and Subscription info will be recovered and ConsumerInfo will be created in addSubscriptionsForDestination method in TopicRegion class.After that the value of prefetchSize of the ConsumerInfo is zero., Modified version of the attached test that puts everything into one file., I modified the test case and ran it against 5.7-SNAPSHOT tests all pass without issue.  A cursory review of the code would seem to indicate that everything is working as it should be., the code 
assertEquals(100, info.getPrefetchSize()) 
in testSecondStart should be 
assertEquals(5, info.getPrefetchSize());
because 
policy.setDurableTopicPrefetch(PREFETCH_SIZE_5);, I think I see what's going wrong, will start working on a fix., Fixed on trunk., This change seems to break org.apache.activemq.store.MessagePriorityTest#testDurableSubs
the problem is that the pendingmessage cursor is reset on activate but with the default keepDurableSubsActive, the state in that cursor about subscribed destinations is lost.
I think we should not call policyentry.configure if keepDurableSubsActive is set and we have been deactivated. Not sure if there is an easy way to determine that., the unusual thing about that test is that it sets a setPendingDurableSubscriberPolicy via a policy, which triggers the reset.
The test works if brokerService.setKeepDurableSubsActive(false) is used., So far I don't see any way to tell if the sub was just deactivated or is coming back from a clean broker start, seems the only way so far is to only reconfigure on setKeepDurableSubsActive(false), Updated fix applied the settings only if keepDurableSubsActive is false the policy is only applied if durable subs go inactive otherwise they retain their original configuration. ]