[You get this exception because the session is closed....

Without more information or a test case to reproduce that's about the only answer we can offer.  , Hi,

 Below is the scenario.
1. I have activemq broker(5.7.0) embedded in jboss 4.2.
2. Spring Default Message Listener container(DMLC) is used for consuming messages.
3. Redelivery is configured on the broker side with a redelivery delay of 2 minutes(120000ms) for 4 maximum redelivery attempts.
4.JMS transaction manager is configured in the spring DMLC.

Below are the steps:
1. Create a message and send to the Queue1.
2. Spring DMLC will consume message and produces another message to queue2.


   When the above scenario is tested with one message it works correct. But when the load test is done with the above scenario. it causes the exception Producer is closed. The above scenario works well in the activemq 5.4.2 version. The reason for upgrade to 5.7.0 is the broker redelivery.

 Please let me know if any more details are needed.
 , A Unit test would be good here so that someone can take a look into it., no test case provided to reproduce what the user is seeing. , We have the same issue here. Please reopen the bug! The problem is not present in ActiveMQ 5.6.0.

While I have no test case at hand, I work on a open source project (and because of this, it is easy to give you access to the source). However, it is a little bit delicate to provoke the issue. If interested give notice and I post the details here., @thomas - please post as much information as you can. does ur scenario match with @kalyan ? as tim says, a unit test or project to reproduce would greatly help., The source it at https://bitbucket.org/nuclos/nuclos. We encountered the problem on the 3.11 branch - but I downgraded this branch back to 5.6.0 because of http://support.nuclos.de/browse/NUCLOS-1565 . 

Hence:
* Check out the source.
* Switch to 3.11.
* Change the property 'activemq.version' from 5.6.0 to 5.7.0 in the (parent) pom.

This is a (big) client-server project. Server is a WAR file for tomcat deployment. Client is a swing based fat client. 

We use ActiveMQ for sending message from server to client. The messages are mainly send for client caches invalidation. Because of firewall issues, we use the HTTP(S) (tunnel) transport of ActiveMQ. 

On the server side, we've got org.nuclos.server.web.activemq.NuclosJMSBrokerTunnelServlet. On the client side org.nuclos.client.jms.WeakReferenceMessageListener, org.nuclos.client.jms.TopicNotificationReceiver, and org.nuclos.client.jms.MultiMessageListenerContainer are the (main) JMS entry points.

Both client and server heavily use Spring configuration. This is certainly also the case for JMS. Messages are sent non-transactional, non-preservative.

After the error a ActiveMQ broker stop and restart is logged in the server log.   
, We have the same issue when upgrading from 5.5 to 5.7.
We are using Spring and Lingo.

I will try to create a reasonably small reproducible test., We have the same issue in a big project after switch from 5.4.2 to 5.7. At the moment we try to reproduce it in order to get a test case. 

With an AMQ 5.7 server and a 5.4.2 client we have no problems., Please reopen.
I want to attach a test case and a quick patch. It prevents connection to be closed even when still in use.

The patch is not complete, since connection close handling should be improved:
* when {{PooledConnection.close()}} is called, all {{Sessions}} created from it should behave like closed. It could be solved by proxying {{PooledSession}}.
* real connection failure should close all proxy connections/sessions immediately
 

, Please open a new issue and attach your work there, thanks., Created AMQ-4366.]