[Attaching patch file containing JUnit test but no fix yet. 
, org.apache.activemq.advisory.AdvisoryBroker does not override the method 
public void removeSubscription(ConnectionContext context, RemoveSubscriptionInfo info);

of class org.apache.activemq.broker.BrokerFilter.

Its the AdvisoryBroker that is responsible for creating and firing the advisory message to inform other brokers in the network that a durable subscription got removed. 
So AdvisoryBroker needs to override method removeSubscription() accordingly. 
, Before this gets fixed, I suppose the workaround is to use offlineDurableSubscriberTimeout? , Thanks Torsten for the good test. Fixed with r1446447.
Give it a shot on your end when you get a sec., @Christian looking at that fix i think it may be may be missing the conduit nature if durable subs. So with two durable subs and one unsub, i think we will loose the bridged sub. Maybe just checkup on that. Not sure if there are failing tests that will show that.
but my thought is that the conduit durables need to be reference counted w.r.t to durable unsubscribes vs disconnects., Gary, that sounds right... I missed it. Let me write the unit test and get that in there, I reverted the change, we can revisit., FYI, DurableSubInBrokerNetworkTest.testDurableSubNetwork is currently failing
, As a first step we need a proper way to send advisories when durable sub unsubscribes. I started with Christian's solution but noted a couple of cases that were not covered, like sending advisory when unsubscribing using JMX and after restarting a broker. I committed a new fix in svn revision 1482790. I'll now proceed to trying to implement the rest of this feature., Pushed another commit 1483827. It keeps track of durable subs in demand suscription and unregister local durable when there's no remote durable subs any more. The DurableSubInBrokerNetworkTest now passes but there is more work in this area. We need to make sure we have a proper state after broker restart and work well with mix of non-durable and durable subs on the same topic., In the latest commit you added a new field to ConsumerInfo clientId with the openwire annotation set to version=1, shouldn't that be version=10 in order to keep backwards compatibility? , Thanks for spotting! Fixed and bumped operwire version to 10 in svn commit 1483902, @Christian - this looks done but there is a test that is excluded in the unit-test pom as broken that maybe can come back into the fold.
{code}<!-- https://issues.apache.org/jira/browse/AMQ-4000 -->
                <exclude>**/DurableSubInBrokerNetworkTest.*</exclude>{code}, test enabled on trunk - fix looks complete
http://git-wip-us.apache.org/repos/asf/activemq/commit/0ebbd5d9, Commit dc06c8dc7540233aad6722afe554c2ea505754e2 in activemq's branch refs/heads/master from [~gtully]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=dc06c8d ]

https://issues.apache.org/jira/browse/AMQ-5994 https://issues.apache.org/jira/browse/AMQ-4000 - proper fix for duplicate sub info from the store on recovery failure from AMQ2149Test. Additional test from Christopher L
, Commit 8ef31b91e6db5a10cebc79785f075649d8ba0a56 in activemq's branch refs/heads/activemq-5.12.x from [~gtully]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=8ef31b9 ]

https://issues.apache.org/jira/browse/AMQ-5994 https://issues.apache.org/jira/browse/AMQ-4000 - proper fix for duplicate sub info from the store on recovery failure from AMQ2149Test. Additional test from Christopher L

(cherry picked from commit dc06c8dc7540233aad6722afe554c2ea505754e2)
]