[The MQTTInactivityMonitor doesn't really need to get an KeepAliveInfo so long as the receiveCounter value is updated correctly.  I committed a fix today that should make that happen now in the NIO and NIOSSL transports so all should be fine there.  , Tim,
I considered that too. However, the PINGREQ/PINGRESP are frames that are part of the contract/spec that determine whether a connection should stay open (insofar as I understand). So if the PINGREQ frame isn't treated specifically in the InactivityMonitor, then it's only counting whether or not more data has come in over the wire. But in that case, you could just send in random data not related to the MQTT spec and that alone would keep the InactivityMonitor alive... Which isn't necessarily desired? , Well technically speaking you could do that on any of the transports, but hopefully that random data would generate a marshaling exception and shutdown the connection.  , I'm not opposed to you adding in the conversion to a KeepAliveInfo, just wanted to note that its not altogether necessary. , Yah, I hear ya. Im on the fence now too. If we use the KeepAliveInfo, then it ties the PINGREQ/RESP to the InactivityMonitor. As it is right now, when the MQTTProtocolConverter sees a PINGREQ, it responds right away with a PINGRESP regardless of whether there is an InactivityMonitor (transport.useInactivityMonitor=false). 

On the other hand, the InactivityMonitor is the heart-beating on the server side and the PINGREQ/RESP is the contract. My instincts say to make the PINGREQ/RESP explicit in the implementation. 

idk yet. i'll run my proposed changes by you before I commit., So I went without the KeepAliveInfo object. 

Also fixed the MQTTTests that were broken, added more around inactivity monitor, added default keep-alive for server side, implemented a grace-period for keep-alive.

Tim, if you could review just to sanity check, that would be great.

The tests around inactivity monitor are not the best (uses some Thread.sleep() calls to get the inactivity monitor to hang). If you can think of a better way, I'm all ears., PS... there are some docs I would like to update on the wiki around MQTT. I still don't seem to have access to assign things to myself in jira, and I don't see any options to update the wiki. Is that another permission?, There's some karma needed to edit the Wiki., Changes look good, not sure on the tests, will have to think on that. , Updated the test case to remove the hard sleeps, Ah, very nice with the waitFor(condition)... thanks!, @Christian, is this complete now?  , Tim,
Yes. Was waiting to assign it to myself, but haven't heard back from Hiram on my Jira access. I can mark it resolved]