[Added the missing code to NIOSSLTransport to attempt to set the property on the ConnectionInfo if the certificates are available.

You can try out the next 5.7-SNAPSHOT and see if this works for you. , Sorry... I can't change right now the version of ActiveMQ.

Are the changing only in the NIOSSLTransport class? I can compile it from the 5.7 sources and "inject" it (only the class) in my 5.6 jar ? , Yes, changes in NIOSSLTransport, see the source tab for this issue to review the changeset., Tim, 
I tried that too, doesn't seem to solve it.
The JaasCertificateAuthenticationPlugin seems to require the certificate from the connection also, so I've written a test for NIO+SSL that uses that auth plugin. It will fail also because of this JIRA. I'll attach test case, Testcase, I tested and it does not work.
The SSLSession in NIO has almost everything null (also local certificate and peer certificate).

The "toString" of the eclipse debug shows this:
[Session-1, SSL_NULL_WITH_NULL_NULL]
In the "standard" ssl it shows
[Session-1, SSL_RSA_WITH_RC4_128_MD5]

If you need other information just ask :)
, Updated my test case... first version didn't set up client credentials properly, The 'SSL_NULL_WITH_NULL_NULL' issue is because the initial call we make to get the sslSession returns an session that's not initialized since the getSession() method can't block.  To fix that we need to update our sslSession in the finishHandshake() method., @Christian the config for the nio+ssl in the attached xml should be transport.needClientAuth=true although that doesn't actually make things work it at least sets the option to require the client to send its cert.  , @Tim good catch, thank you!, Added the change to update the SSLSession instance post handshake so that the session in use contains accurate data about the cipher suites etc that are in play for that current session. , It's a bit better... Now at least the session is no more empty.
But still some information are missing.. in particular information about the host (ip and port) and the peer certificates.

I attach two screenshot of the debug window in eclipse for ssl and nio+ssl, Francesco, so are you indicating that on the 2 screenshots, the nio+ssl has some details missing that are on the ssl screenshot?, Tim do you have some time to work on this. It would be great to get fixed for 5.8.0 release., We use X.509 authentication on our SSL connectors.

Because of this bug, STOMP+NIO+SSL authentication always fails with: java.lang.SecurityException: User name [null] or password is invalid., Hi Claus, I'm a colleague of Francesco Romano , and I 'mwriting on behalf of him.

If you compare the two screenshots, you'll find that the peerCerts field is null in nio+ssl environment and is valued in ssl one.

, Updated test case, self contained now so we don't need the broker xml config file., This one's got be a bit stumped., Ok, committed what I believe is the fix for all this now.  In order to test it fully you need to completely setup the Jaas Certificate stuff with the login.config files and such.  For those with the proper config I'd appreciate if you can test out the next SNAPSHOT build and see if this resolves all the problems. , Tim, could you please be a bit more specific in what is needed in terms of configuration?

We use the jaasDualAuthenticationPlugin with two domains configured in login.config (one with SSL, the other one without) and this works fine with stomp+ssl.

Changing the connector to stomp+nio+ssl breaks the authentication (we get java.lang.SecurityException: User name [null] or password is invalid).

Do we need to add configuration bits that are specific to NIO?, There's nothing specific to NIO.  The configuration is the same.  See this documentation on the setup for JaasCertificateAuthenticationPlugin
http://fusesource.com/docs/broker/5.3/security/Auth-JAAS-CertAuthentPlugin.html, Tried it out, and it works.

At first I was getting the same errors that Lionel was getting (it got past that part in JaasCertificateAuthenticationBroker.addConnection() where it was making sure the TransportContext was an instance of X509Certificate which is where it was failing previously, but then it would fail at the call to LoginContext.login() with User name [null] or password invalid error) but then I changed the user.properties a little bit to match what the client was presenting in its cert and my tests passed., Christian, in our case the exact same user.properties file works fine without NIO. It is strange that enabling NIO would change the certificate format... What did you change to have your tests pass?, Lionel,

I changed the user.properties file referenced by my login.conf to match the client with what was in the cert. 

client=CN=client, OU=activemq, O=apache
#client=CN=client, OU=activemq, O=apache, L=Unknown, ST=Unknown, C=Unknown

Now that I think about it, I should have verified the client's cert to make sure it wasn't indeed passing the data in the commented out (second) line and that the SSL code only saw the first line.

, Christian/Tim, in our setup, we use the jaasDualAuthenticationPlugin. Its code contains:

{code}
   isSSL = (transportConnector.getServer() instanceof SslTransportServer);
{code}

This does not seem to be correct with NIO. Could you please check if you can make cert auth work with jaasDualAuthenticationPlugin?, Ok, think that's all fixed now as well.  Would be good to validate under your own configuration using the next nightly SNAPSHOT to ensure I got it all sorted. , This is now fixed on trunk. , Hello,

it still fails for us with jaasDualAuthenticationPlugin and certificate authentication.
Attached you find the unit test with its configuration files., Issues with the Jaas Authentication isn't related to the certificates not being present any longer so I'd recommend you open a new issue for this test so we can track that work there., Ok, I opened AMQ-4126.]