[I can work on this one., Sure thing - go for it Mark., Upon closer inspection, this seems to be working as expected. I've added a section at the end of the REST page to clarify how to handle this situation:

https://cwiki.apache.org/confluence/display/ACTIVEMQ/REST, Thanks Mark.  Looks like a good way to resolve under the circumstances., Hi All,

I am new around here, so sorry if I get the etiquette wrong...

I am working on a project to use Apache ActiveMQ with a RESTful interface.  It's a cross platform error logging project, so code written in C++, Java, VBA, Perl or indeed anything that can access an URL can then report issues. The point is, we DO NOT deploy any libraries - we simply use the native implementations within the language to access an URL.  The HTTP message body then contains the details of the error - who, what, when, what line of code and so on.

The piece I am working on is a port of an MSMQ implementation (you can a simpllified implementation of the MSMQ version on this http://blog.alignment-systems.com/2015/03/excel-vba-industrialisationpart-seven.html and on github at https://github.com/JohnGreenan/7_ExcelVBE)

So, I can access Apache Active MQ from a Windows PC using the WinHttp.WinHttpRequest class (https://msdn.microsoft.com/en-us/library/windows/desktop/aa384106%28v=vs.85%29.aspx)

The issue is that when I try and send a body of the request, I get the same error as shown in this JIRA.

Within cURL it's possible to workaround as described by Mark Frazier, but I have tried a few approaches on this WITHIN VBA and failed to get it to work.

What I propose to do is to create a github repository with the VBA code and instructions on how to replicate, but I am not sure if that's how you guys work? Do you actually work with implementations in languages, or is it just the case that it it works with cURL then the other language implementation is viewed as being at fault?

Can you please give me some guidance on how I can work with you to get this resolved?

Cheers,

John, Replication code and instructions as well as log files from Apache ActiveMQ all on github now at 

https://github.com/JohnGreenan/ApacheActiveMQ.REST.winhttp]