[I've a similar problem using active mq 5.2-Snapshot. Messages get enqueued in queue, but don't get dispatched after a many days of normal operation. If a new message get enqueue in the queue -> the old message get dispatched and the new one stuck in queue. I'm also using the  amqPersistanceAdapter., Stephen, is this with the RC3 candidate?
Are there selectors on the consumers?
Would it be possible to produce a test case, even if it does not show the problem, it will help characterise the usage.
thanks., Hi,

Providing Attachments as Requested by Gary Tully.

My Environment:: ActiveMQ 5.2.0 - PERSISTENT MODE, Windows 2003 Server, Oracle 10

I have successful simple producer and consumer programs I always use for my test.(FYI: I can configure it to change No.Of Producers, No.of Consumers, and No.of Messages)

In our application, developers reporting to me of a particular job that it is not getting 2 paticular messages from activeMQ to complete the Job Process.
Not always but some times.

I saw them pending in ActiveMQ Admin Pages - queue browser.
==========================================
First test run:
==========================================
I sent a simple text message "NNP Message" to that same queue, and my consumer is waiting to receive them
Whereas Queue browser is showing them as sent and received but no pending.

Program Output:
	Connection Established :: ID:DWD51075520-3438-1298909628155-1:1

	ActiveMQ Machine : tcp://DWDAPPP05PW:63616
	ActiveMQ Queue : UIMJobQueuePreProdTax
	I AM  :: Thread-5

	Consumer STARTED
	Sending Message - 1
	Sending Message - 2
	Sending Message - 3  ...........................and keep on waiting
==========================================
Second test run:
==========================================
Same Program, Same Active MQ, But I sent to "different queue" now. Successfully Received those Messages

	Connection Established :: ID:DWD51075520-3767-1298911642514-1:1

	ActiveMQ Machine : tcp://DWDAPPP05PW:63616
	ActiveMQ Queue : TestTestTestQ

	I AM  :: Thread-5

	Consumer STARTED
	Sending Message - 1
	Sending Message - 2

	FOUND SOME MESSAGE - 1

	I AM ::Thread-7   Received NNP Message - 1

	FOUND SOME MESSAGE - 1

	I AM ::Thread-7   Received NNP Message - 2

	FOUND SOME MESSAGE - 1

	I AM ::Thread-7   Received NNP Message - 3
	Sending Message - 3


After reading this Bug scenario...I can also consider "After running for several days" situation and applying to my issue. The attachment provided can be used as a test case requested by Gary Tully

This is really giving us a big problem, as that job is very crucial to be completed in time, and due to this problem it is keep on waiting.

I can not suspect their consumer program OR their JMS type of that message, as the same thing is happening to my message and program.

I am attaching the ActiveMQ Log snippet, My Testing Programs, Please analyse it and help me, I am clue less and very urgent.


Thank You,
Nageswara P Nakarikanti., Looks like same Issue with some good comments: https://issues.apache.org/jira/browse/AMQ-2009, No test case given to reproduce the issue.]