[AMQ-2758 might also be related. , Your client should be catching all exceptions in the onMessage method.

From the JMS 1.1 spec...

4.5.2 Asynchronous Delivery

A client can register an object that implements the JMS MessageListener interface with a MessageConsumer. As messages arrive for the consumer, the provider delivers them by calling the listener's onMessage method.

It is possible for a listener to throw a RuntimeException; however, this is considered a client programming error. Well-behaved listeners should catch such exceptions and attempt to divert messages causing them to some form of application-specific 'unprocessable message' destination.

The result of a listener throwing a RuntimeException depends on the session's acknowledgment mode.

    * AUTO_ACKNOWLEDGE or DUPS_OK_ACKNOWLEDGE - the message will be immediately redelivered. The number of times a JMS provider will redeliver the same message before giving up is provider-dependent. The JMSRedelivered message header field will be set for a message redelivered under these circumstances.
    * CLIENT_ACKNOWLEDGE - the next message for the listener is delivered. If a client wishes to have the previous unacknowledged message redelivered, it must manually recover the session.
    * Transacted Session - the next message for the listener is delivered. The client can either commit or roll back the session (in other words, a RuntimeException does not automatically rollback the session).

JMS providers should flag clients with message listeners that are throwing RuntimeExceptions as possibly malfunctioning.
, Regardless, an uncaught RuntimeException from a client should not have the effect of ending that clients subscription.

Nothing in the spec (or even the section you quoted) would suggest this issue is expected behaviour, would it?, See this article for an explanation on why an uncaught exception can end the subscription
http://effectivemessaging.blogspot.com/2009/01/messagelistener-exception-handling.html
, I am out of the office until Monday, September 6th and have limited access to my emails. I will answer your email ASAP.

Please contact Nicolas Lejeune for urgent matters.
, I guess if the behaviour is undefined ... we cant rule out System.exit() as unexpected behaviour.... ]