[We used to have an infinite blocking request-response when closing clients, letting the broker konw that the client was shutting down. The code was patched a few days ago to use a timeout instead - so if the broker is down, the client will only wait until the timeout occurs before shutting down, This is fixed except when I use failover.  I am using failover (on client side) to connect to a network of brokers configured with static discovery and failover=true.  After the client has connected to some broker in the network, if I bring down all brokers in the network, the client will not shutdown.  Watching the client's DEBUG output, I see that it is forever trying to recoonect to a broker from the failover list.

When I turn off failover on the client side, the reconnection attempts do not continue -- i.e. without failover, the client shuts down properly. With failover, the client is forever trying to reconnect to a broker. I also set maxReconnectAttempts on the client, it still gets this debug output:

DEBUG - Attempting connect to: tcp://localhost:61616
DEBUG - Connect fail to: tcp://localhost:61616, reason: java.net.ConnectException: Connection refused
DEBUG - Waiting 30000 ms before attempting connection.
DEBUG - Waiting for transport to reconnect.
DEBUG - Waiting for transport to reconnect.
DEBUG - Waiting for transport to reconnect.
DEBUG - Waiting for transport to reconnect.
DEBUG - Waiting for transport to reconnect.

...and so on. This prevents the client fromn shutting down.

If I restart a broker, the client reconnects and then completes shutting down., Look into fixing this post 4.x, Is it possible to get this into the 4.0 release?, BTW have you tried setting a fairly aggresive closeTimeout value? (e.g. like 500 milliseconds)

http://activemq.org/site/connection-configuration-uri.html

, Yes - even with the closeTimeout value set to 500ms, if I am using failover then the client will wait FOREVER for the broker to reply before shutting down.  Without failover, if I just use TCP, then client shuts down properly, 

I have been testing this using the 4.0.1 release: incubator-activemq-4.0.1.

Perhaps you could try to duplicate this, so I'll at least know that it's not just my configuration?

Thanks., This is fixed, but the client using the failover protocol must  be configured with the maxReconnectAttempts argument set.  If maxReconnectAttempts is not set, then the client tries forever to reconnect and this seems to block the client's shutdown.  As long as maxReconnectAttempts value is non-zero, then the client will be able to shutdown when no brokers are online., I think it is a bug. Why transport cannot be stopped without any parameters? I have same problem and this problem not described in documentation. I set this parameter and solve problem, but I think bug is not resolved, Issue has been resolved.  The behavior described regarding maxReconnectAttempts is what is expected.]