[Do you either:
- delete the temporary queue when you do not need it anymore
- close the connection

?
Note that connection pooling in Spring or JEE containers will generally avoid closing the connection.


According to the 1.1 JMS specification temporary queues are not deleted before you do one of these.

See http://java.sun.com/j2ee/1.4/docs/api/  javax.jms.Session.createTemporaryQueue():

  "Creates a TemporaryQueue object. Its lifetime will be that of the Connection unless it is deleted earlier."

Or section 4.4.3 "Creating Temporary Destinations" of Java Message Service Specification - version 1.1
http://java.sun.com/products/jms/docs.html

{quote}
Although sessions are used to create temporary destinations, this is only for
convenience. Their scope is actually the entire connection. Their lifetime is that
of their connection, and any of the connection's sessions is allowed to create a
MessageConsumer for them.

..................................

Since temporary destinations may allocate resources outside the JVM, they
should be deleted if they are no longer needed. They will be automatically
deleted when they are garbage collected or when their connection is closed.
{quote}

BTW: Gary, this is not like implemented now. See AMQ-1979
Or is the deletion triggered by garbage collection? (i.e. no references left)
In that case it is correct.

Hans
, Thanks for that. I did not realize the temp queues remain live until the connection is closed...

However, I am not clear of how I can delete the temp queues without closing the connection. I am using .Net (and therefore Apache.NMS.ActiveMQ), and I don't see any delete method in Apache.NMS.ActiveMQ.Commands.ActiveMQTempQueue (which is the runtime type returned when I create temp queue via the session), and  I also don't see any delete method in Apache.NMS.ITemporaryQueue interface.

I digged in the code a bit and found the following method: Apache.NMS.ActiveMQ.Connection.DisposeOf which deletes the temp queue when I pass Apache.NMS.ActiveMQ.Commands.ActiveMQTempQueue to it. However, it seems to kill the connection, as when I try to connect with the broker again right after I called disposeOf I am getting the following error: 

System.Exception: Error writing to broker.  Transport connection is closed.
  at Apache.NMS.ActiveMQ.Transport.Tcp.TcpTransport.Oneway(Command command) : Transport connection error: Error writing to broker.  Transport connection is closed.

Would you be able to advise us how we can delete temp queues without closing the connection.

Many thanks

N





, NMS.ActiveMQ Connection class has a DeleteDesination method for this.  ]