[Ah you are shutting down the application. Do you have an embedded AMQ broker, or do you connect to a remote broker?

Since its Spring that shutdown, then make sure to set the order in the XML files using depends-on attributes. So Spring will shutdown Camel first.

You should also use the start|stop method on the pook as documented here
http://camel.apache.org/activemq
{code}
<bean id="pooledConnectionFactory" 
   class="org.apache.activemq.pool.PooledConnectionFactory" init-method="start" destroy-method="stop">
{code}

But the "depends-on" attribute should be set on these <bean> to depend on <camelContext> so Spring can shutdown Camel before them etc.



Looking at the source in 5.4.2 vs 5.6.0 then in 5.6.0 there is a try  .. catch now with a log WARN.
As the logic is clearing the session listener, we could possible enhance AMQ to allow setting the listener to null, even if its already closed. , Patch in activemq-core, to allow setting the listener to null if the session has been prior closed., We now allows setting the listener to null, even if the session has prior been closed. This should allow nicer shutdown of apps.

However still you should configure those depends-on to help Spring shutdown the app in correct order., Just wondering, how exactly should depends-on be configured? We're experiencing the same issue, and I've tried setting the depends-on attribute on the camelContext, the ActiveMQComponent, the PooledConnectionFactory, but none of those seem to have any effect., Yeah it can be tricky to get spring to shutdown in the order you want.

There is an example in Apache Camel - camel-example-management that has an embedded AMQ broker, that shutdown in correct order (AFAIR).
Also it may depend a bit on if embedded AMQ in the same JVM as the client (eg Camel) or use a remote AMQ broker etc.

@Jorge, fell free to try with 5.7-SNAPSHOT to see if the WARNs is gone now. , In our case we're using a remote broker in another JVM, so we can't "depends-on" the broker instance. Hmm., This issue happens when Camel is shutting down. My Camel connects to a remote broker and my configuration is shutting down Camel first, then the ActiveMQ. I used start/stop methods for init and destroy but i received the same WARNs. Also i try setting the correct depend-on attributes in Camel and ActiveMQ but there is no change.

I will try with the 5.7-SNAPSHOT to see if the WARNs is gone now.

Thank you very much [~davsclaus]. ]