[Is there any way to shut off the presentation of this NumberFormatException in 5.2.0.  Short of having it fixed, it would be very nice to at least prevent the spurious NumberFormatException and stack trace from appearing when using the tcp protocol in this manner, could you attach a test case for this issue? Exactly what parameters are passed to the API?, The String path passed to the API  at org.apache.activemq.transport.tcp.TcpTransportFactory.createTransport(TcpTransportFactory.java:125)

is "/exampleTopic".  The exact contents of the string doesn't matter.


, Not enough information provided to construct a test case.  Can be reopened if a test case is provided so this can be validated., The test case is simply:

new ActiveMQConnectionFactory("tcp://localhost:61616/exampleTopic").createConnection();

The connection is created successfully, bu the NumberFormatException is still being produced to standard error.

Although originally reported on 5.2.0, the same problem exists on 5.3.2 as well (what I happen to be using now).

As stated in the bug, the problem is in TcpTransportFactory.createTransport.  Here is an annotated code fragment that shows the problem (modified slightly from TcpTransportFactory.createTransport)

URI location = new URI("tcp://localhost:61616/exampleTopic");
String path = location.getPath();
// path is "/exampleTopic"
if (path != null && path.length() > 0) {
  int localPortIndex = path.indexOf(':');
// localPortIndex == -1 ...this is wrong, since //exampleTopic has no port in it
  try {
    Integer.parseInt(path.substring(localPortIndex + 1,path.length()));  
// the previous line throws NumberFormatException because path.substring(0.path.length()) does not produce a number, because path is "/exampleTopic"

, Thanks, having your full URI made that much easier.  The code will suppress the full exception stack and just log a warning now unless debug logging is on., sorry, But I found we still have some output which looks like:
*[/50/data/fileIn] TcpTransportFactory            WARN  path isn't a valid local location for TcpTransport to use*
I tested on activemq-5.7.0, it's a problem or not? Thanks., My two cents
Same warning with amq 5.8. used with Apche Camel 
Solved by not adding a / at the end of the amq server url 
tcp://myhost:61616/  give a warning 
tcp://myhost:61616 don't !]