[I thought I had a working patch, but no such luck.  I'll spend some more time on it next week and submit a patch once I get something working.
, Still working on this, but now it looks like this test sometimes hangs on other platforms, including Mac, Solaris, and RHEL.
, Stack trace, Stack trace attached from run with ampq+ssl
, I don't think we can resolve this as long as we are using the QPID client, because starting a connection in QPID is not fully synchronous. connection.start() creates a org.apache.qpid.amqp_1_0.jms.impl.ConnectionImpl, which in turn creates a creates a org.apache.qpid.amqp_1_0.client.Connection. This Connection creates a ConnectionEndpoint in its constructor and then calls open() on that.

ConnectionEndpoint.open() sends the open packet to the server. However, it doesn't wait for a response. It sets _state = ConnectionState.AWAITING_OPEN and returns. (The response from the server ends up getting handled by the thread named inputThread that Connection also creates in its constructor).

This can create a short race condition, which doesn't matter most places. I think it's a problem here because it takes longer for the server to create a connection when using SSL, and the test cases in UnifiedSessionTests aren't really doing very much. For example, for testCreateDurableConnectionConsumerOnQueueConnection it creates a QueueConnection in setUp(), calls QueueConnection.createDurableConnectionConsumer() which immediately throws an IllegalStateException, and then hangs trying to close the QueueConnection in tearDown(). As far as I can tell the test ends up calling close() on the connection before it's finished opening, and the result is a deadlock.

All of the tests pass if I add a short sleep to the setup to allow the connections to finish opening, but I don't think we can do that with the JoramJmsTests.
, The same issue affects TopicConnectionTest, so I have closed AMQ-4654 as a duplicate.
, This is also the root cause of https://issues.apache.org/jira/browse/AMQ-4641, "JoramJmsTest QueryBrowserTest fails when run with amqp+nio".  
, This comments out UnifiedSessionTest from the JoramJmsNioTest suite, as it hangs on slower boxes.
, Applied for now to prevent CI builds from hanging. , This is now hanging in JoramJmsTests occasionally, so I will comment it out there too.
, This has not been happening with these tests enabled since switching to the new JMS AMQP client from QPid.  ]