[Why are you trying to make a GET request to the WebSocket servlet?

I'm not really sure what the best behavior is here. On one hand we could either return nothing for a response to a GET request (or register the default servlet and forward to it).  Or we could just have the WebSocket servlet not implement GET at all and throw an error because there's not really a good reason to make a GET request to the WebSocket servlet that I can think of.

My preference would probably be to just return an empty response if a GET request was made and no error., What I am attempting to do is use client certificates in order to authenticate connections from the web browser (Chrome in this case) to ActiveMQ. I've found that in order to get Chrome to pop up the box to allow the user to choose their client certificate, I need to first make a standard HTTPS request to the WSS endpoint. Once the user has chosen to present their certificate to this connection, the WebSocket connection will also present their certificate enabling the use of it for authentication. It could be argued that this is a "feature" in Chrome, but I equally think that passing the request on to the non-existent default servlet is not ideal.

My first preference would be to make it possible to define (somehow) a default servlet for the WebSocket servlet to pass the request onto. Failing that, I would prefer receiving an empty response over not implementing GET at all., Hi, just a comment as we also get this issue.

We have a lot of websocket (wss) connections from various customers , mobile or desktop, over mobile network or not etc etc ... We have ~ 7k connections , with a lot of connections dropping and initializing all the time (basically this is connected to a website , so every time a user switches to a new page => new connection). 

in the 20 minutes, I find not less than 350 NPE with the exact same stacktrace. If I check the "qtpXXXXX" id at the beginning of log line and grep for it, I usually find other lines like :

bq. User Agent: [unset] requested WebSocket version [-1], Jetty supports version: [13] | org.eclipse.jetty.websocket.server.WebSocketServerFactory

and the corresponding IP are likly to be behind some enterprise proxy that (I guess) doesn't support websocket. 
Also, most of the qtpXXX id don't have any log with the source IP. It would be good to have the source IP when an exception is raised.
, I think the simplest thing to do is just return an empty response (no exception).  I don't really see a benefit of redirecting to a default servlet in this case., Commit f40532a23d70639a027fcf87893de8683edf430f in activemq's branch refs/heads/master from [~cshannon]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=f40532a ]

https://issues.apache.org/jira/browse/AMQ-6491

Changing the WebSocket servlet to return a succesful empty response
instead of an error when a GET request is made
, Commit a50979e308ab97123cfcf058e1acabb2c2c6b9d9 in activemq's branch refs/heads/activemq-5.14.x from [~cshannon]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=a50979e ]

https://issues.apache.org/jira/browse/AMQ-6491

Changing the WebSocket servlet to return a succesful empty response
instead of an error when a GET request is made

(cherry picked from commit f40532a23d70639a027fcf87893de8683edf430f)
]