[added an affected version, Am guessing this jira is still open because the mechanism for expiry is non deterministic, It occurs on ack and on message dispatch but not independently. For example a message enqueue with no more work on the broker will not be removed when it expires. 
There needs to be a task that periodically checks and expriies messages independent of normal message processing.
Current behavior is that expired messages will not  be delivered to a consumer, but they remain till some destination activity occurs.

I imagine a destinationPolicy.expiryPeriod=60000 - which indicates that a task will fire every minute and iterate through the in memory messages and expiry any that warrent it.
Possilby there is another destinationPolicy,expireStoredMessages=true which indicates that the expiry task will iterate through the entire store to locate messages that have expired. there may even be a limit, destinationPolicy.expiryTaskDuration=500 that limits a task duration to some period.

In all these would make message expiry deterministic for a destination.
, some further context from the user list:
http://www.nabble.com/Expired-messages-are-not-being-removed-from-queues-tt21967682.html#a22773666, just fyi I am highlighting the workaround from the post linked above.
{quote}In the end I implemented a workaround that was simply a thread that periodically cleared my queues of expired messages. The way it did so was to use a MessageConsumer and use a JMSSelector to consume only those messages that had expired. I don't believe the consumer itself actually ever receives any messages, but the act of looking for them causes ActiveMQ to expunge the expired messages.

e.g:
                MessageConsumer c = sess.createConsumer(dest, "JMSExpiration < " + System.currentTimeMillis());
                Message m = c.receiveNoWait();
                if (m != null) log.error("Returned an expired message");
{quote}
, I created a quick python script that hits the web ui, finds all the queues and then browses each which causes any expired messages to actually be removed from the queue.  We put this as a cron job that runs every 5 min.

If you pass no arguments it looks at localhost otherwise you can pass in as many host names as you want to hit.

I tried attaching it but no go so here is the source.

--------------------------------------------------------------------------------

#! /usr/bin/env python

import sys, urllib2, re

pattern = re.compile('browse.jsp\?JMSDestination=([a-zA-Z.]*)')

def expireMsgs(host='localhost'):
    url = 'http://' + host + ':8161'
    html = urllib2.urlopen(url + '/admin/queues.jsp').read()
    for queue in set(pattern.findall(html)):
        urllib2.urlopen(url + '/admin/browse.jsp?JMSDestination=' + queue).read()

if not sys.argv[1:]:
    expireMsgs()
else:
    for arg in sys.argv[1:]:
        expireMsgs(arg), warning, my above fix runs into this 

https://issues.apache.org/activemq/browse/AMQ-2169, r791881
Added a new expireMessagesPeriod (default 30 seconds) periodic task on a queue that iterates though maxExpirePageSize(default 400) queued messages (or draws them into memory) to implement deterministic message expiry. Can be disabled by setting expireMessagesPeriod==0 through a PolicyEntry. A producer with no consumer will not longer be blocked on memory limits if a message expiry is configured on a message as they will be actively expired every 30 seconds.
There is an additional expiredCount attribute in the destination statistics to track the count of expired messages., Need to update the schema to allow the configuration of  the expireMessagesPeriod attribute using activemq-broker.xml.

Currently activemq fails with a org.springframework.beans.factory.xml.XmlBeanDefinitionStoreException if you try define the attribute.

---Jaco, schema updated in r807969, optimizedDispatch makes this test hang, so I commented it out for the moment. It should be investigated more., optimizedDispatch makes this test hang (producer hangs), issue with optimizedDispatch resolved in 812214 , Modified test so that it has larger expiry time, which helps it pass on slower machines. But if you have small enough expiry time, it will fail, last piece of this resolved by https://issues.apache.org/activemq/browse/AMQ-2481, last piece resolved by AMQ-2481, This fix only applies to queues. Topics are a different matter as there is only persistence when there are durable consumers. there are pending message limit strategies that control the build up of messages for slow consumers. See: 
http://svn.apache.org/viewvc/activemq/trunk/activemq-core/src/test/java/org/apache/activemq/MessageEvictionTest.java?view=markup for an example of configured message eviction.]