[The receiver issues a credit of 2 but receives only 1 message., AMQ5684-reproducer.cs is a Visual Studio 2012 C# program to reproduce the issue. Instructions on how to install AmqpNetLite are included within.

, Thanks chuck, that's very helpful.  I had started down the same road of extracting the test from the AmqpNetLite stuff as well :)  I think I understand why this happens and am working on a fix, problem being that I've broken other clients test suites in the process :(

, Chuck, I have pushed some fixes to ActiveMQ master which should show up in the next SNAPSHOT build of 5.12 that attempt to address this.  I've implemented support for AMQP drain and in doing so found some places where we were not handling incoming flow events correctly that could cause what you have been seeing.  I couldn't reproduce this using the AmqpNetLite tests after applying all these fixes, can you validate this on your end.  I am still seeing some odd behaviour with the .NET tests when I use the 'jms' transformer but they seem pretty happy when run against a broker that is using the 'raw' or 'native' transformer, I'll try and track down what's going on there as well., Added additional fix to attempt to preserve the original MessageID value when the 'JMS' transformer is in play, requires that the store version be set to 10 in the Broker configuration to fully work.  This allows the AmqpNetLite tests to work fairly well now even when 'JMS' transformer is used., Snapshot 5.12-20150331 looks good. The test case passes., Fix confirmed by Chuck, thanks!, Timothy Bish, our production environment seems meeting this problem with activemq-5.11.2. I was trying to reproduce this issue with the jms referring to 'AMQ5684-reproducer.cs', but failed. Here is my code. [https://github.com/zman2013/activemq-test-2/blob/master/src/main/java/zman/test/CloseBusyConsumer.java] Can you give me some advice to replay the issue? Appreciate your help :) -zman, You will most likely find it quite tricky to reproduce an AMQP bug using the OpenWire JMS client.  ]