[This is my first shot at fixing it.

Some of the issues I found:

1) SelectorWorker calls Selector.open(), but the selector is never ever closed. I'm closing at SelectorManager.onWorkerEmptyEvent. Not sure if that's the correct spot.

2) StompNIOTransport.serviceRead was not calling selection.close on IOException. NIOTransport does call selection.close on channel.read == -1 but not on IOException.

3) DataInputStream not being closed at StompNIOTransport.serviceRead

I'm still getting some side effects. The exception below happened once on a client disconnect. Seems like a race condition at SelectorWorker.

Exception in thread "NIO Transport Thread" java.nio.channels.ClosedSelectorException
	at sun.nio.ch.SelectorImpl.lockAndDoSelect(SelectorImpl.java:66)
	at sun.nio.ch.SelectorImpl.select(SelectorImpl.java:80)
	at org.apache.activemq.transport.nio.SelectorWorker.run(SelectorWorker.java:76)
	at java.util.concurrent.ThreadPoolExecutor$Worker.runTask(ThreadPoolExecutor.java:886)
	at java.util.concurrent.ThreadPoolExecutor$Worker.run(ThreadPoolExecutor.java:908)
	at java.lang.Thread.run(Thread.java:619)
, I'm failing to reproduce this problem. Can you provide your testing code (in any language that you have it)? Thanks, - Start a server with a single stomp+nio transport. StompDropTestServer.java attached.

- Now you need a way to see the TCP ports opened by the server process. netstat will do, but I'm using "Process Explorer" [1] on Windows XP. Choose the process on the list, go to properties page, TCP/IP tab.

- For the client I'm using the gozirra library, which is a java stomp client [2]. I think StompConnection from ActiveMQ would lead to the same issue. But my application already uses gozirra. Create a client, StompDropTestConsumer.java attached.
No matter if the client calls disconnect or not, the server TCP ports will still be opened when the client terminates (and won't be reused).

[1] http://technet.microsoft.com/en-us/sysinternals/bb896653.aspx
[2] http://www.germane-software.com/software/Java/Gozirra/
, The client requires gozirra client from http://www.germane-software.com/software/Java/Gozirra/, Another thing that disturbs me is that TcpTransport.closeStreams is never called.
The only call is commented out at TcpTransport.doStop., This is now fixed on trunk and 5.3 branch. It's tested manually using StompLoadTest in activemq-systest subproject, which opens/closes a connection for every send/receive and simulates a real load on the broker. This test should be converted to the real system test, but that's the case for another issue.]