[Commit 5a27bdf07e1cc77251d02d10b477b38d34413d91 in activemq's branch refs/heads/master from [~gtully]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=5a27bdf ]

https://issues.apache.org/jira/browse/AMQ-6068 - fix and test. Cleanup from ra managed connection needs to remove the connection info, leaving the tcp connection free for another identity. Possibly this could be conditional on having a user supplied clientId
, The fix for this bug introduces an unwanted behaviour in our activemq cluster.
We are running JBoss 6.4 with a Java EE application that processes around 25000 msg per minute throught couple of JMS queues.
The application consumes one message, does some logic and then post a message on another queue. 
The applucation is running with XA-transaction enabled.

We recently upgraded from activemq-rar.rar version 5.13.5 to 5.14.5 and noticed that the A-MQ cluster started to behave strange,
one issue was that the nodes in the cluster (network of brokers) ran out of native memory. 

We have now come to the conclusion that the fix for this issue forces the activemq client to send a new ConnectionInfo message
to the broker for every message it processes. This get passed around in the cluster via Advisory messages and both memory consumtion
and CPU load went up on all brokers. The information sent in the connectionInfo is in our case always the same thing, i.e. we don't set any clientId etc.

There is almost no use having a JCA connection pool for activemq resource adapter when it cant avoid sending ConnectionInfo messages.

We have reverted back to 5.13.5 for now.  , thanks for the feedback. It may make sense to have this full cleanup conditional on a user specifying a client id.
However, the old cleanup would remove any consumer info, so the advisory load would be the same;
Usually only demand information, ie: consumer add/remove is propagated across a network.

There may be something else in the mix that is leading to the excessive memory usage., Commit 2bd337993285d83549fdb9d9f9b96712bb6fed69 in activemq's branch refs/heads/master from [~gtully]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=2bd3379 ]

[AMQ-6068] make full cleanup of the rar managed connection conditional on a user specified client id being present
]