[Please provide a reproducer for this, testing has not shown any of these issues., Please find the activemq.xml config in attachment.

The used qpid client with his dependencies :
- qpid-jms-client-0.9.0.jar
- proton-j-0.12.2.jar
- netty-all-4.0.36.Final.jar

I get the following situation at the moment the consumer connects :
!status when subscriber connects.png!

Is that sufficient to reproduce the problem ?
, Testing with latest Qpid JMS client and Broker I don't see this issue.  , I have done the same test again with the latest qpid client that I know : 
- qpid-jms-client-0.11.1.jar
- proton-j-0.14.0.jar
- netty-all-4.0.41.Final.jar

And I experience the same problems.  
I hope that you are talking about the same version of the qpid client and his dependencies now ?, Recommend you create a unit test that shows your usage that can reproduce the problem., I have added a unit test that shows the issue : "JmsClientUnitTest.java".

The unit test sends 1000 topic messages and only 501 are received., Hi Timothy,

I can tell you that the problem is started in ActiveMQ 5.14.1.  
I don't see the problem in ActiveMQ 5.13.3, 5.13.4 or 5.14.0.

Below you can see the difference between ActiveMQ 5.14.0 and ActiveMQ 5.14.1 at the moment a subscriber connects, before a message is consumed.

!status when subscriber connects 5.14.0 and 5.14.1.png!, Commit e050519ff6ae8079c5183f6e6372ddb3d03e91c7 in activemq's branch refs/heads/master from [~tabish121]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=e050519 ]

https://issues.apache.org/jira/browse/AMQ-6500

Better handle prefetch extension and pull consumers over Topics to avoid
the remote not receiving all the messages available based on the credit
it has issued. , Commit 65d789b4e1d59a196aa7f8f7e42aa99769352d8e in activemq's branch refs/heads/activemq-5.14.x from [~tabish121]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=65d789b ]

https://issues.apache.org/jira/browse/AMQ-6500

Better handle prefetch extension and pull consumers over Topics to avoid
the remote not receiving all the messages available based on the credit
it has issued.
(cherry picked from commit e050519ff6ae8079c5183f6e6372ddb3d03e91c7)
, Dear Timothy,

Thank you very much for solving the problem. 
I appreciate it a lot !

Patrick

]