[This appears to be part of the error described in AMQ-6929, but I've pulled it out into a standalone issue to put the focus on the fact that we're not respecting the configuration provided via the ignoreMissingJournalFiles property, so that AMQ-6929 can focus on whatever the root cause was, if it can be determined., note: if journal files are manually removed, then the index needs to be rebuild, otherwise there will be references in the index that won't exist and that is expected to error out.

removing the db.data will force an index rebuild from the available set of journal files.

the ignoreMissingJournalFiles relates to finding corrupt journal files.... it should be called ignoreCorruptJournalFiles i think. That needs some investigation to figure the best course of action. Fix of document, [~gtully] If that's what that flag actually means in the code, then I think we should 1) update the documentation on that flag, and 2) consider whether to begin the process of renaming the flag to the name you proposed, to make its actual purpose self-documenting. We could deprecate but keep (for now) the original name, but have both map to the same variable in the config class (via two setters but only one member variable). As long as the documentation for the old name clearly stated that the two were functionally equivalent and users should not set both values (or at least not to the same value), I'd think that would be a reasonable solution that was backwards-compatible for users upgrading but moved us in a good direction for avoiding future confusion., [~gtully] So I guess the other question is whether the capability implied in the current name (i.e. the ability for KahaDB to ignore missing files, updating the existing index accordingly without requiring a full rebuild) should in fact be added to the current implementation. Does that seem like a feature we'd want to implement? And if so, would you want it done in the same story as the flag renaming and documentation update, or would you want a separate story for that enhancement?]