[Commit 2aa172f905d3c783c722f6aedd0fe2c1af7b988d in activemq's branch refs/heads/master from [~gtully]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=2aa172f ]

https://issues.apache.org/jira/browse/AMQ-6065 - allow ioexception handler to flip the systemExitOnShutdown broker attribute before calling stop, i.e: exit on store io errors
, Commit 39a20bd788c664105c18886abf77c372cf9229aa in activemq's branch refs/heads/master from [~cshannon]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=39a20bd ]

https://issues.apache.org/jira/browse/AMQ-6065

Fixed test case so that a System.exit call will not take down the
JVM and cause the test suite to abort in Jenkins early
, [~gtully],  The test case here kept causing Jenkins to break because of the System.exit() call so I updated your test to use the System Rules library for JUnit which has an option to handle System.exit with a Security Manager to prevent an actual JVM exit., [~cshannon]  thanks for that. i overrode the broker service so i could check the flag and reset but missed the reset! pulling in that lib will also do it :-), Yeah, I thought about fixing it without using that library but I know in the past there have been other cases of System.exit being called in JUnit tests so I wanted to see how this solution would work because I figure it will happen again in the future :) , [~cshannon] I just peeked at that dependency - the license is not 100% compatible with ASF without some additional documentation[1] etc, I don't think we need to go there. I will revert the change and fix the test. 
btw: that security manager hack is in use at https://github.com/apache/activemq/blob/d6682e5476cd8cbefca04227ffa26a5d508d2494/activemq-unit-tests/src/test/java/org/apache/activemq/security/AbstractCachedLDAPAuthorizationMapLegacyTest.java#L405

[1] http://www.apache.org/legal/resolved.html, Ok, no problem.  I was thinking it would be ok because it's just a test dependency and wasn't being included with the release, plus it is the same license as older versions of JUnit.

As soon as you are done I will start the release process for 5.13.0.  , Commit 1bef4de4dc6744c23c22d2dac0faf0c9a6ab68d9 in activemq's branch refs/heads/master from [~gtully]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=1bef4de ]

Revert "https://issues.apache.org/jira/browse/AMQ-6065"
CPL dependency is not fully compatable with ASF and is not really necessary

This reverts commit 39a20bd788c664105c18886abf77c372cf9229aa.
, Commit f09000d1e61a0131ee20df22b7b2ac6d297ebd07 in activemq's branch refs/heads/master from [~gtully]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=f09000d ]

https://issues.apache.org/jira/browse/AMQ-6065 - ensure no call to exit. fix mock test to account for extra call
]