[We are tracking our own work-around in the following downstream bug:

http://projects.puppetlabs.com/issues/19239, Can you post the options you are currently using for your KahaDB store?, Reproduced with testcase based on description from Ken, patch for fix attached. 
Gary please review and let me know whether we're good to commit..., You may want to keep the old configuration option setter around as deprecated for at least one release cycle to be kind.  , You're probably right. I can change it back. 
Was trying to go with something a little more accurately named. But i would definitely not be happy to upgrade and find it blows chunks because of the attribute name change. 

I'll update the patch., The name change makes sense, just is nice to leave the old one around for a bit to ease the pain of those upgrading.  We just need to make sure to update the Wiki as well if we make changes to the names. , Sorry about the delay, my settings are here:

https://github.com/puppetlabs/puppetdb/blob/master/src/com/puppetlabs/mq.clj#L101-L105

Its in Clojure, but is basically:

{code}
          db (doto (.getPersistenceAdapter mq)
               (.setIgnoreMissingJournalfiles true)
               (.setArchiveCorruptedIndex true)
               (.setCheckForCorruptJournalFiles true)
               (.setChecksumJournalFiles true))]
{code}, Updated patch to take into account deprecating the ignoreMissingJournalfiles and using ignoreMissingOrCorruptJournalFiles

Gary/Tim, please review and give okay. I can commit when ready., Applied the fix and the tests: 

testLastJournalCorruptedCausesMissingMessages
testIgnoreMissingJournalfilesOptionSetFalse

Both fail., K.. i've tried it a couple diff ways... fresh checkout of trunk+patch on my Mac, fresh checkout of trunk+patch on different linux box, fresh checkout+patch on Eclipse, on Intellij, etc etc.... i can't get any of those tests to fail. Only thing I didn't try was windows box.

Looking at your gist from your logs (https://gist.github.com/tabish121/a51d3e93f902ae7e6874), any reason why there are eclipse jdt classes in the stack traces?, I had to use the Eclipse runner because surefire kept swallowing the output for some reason., Tried this on my Mac and it passes every time, on my Linux box where I've been running the test it fails every time.  ]