[[~gtully],

Mind taking a quick look at this patch I created?  I haven't written tests yet but this should give you an idea the direction I am going with this and I wanted to see if you thought I was overlooking anything.

https://github.com/cshannon/activemq/commit/85efac7c2f5d95a8ae75f8daa4a9478186d25d31, [~cshannon] looks good 


one thought: 
I guess it also means that on each dispatch, so when prefetched messages are redelivered, there will be an unmarshall/clear.
it makes me think that maybe doing something to ensure that properties in both states are part of the size. That would tackle directly the OOM.

However the non persistent case is valid and I guess the selector case is less common.

One important aspect is ensuring no sharing of a message when the destructive change to clear the state is made. With composite sends or virtual topics (mostly there is copy) but some care there may be needed. Also consumer that use a composite dest to subscribe to multiple dests. Recall the test that had us add/remove some sync in message in the past.

I think it will be fine, just be sure there is some existing sync point that will protect you in the case of sharing.
, That's a good point about not sharing the message while doing the clearing which I think could be an issue with topic subscriptions since the message will potentially be passed to multiple subs.

When doing the clear in the subscriptions maybe we need to do something like add a synchronize around the clear block:

{noformat}
if (isReduceMemoryFootprint()) {
  synchronized(node) {
    if (node.getMessage().isMarshalled()) {
      node.getMessage().clearUnMarshalledState();
    }
}
{noformat}

Ultimately, I agree about having the size count both states.  That would protect form OOM errors for when the message contains both of the states while also trying to save memory when it can.  The hard part is trying to estimate the size of the properties map., May not need the sync after all since the dispatch happens in the same thread sequentially (the dispatch policy just iterates over each subscription 1 at a time)

Also, really it needs to clear out only after it finishes dispatching to all subscriptions that match.  Otherwise it will clear the memory and then the next call to matches() for the next consume there will be another unmarshal.

So I think I might need to think about this a little bit more to see if/where it makes sense to do this in the subscription.  At the very least we can make the change for non-persistent messages to start., [~gtully],  I've decided to be slightly more conservative for this patch.  I don't feel super comfortable putting the memory clearing into the add method of the subscription like I did in my original patch because we would get into a state where we have to unmarshall/marshal the properties over and over again for each sub if there is a selector.  Plus there could be race condition issues at that point since the message has now been handed off to the different subscriptions.  So the new plan is to:

1) Still handle clearing the memory for non-persistent messages by checking if content and marshalledProperties are not null (or if both marshalledProperties and properties are null)
2) For topics, move the clear memory method call from doMessageSend to the dispatch method and put it after the subscriptionRecoveryPolicy check (which needs to use the properties and triggers and unmarshal) but before the dispatch itself.

This will at least fix non-persistent messages and it will also clear memory for topic subscriptions as long as there are no selectors (which is a less common case).  For the selector case where the dispatch policy triggers an unmarshall I would need to think about it a bit more or maybe we'd just need to do something like you mentioned earlier where we actually count the size of both objects in memory., Commit 7c3bb401007b4047c540287b53b435b20d3161c0 in activemq's branch refs/heads/master from [~cshannon]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=7c3bb40 ]

https://issues.apache.org/jira/browse/AMQ-6477

ReduceMemoryFootprint now applies to non-persistent messages if they
have been marshalled and topics now clear memory after the recovery
policy check
, Commit e0116d0458769881396d9f848d63496421fd59d5 in activemq's branch refs/heads/activemq-5.14.x from [~cshannon]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=e0116d0 ]

https://issues.apache.org/jira/browse/AMQ-6477

ReduceMemoryFootprint now applies to non-persistent messages if they
have been marshalled and topics now clear memory after the recovery
policy check

(cherry picked from commit 7c3bb401007b4047c540287b53b435b20d3161c0)
, Commit 0a80165a99bff33bfaeeb8fe1dc7b5a8e6f50830 in activemq's branch refs/heads/master from [~cshannon]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=0a80165 ]

https://issues.apache.org/jira/browse/AMQ-6477

simplifying isMarshalled method
, Commit 4cbe692bccb5bb246a2099f8504e103ac90079be in activemq's branch refs/heads/activemq-5.14.x from [~cshannon]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=4cbe692 ]

https://issues.apache.org/jira/browse/AMQ-6477

simplifying isMarshalled method

(cherry picked from commit 0a80165a99bff33bfaeeb8fe1dc7b5a8e6f50830)
, Commit 5c80eda321e7edb5f34ffd62c71523310d26b2ca in activemq's branch refs/heads/master from [~cshannon]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=5c80eda ]

https://issues.apache.org/jira/browse/AMQ-6477

Fixing potential concurrent modification exception
, Commit fc3206864d895a469af39ec2f3f6808ad936b908 in activemq's branch refs/heads/activemq-5.14.x from [~cshannon]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=fc32068 ]

https://issues.apache.org/jira/browse/AMQ-6477

Fixing potential concurrent modification exception

(cherry picked from commit 5c80eda321e7edb5f34ffd62c71523310d26b2ca)
]