[Not enough info to produce a test case.  I tried a few scenarios but couldn't create any leaks.  If you can provide a test case please reopen., Providing test case and screenshots , See test testAdvisoryRemovedWhenTempQueueRemoved, jconsole screenshoots on how to reproduce this problem. , The attached classes provide the modifications to fix this issue, Is it possible for you to include your fixes as a patch file, and ensure that you check the grant license to apache when you upload it, your current submissions don't have the lic grant., I'm going to take a look at this one as we've been hit with a temporary destination leak that gets ugly when we setup a test environment to test failover periodically (spoke node failing between two nodes every 15 minutes).

If all goes well, I'll post the patch., does gc of inactive destinations, https://issues.apache.org/jira/browse/AMQ-2821 not work in this case?, Added a test to show that the Purge inactive destinations feature handles this situation.  , We have {{gcInactiveDestinations=true}} and still see this problem.

The entire sequence of events is unclear, but it appears to be related to the network of brokers awhen producers and consumers are on different brokers.  It may also be related to failover; when we see a broker failover (even one not involved in the flow of the destinations), traffic on {{ActiveMQ.Advisory.TempTopic}} jumps.

Note that messages on the {{ActiveMQ.Advisory.TempTopic}} appear to cause the destinations to be re-created as they are unmarshalled by the protocol.  That seems problematic to me - especially for temporary destinations which need to get attached to a connection.

I'll try to produce a test case.

*Dreaming:* I really wish I knew a way to see the sequence of all of the broker internal activity for a specific destination across the network of brokers.  Or, better yet, a way to capture that information and review it later since the specific destination involved may not be known until after the fact., Arthur, just a thought, if you don't want temp destinations to propagate across a network, use <networkConnector bridgeTempDestinations="false" />

A test case is the answer alright :-), Thanks Gary - we do need them to propagate across the network.]