[Care to elaborate here, not really sure what you are referring to.  , Hi,

I have Apache activemq version 5.0.9 on a Redhat 7.
in activemq.xml there is the following definition:
 <transportConnector name="ws" uri="ws://0.0.0.0:61614?maximumConnections=1000&amp;wireFormat.maxFrameSize=104857600"/>

 I have to disable TRACK and TRACE method on activemq port 61614 because using 
telnet xxx.xxx.xxx.xxx 61614 and put TRACE or TRACK 'commands' I can see that those methods are enabled

TRACK and TRACE methods are not enabled on the other transportConnectors definitions using 61616, 61613, 1883, 5672 ports

Regards
, Still not clear what TRACE and TRACK are, perhaps share how you disable them so it is clear what options you are referring to. , Hi,

I am referring to CVE-2004-2320, CVE-2010-0386, CVE-2003-1567 vulnerabilities.

Here is the PCI finding and the proposed solution that audit dept gave to us:
-----------------------------------------------------------------------------
The remote Web server supports the TRACE and/or TRACK HTTP methods, which makes it easier for remote attackers to steal cookies and
authentication credentials or bypass the HttpOnly protection mechanism.

Track / Trace are required to be disabled to be PCI compliance.

IMPACT:
If this vulnerability is successfully exploited, attackers can potentially steal cookies and authentication credentials, or bypass the HttpOnly protection
mechanism.

SOLUTION:
Disable these methods in your web server's configuration file."

$telnet localhost 61614

TRACE / HTTP/1.1
Host: localhost:61614
HTTP/1.1 200 OK
Content-Type: message/http
Content-Length: 115
Server: Jetty(7.6.9.v20130131)
-----------------------------------------------------------------------------

In activemq.xml file there is the following transformconnector definition:

            <transportConnector name="ws" uri="ws://0.0.0.0:61614?maximumConnections=1000&amp;wireFormat.maxFrameSize=104857600"/>


So I need a way/solution to disable TRACK and TRACE methods that are activated on port 61614. So that the above telnet command does not returns 200 OK result
I hope that now everything is clear?

Installed OS is Redhat 6.5 and RedHat 7.
Installed activemq version is 5.9.0
Installed java version is jdk1.7.0_67
Installed tomcat version is 7.0.42

Regards

, Have you tested against a later broker release such as v5.11.1 which uses a much newer Jetty?, Hi,

I can't upgrade activemq version to the recommended one since our application vendor has certified his application up to activemq version 5.9.0. So I need a solution for activemq version 5.9.0

If I disable/commented out the
 transportConnector name="ws" uri="ws://0.0.0.0:61614?maximumConnections=1000&wireFormat.maxFrameSize=104857600"/>
what will be the cons?
What actions will not be supported?

Regards, If you remove the ws:// transport nothing terrible will happen other than not being able to connect clients using a websocket connection.  If you need that then you'd probably want to upgrade to the latest version that uses an updated Jetty. ]