[I just did a sanity on a new build of trunk and it works ok. Also I increased the logging in a relevant test[1] to validate it it works ok.
Is there any chance there is concurrent access to that destination.

Test case: https://fisheye6.atlassian.com/changelog/activemq?cs=1454333, Gary, the broker has no clients using the queues we tried to delete. Could it be some kind of corruption of the store (KahaDB for us)?, FWIW, I've tried again with a more recent snapshot (activemq-5.9-20130315.115006-23) and the problem is still present.

To reproduce it:
 - wipe out the message store
 - start the broker
 - start test clients to use some queues, wait until they finish
 - delete the queues via JMX or JConsole -> they do not get removed, Just tried it here on a fresh build and its working fine, followed the steps given and Queues are deleted without issue. , Could this be linked to the message store? We use kahaDB with the following parameters:

    <persistenceAdapter>
      <kahaDB directory="/some/where/kahadb" enableJournalDiskSyncs="false" indexCacheSize="1000" indexWriteBatchSize="10000"/>
    </persistenceAdapter>
, Seems doubtful given that you started with a clean KahaDB, you can always go back to default settings and test.  , Via trial and error, it seems that the following line is causing us problems:

      <jaasDualAuthenticationPlugin configuration="activemq-domain" sslConfiguration="activemq-ssl-domain"/>

Without it, queue deletion works. With it, it does not.

Do you see the same behavior?, Can you throw together a unit test that reproduces it?  , jaasDualAuthenticationPlugin is quite complex to setup.

I've tried to patch activemq-unit-tests/src/test/java/org/apache/activemq/bugs/AMQ4126Test.java for it (see attached).
The new test fails on the last assert, indicating that the queue still exists.

BTW, I also had to modify activemq-unit-tests/src/test/resources/org/apache/activemq/bugs/amq4126/JaasStompSSLBroker.xml to set useJmx=true..., Fixed, will show up in next SNAPSHOT]