[Patch of DemandForwardingBridgeSupport, which waits until the local Broker's ID is known before transmitting the BrokerInfo to the remote transport., Unit test that demonstrates the ability of DemandForwardingBridgeSupport to transmit a null local Broker ID.  The test contains a "normal" case that typically succeeds because there are few delays in VMTransport.  The test also contains a "delayed" case that fails with the unpatched DemandForwardingBridgeSupport.  When the attached patch.txt is applied, both tests pass., Both tests seem to fail regardless of the patch being applied., The unit test is failing because Broker.addBroker(...) is no longer being called when the bridge processes a remote BrokerInfo command.  The test was relying on addBroker(...) to verify that the broker ID had been set.

The removal occurred in TransportConnection#processBrokerInfo(...) as part of this changeset:

Revision: 1058577
Author: gtully
Date: 6:18:14 AM, January 13, 2011
Message:
https://issues.apache.org/jira/browse/AMQ-3077 - ArraysIndexOutOfBoundsException : -32768 in "BrokerService[xxx] Task" thread - brokerInfo and peerBroker infro explosion problems. A peer is a oneway relationship with networks, broker infos were being accumulated in duplicate for each connector and for multiple connectors. The peer broker info was maintained for each which caused the problem marshalling. re: https://issues.apache.org/jira/browse/AMQ-2632 - the configuration is now respected so it can be selectively enabled and rebalance only occurs if we randomly choose an alternative. The nested peer broker info is not propagated in a connection control
----
Modified : /activemq/trunk/activemq-core/src/main/java/org/apache/activemq/network/DemandForwardingBridgeSupport.java
Modified : /activemq/trunk/activemq-core/src/main/java/org/apache/activemq/broker/TransportConnection.java
Modified : /activemq/trunk/activemq-core/src/main/java/org/apache/activemq/broker/region/RegionBroker.java
Modified : /activemq/trunk/activemq-core/src/main/java/org/apache/activemq/command/BrokerInfo.java
Modified : /activemq/trunk/activemq-core/src/main/java/org/apache/activemq/transport/failover/FailoverTransport.java
Modified : /activemq/trunk/activemq-core/src/test/java/org/apache/activemq/transport/failover/FailoverClusterTest.java
Modified : /activemq/trunk/activemq-core/src/test/java/org/apache/activemq/JmsMultipleBrokersTestSupport.java
Added : /activemq/trunk/activemq-core/src/test/java/org/apache/activemq/usecases/NetworkOfTwentyBrokersTest.java

, Updated unit test that works on trunk to demonstrate the issue (pre-patch) and resolution (post patch)., I've added a revised unit test that does not rely on Broker.addBroker(...) to demonstrate that the issue (transmitting BrokerInfo with null ID) is still present on trunk., Reviewed the code, Patch applied, thanks for the hard work on this.]