[What does your configuration for your broker look like? , So our topology is pretty complicated, but I'll give you a couple of nodes to show the basic idea. The four configuration files in question are included in the [^config.zip] attached to this ticket.

We've got one broker, here mqbe03, with the configuration be03_activemq.xml and be03_camel.xml. That broker is networked to another broker, 04, which I'm not showing here. They have rebalance and their clients all do failover. 

Then there's a third broker, npqueue01, which has the configuration npqueue_activemq.xml and npqueue_camel.xml. This broker is standalone, and uses its camel routing to pull from mqbe03 (or, if it's rebalanced of fails over, mqbe04).

Let me know if this isn't clear enough or you need more information., One thing I noticed is that you have configured {{concurrentStoreAndDispatchTopics}} set to true.  Setting {{concurrentStoreAndDispatchQueues}} to true (the default) is recommended but for Topics it is not and might be the cause of the issue.  You might want to try disabling that first.  

Other than that, to narrow down the issue, you'd probably need to start removing variables.  It's possible there could be something going on with Camel, etc but it's hard to say., We have tested setting concurrent store and dispatch to false for topics and have continued to see the issue. What variables would you suggest we eliminate?, What kind of messages are you sending?  Does the issue still happen if you change message type? (String, bytes message, etc, or persistent or non-persistent)

The main thing is just trying to narrow down what the issue could be as right now it will be hard to figure out as your setup is complex.  For example, does the issue happen if you only have 1 consumer instead of multiple?  Does the issue happen if you just use a standalone broker and no network of brokers?  Does the issue happen if Camel is not used?  The simplest setup possible to reproduce the issue the better.  For example, If you are able to reproduce it with a standalone broker without Camel it would be a lot easier to debug., [~pboekelheide] did you ever manage to resolve the issue?]