[Sorry to pester, but this issue is now holding up deployment at a customer site ... has anyone been able to replicate it, or can someone point out my mistake(s) or an alternative solution?  I searched the mailing lists and posted a message on the forum, but i'm getting no responses from anyone.  

We moved to activeMQ precisely because of the reliable capabilities, but it's the one thing we can't get to work ..., Incidentally, further testing has shown that the two post-network-outage situations i described above boil down to the same thing - situation 1 (where no messages are received) becomes situation 2 (infinite repetition of the same message) if it's left alone for a while., I've also experienced the same problem using the reliable protocol between a network of brokers.  I can confirm that the problem still exists in 4.0-M3 when using the failover protocol (which is the replacement for reliable).

Has anyone managed to get this feature to work successfully?, Yes, I'm having the same problem with 3.2.2. 

The main reason my company is looking at ActiveMQ is the broker networking feature. This pretty much seems like a showstopper for adopting this product for us., OK,

I've played around with this a little more using just 2 networked brokers (brokerA and brokerB) and 2 clients (clientA and clientB) connected to their respective brokers. The clients publish and subscribe to a single topic.

Again the problem that occurs is that if brokerB is shut down and then restarted, clientA will then start receiving two copies of each message that it publishes.

What I did, though, was to add a reconnectSleepTime attribute to broker A's <networkChannel> element and set the value to 10000 (10 seconds). The default value is 2000. What happens when I run this way is that if I stop brokerB and immediately restart it, for a while clientA behaves correctly, i.e., it only gets one copy of the message. After about 10 seconds (when brokerA reconnects to brokerB), then clientA will start getting double messages.

Hope this provides some sort of clue., 
   Hi, we are also seeing this problem...and is holding up our deployment now.  Any idea when we might get a fix for this?

   Thanks,
   Joe
, We are experiencing the exact same problems. This is crucial to our decision on using ActiveMQ as well. It's a total killer to get this to work. If we can't, we'll probably spend a ton of money on Sonic or something. I haven't found the same HA (High Availability) features in other opensource jms's. JBoss doesn't have it, neither does OpenJMS. Reading this bugreport I've come to think there's a reson for that :-) It seems difficult to implement., I'd recommend you all try out Master/Slave to give you HA

http://activemq.org/MasterSlave

which is available in the forthcoming 4.0-RC1 release (its in the current SNAPSHOT distro if you want to try it out), We are currently testing master-slave in the snapshot version. We'll probably put it in production as soon as 4.0 becomes a release., Seems issue was resolved by useing M/S pairs.]