[We can disable the LevelDB variations for now and address these in v5.9 as KahaDB is still the default persistence adapter. , adding failing org.apache.activemq.broker.region.cursors.StoreQueueCursorJournalNoDuplicateTest, but scenario where journal is used over a journaled pa is dubious., org.apache.activemq.bugs.AMQ2149Test needs a leveldb variant, and will fail atm, also - org.apache.activemq.usecases.ThreeBrokerVirtualTopicNetworkAMQPATest, Also, these cause issues at least on AIX and Solaris.

AMQ2584Test 
AMQ2870Test 
QueueMbeanRestartTest 
FailoverTransactionTest
ConcurrentProducerDurableConsumerTest
DurableSubscriptionOfflineTest
, Could you apply this patch to FailoverTransactionTest?  On AIX and Solaris when testFailoverCommitReplyLost is run with LevelDB it will hang.
, Patch applied., Also: QueueMasterSlaveSingleUrlTest
, And AMQ2580Test
, Found a thread safety issue in the leveldb imp.  Should now be fixed as of r1483369, Have just committed a fix for LevelDBXARecoveryBrokerTest.  The topic GC was being to agressive and was GC messages which had acks that were prepared but not committed., Added a LevelDB version of AMQ2149Test.java.  It's working now., Implemented a pure LevelDB test for the StoreQueueCursorNoDuplicateTest and fix the bug that was causing it to fail., The bug causing ThreeBrokerVirtualTopicNetwork to fail is now fixed., Most look pretty good now, QueueMasterSlaveSingleUrlTest is still hanging though. , found out what was breaking the run of QueueMasterSlaveSingleUrlTest, fixed the clean settings to remove old test stores.  Works now for me on Mac and Linux., QueueBrowsingLevelDBTest is failing because the LevelDB store isn't using the Message incrementReferenceCount and decrementReferenceCount methods as KahaDB does so first three messages get added to the cursors batch list befire the memory usage exceeds the set value.  In the KahaDB versions of the test the usage exceeds the set value on send of the third message so it's not added to the Cursor's batch list and its usage drops after the store finishes its write so we can then page in one page worth of messages after the first two messages are sent to the browser.  , current set of test are passing for me now. ]