[are the broker names unique for master and slave. If not, then you need to provide unique names to the locker via setLeaseHolderId in xml config.

If possible, could you try and make a variant of org.apache.activemq.store.jdbc.LeaseDatabaseLockerTest (from activemq-core) that demonstrates the problem you are seeing.
That test uses an embedded derby instance, but you can fire off sql to that instance to simulate whatever changes you want., Hi Gary, I attached our current activemq.xml which was active on two nodes (master/slave). As you can see the broker attribute useLocalHostBrokerName is set to true. The broker registers with its unique hostname., thanks for the config Christoph, I went ahead and built a simple unit test based on your description. It works fine. Maybe I need to add more contention, ie: more locks to try and replicate a race condition. The locker currently verifies that it succeeded in acquiring the lock by doing a lease extend immediately after, so it should be safe but there may be need for a random pause in there.
Can you peek at the test case and see if it reflects your use case and is possible modify it such that it breaks?
http://svn.apache.org/viewvc/activemq/trunk/activemq-core/src/test/java/org/apache/activemq/store/jdbc/LeaseDatabaseLockerTest.java?view=diff&r1=1401848&r2=1401849&pathrev=1401849, I can also confirm that I am having the same issue.

I have to brokers running on 2 different machines and when I kill the mysql DB, 
and it comes back online both brokers both become the master.

I also attached my activeMQ config
and here is a screen shot of the log
http://i.imgur.com/ZS4Er.jpg, looks like I was using the depreciated setDatabaseLocker when i should have been using setLocker.
, We are seeing a similar issue.  After debugging, I've found some odd behavior. 

When the LockableServiceSupport class gets a "false" back from the LeaseDatabaseBaseLocker.keepAlive() method, it calls LockableServiceSupport.stopBroker().

On line 132 of LockableServiceSupport:

LOG.info(brokerService.getBrokerName() + ", no longer able to keep the exclusive lock so giving up being a master");

This fails for me with a NullPointerException, which kills the thread, but does not stop the broker.

It turns out, there is an org.apache.activemq.broker.BrokerService variable (brokerService) that is null.  However, there is also a org.apache.activemq.xbean.XBeanBrokerService variable (brokerService) that is not null.  This is odd.

I'm guessing that I have a problem with my configuration.  I will be posting mine as well., I was never able to resolve the issue so i made the following work around
I basically have each broker query the db to get who the current Master should be (based of the brokers hostname)
compare it to its host name and check the isSlave value. if there is a discrepancy I shut the broker down and create a new one.

ActiveMQ Broker Monitor
https://gist.github.com/4040309

ActiveMQ bean definitions / configuration
https://gist.github.com/4040646

Parallel Ingestion ActiveMQ Manager
https://gist.github.com/4fc5669d41f25072d2f4

Broker Factory (see bean definition in ActiveMQ bean definitions)
https://gist.github.com/8ad9cf6ace9245c63f41, I looked at things a bit closer and realized that there is a bug that is contributing to this behavior.

org.apache.activemq.broker.LockableServiceSupport has a private BrokerService variable.  It implements BrokerServiceAware and has a method setBrokerService(...).

org.apache.activemq.store.jdbc.JDBCPersistenceAdapter (which extends from LockableServiceSupport) ALSO has a private BrokerService variable.  It ALSO implements BrokerServiceAware and has a method setBrokerService(...).  Because it extends from LockableServiceSupport, it overrides the setter and consequently, the private BrokerService variable will NEVER be set.

I think that the JDBCPersistenceAdapter class should get rid of its private BrokerService variable (and setter).  This will solve the issue that I was seeing with 2 active master brokers., the duplicate hiding brokerService variable in JDBCPersistenceAdapter was resolved by https://issues.apache.org/jira/browse/AMQ-4108 but there is still the need to tidy up the inheritance structure., hidden brokerService var removed as part of the fix for AMQ-4108, Closing this off, did the final bit of tidy up in: http://svn.apache.org/viewvc?rev=1407614&view=rev

It would be great if you could validate a 5.8-SNAPSHOT at some stage., I did some first tests with the 5.8 Release version. The lease database locker seems to work as expected now. However, it seems that it is always the last node that is available that becomes master. 
For instance:
start node1 -> node1 is master
start node2 -> node1 gives up being master; node2 becomes master
stop node1 -> node2 stays master
start node1 -> node2 gives up being master; node1 becomes master
While I am not sure if this is the intended behavior, right now I do not expect any issues with that., @st.h - that is not expected unless all of the brokers have the same name. I would be great to see a sql log of the db for the lock table as the nodes attempt to get the lock, I have configured ActiveMQ to use the hostnames. The master correctly shows up with its hostname in the DB, so that should be good. Is it possible to configure ActiveMQ to log the sql statements, or do you need the DBs log? The latter one might be a problem here., @st.h was thinking the latter. Or maybe there is a logging sql driver or wrapper. The broker does not provide this, well not the data in prepared statements which is the interesting part. For that reason, the logs from the DB is best. And the DB is common to all brokers so it should provide the interesting overlap etc., I also see the same unexpected behavior experienced by st.h.
New broker starts up will obtain the lease lock successfully every time and no slaves can keep standing.
The patch I attached may reveal the cause., Please find the query log attached. This is a simple test I have run on two Ubuntu servers VMs. It is basically starting node-h03-ap21 in console mode, which becomes master. Then I started up node-h03-ap22 in console mode, which takes over as master. node-h03-ap21 automatically quits as soon as node-h03-ap22 becomes master., The cause is that LeaseDatabaseLocker always succeed updating the broker name (the owner of the lease lock) by later lease time in contrast to the current lease owner,that means new broker will always obtain the lease lock and the previous owner has to give up the lock and becomes slave. 
, The patch works for me and you may give a try., @st.h - thanks for the slq log.
From looking at https://issues.apache.org/jira/secure/attachment/12570319/mysql.log, it looks like a configuration problem.
node-h03-ap21 is obtaining a 5s lease that it renews every 10s. So there is a s period when the lease is available to others.

It needs to obtain a 10 second lease and update it every 5 seconds. So that a second (slave) broker always sees time > now when it attempts an update as part of an acquire.

You need:
{code}
<jdbcPersistenceAdapter ... lockKeepAlivePeriod="5000">
   ..
   <locker>
     <lease-database-locker lockAcquireSleepInterval="10000"/>
   </locker>
{code}
lockAcquireSleepInterval is the lease duration, lockKeepAlivePeriod is the lease renew period. On a renew, the lease is extended by the lockAcquireSleepInterval (lease duration). So a master is always (lockAcquireSleepInterval - lockKeepAlivePeriod) ahead with its lease.
In short, ensure: lockAcquireSleepInterval > lockKeepAlivePeriod.

Can you verify this.
I think it may also makes sense to add lease related attributes to this locker. leaseDuration, leaseRenewPeriod so that it is a little more intuitive and obvious that the leaseDuration > leaseRenewPeriod
, [~gtully]st.h uploaded the query log not me.
In fact I already know that lockAcquireSleepInterval should be greater than lockKeepAlivePeriod.
Their names are not intuitive indeed, new names seem very well.
I had tested your suggested configuration before you told me, there are two problems:
1. The duplicate hiding brokerService variable in JDBCPersistenceAdapter causes the presence of multiple master brokers(solved by AMQ-4108).
2. The subsequent problem after problem 1 is that a new startup broker always succeeds in obtaining the lease lock and becomes master and the previous master unexpectedly loses the lock and terminates.No brokers can keep obtaining the lease lock all the time.
The cause is that LeaseDatabaseLocker always succeed updating the broker name (the owner of the lease lock) by later lease time in contrast to the current lease owner.
I have tested my patch and it solves the problems.
Can you review and verify it? , @SouNayi  - thanks for the feedback. on {quote}The cause is that LeaseDatabaseLocker always succeed updating the broker name (the owner of the lease lock) by later lease time in contrast to the current lease owner.{quote}

Can you make a variant of https://fisheye6.atlassian.com/viewrep/activemq/trunk/activemq-core/src/test/java/org/apache/activemq/store/jdbc/LeaseDatabaseLockerTest.java that shows the problem? I don't see a problem against derby in the unit test. Note: in the unit test there is no periodic call to keepalive.
The intent of the update to acquire a lock checks the TIME value against current time and sets it to obtain the lease. It should (and does) fail if the lease is still valid. ie: the time is set to a value in the future.https://issues.apache.org/jira/browse/AMQ-4122?page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel#, Gary, I can confirm expected behavior when applying your changes. Thanks. However, I would suggest the following changes:
- modify the documentation to show the correct configuration. currently it shows {{lockKeepAlivePeriod="10000"  lockAcquireSleepInterval="5000"}}, which has been the config I used for the tests.
- in case lockAcquireSleepInterval < lockKeepAlivePeriod, at least log a warning., @Gary,verification is passed for amq 5.8.
I misread the parameter order for the lease obtain statement so I made a wrong presumption.
Sorry for your time., thanks for closing the loop.

added LOG warning if lockKeepAlivePeriod < lockAcquireSleepInterval, I noticed that the code in the attached patch differs from the code in 5.8.  Although perhaps different in form, is this fix a part of 5.8?, For those using ServiceMix 4.5, the file "amq_dual_master_5.7_backport.patch" provides a backport for ActiveMQ 5.7. ]