[The log message is output from the public void serviceTransportException(IOException e) method of the org.apache.activemq.broker.TransportConnection class only if the stopping and the pendingStop flags have not been already set before the serviceTransportException(IOException e)  is called as seen from the following code snippet - 

        if (!stopping.get() && !pendingStop) {
            transportException.set(e);
            if (TRANSPORTLOG.isDebugEnabled()) {
                TRANSPORTLOG.debug(this + " failed: " + e, e);
            } else if (TRANSPORTLOG.isWarnEnabled() && !expected(e)) {
                TRANSPORTLOG.warn(this + " failed: " + e);   //--> This is where the WARN is written to the log.
            }
            stopAsync(e);
        }

Sequence of events - 
1. The close() method on the ActiveMQConnection sends a ShutdownInfo to the server and immediately closes the socket from the client side. 
2. The broker's TcpTransportConnection is handling this ShutdownInfo but it so happens that the Inactivity monitor also fires off a write to the closed socket and fails with an EOFException or SocketException.
3. The public void stopAsync() in the org.apache.activemq.broker.jmx.ManagedTransportConnection makes a call to unregister the MBeans and then sets the  stopping flag. The latency involved in unregistering the beans is causing the stopping flag to not be set in time, so the WARN message is caused. 

Moving the stopping flag to be set before the unregister bean call should set the stopping flag to be set and prevent the WARN message from being written to the log.

I have attached a patch a test.

Thanks., [~ganeshmurthy]  peeking at the patch - it looks like the mbeans won't get unregistered b/c the stopping flag will be flipped by the super stopAsync., Good catch Gary. Gosh, I introduced a regression. I have attached a new patch after doing some testing. I removed the if(!isStopping()) conditional. The unregister now gets called.

Please see patch AMQ-5888-GMURTHY-NEW-PATCH.TXT  , Commit 2b5b890db9810ff282479d7688c36e3c78e32c73 in activemq's branch refs/heads/master from [~gtully]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=2b5b890 ]

AMQ-5888 add patch from GMURTHY with thanks - fix and test
, fix and test applied via patch with thanks to Ganesh Murthy

https://git1-us-west.apache.org/repos/asf/activemq/repo?p=activemq.git;a=commit;h=2b5b890db9810ff282479d7688c36e3c78e32c73 ]