[This includes the following commits for 5.15.7:

ca6293b55 AMQ-7082 We should make sure that pages managed during recovery are not recovered in error variation of patch from Alan Protasio <alanprot@gmail.com> closes #317
505200b92 AMQ-7082 - fix compilation after merge
45d7676bd AMQ-7082 - Make sure that the recovery will only mark pages as free if they were created in a previous execution

 

For 5.16.0:

85859fd8d AMQ-7082 We should make sure that pages managed during recovery are not recovered in error variation of patch from Alan Protasio <alanprot@gmail.com> closes #317
81062fde8 Merge branch 'AMQ-7082'
0d3433891 AMQ-7082 - Make sure that the recovery will only mark pages as free if they were created in a previous execution

 

 

 , [~cshannon] and [~gtully], feel free to resolve this if it encompasses all of AMQ-7082 for the fixes., [~cshannon] and [~gtully], based on the impact of 5.15.8 and potential for corruption, I think it may be a good idea to get 5.15.8 out fairly quickly with this in it.  Do you guys agree?, I can do a 5.15.8 soon but maybe want to give it at least a week or so to see if anything else pops up that needs to be fixed or should go in.  AMQ-7091 could be a candidate depending on the fix..if it is very involved and ends up requiring an index upgrade then it should probably not go into 5.15.8 but only 5.16.  At some point we should start looking at doing 5.16 but that is going to require a bunch of work such as dependency upgrades and verifying JDK 11 works, etc., Yeah.. seems like a important fix...

About AMQ-7091, it will not require a index upgrade anymore...

The last proposed change will get the information from sd.ackPositions (this is already in the index file nowadays).

I can still have a copy of this data 100% in memory but i think it dont worth as we already read this information when sending messages., [~gtully] - The PageFileTest is failing for me on the 5.15.x branch but it works in master.  I'm wondering if we missed backporting something, there have been a lot of changes.

Specifically the testBackgroundWillNotMarkEaslyPagesAsFree test is not passing this assertion:
{noformat}
assertTrue("We have 10 free pages", Wait.waitFor(new Wait.Condition() {
            @Override
            public boolean isSatisified() throws Exception {
                pf2.flush();
                long freePages = pf2.getFreePageCount();
                LOG.info("free page count: " + freePages);
                return  freePages == 100100;
            }
        }, 12000000));{noformat}, [~cshannon]

 

Probably is this change:

https://github.com/apache/activemq/commit/8a1abd9bb2744de70af11053f1755116c40ec55f, Nevermind, I figured it out.  We were missing the commit for https://issues.apache.org/jira/browse/AMQ-7084, [~alanprot] - Yep, we figured it out at the same time :)  I merged it in so I can continue with the release now]