[Hi,

do you have war feature installed, like

{code}features:install war{code}

That should do the trick. See more info at

http://activemq.apache.org/osgi-integration.html#OSGiIntegration-WebConsole, Dejan,

I do have war installed. The packages in question are being exported just fine from the org.ops4j.pax.web.pax-web-runtime bundle, the problem is they aren't being imported into the activemq-web-console bundle as far as I can see. Maybe I'm missing something but that looks like the problem.

Chris, Thanks Chris, just confirmed it. I'll try to fix it soon. In the meantime you can trying using 5.5.0 console, they should be the same in functionality., Dejan,
Seems to be an issue with changes in the maven-bundle-plugin. activemq-5.6.0 is using v2.3.5 of the plugin which seems to not include the javax.servlet and javax.servlet.http packages, while the older version of the plugin, v2.1.0 which is used by the 5.5.x builds correctly populates the manifest with aforementioned packages. v2.2.0 of the plugin also works., Here's my research:

Indeed there were multiple changes in the maven-bundle-plugin to take advantage of the newer versions of the bnd tool that underlies the maven-bundle-plugin, but none of those changes were what cause this error. 

The bnd tool will not add imports for packages it sees within the bundle. To make it a short story, some transitive dependencies of the 5.6.0 activemq-core were including the servlet-api (and thus were part of the bundle) which explains why the bundle plugin wasn't adding the javax.servlet and javax.servlet.http packages.

In the activemq-web-console's pom.xml file, you see the following:

{quote}
            <Embed-Dependency>*;scope=compile|runtime</Embed-Dependency>
            <Embed-Transitive>true</Embed-Transitive>
{quote}

And if you follow the dependency tree for 

{quote}
    <dependency>
      <groupId>${project.groupId}</groupId>
      <artifactId>activemq-core</artifactId>
    </dependency>
{quote}

you'll see the two instances of the servlet spec within the transitive deps:

{quote}
mvn dependency:tree | grep servlet
{quote}

You'll see that although the geronimo servlet spec has "provided" scope, the other two (transitives from fusemq-leveldb->hadoop-core) have "compile" scope and will be included in the WEB-INF/lib directory of the bundle. Thus when bnd tries to determine whether to add the appropriate packages, it decides not to since they're already on the class path.

There are two options to fix:
1) add the javax.servlet and javax.servlet.http to the <Import-Package> instructions to the bundle plugin. This just kinda glosses over the fact that the servlet api is being included
or
2) exclude the servlet api from the activemq-core transitive dependencies.

I would suggest the second approach. I've added this patch.
Let me know if I didn't explain something clear.
Christian


Patch is attached., Thanks Christian, great work. Patch applied with svn revision 1341810. I'm not resolving this issue yet as I want to take this opportunity and create a pax-exam test for amq features (something we want to do for a long time). I'll try to get to it soon, but if any of you have time and want to do it, please do., I'll find some time. Would be an interesting exercise., Dejan, could you create a new ticket about the test, and mark this as resolved for 5.7. Its good to have this in the release notes for 5.7 as being fixed., Done. New Jira for integration testing is https://issues.apache.org/jira/browse/AMQ-4034]