[Commit 88daeec28f25266c6fce15e200ac6d2ca9d11eb6 in activemq's branch refs/heads/master from [~gtully]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=88daeec ]

AMQ-6422 - include the inflight count in the prefetch for positive remote credit flows. Fix and test
, I think this fix can be further refined by avoiding some updates to the prefetch. not done yet and maybe the tests will be sensitive to proton event production order., Commit ee271afe9041172df24b572231b394a7c6fec0ce in activemq's branch refs/heads/master from [~tabish121]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=ee271af ]

https://issues.apache.org/jira/browse/AMQ-6422

I've made a few minor test changes and added a couple more cases.  Under
heavy CPU load I'm able to get test,
testReceiveMessageAndRefillCreditBeforeAcceptOnQueue to fail on the
second receive call where it should get the second message since it
granted credit., A couple things to note here, the unsettled count and the credit on the link aren't really tied to each other at all.  The remote can keep granting credit and not settle anything if it wishes and I don't think there's test that cover that case.  Also the remote could request that all deliveries are sent settled so there'd be no movement on that counter, which I don't think is tested much here so there could be issues yet to be discovered in that area.  , Also see failures in testDispatchOrderWithPrefetchOfOne test in repeated runs with varied CPU loads., [~tabish121] I have a variant of (added in some send threads)  org.apache.activemq.transport.amqp.interop.AmqpSendReceiveTest#testReceiveMessageAndRefillCreditBeforeAcceptOnQueue that can't get past 3 iterations.
optimizeDispatch=true sorts this one case, but that is too general a solution.
, Commit 640289868e18e82b054be8aff5580d3665518f5c in activemq's branch refs/heads/master from [~tabish121]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=6402898 ]

https://issues.apache.org/jira/browse/AMQ-6422

Add test for credit grants but no settles for a single receiver., Commit 2fdc2600ac37d11d2d660654b327dddd852eeef7 in activemq's branch refs/heads/master from [~tabish121]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=2fdc260 ]

https://issues.apache.org/jira/browse/AMQ-6422

Small fix to test and check for zero inflight on successive send to
destination that should have no credit on the registered receiver., Commit da9fedead4078cc82efb32e15d8d9cd53c8e82dc in activemq's branch refs/heads/master from [~tabish121]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=da9fede ]

https://issues.apache.org/jira/browse/AMQ-6422

Adds a split consumer test that uses presettled receivers., Commit ffee8b442f57b38d57a59745b9062e8d963c65ba in activemq's branch refs/heads/master from [~gtully]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=ffee8b4 ]

https://issues.apache.org/jira/browse/AMQ-6422 - match proton sender view credit to prefetchExtension - tracking credit to dispatch delta to track additional flow requests. Proton sender layer is distinct from the transport layer - they mirror each other
, The 'logicalDeliveryCount' increment added at the end of the 'delivery' method seems off since that method is called based on disposition activity, and may either never be called for a given message (if sent pre-settled) or be called multiple times for the same message (due to multiple dispositions).

For the purposes of credit tracking, the credit is used as soon as the message is finished being handed to proton, in this case in 'pumpOutbound' when the link is advanced to complete the current delivery, or the links 'current' incomplete delivery is settled (which must advance the link to complete the delivery)., Commit 6c01b641b1850b384e57d74ad6471ea4c8fcf01f in activemq's branch refs/heads/master from [~gtully]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=6c01b64 ]

https://issues.apache.org/jira/browse/AMQ-6422 - move delivery tracking to pumpoutbound and additional test that shows how the presettle case breaks. Thanks to Robbie Gemmell for the feedback
, Thanks [~gemmellr] for the quick review. I managed to build a test that showed the problem with using delivery in the successive flow case. When drained there is a flow with credit 0 that reset in the more normal case., Commit ca11674f37cf3a67a9215f341a8e8458ce7b0641 in activemq's branch refs/heads/activemq-5.14.x from [~tabish121]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=ca11674 ]

https://issues.apache.org/jira/browse/AMQ-6422

Add test for credit grants but no settles for a single receiver.
, Commit 566e82614aa3cb31c80d44d155debe0e63cc2a3c in activemq's branch refs/heads/activemq-5.14.x from [~tabish121]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=566e826 ]

https://issues.apache.org/jira/browse/AMQ-6422

Small fix to test and check for zero inflight on successive send to
destination that should have no credit on the registered receiver.
, Commit 14c5c5276c9f6bfa360c24d4e2b875483dc43888 in activemq's branch refs/heads/activemq-5.14.x from [~tabish121]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=14c5c52 ]

https://issues.apache.org/jira/browse/AMQ-6422

Adds a split consumer test that uses presettled receivers.
, Commit ebbb7ab437b3023be5afe731a0015fec58a51d57 in activemq's branch refs/heads/activemq-5.14.x from [~gtully]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=ebbb7ab ]

https://issues.apache.org/jira/browse/AMQ-6422 - match proton sender view credit to prefetchExtension - tracking credit to dispatch delta to track additional flow requests. Proton sender layer is distinct from the transport layer - they mirror each other
]