[Creating a JUnit test to reproduce what you are seeing would be helpful, Hello,
Creating a JUnit Test is difficult as issues involves threading and interruption.
With Test Plan provided at JMeter Bugzilla you can reproduce it very easily with the described scenario, 
note it doesn't occur with OpenJMS.

Regards
Philippe, Since JMeter can't be part of the unit tests its important to capture something like this in a JUnit test so that it can be investigated and protected from future breakage., A JUnit test case demonstrating how this issue occurs under normal usage is needed in order to reproduce and investigate this issue., Hello,
As I explained it is very difficult to create a JUnit Test Case for this issue as it is related to Multi Threading and interrupt.

You shouldn't close it like this, why don't you want to try the Test Plan attached in JMeter Bugzilla ?

I will try to create a Test case (no Junit one) and descrbie the scenario to reproduce but that will take some time., Same problem in both cases, Fixed by AMQ-3547, Hello,
I tested with last 5.6 snapshot integrating the fix, issue is still here for me.

Regards
Philippe, Test case to reproduce issue, Changed test to show different errors.
, Additional fixes added for updated test case., Hello,
I confirm issue is fixed, I tested with last nightly build.

Thanks.
Regards
Philippe, Commit 0a12bcb928f151b5ace9a0cffc34ec717b6a8e9c in activemq's branch refs/heads/master from [~gtully]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=0a12bcb ]

https://issues.apache.org/jira/browse/AMQ-2191 https://issues.apache.org/jira/browse/AMQ-3529 - rework fixes to remove uncertanty from dealing with intettuptedexception. Sync requests will trap interrupts that ocurr while waiting for responses and fail the connection with an interruptedioexception. Interrupts pending before requests will be suppressed, allowing possible clean shutdown. It is not safe to replay openwire ops b/c they are not idempotent, the only safe option is to have a teardown of the broker side state from a close
]