[this is message ordering in action, it is expected behavior. The good message cannot be received till the bad message is discarded. A second consumer will see the new messages, but a good message cannot jump a bad message in the queue for a particular consumer., Ok in the case of just 1 consumer. My intention was to simplify the reproduction of the problem

It still happens with 2 consumers and this sequence (the test pattern is the same, send a message to the queue and watch in jconsole and log if it is processed and queue size):

   - 1 bad message: message stays in the queue waiting for redelivery. Queue size : 1
   - 1 good message: it is processed ok.  Queue size : 1
   - 1 good message: it is NOT processed. Queue size : 2
   - 1 good message: it is processed ok.  Queue size : 2
   - 1 good message: it is NOT processed. Queue size : 3
   - 1 good message: it is processed ok.  Queue size : 3
   - 1 good message: it is processed ok.  Queue size : 3
   - 1 good message: it is processed ok.  Queue size : 3
   ...................... 

   With 3 consumers

   - 1 bad message: message stays in the queue waiting for redelivery. Queue size : 1
   - 1 good message: it is processed ok.  Queue size : 1
   - 1 good message: it is processed ok.  Queue size : 1
   - 1 good message: it is NOT processed. Queue size : 2
   - 1 good message: it is processed ok.  Queue size : 2
   - 1 good message: it is processed ok.  Queue size : 2
   - 1 good message: it is NOT processed. Queue size : 3
   - 1 good message: it is processed ok.  Queue size : 3
   - 1 good message: it is processed ok.  Queue size : 3
   - 1 good message: it is processed ok.  Queue size : 3
   

   This seems odd to me, first because not all messages got stucked in the queue and every new message after queue size reaches 3 messages is processed inmediatly.

   I'm going to install ActiveMQ in a production system in a few days and I am worried about the fact of messages being stucked in the queue for minutes because of redeliveries.
, This is working as designed for a transacted consumer.]