[2.11 is the latest version in maven central :

[http://mvnrepository.com/artifact/org.apache.activemq.protobuf/activemq-protobuf]

Yet this CVE has been open for three yrs ?

 , JBoss AMQ is not ActiveMQ.  You seem to be confusing the products. AMQ is based on ActiveMQ but is not the same thing and a CVE reported against AMQ does not necessarily mean it is also valid for ActiveMQ.  Hawt.io is not part of ActiveMQ.  

For the fileserver portion, that was reported by us and released some time ago and already removed so there is nothing to do.

Furthermore, please stop posting suspected security issues on a public forum (in this case Jira).  This is not the appropriate place.  Please follow these instructions for any future issues: [https://www.apache.org/security/committers.html], Yeah but....  Russia China France, Israel, common crimminals can all freely download all open-source projects...have and continue to 24x7, edit the pom file to include OWASP dependency check and in 15 minutes know what vulnerabilities are in the projects.  Google for proof-of-concept exploits to a CVE and in another 15 minutes have a missile.   

Is it better to :
 # shine the light of day on vulnerabilities to increase the urgency of fixing ?
 # send an email that gets ignored and nothing ever happens ? " Messages that do not relate to the reporting or managing of an undisclosed security vulnerability in Apache software are ignored and no further action is required."
 # or Have all apache projects add OWASP Depencency check into the pom ahead of time and run the report weekly to weed out vulnerabilities as part of the normal process, like what Apache Camel project now does ?

I vote for #3.   but until that is universal, #1 "shaming" is much more of an incentive than #2 which is where we have been for 20 yrs and everything is still broken.   sorry to rant...Thanks for fighting the good fight ,but I been at this for 30 yrs...im done wasting time.  Talk to Claus Ibsen, then push this call out to everyone in all Apache projects., Regardless of your feelings about how security issues should be handled the Apache software foundation has a process in place to report vulnerabilities.  If you have been in this business for 30 years then you should understand that it's not appropriate to discuss vulnerabilities in a public forum regardless of how easy you think they are to discover. 

If you do not like Apache's policy then feel free to bring it up with the security team for discussion but as a PMC member of this project it is my responsibility to please ask you to follow the security process and not bypass by posting on a public forum., Christian :   I appreciate your position and stance, but fact of "Apache"s security reporting policy has proven to be ineffecive countless times(name any breach in last 20yrs, leveraged known, unpatched vulnerabilities).   Apache security reporting tiage teams  end up dealing with many many issues and, too often, try to /oo quickly find reasons to ignore real issues.   Central teams are over-burdened. This cycle peretuates vulnerabilities that exist for years.  A much more pro-active policy on Apaches' part has already /proven/ to be extremly effective in the Camel project.  This policy to inculde OWASP Dependency check in every nightly build must become the standard. This /distributes/ the load to all team members, which is a /much/ more scalable solution.  Fact-of, in any given build in the last few years, there are /zero/ outstanding known vulnerabilities in Camel.  This is the standard the world is now demanding. Will Apache be a furture force for good by proactivly eliminating vulberabilites in all its projects or continue to pave the road for bad actors to exploit, breach, and subvert all commercial systems going forward ?  You decide !  Please include OWASP Dependency check in all Apache projects, and refuse the excuse not to do it because there are occasional false positives. The net benefit is overwealming positive., I agree with the dependency check, I don't see any reason not to include the OWASP check in both the ActiveMQ 5.x builds and our Artemis builds and to run it periodically stay on top of things.  I think the Versions maven plugin is also useful just to know when any dependency has been updated.  There are so many dependencies that it is too difficult to stay on top of all the updates manually., Hi Albert,

May I suggest that you create a Jira with for OWASP plugin and provide a patch?  It seems that you have tried this and that contribution would be great.  Based on CLS' response, I would think that we could get that in the project rather quickly.  In the time it took you to write up your response, it likely could have been included. :), I would /love/ to contribute but am bound by a highly restrictive non-compete contract that bars me from contributing to even open-source projects.  I am in skating-the-line by simply helping point out issues., I could....create Jira issues in all apache projects to help kick start that process though.... :), Creating a Jira is a great start! :), Done for AMQ.   Will add more for other Java Apache projects this week-end.   Thank you very much for your help., Rethinking...adding OWASP DC to too many projects to fast will slam MITRE CVE DB with alot of traffic.  I sent MITRE an email informing them of my intent, asking them to plan to scale up thier infrastucture to handle the upcoming load increase.  Promised to only create 5 Jira tickets/week.  promise to work with them to slow down if they need it.  Ill focus on commonly used components, then security related ones, then data ingest/formatting/transformation/serialization/, etc.]