[It doesn't look like Springs SPEL works with ActiveMQ's schema.  There is probably some work that would need to be done here to enable it., If you could point me at where this would integrate into the code for ActiveMQ's schema I'd be happy to take a look to see if it was something I could contribute., The activemq-spring sub project is where the spring stuff lives.  [xbean-spring|http://geronimo.apache.org/xbean/] is used to generate the schema from the java classes.  This might be something that needs to be fixed in the schema generated by xbean-spring, not sure.  I think the problem is that it isn't even passing schema validation to get to the part where the expression can be evaluated because during validation it errors trying to convert the expression to an integer.  So it might be that the schema would need to be fixed to relax validation., I think you are correct.

Further investigation shows that it doesn't even work with simple property placeholders e.g

{code:xml}
<amq:timedSubscriptionRecoveryPolicy recoverDuration="${my.value}" />
{code}

giving the same validation exception.

I see that for the "persistent" attribute on "amq:broker" the type is "xs:string" and these is a custom BooleanEditor. In this case a placeholder can be used but SPEL doesn't seem to work.

Is a similar solution viable? Even if SPEL couldn't be supported using placeholders would be useful. However, would you need to change the schema type for every property you want to set via a placeholder?, From what I can tell, I think the only way this will ever work is if every property that needs to support replacement is changed to type xs:string so it passes validation and can be replaced.  As you pointed out, in the case of the persistent attribute it works because it passes schema validation and gives Spring a chance to replace the property.  I'm not sure why SPEL didn't work in that case but in theory it should be at least possible to make it work since the schema will validate.  (I would need to dig into it to figure out why it's not being evaluated and if a code change is necessary)

So for now, I think the best that could be done is any property that needs support for placeholders would need to be annotated with a PropertyEditor that takes a String and then converts it to the type that is necessary, that way the schema generated specifies a string value and allows the chance for the property placeholder to replace the value before evaluation.  There are several boolean properties that are already annotated that way in the BrokerService., For my immediate needs I'm creating the PolicyMap using Spring Java-based configuration. , That works as well and it is what I typically do. At some point it may be nice to have a Java DSL for this but it's also relatively straight forward to create a Broker using pure Java (as most unit tests already do) and by using Spring's java config. ]