[Same issue on Windows Server 2008 R2, when attempting to run ActiveMQ as a service.

ActiveMQ will start at the command prompt using _activemq.bat_, but not when running as a service, the result is the same error as above.

The only way I can get it to start as a service is to comment out the Jetty section at the bottom of _activemq.conf_. (However, you will loose access to the web console).

Eg. Replace

    *<import resource="jetty.xml"/>*

with

    *<!-- <import resource="jetty.xml"/> -->*

So the issue is most definitely somewhere within jetty., I had this same problem on Windows Server 2008 when running as a service. It seems to be related to a problem in determing or creating the temp folder that Jetty needs. The "work" folder is one of the locations that Jetty looks for, so I resolved this problem by creating a "work" folder here:

{amq-home}/bin/win32

, Pardon the naive question, but how did you set the 'work' folder for Jetty to look for?, Just create a work folder under win32.
   {amq-home}/bin/win32/work
and 
   {amq-home}/bin/win32/temp

I created a temp folder too, not sure if it really needed., Great!  What a simple fix.  I just added 'work' and the service starts successfully.  Thanks so much., Same with ActiveMQ *5.5.0* on Win 2008 R2 / 64 bits running with a Win 32 jvm .... 
, A better way to solve this problem is to set the TMP environment variable to point to a temporary folder. To do that in the install script add _TMP variable and pass it on the command line.

set _TMP="set.TMP=<temp folder>" 

"%ACTIVEMQ_HOME%\bin\win32\wrapper.exe" -i %_WRAPPER_CONF% %_ACTIVEMQ_HOME% %_ACTIVEMQ_BASE% %_JAVA_HOME% %_TMP%

or in the wrapper conf add set.default.TMP=<tmp folder>

That solves the problem without polluting the activemq installation folder. , i think you will eventually find, like i did, that when starting the service as the local admin account the temp directory that it is looking for is located here .. C:\Windows\System32\config\systemprofile\AppData\Local\Temp and when this directory does not exist it refuses to create it by itself... so just add a line to your start script if you do things that way, or add it to the install service script to make sure that that directory is created

as soon as you have created that directory things are then perfectly fine, This is an issue of the script not being able to find or access the temp dir, you need to ensure that its properly configured and accessibe for the logged in user., I agree that the bug has been resolved with the comments above, but I don't agree that it's simply a user-configuration problem.

* The distribution should include a \work folder (Paddy's suggestion)
* Or the wrapper should set the TMP folder according to %TEMP% (Rajesh's suggestion)
* Or the documentation should note that you have to explicitly perform this step.   ("enure that it's properly configured")

If you don't do one of the above, the wrapper will refuse to run.

So I think there needs to be some sort of action (ie, one of the steps above)
]