[GitHub user bastijns-jeroen opened a pull request:

    https://github.com/apache/activemq/pull/189

    AMQ-6317

    

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/bastijns-jeroen/activemq AMQ-6317

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/activemq/pull/189.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #189
    
----
commit be38782c221223def47db79b020218054441c225
Author: Jeroen Bastijns <jeroen.bastijns@aca-it.be>
Date:   2016-06-09T09:09:18Z

    AMQ-6317: Use an SQL Statement for each createSchemaStatement

----
, this is a good patch. thanks.
One quick change. I think you can replace the new dependency on uk.org.lidalia... with the DefaultTestAppender. It is not as neat, but it does work fine and is already used in many tests.
See some example usage at: https://github.com/apache/activemq/blob/e2b4ca2c59a316be91cf391c758a10e518dd3a1f/activemq-unit-tests/src/test/java/org/apache/activemq/usage/StoreUsageLimitsTest.java#L55

final picky thing - the formatting on the new code seems different, maybe there are tabs in the mix of something. Just follow what is there so that there are no formatting changes.
, Fixed the formatting.

When I use the DefaultTestAppender I have to add a dependency on activemq-unit-tests test-jar which introduces a cyclic dependency between activemq-unit-tests and activemq-jdbc-store.
Any idea's?, darn, that  util should be back in the broker module, like socketProxy etc.
I did an update to move that so that you can pull in the broker test-jar dependency: <artifactId>activemq-broker</artifactId><type>test-jar</type> into jdbc.

https://git-wip-us.apache.org/repos/asf?p=activemq.git;a=commit;h=f548aafa81fdb53b5c273bd15705a3d0fe2ef0e2, I pointed my pull request to the 5.12.x branch. Your fix is on the master branch. [~gtully] can you cherry pick it?, There are no planned release from the 5.12.x branch so no reason to try and merge fixes back there at this time.  All work should target master.  , Github user bastijns-jeroen closed the pull request at:

    https://github.com/apache/activemq/pull/189
, [~tabish121] made a new pull request to master: https://github.com/apache/activemq/pull/190
Jenkins check failed due to issues with git..., Looks like the patch still uses the uk.org.lidalia instead of the DefaultTestAppender as Gary has pointed out previously. , Maybe you are looking at the first pull request, I declined that one. In the new pull request (https://github.com/apache/activemq/pull/190) I use the DefaultTestAppender., I see, I missed it in the new one because the commits aren't squashed, please squash them into one commit, thanks., Squashed :), Great, thanks much, will try and review it as soon as time permits., Any news?, Commit 03a211ec061d9ed49dc1ac16f171d8f4458483b8 in activemq's branch refs/heads/master from [~JBastijns]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=03a211e ]

AMQ-6317: Use an SQL Statement for each createSchemaStatement
closes #190
, fix applied, thanks for the contribution :-)]