[Please try to create a unit test to demonstrate your issue., My test code that verifies the problem is written in php. I am not a  java developer. I do not have the ability to create a JMS unit test. Do you want a tar file of php? It's a very simple test. Use a language binding other than java JMS and send a message.  Perhaps NMS? The "timestamp" header is added. If a timestamp existed, it is still changed. This is the essence of the bug., Yea, not sure why we forcedly overwrite the user defined timestamp when its present, will look into this., Fixed on trunk, Issue not resolved. The code change fixed the issue where a stomp "timestamp" header was overwritten. However, the TimeStampPlugin does not work as expected. I sent a message to a queue to test the plugin. The message was not delivered to the queue; i.e. probably delivered to the DLQ. Details:

Expected Result: The message should be sitting in the queue. There were no consumers. The TimeStampPlugin was enabled. Although the message timestamp and expire UTCs where 1 day in the past, the plugin should have used the difference between the expires and timestamp UTCs to rewrite a new expires and timestamp using the Activemq server local time. The rewrite did not occur.

Activemq Server Time: 2013-05-07 20:27:51,995
Message timestamp header: 2013-05-06T20:27:51-07:00 (1 day earlier than Activemq time)
Message expire header: 2013-05-06T22:27:51-07:00 (2 hours ahead of timestamp, still less than Activemq UTC time)
Using activemq binary snapshot: apache-activemq-5.9-20130507.083009-49-bin.tar.gz

Here is the stomp.log:

2013-05-07 20:27:51,995 [127.0.0.1:43950] TRACE StompIO                        - Received:
SEND
b_expires:2013-05-06T22:27:51-07:00
JMSTimestamp:1367897271000
destination:/queue/trinity.test_send
b_timestamp:2013-05-06T20:27:51-07:00
timestamp:1367897271000
expires:1367904471000
json:1
content-length:2
b_ct:50

50, If you feel there's an issue the way to help is to create a unit test to reproduce your case, Downgrade until a test case is provided., Seems to be working as expected.  If you can provide a test that shows something wrong please do. , Steps to reproduce the problem:

1) Enable TimeStampPlugin
2) Send a message to a topic with the timestamp header set to -1 day earlier and the expire header set to -1 day + 10 minutes using the STOMP protocol. JMS will not work.
4) Use the http://<>:8161/admin interface to see that the message is not present, or use active-admin browse to verify the message is not located in the topic.

Further details of how the timestampplugin should work can be found here: http://tmielke.blogspot.com/2011/01/sync-your-machine-clocks.html . Timestampplugin does not work as expected in this article with the STOMP protocol.
, You need to come up with a unit test that demonstrates the problem.  The attached test case should provide you with everything you need.  , What exactly do I do with the *.java file? How do I run/install it?, Test added to activemq-stomp StompTimeStampingBrokerPluginTest which does what was described in this issue, two messages sent with timestamp set for previous day, and a set expiration.  One message received, then wait for the set expiration time and observe that the second message is no longer on the Queue. ]