[We are also getting same error with maxinactivityduration = 3000. For our application nature we need to monitor the consumers so not possible to set maxinactivityduration = 0. Any specific reason for this exception? How to solve this exception? 
 
2012-07-05 12:11:16,399 [$Worker@1535a58] INFO  Transport                      - Transport failed: org.apache.activemq.transport.InactivityIOException: Channel was inactive for too (>3000) long: /127.0.0.1:34829
2012-07-05 12:11:16,405 [$Worker@1535a58] INFO  Transport                      - Transport failed: org.apache.activemq.transport.InactivityIOException: Channel was inactive for too (>3000) long: /127.0.0.1:34830
2012-07-05 14:35:00,457 [127.0.0.1:45777] INFO  Transport                      - Transport failed: java.io.EOFException
2012-07-05 15:06:20,315 [6.252.110:58999] INFO  Transport                      - Transport failed: java.net.SocketException: Connection reset, can you attach your activemq.xml
note that the values for inactivity are negotiated. The min of the values from the each end of the transport are used. So the min of the values from the connectionfactory tcp url and the broker transport connector url, As requested, have attached activemq.xml. 

Note: In the connectionfactory we set both inactivity and keepalive as below

ActiveMQConnectionFactory factory = new ActiveMQConnectionFactory(url+ "?keepAlive=true&wireFormat.maxInactivityDuration=3000");, the exception indicates that there was no activity on the transport for >3000 or >30000 milliseconds. Which is indicative of a client side abort that has not yet filtered through as a socket close/timeout on the broker.

Can you again restate what you want to achieve or what you think the issue or bug is?  , Thank you for your quick response.

I understand the nature of this exception and need help to fix this exception. I am new to AMQ and how to filter socket timeout on the broker?

We are using inactivity to generate advisory if the client is crashed so we can not set inactivity to 0. 

, The logs seem to indicate that the broker side is working as expected.  The thing to do here is to evaluate what's going on with your clients.  Are they aborting without disconnecting?  We can't really help you here without additional information on the client side of this. , Thanks for your response. After we disabled the flow control on the broker seems to be working fine. ]