[I apologize for the duplicate posts, JIRA seems to be acting up (hang for a long while then showed the new issue form as not submitted)., Update: I followed up on my original direction of investigation, and found out that both dosgi and an app custom feature had included the osgi compendium bundle as a dependency, and the latter even had osgi core specified in it. Manually removing the three bundle references from the features xml files in karaf/system folder before first launching Karaf seems to resolve the issue. While there is now a usable workaround, there are still a few open questions which hopefully someone can answer:

1. Should these bundles be referenced in the custom feature? It is created by karaf-maven-plugin (3.0.0-SNAPSHOT) with includeTransitiveDependency set to true for offline deployment. In the poms that define them as dependencies they have scope set to 'provided'. Should such provided bundles be included in a feature definition or not? Is this a bug? It's good for completeness and documenting the real dependencies, but it also seems to break things here. Perhaps features should support some form of 'provided' attribute for dependencies?

2. Is Karaf supposed to do anything about such provided dependencies, or just ignore them since they are already provided? Is this a bug?

3. How exactly do these bundle references cause ActiveMQ to fail?

4. Why does ActiveMQ fail silently and not show an error anywhere?

5. What can be improved in order to either protect against such occurrences (if they are to be flagged as invalid) or make it clearer where the problem lies for future instances of this error (this might happen with features other than ActiveMQ)?

Any further insights would be appreciated :-)
, Darn, I spoke too soon.

While ActiveMQ and my app run properly after this fix, dosgi does not (missing remoteadmin stuff from the compendium). So if the compendium gets installed dosgi works and ActiveMQ fails, and if it is not installed it's the other way around.

So still no good :-/
, Let me review it.

I fixed an issue on activemq-osgi (about LevelDB JNI import, on 5.9-SNAPSHOT). Let me do a complete test case., This issue still occurs after the JNI fix has been applied - they are unrelated., Another update:

1. The web console is not a good indication of whether the broker is started or not, due to AMQ-4794. Search the karaf log for 'Starting broker amq-broker' or similar instead.
2. As for the provided-scope questions above, I found KARAF-1972 which covers part of it.
3. A working workaround is to replace osgi compendium 4.3.1 bundle in dosgi feature with osg enterprise 4.2.0 bundle (there is no enterprise 4.3.1 - relevant packages should be the same).

I don't know yet if it's illegal for dosgi to have the osgi compendium bundle installed, or if it's perfectly ok and it's ActiveMQ that doesn't deal with it properly - not sure where the underlying problem lies exactly. But the workaround is a step forward.
, DOSGi was updated with a new bundle that exports(+imports) only the necessary osgi apis out of the compendium. However I then started hitting another issue, whose investigation may also be related: AMQ-4850., Needs review now that Karaf is being updated to version 4.]