[There were some fixes in this area w.r.t to duplicate network connection detection. One of the prerequisites is that the brokerId be specified for the broker to ensure it is maintained after a restart. The broker id and networkConnector name(if there is more than one duplex network connector configured (for 5.5) are use to identify duplicate network connectors and pull down old sate that can be pending with a temp network partition or fast restart.
Can you validate a 5.5-SNAPSHOT? But first, try setting a brokerId, use the same value as your brokerName. , Gary, thanks for response. Unfortunatelly, I have the same result with brokerId and with 5.5-SNAPSHOT either. BTW, it's pretty strange but 5.5-SNAPSHOT doesn't work without slf4j-log4j12-1.5.11, slf4j-api-1.5.11. Are they both required now? 5.4.2 works fine without them., Tried with 5.5.0 final in our test lab and we're having the same behavior.

Is there any fix?, Did you try adding broker.setBrokerId(...unique_id_per_broker...)?  How about nc.setName(...unique_nc_id...)?

For example
{code}
    private static void publisher() throws Exception {
        System.out.println("Starting publisher ...");
        BrokerService broker = new BrokerService();
        broker.setBrokerName("local");

        broker.setBrokerId("publisherEmbeddedBrokerId");

        broker.setUseJmx(true);
        broker.setPersistent(true);
        NetworkConnector nc = broker.addNetworkConnector("static:(failover:(tcp://localhost:61616))");
        nc.setDuplex(true);
        nc.setNetworkTTL(4);

        nc.setName("publisherConnToNw");
{code}, @Andreas - use static:(failover:(tcp://localhost:61616)?maxReconnectAttempts=1) or no failover at all in the network connector.
A networkConnector does its own reconnection/recreation in the event of a failure. The failover transport hides the failure and does not properly reconstitute the duplex state. failover: with a network connector is really only beneficial to make a choice between two urls., @Arthur Yes, I tried both - didn't work, as far as I remember.

@Gary @Andreas I've tried without failover. It works so far. Though I think it's not obvious that failover can not be used in the network connector. This still can be considered as a buggy behavior I suppose., This should be resolved by the changes in AMQ-3542]