[The API on receive is
http://docs.oracle.com/javaee/6/api/javax/jms/MessageConsumer.html#receive(long)

Throws:
JMSException - if the JMS provider fails to receive the next message due to some internal error.

Though you can argue that if the consumer is closed is that an internal error? And should a runtime exception be thrown for other kind of exceptions?

Nevertheless we got a critical issue as camel-jms / spring jms / cannot shutdown reliably due changes in ActiveMQ., We can help on this problem in camel-jms to detect CamelContext is being stopped and more quickly disallow the spring message listener container to run, and therefore for it to not try to refresh and re-create the connection which will cause activemq-client to throw that exception -> a NPE exception inside spring-jms in a final method we cannot change., Logged a ticket to improve shutdown quicker on the camel-jms side
https://issues.apache.org/jira/browse/CAMEL-7667, Ah re-read the java doc api, and it clearly states that we should return null if the consumer is closed

Returns:
the next message produced for this message consumer, or null if this message consumer is concurrently closed
, Attached is a patch I got started with. There is also a chance that in the dequeue method we got closed and should return null IMHO. I found that from a stacktrace error I got while testing., Lowered to major as current behavior has been like this from the very start. Though we should get this fixed so AMQ is aligned with the JMS spec.

[~dejanb] you said you wanted to take a look. I have attached a patch with some fixes. There could be similar issues in other JMS APIs, such as the Session / Connection etc too., Not sure it is really wrong for the client code to throw the javax.jms.IllegalStateException which is what it currently does as the definition of that exception is "This exception is thrown when a method is invoked at an illegal or inappropriate time" and it is an extension of JMSException so any catch handler expecting JMSException would work.  So in the cases where it is throwing that exception type it is probably ok.

As far as the receive calls go I'm not sure it must always return null or only when the receive has entered a blocking mode as the API states that it returns null when the consumer is "concurrently" closed which you could read as meaning that it throws an exception if called "after" the consumer has been closed.  , The spec clarified in JMS 1.1 that a pending receive should return null when the consumer is closed. i.e when receive was called and then the close occurs, but it does not say that should happen if you call receive after the close occurs.

An IllegalStateException getting thrown when receive() is called after the consumer closed is consistent among 5 different JMS clients I have either worked on or looked at the source of. Upon checking, it is in fact a poorly documented requirement of the spec itself, since JMS 1.01:
{quote}
"The IllegalStateException has been noted as a required exception for several
more error conditions. they are acknowledging a message received from a
closed session; attempting to call the recover method of a transacted session;
attempting to call any method of a closed connection, session, consumer or
producer (with the exception of the close method itself); attempting to set a
connection’s client identifier at the wrong time or when it has been
administratively configured."
{quote}, From review of the spec the current behaviour matches the spec so I don't think we should change it since we want to follow the specification defined behaviour.  I've added some tests to validate that we do indeed throw or return null in the cases defined by the spec.  ]