[I found another scenario, but have not had time to discover whether it is due to problem in ConduitBridge or not.  But, it seems likely:

+++++++++++++++++++++++++++
Start Broker A

Start Publisher, connecting to Broker A, publishing FOO

Start Broker B

Start Consumer, connecting to Broker B, consuming FOO (needs to use failover on connect url, but just connect to Broker B)

kill-9 Broker B

Restart Broker B

Consumer no longer gets FOO
+++++++++++++++++++++++++++++++++

This problem happens regardless of whether the patched ConduitBridge code is used. , Any reason why "clearDownSubscriptions" in DemandForwardingBridgeSupport is uncoded?  Or perhaps overridden in ConduitBridge?

I've coded an override method in ConduitBridge and this seems to take care of the issue.

Maybe you coded it once, but some test cases failed?, Hi Kevin,

not sure I understood the last comment ? :) - clearDownSubscriptions in DemandForwardingBridgeSupport clears the subscription maps - do you do something different ?, Rob,

The code for clearDownSubscriptions in DemandForwardingBridgeSupport.java is not present (empty method) in 4.0.1.  Perhaps you are looking at 4.0.2 or 4.1?  I haven't downloaded those versions yet., I'll attach a patch file for DemandForwardingBridgeSupport.java which is baselined on the 4.0.1 version.  It includes the logging changes from my other call, which you've already applied to 4.0.2.

When I was analyzing the problem, it looked to me like there was more to the problem than just clearing out the subscription maps (which is what the 4.0.2 code does).  It needed to forward the subscription removal to the broker, which is why my patch calls removeSubscription, which forwards the removal to the broker code, but also removes the entry from the local subscription map.  It did not make any difference whether I cleared the remote subscription map, so that step is not in the patch (but could be for cleanliness).

I've downloaded the current 4.0.2 snapshot, and applied this change (replacing the 4.0.2 version of clearDownSubscriptions).  However, the problem still persists in 4.0.2.  So, given other changes in 4.0.2, the change is not compatible - which is bad.

The first patch for this call, ConduitBridge.patch, is applicable to 4.0.2., This issue looks like it's still not resolved., Hiram,

I have been very busy with some other items around here, so I've not worked on this for about a month.  I'm planning on downloading the recent 4.0.2 and looking there again.  But, also, it looks like 4.1 is pretty active?  I'll download that and test this scenario there as well., Hiram,

With help from Holger Bruch on AMQ-961, this issue I think can be resolved.  For AMQ 4.0.2, apply the ConduitBridge patch, which fixes the first part of this issue.  Apply Holger's patch from AMQ-961 to DemandForwardingBridgeSupport.  That fixes the issue from AMQ-961, but also the second part of this issue.
, patch applied for associated issue: http://issues.apache.org/activemq/browse/AMQ-961]