[BTW there is a local and remote broker config in XML here which creates a demand forwarding bridge...

https://svn.apache.org/repos/asf/incubator/activemq/trunk/activemq-core/src/test/resources/org/apache/activemq/network/

e.g. 

https://svn.apache.org/repos/asf/incubator/activemq/trunk/activemq-core/src/test/resources/org/apache/activemq/network/localBroker.xml, BTW DemandForwardingBridge has a bean property "dispatchAsync" if you need to change that?, Yes, I need to be able to set some properties, including dispatchAsync, for DemandForwardingBridge.  However, the link you give above configures a NetworkConnection, not a DemandForwardingBridge.  Am I missing something??
, Its a bit confusing isn't it :)

So the NetworkConnector creates the DemandForwardingBridge; so you should be able to configure the it with the things you need like

 <networkConnector dispatchAsync="true">

etc

(BTW true is the default in NetworkConnector.java)

There are a few different kinds of bridges available depending on the configurations of the <networkConnector>. For added fun, the NetworkConnector class just got refactored; so the concrete class that actually creates the bridge is DiscoveryNetworkConnector - see the createBridge() method for details of how it figures out which bridge to use.

For demand forwarding I think you need to set <networkConnector conduitSubscriptions="false" ..., BTW I tried applying your patch and got a number of failures

    [junit] [ERROR] TEST org.apache.activemq.broker.policy.RoundRobinDispatchPolicyTest FAILED                                                                                                                                               
    [junit] [ERROR] TEST org.apache.activemq.broker.policy.SimpleDispatchPolicyTest FAILED                                                                                                                                                   

so we need to think a bit more before applyting this one; maybe the change has to be localised to only VMTransports created via the network connectors, Thanks, James.  My test system is experiencing problems at the moment, so I hope I can soon try out the settings as you describe.

Thanks for trying out the change.  I only tried within my own usage patterns, and all seemed fine.  I will eagerly await the official change :-), James,

The config settings on networkConnector works famously, as of the 3/17/2006 SNAPSHOT (it did not work against 3/15/2006 SNAPSHOT).

So, just need the official change for the TaskRunnerFactory so that dispatchAsync between brokers actually takes place., Fancy taking a stab at this one? Was wondering if we should pass along the task factory always, but then allow each transport to decide if its gonna use async dispatch using a flag?, patch committed., I'll try this on my end tomorrow after the SNAPSHOT build.]