[Update:
The AMQ Webconsole works well in case of karaf 4.0.8 + AMQ 5.14.4. karaf 4.0.8 is using Jetty 9.2.19.v20160908 and Pax Web 4.3.0., I just tested with pax web 6.0.3-SNAPSHOT to see if the issue is related to pax-web. It remains the same. So this issue should be purely in activemq. Maybe it is just some additonal missing tag libs. , I found that the root of the ActiveMQ webconsole jsp issues is that the jspf/headertags.jspf is not prepended when running on karaf 4.1.0.

I created a sample bundle in pax web to reproduce the issue. The issue happens with the sample bundle in karaf too. Interestingly though I can not reproduce the issue in a pax web itest. There it simply works. So the issue must be related either to the deployment of pax web in karaf or karaf itself.

To provide a quick fix I commit a workaround in activemq by simply including the jspf into each jsp., Commit f651aa361f8d8428c94420d1f5713c70ed0baf07 in activemq's branch refs/heads/master from [~chris@die-schneider.net]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=f651aa3 ]

[AMQ-6620] Workaround until the actual issue is fixed in karaf
, Commit dea1accb9882b2db45000da93f2506d07bd15089 in activemq's branch refs/heads/activemq-5.14.x from [~chris@die-schneider.net]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=dea1acc ]

[AMQ-6620] Workaround until the actual issue is fixed in karaf
, Commit 04b60cb188932a91be9f59d6cda09290219d8a45 in activemq's branch refs/heads/master from [~cshannon]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=04b60cb ]

AMQ-6664 - Adding missing header tag to JSP files

Also fixing JSP comments.  This fix is a follow on to
AMQ-6620
, Commit 908ef647289a80a6fec500a6d37dd59059dccfbd in activemq's branch refs/heads/activemq-5.14.x from [~cshannon]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=908ef64 ]

AMQ-6664 - Adding missing header tag to JSP files

Also fixing JSP comments.  This fix is a follow on to
AMQ-6620

(cherry picked from commit 04b60cb188932a91be9f59d6cda09290219d8a45)
, [~chris@die-schneider.net], is this issue finished?, Yes .. This issue is finished but I can not resolve it. Probably not in the permission group for it., [~chris@die-schneider.net] - I just gave you permissions that you should have already had as you are a committer.  You should be able to resolve it now so give it a shot.]