[what is your use case here? it is normal for an xa connection to be used with an xa transaction, that is what xa_rdonly is about. Not sure why the check was added in the first place but it has been around for quite a while and is a good indication of intent, as in, it helps determine whether an XA connection factory is being used as desired when it is configured with a transaction manager. I am slow to drop it without out good reason., The use case is that when the JMS client calls createConnection on the connection factory handle, an XA tx may have been started or may not have been.  The RA has no way of knowing this.  Therefore, we configure the RA to always use XAConnectionFactory.  This way, if a tx was started, the XA capabilities of the connection will be used, and if not, they won't, but it should work in either case.

Without this change, I get an Exception when trying to use the AMQXAConnFactory/AMQXAConn when a tx has not been started.  I've had to make this change to make our RA work with AMQ.  Other JMS engines (such as JBoss) don't have this restriction.  Nor do the JMS and JCA specify anywhere that if XA objects are used, a tx MUST be started., So what's the verdict?  Can we get this change into 5.4.0 so I can use AMQ with our RA and not have to patch the source on my end?, to speed up the process, it would help if there were a few unit tests that demonstrated the required behavior and don't break anything else. I think message receipt will be problematic as an XASession is always transacted w.r.t acks and without a transaction there will be no ack.

btw: I think the change to getTransacted() will help with https://issues.apache.org/activemq/browse/AMQ-2712 which is good., Isn't an ack sent at the end of ActiveMQSession.run() irrespective of whether there is a tx in progress or not?  line 885 in 5.3.1: asyncSendPacket(ack).  In fact, ActiveMQXASession doesn't override this so it will always execute the code in ActiveMQSession which surely can run without a tx.

I will work on a junit test shortly..., yea, in the run() case it is. The issue is for other regular users of jms who swap in an XA connection factory for a regular connection factory and use an XASession as a regular session without a transaction, currently they will get an exception but with the proposed changes they will not and they are into undefined behavior.
The point being that this change has implications beyond the RA use case. A variant of the org.apache.activemq.JMSConsumerTest with an XA connection factory will demonstrate the problems that the current exception is trying to avoid. From a normal JMS user perspective, Session and XASession are not the same.

Maybe the way out of this is again through configuration, making the check for an active XA transaction optional, so it can be disabled for power users.
, I still don't understand why using XASession without a tx is "undefined behavior".  No, they are not the same.  XASession has additional functionality but should still work as a regular session in the absence of tx. After all, XASession extends Session so even by the API an XASession can be treated as a regular Session.  In fact, the JMS client will always get a regular Session to work with.  However, the RA may instantiate an XASession behind the scenes.

If we make this change and modify JMSConsumerTest to use XASession, what problem are you expecting to occur?

, Ok, so I modified JMSConsumerTest to use XASession (attached).  I did initially see some problems and now understand what you were talking about.  However, I was able to get rid of the problem and make the tests pass by including the following method in ActiveMQXASession: \\ \\
{noformat}
    public boolean isAutoAcknowledge() {
       return true;
    }
{noformat}

I think this makes sense since for an XASession transactions are controlled outside of the session and so as far as the session is concerned it is always AUTO_ACKNOWLEDGE.

This would take care of your concerns, no?

P.S.  There are 4 failures in the test but I think those are because the tests don't make sense any more with the transactions not controlled by the session.  Sorry, I don't have more time right now to look into it further., Hi Gary,

Did you have a chance to run the attached test and check the additional proposed change?  Does it satisfy your concerns?  Can these changes be adopted?  I think in this case it is better to make it work for all use cases as opposed to going the config route., will try and find some time for this before the 5.4 release, changes implemented in r983057
thanks for the test case etc., Revisiting this, I now think the change needs to be configurable.

I came across a use case with an XASession and consumer.receive(timeout) where the XA transaction rolls back before the timeout and where the subsequent received message gets auto acked in error, effectively loosing a message. Before this change, the doStartTransaction would throw and the receive would fail.

Because the lifecycle of the transaction is independent of the consumer and session, having the session work without a transaction will leave the potential for holes in transacted work. It should not be enabled by default.

 

In addition, XASession.getTransacted() should always return true  as per the [javadoc|https://docs.oracle.com/javaee/5/api/javax/jms/XASession.html#getTransacted()], not sure why that was missed 6years ago.

I will rework the changes to allow the use of an xasession outside of a transaction once there is an explicit request to use a non transacted ack mode via setXaAckMode.

By default, work outside an xa transaction will throw an error as it should., Commit 004be56127e7e949c8ffff8c36435ea0f27d32d4 in activemq's branch refs/heads/master from gtully
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=004be56 ]

AMQ-2659 - make configurable based on xaAckMode, otherwise pure xa case can default to autoack in error. Additional tests
, To use a non transacted ack mode in XASessions, it now needs to be explicitly enabled via the xaAckMode accessor. Either through the brokerURI or via the setter.
{code:java}
ActiveMQXAConnectionFactory activeMQXAConnectionFactory = new ActiveMQXAConnectionFactory("vm://localhost?jms.xaAckMode=1");

// or
activeMQXAConnectionFactory.setXaAckMode(Session.AUTO_ACKNOWLEDGE);{code}, [~gtully] - it looks like your latest commit broke this test: [https://builds.apache.org/view/A/view/ActiveMQ/job/ActiveMQ-Java8/lastBuild/org.apache.activemq$activemq-karaf-itest/testReport/org.apache.activemq.karaf.itest/ActiveMQBrokerNdCamelFeatureTest/test/]

Do we need to configure something different now with camel for XA or is this a regression?, Commit 18543080a04b3612708464eb32e9975a8eb974f6 in activemq's branch refs/heads/master from gtully
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=1854308 ]

AMQ-2659 - fix camel route config to reflect revised behaviour
, [~cshannon] thanks for the heads up, apologies. yes - the config for that non transacted route with an xa connection factory needed to be updated after this change. sorted now., [~gtully] - no problem thanks for fixing that, I was just verifying this morning all the tests work as I am about to do a 5.15.5 release and noticed that the Camel test had broke in Jenkins]