[After creating the Bug Report, I can upload a file. Here is the example Eclipse Project, It's not clear what the problem you think you are seeing is, the broker config looks ok but your project doesn't open in eclipse and seems to be setup to run on windows so I can't do much with it.  I'd recommend trying to clarify the issue and ask again on the user list, Jira is not he place for questions.  , Seems to be configuration of the project that causes an issue., I ask in Forums, and they say that is not a configuration Problem. I configure nothing to create a new KahaDB in a different Folder. I have posted a link to the Problem and Forum. So you can read all steps what I had done.

I open my Project without Problems in Eclipse on Ubuntu 14.04.

You need to install the "Maven Developer Tools" and the "m2e connector for the Maven Dependeny Plugin". This both you can install on 
Window / Preferences / Maven / Discovery / Open Catalog. There are both Packages.

The Problem is also on Linux. And when it is a configuration Problem, where it is? Please help me to find out where it is. What is wrong? I do all, how it is written in the Documentation.

Thank you, I didn't look at the test project yet but I looked a little bit at the logic for getting the broker name for that directory.  One thing I noticed is that there's some logic in the BrokerService to grab the local host name and to use that for the broker name if a certain flag is set, although normally it just uses what was set in the xml.  It's possible that the method call InetAddress.getLocalHost() is returning 127.0.0.1 for you instead of localhost and that's causing this problem.  

Is there an entry in your /etc/hosts file for localhost 127.0.0.1? , Yes, there are entries for 127.0.0.1 in /etc/hosts
But this is wrong, the folder name should be the broker name, or the folder which is configured:

<broker id="broker" brokerName="SOMENAME" dataDirectory="activemq-data">
this should create activemq-data/SOMENAME/KahaDB/

Or a persistenceAdapter say the directory
<persistenceAdapter>
	<kahaDB directory="activemq-data/SOMETHING/KahaDB" journalMaxFileLength="100mb" cleanupInterval="5000"/>
</persistenceAdapter>

In both cases it never should be activemq-data/127.0.0.1/KahaDB

, The Problem is also in Active MQ 5.14.1. 
Is there a chance that this Bug is solved?]