[Attached activemq.log.  The service had been up for months with no issues, so this is a daily rotated log, hardly anything in there until the world comes crashing down when the disk filled up., I have the KahaDB directory tar.gz'd but it's 32Mb and won't fit here, any preference on how to get it to you?, please attach your xml config.

the broker should exit. the ioexceptionhandler controls that.
kahadb needs to have checksum enabled so that it can detect journal corruption.
also you can configure pre allocation to force an earlier error.
the disk usage limits are also relevant., As [~gtully] pointed out, look into using disk usage limits.  In version 5.12.0 and later the broker can be configured to periodically check the disk usage and to shrink the space available if something else external uses up the space.  See AMQ-5393 and http://activemq.apache.org/periodically-checking-disk-limits.html

, For posterity, attaching the activemq.xml we use.

Since we are (currently) pre 5.12, the options you mention are not available, 

We wouldn't want to have ActiveMQ try to reduce it's disk usage as the disk fills up, because based on our experience it will just reduce to 0, and then become unresponsive still.  So we're looking to define an effective minimum/maximum disk space usage as the same, and claim the space.  We have calculated a disk space size that should hold up to 0.5 days worth of production scale messages to be stored to allow for a reasonable period of consumer down time and to allow flexibility in an incident response.

but just to make sure I get this right when we do the upgrade, is this what we should do (based on the above attached activemq.xml)?

* enable 'checkForCorruptJournalFiles'
* set the 'preallocationStrategy' - though with what, the documentation at http://activemq.apache.org/kahadb.html  are the only valid options ['sparse_file', 'zeros', 'os_kernel_copy']   I would have chosen 'zeros' here just to be sure (we're running Oracle Linux 6.x )

Is there any other suggestions to maximize uptime in this regards?

thanks heaps for the response., fyi https://issues.apache.org/jira/browse/AMQ-6084 in 5.13.1 may also be relevant, Configuration in new broker releases exists to work around the presented problems.  ]