[I was reviewing this report and I found the problem that generates this exception. 

In the particular case shown here, when commiting a transaction the broker will attempt to commit messages received by the subscriber created before the transaction. 
{code}
SUBSCRIBE
activemq.prefetchSize:1
ack:client
destination:/queue/COMMAND.HOST.alex
activemq.exclusive:true
{code}
Since there are no messages there to be commited it fails when doing a lookup on the message subscription linked list. 

Stomp transactions are based only on the transaction ID. The sample here assumes that the transaction is tied to the destination which is not the case. In this case the destination parameter passed in the BEGIN and COMMIT statements is simply ignored by the stomp transport. They are not part of the protocol specification AFAIK. Since mixing multiple transacted and non-transacted destinations within the same stomp connection will cause problems I added a simple check that will warn the user about this issue.  , Hi,

Many thanks for the patch, I'll try to test as soon as it gets comitted or i find the time to build amq myself, whichever comes first :)

Sending destination in BEGIN frame was an error, I have since corrected that.

However I'm intrigued by your statement that "Mixing multiple transacted and non-transacted destinations within the same stomp connection will cause problems"

Can you elaborate on this? What is a "transacted destination" if, as you said, transactions are not dependent on the destinations?

What kind of problems can I expect? Can you point me to some documentation? I thought that, like in SQL, i can BEGIN, send MESSAGEs and then either COMMIT or ABORT and all the messages in between will either be sent or discarded.

Many thanks for your insights., Hi,

The patch that I'm suggesting is a simple check on the code to try to avoid this situation since in my opinion without a more fine grained definition of transactions with Stomp would be required.

Let me try to explain this a bit better. 
The particular problem with the snippet of stomp code that you attached to this report is that it first subscribes to destination "/queue/COMMAND.HOST.alex" and then you tries to send transacted messages to "/queue/COMMANDREPLY.HOST.alex".  Since stomp transactions are bound only by the transactionID the logic in the code needs to check *all* destinations used in a connection for messages to commit. In this case the exception happens because there is nothing to be commited at "/queue/COMMAND.HOST.alex".

The bottom line is that since BEGIN doesn't take a destination as a parameter there is no way to identify for which destination you are starting a transaction and that's the reason why all destinations for the current connection have to be checked for messages to be commited.

My recommendation is that if you use transactions, don't use more than one destination per connection. This way you avoid the confusion of which destination the transaction is actually supposed to be for.

Hope that this clarifies some of your questions., 
Just to confirm that I have split the sending and receiving part of my client into separate connections and that appears to have "fixed" the problem.

I still don't see anything both in the STOMP spec and common sense that would be against mixing transacted and non-transacted statements in one connection, so IMO this is a bug in AMQ STOMP, not in my usage (if we don't count sending a destination in BEGIN frame which is clearly an error)., Fixed in SVN revision 801916, by checking if the subscriber has some messages in the tx, before sending ack. Please check it out by building the current trunk (or trying the next nightly build).]