[The deletion of temp destinations before close cause a problem when there are active consumers. The broker will remove the consumers but will not fire advisories for their removal because the destination is already gone.
The broker side will remove the temp destinations so it is not necessary in the normal case. Only for a pooled connection, where the connection is not closed broker side. The pool ensures that sessions are closed so removing temps is fine in that case., This may be the root cause of the lack of advisories when connection.close is called with active consumes. Clearing out the list is sufficient for the client side memory issue. The broker handles cleanup of the temp dests broker side., fix in http://svn.apache.org/viewvc?rev=1415406&view=rev

two different problems uncovered by the two test case variants

1) order of removedest and remove sub advisory handling. serialized that
2) deleting temp dests as part of close (client side) caused dropped advisories if there were pending consumers. Left removal of temps to the broker shutdown connection processing., I like it! Nice fix., Is this a fully robust solution?  Given the impact of missing consumers on removal of a temporary destination (memory leak, leaked destinations, and leaked threads), the removal of all consumers when the temporary destination is deleted seems important to keep all the way around.

In addition, the nature of advisories includes sending destination removals and consumer removals through different destinations, and therefore different threads (dest remove on ActiveMQ.Advisory.TempQueue/TempTopic and consumer remove on ActiveMQ.Advisory.Consumer.ID...) which also leads to out-of-order processing.  In this case, the change here will have no impact.
, @Arthur - any outstanding consumers will be network bridge local forwarding consumers that will be removed when the remote destination is removed. Following the normal, respond to advisories approach.

On the threading - dispatch occurs in the sending thread and so long as only one network bridge is dealing with temp destinations, a single consumer will be dealing with all advisories in the order in which they are produced.

Feel free to provide more test cases that can demonstrate that there still is a problem., Working on the test cases.

Can you please point to the code paths for (a) the removal of consumers in the "normal, respond to advisories approach" and, (b) the dispatching in a single thread?, Art,

for (b), remove consumer (for a temp) and remove destination (for a temp) can only come from one place (the connection it originated from), ie, another connection cannot remove the temp or the consumer to the temp. When that connection makes a call to remove the consumer for the temp, the thread that handles it for that connection handles the remove in the broker and sends to the advisory topic as well as sends to the subscription for the advisory topic. Topics don't have a separate "dispatch thread" like queues do, so the ordering for this case cannot race. The same thread that handled the connection is also used in the TopicSubscription. If there were two separate connections involved with sending the remove info and remove destination, then there could be a race. 

The only other thread involved is the thread for the consumer's connection. When a topic sub dispatches to the consumer's connection it will do this by default async. So it will be put into a "worker queue" for the connection thread to finally send it over the wire. but the messages are put there by the same thread and in order for this async dispatch. 

If i've mispoken, I'm open to corrections :), Only 1 dispatch thread for all Topics?  Then what were all those leaked threads we came across as one of the consequences of this consumer leak?  We had threads for every temporary topic and for every advisory destination.

Also, what is wrong with adding the more robust solution that makes sure that no consumers ever linger after deletion of the temporary destination?  That is a nice, clean, easy-to-verify fix that should eliminate all possible causes of an issue - unless somehow a consumer gets created without attaching to the temporary destination.  I'm all for fixing the cause by serializing the operations as well, but I see 0 downside to this more robust fix.

Oh, and btw - shouldn't the DestinationInfo get copied in Gary's patch since it's being processed asynchronously, and changes to the object could lead to Null Pointer Exceptions?

Robust please.  I  need ActiveMQ to stop having so many problems., @Arthur
{quote}
Only 1 dispatch thread for all Topics? Then what were all those leaked threads we came across as one of the consequences of this consumer leak? We had threads for every temporary topic and for every advisory destination.
{quote}

Yes, that's correct. There is a thread for the topic, but it's used for dispatching messages that were set aside because of producer flow control when sent with a producer window or sent synchronous. That's the only purpose for that thread. It does not dispatch the messages in normal cases. Even in the PFC case, it will not race because the Usage#usageMutex would allow the messages waiting for space to fire first before any new messages are sent.

However, I agree to the extent that consumers to temporary destinations should be tied to the life of the temporary destination (whether a network sub or real sub). In other words, if somehow there is a consumer for a temp dest around when the temp dest is being removed, then that consumer too should be removed. 

I think Gary's patch will enforce this at the bridge level, but further assurances should be fine.


, So, the brokers guarantee ordering across more than 1 Topic?

The following can never happen - even if PFC is hit on on Topic?

- subscription S to composite ActiveMQ.Advisory.TempTopic,ActiveMQ.Advisory.Consumer.>
- message A produced to ActiveMQ.Advisory.TempTopic
- message B produced to ActiveMQ.Advisory.Consumer.ID:xyz
- message B consumed by S
- message A consumed by S

In other words, once the ActiveMQ.Advisory.TempTopic destination hits PFC, dispatches to ActiveMQ.Advisory.Consumer.ID:xyz will block as well?

This is starting to shed light on potential circumstances under which I was seeing more out-or-order processing issues., @Arthur - please build the test case. If there is need for a further fix (demonstrated by a concrete test case) we can do it.

There is no ordering guarantee (across topics) in general but for advisories, pfc is disabled, and all dispatch is async such that a send never blocks, so each sub has guaranteed ordering. The network bridges depend on this behavior., Alright.  Just keep in mind that I'm tired of providing concrete test cases for issues that aren't getting fixed.  So, I'm going to stop doing so if they don't start yielding results.

For example, I still have (> 1 year now) issues with transacted sends failing and the clients never notice.

And then there's the partner to this issue in which a request message with JMSReplyTo = temp topic sent across a network of brokers, the producer can actually start sending messages before it's broker knows of the existence of the temporary destination.

So, when I produce a concerete test case for this, I expect immediate action., I ran tests with a broker filter designed to detect out-of-order operations on temporary destinations.  It ran into a problem in which one broker in the network saw a "DELETE DESTINATION" first rather than the "CREATE DESTINATION".

Digging into that problem resulted in finding a problem resolved as a part of the changes in AMQ-3253 (copying the DestinationInfo before sending in an advisory).

After applying that fix, I'm not seeing out-of-order operations, with the exception of occassional "destination ... does not exist" errors when using a temporary destination as the JMSReplyTo address due to a race between the request message and the temp advisories.

Note that this thread has been very illuminating.  PFC doesn't really handle all of the cases I thought it would handle, and that needs careful consideration.

Lists of "what does ActiveMQ guarantee" (with a broker network and without), and "what ActiveMQ does not guarantee" would be extremely useful., that is good news. 
One thought, if you are getting a race between messages with replyTo and temp destination creation/propagation via advisories, ensure that the network bridge that propagates the target destination of the request message is also the bridge that propagates temp destinations. ]