[Hi Joe,

So are you saying that you are trying to fan out to two JMS Queues??  It seems like you are trying to deliver the message to two consumer, and if that's the case, you should be using Topics instead., Hi Hiram,

Yes, I am trying to fanout to two queues, each on two 'unrelated' brokers.
It works great on 4.1.1, but doesn't on 5.0. 

Joe

 

, Um..  I think the problem is that this was 'fixed' since 4.1
Logically it does not make sense to fanout queues since messages sent to queues should only be consumed once.  I'll add a option to the transport so that fanout on queues is also supported in the 5.0 release.  Right now fanout is only fanning out messages to Topics., Hmm, here is what the fanout transport reference page states.

"The Fanout transport layers reconnect and replication logic on top of any
of the other transports. It is used replicate commands to multiple brokers."

Perhaps I am missing it, but nowhere in the documentation does it state that
the fanout can only be used for Topics.

My apologies for not properly interpreting the purpose of the fanout and
thus not using it in a logical manner; however, we do have a need to have a
producer "replicate" a message to two completely different systems and we
want the message consumed only once on each of those systems. The two
systems are completely separate from one another (i.e., the brokers and
consumers on those systems are not interconnected).  


, Hi 

As of revision 587188 the broker will now support at fanOutQueues option the defaults to false which enables fanning out on queues too.  So to enable just update your URI to something like:

fanout://( discovery-agent )?fanOutQueues=true, It appears that the Queues versus Topics issue has been resolved, with the addition of the new fanOutQueues option. However, the problem of java.lang.IllegalStateException remains.

I am using Topics with the 10/28/07 5.0 Snapshot. I have 2 standalone brokers, each connected to a Topic consumer. I start a Topic producer that uses fanout to connect to the 2 brokers. The messages that are sent by the producer are received by each consumer (good), but after the producer closes the session, one of the the brokers throws the exception "ERROR Service      - Async error occurred: java.lang.IllegalStateException: Cannot remove a consumer that had not been registered" as Joe reported., I added a test to the FanoutTransportBrokerTest for that and I cannot reproduce it.  Please let us know if this is still an issue for you, or we could close it with a could not reproduce.  Adding a unit test will also help a lot.

One other (quite important) thing I noticed is that the initial description mentioned that the feature did work in 4.1.1 so I assume that had to be topics not queues and Gary tested with topics too.  I don't know how much sense would make to implement fan-out for queues as topics should be used in such a case.  Could you please give more details why fan-out would be needed for queues?, partial fix helps and IllegalStateException cannot be reproduced. To progress further if necessary, a unit test would be required., I'm using activeMQ 5.2.0 and I get this exact issue. I'll attach a test that causes it on my machine as well as the output from that test
, Here are the aforementioned test and test output files., I should also point out that while that test doesn't have the 'fanOutQueues=true' option explicitly specified, I get the same output when using that option as well., Fixed with svn revision 947757]