[think this is resolved on trunk.
Can you try out the current 5.3-SNAPSHOT?, I'll absolutely try that but could you tell me what's happening ?, Confirming the snapshot doesn't fix this. It still happens after 5 million of messages., can you post your actiivemq.xml and any test code - or an entire test case, this will help reproduce?, Sure, check the files.

Note that ever since upgrading to 5.3 Snapshot, it's happening more frequent whenever it reaches 2m messages., My assumption on this problem may be because of the resize hash bin problem. Every time this happens I check the AMQ log and found no error but the resizing logs:

Resize hash bins queue-data_queue#3a#2f#2fipbonus from 1024 to 2048

Can you point me to where I can find additional log if there is ?, resizing the index persistent hash does lock the store and can take some time. To prevent a resize at run time you can configure the initial size of the hash bins using the "indexBinSize" attribute  of the kaha persistence adapter.

You may also want to consider the kahaDB store in the 5.3 snapshot which has more consistent enqueue rate profile. An example configuration can be found at http://svn.apache.org/viewvc/activemq/trunk/assembly/src/sample-conf/activemq-scalability.xml?view=markup, I'm load testing with the new config of indexBinSize and see how it goes. Anyway, I'm running AMQ5.3 Snapshot but it's still saying " ActiveMQ 5.2.0 JMS Message Broker (localhost) is starting". Is that normal ?, Nothing works so far, every changes I made still result the same problem at 4m messages.

On restarting AMQ I notice:

INFO  KahaStore                      - Kaha Store using data directory /usr/local/gtweb/activemq/data/kr-store/state
INFO  AMQPersistenceAdapter          - Active data files: []
WARN  AMQPersistenceAdapter          - The ReferenceStore is not valid - recovering ...
INFO  KahaStore                      - Kaha Store successfully deleted data directory /usr/local/gtweb/activemq/data/kr-store/data


Is that something we should look at ?

I'm getting tired of this because it's like being middle of nowhere., Thought it would be good to update with you that I switched to use kahaPersistenceAdapter and the enqueued and dequeued messages are 6,5m now. Consider that's a big different with usual 2m-3m.

I'll keep you posted., Appears to be fixed, reopen if still experiencing issues., reopen to set fix version to 5.6, closing again with correct fix version]