[Debugging this and reproduced with a breakpoint in the presumed erroneous code.  It seems to be the getText() method of the ActiveMQTextMessage is returning null and the convertMessage of the LegacyFrameTranslator is trying to getBytes() of the null text.

Still looking further into this., I have a similar problem. I use the PHP Stomp librart from Fuse. A PHP process is listening to a topic where a dozen of Java JMS clients are posting. Every now a then the process just stops receiving messages from just that topic (it hears other queues). Even adding a reconnect every hour didn't help., This is a result of a null message being sent from a JMS producer.  To stop this from crashing you would need a null check in getText() of the ActiveMQTextMessage object.  Not sure if the fix should throw some exception or if it should put in 0 bytes,  my first thought is the latter., Thats another issue with ActiveMQ I have that sometimes text messages loose their body when going between remote jms clients and the local php process (besides memory leaks and other issues). I'm switching to nio transports today. May be in some bizarre way this will help., I have this issue with 5.4.1.  I got it within a few minutes of starting up the broker.  I did not have this issue in the ~6month that 5.3.1 was up with the same setup., Not test case provided to test the issue.  Fixes since 5.4.0 might have resolved this, should test using 5.5.0 and reopen if problem persists., I've just encountered this problem on ActiveMQ 5.5.1.

Stack trace:
Exception in thread "ActiveMQ Connection Dispatcher: /127.0.0.1:51148" java.lang.NullPointerException
        at org.apache.activemq.transport.stomp.LegacyFrameTranslator.convertMessage(LegacyFrameTranslator.java:90)
        at org.apache.activemq.transport.stomp.ProtocolConverter.convertMessage(ProtocolConverter.java:614)
        at org.apache.activemq.transport.stomp.StompSubscription.onMessageDispatch(StompSubscription.java:93)
        at org.apache.activemq.transport.stomp.ProtocolConverter.onActiveMQCommand(ProtocolConverter.java:596)
        at org.apache.activemq.transport.stomp.StompTransportFilter.oneway(StompTransportFilter.java:58)
        at org.apache.activemq.transport.MutexTransport.oneway(MutexTransport.java:40)
        at org.apache.activemq.broker.TransportConnection.dispatch(TransportConnection.java:1270)
        at org.apache.activemq.broker.TransportConnection.processDispatch(TransportConnection.java:815)
        at org.apache.activemq.broker.TransportConnection.iterate(TransportConnection.java:851)
        at org.apache.activemq.thread.DedicatedTaskRunner.runTask(DedicatedTaskRunner.java:104)
        at org.apache.activemq.thread.DedicatedTaskRunner$1.run(DedicatedTaskRunner.java:42)
]