[To use xbean to load an xml configuration, the spring dependencies need to be included in the RAR. spring-core and spring-context

The classloader used by the BrokerXBeanContext needs to provide access to the contents of the RAR. 
Setting the thread context class loader for the thread that starts the broker to the classoader that loads the ResourceAdapter makes this happen for weblogic 10 and works also on Jboss 5.

The default xml configuration file from the root of the RAR may not be sufficient. It is reasonable to update this config and leave it in the RAR or change the value of the BrokerXmlConfig property in the META-INF/ra.xml to point to an external location.

It is possible to use the weblogic console to deploy a plan.xml and contained/generated weblogic-ra.xml that will overide the BrokerXmlConfig to allow an external config file to be generated, without modifying the RAR at all.

{code}<?xml version='1.0' encoding='UTF-8'?>
<weblogic-connector xmlns="http://www.bea.com/ns/weblogic/weblogic-connector" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.bea.com/ns/weblogic/weblogic-connector http://www.bea.com/ns/weblogic/weblogic-connector/1.0/weblogic-connector.xsd">
  <native-libdir></native-libdir>
  <jndi-name>ActiveMQ</jndi-name>
  <enable-access-outside-app>false</enable-access-outside-app>
  <enable-global-access-to-classes>false</enable-global-access-to-classes>
  <security></security>
  <properties>
    <property>
      <name>BrokerXmlConfig</name>
      <value>xbean:file:///tmp/broker-config.xml</value>
    </property>
  </properties>
  <admin-objects>
....
{code}, r766053
verified on jboss5 and weblogic10
Added log4j.properties to the rar so that info/errors appear on weblogic console now that log4j is configured for the RAR.
Reduced the complexity of the embedded broker-config and suppressed the use of shutdownHook as the RAR classes are not available to the shutdown handler. ActiveMQ is terminated by the RAR lifecycle just fine., It would be great if you could update the [JBoss integration page|http://activemq.apache.org/integrating-apache-activemq-with-jboss.html] and the [Weblogic integration page|http://activemq.apache.org/weblogic-integration.html] with these details. , don't forget to include spring-beans-x.x.x.jar (jboss integration)
, Sorry, the documentation is still out of date,with JBOSS 5.1.0 and ActiveMQ 5.3 it does not work in any combination:

I've tried different path combinations in ra.xml descriptor:
<config-property-value>xbean:file:///broker-config.xml</config-property-value>

creating symlinks, copies of this file etc etc... spring libraries are in server/default/deploy/activemq-ra.rar directory
broker-config.xml is also located there... no chance, it can not start ActiveMQ Broker in any combination. But what's really interesting: If I put any Camel config in broker-config.xml - it starts Camel ant makes several attempts to reach ActiveMQ Server... unsucessfully., actually wit the following config you do not need to use xbean:file if your config is directly under RA directory:
Jboss 5.1.0 + ActiveMQ 5.3 + Camel 2.0 + Spring 2.5

params from  /META-INF/ra.xml (ActiveMQ Resource Adapter)
<config-property>
            <config-property-name>BrokerXmlConfig</config-property-name>
            <config-property-type>java.lang.String</config-property-type>
            <config-property-value>xbean:broker-config.xml</config-property-value>
</config-property> 


you just need to add xmlns to your broker definition (broker-config.xml file), in another case it will not start:

<broker xmlns="http://activemq.apache.org/schema/core" useJmx="true" useShutdownHook="false" id="broker" name="bruce.broker"> 

that's it.]