[Can you elaborate on this, can't really see what the issue is as Message's without an expiration are not expected to be removed until they are consumed., Thank you for the clarification. I have read all of the ActiveMQ documentation and was not clear what the default is supposed to be. Perhaps this issue should be changed to a documentation feature request? Here is how ActiveMQ 5.8 currently works:

1) When a producer sends a message to a topic using stomp and a consumer is not present, the message is silently discarded. The web console shows an increase in the enqueue count. The dequeue count is not used and is always 0. This occurs when an expires header is set to 0 and also when an expires header is not present.

2) When a producer sends a message to a queue using stomp and a consumer is not present, the message is added to the queue. The web console shows an increase in the enqueue count. The message will never expire. This occurs when an expires header is set to 0 and also when an expires header is not present.

Additional Comments:

1) I would expect topic and queue destinations to have the same defaults with respect to how messages are removed. Since the documentation does not state otherwise, it is not intuitive to think they would be different.

2) The default for queues seems to be a problem. When a producer sends many messages to a queue periodically and no consumer is present, ActiveMQ's disk space/memory pool could be depleted. This default requires intervention/maintenance. One improperly written application written by a novice developer could bring down the entire messaging server. I would like the default for queue's to match the default for topics. In other words, messages sent to queues with no consumers are silently discarded. This is how DBUS works too.

3) Messages with an expiration cause problems when the producer's clock is not synchronized with the ActiveMQ server.

4) Perhaps a feature could be enabled to support an expires header with -1. -1 means the message will expire when consumers are not present.


, You need to do some additional research on the different between a Topic and Queue.  This behavior is as expected, Queues are fundamentally different beasts from Topics.

See: http://activemq.apache.org/how-does-a-queue-compare-to-a-topic.html

Messages are held in the Queue regardless of there being an active subscription.  If you need the Queue to drain over time when there are no consumers then a TTL value is required., Working as expected. , Thanks for the link on Topics vs Queues.

ActiveMQ does not support TTL with Stomp., ActiveMQ does support TTL with stomp after AMQ-4468 was resolved.]