[Source project as a tar.gz, Unfortunately the compiled jar with all included deps is over the 10mb limit, so I can't include.

execute:
- *{{mvn clean compile}}* to get *target/5.4.1-deadlock-jar-with-dependencies.jar*

The attached source code is for 5.4.1 broker.

The same issue exists in 5.3.2 (when setting the setTmpDataDirectory on the BrokerService object, the reason I'm not supplied the test code for this is due the different implementations returned from the broker.getTempStore() - PListStore (5.4.1) and Store (5.3.12))

Let me know if you need 5.3.2. Unit test code, I can zip up this also, but 5.4.1 is probably the more useful to you.

cheers
/dom, Adding 3 potential patches. 

- Have run against the unit test provided.
- Have run against the 5.4.1 src (*{{mvn test}}*)


However, I'm not 100% sure these patches are good, reason being is that in Queue.java I've stopped the *{{checkUsage()}}* in doMessageSend(..).  Which is encroaching on ProducerFlowControl, so concerns me a little.  Anyways, I'll attach for you to look at.

/dom, attaching diffs., Hi,

I've recently come back to this and noticed that the patch contained a bug in the Queue.java where the commented out *{{//checkUsage(context, message);}}* should have been replaced with the follow; otherwise the percentageUsage on the persistence store wasn't calculated meaning that *{{<storeUsage limit=}}* wasn't being applied:
{noformat}
		if (message.isPersistent()) {
			checkUsage(context, message);
		} else if (messages.getSystemUsage() != null) {
			systemUsage.getTempUsage().isFull();
		}
{noformat}

Also, the patch I provided was accidently coded against 5.4.1 of fuse's distribution.  So sorry about that.

----

I've recently re-run the deadlock test against 5.5 release and the dead lock still occurs.  What I think I'll do is open another a jira against 5.5 directly;
so that I can look soley at providing a patch for the 5.5 apache activemq version.


Big Apologies
/dom
, This issue is duplicated by AMQ-3530]