[I have two brokers A & B.

I have attached both activemq config file, my jms provider configuration in camel and the log that comes from servicemix.

Whenever I send a request from camel into a queue in brokerA, which a consumer in brokerB is listening to, the request never gets to the consumer, instead it goes into DLQ.retailpay.

It appends DLQ to the queue because somewhere in my activemq config file, I ad specify this:

	<destinationPolicy xmlns="http://activemq.apache.org/schema/core">
	    <policyMap>
		<policyEntries>
		    <policyEntry queue=">" producerFlowControl="true" memoryLimit="20mb">
			<deadLetterStrategy>
			  <individualDeadLetterStrategy queuePrefix="DLQ." useQueueForQueueMessages="true" />
			</deadLetterStrategy>
		    </policyEntry>
		    <policyEntry topic=">" producerFlowControl="true" memoryLimit="20mb">
		    </policyEntry>
		</policyEntries>
	    </policyMap>
	</destinationPolicy>
	
Its quite strange, because when I insert message into brokerA's queue from activemq web console, the consumer listening for the message on the queue in brokerB gets the message and samething when I sent the message from "ant producer -Durl=tcp://broker1:61616 -Dtopic=false -Dsubject=myqueue -Ddurable=true -Dmax=1", Lekan, you will need to come up with a test case. I had a cursory look at the two broker configs, both use the same brokerName which is not advisable and both include duplex network connectors, because both have network connectors configured they don't need to be duplex. Not sure if any of that is the root cause though.
The odd think is that in the servicemix log, some component is connecting to a broker with name testESB which does not seem to be related to either config. It uses the vm://localhost url and can only find a broker with name testESB, where does that broker come from?

One plan of attack may be to try and reproduce with just camel and activemq, leaving service mix out of the equation to see if the issue can be isolated., Without a test case there's little else we can do here.  ]