[Was originally raised as CAMEL-9857., This is a basically a duplicate of AMQ-6230.  Work is needed to upgrade ActiveMQ to drop Spring DM., Ralf can you try installing camel-spring first before activemq. That module is now optional and not installed by default anymore as it brings in Spring 3.x JARs because of spring-dm., [~davsclaus], explicitely installing camel-spring before installing activemq-camel unfortunately makes no difference:

{noformat}
karaf@root()> feature:repo-add activemq 5.13.2
Adding feature url mvn:org.apache.activemq/activemq-karaf/5.13.2/xml/features
karaf@root()> feature:repo-add camel 2.17.0
Adding feature url mvn:org.apache.camel.karaf/apache-camel/2.17.0/xml/features
karaf@root()> feature:install camel-spring
karaf@root()> feature:install activemq-camel
karaf@root()> bundle:list | grep -i activemq
 76 | Active  |  80 | 5.13.2  | activemq-camel
 77 | Failure |  80 | 5.13.2  | activemq-osgi
karaf@root()> bundle:list | grep -i camel
 52 | Active  |  80 | 2.17.0  | camel-catalog
 53 | Active  |  80 | 2.17.0  | camel-commands-core
 54 | Active  |  80 | 2.17.0  | camel-core
 55 | Active  |  80 | 2.17.0  | camel-spring
 56 | Active  |  80 | 2.17.0  | camel-karaf-commands
 76 | Active  |  80 | 5.13.2  | activemq-camel
 78 | Active  |  80 | 2.17.0  | camel-blueprint
 79 | Active  |  80 | 2.17.0  | camel-jms
karaf@root()>
{noformat}

Installing activemq-camel actually does install camel-spring as a feature dependency:

{noformat}
karaf@root()> feature:repo-add activemq 5.13.2
Adding feature url mvn:org.apache.activemq/activemq-karaf/5.13.2/xml/features
karaf@root()> feature:repo-add camel 2.17.0
Adding feature url mvn:org.apache.camel.karaf/apache-camel/2.17.0/xml/features
karaf@root()> feature:install activemq-camel
karaf@root()> bundle:list | grep -i activemq
 52 | Active  |  80 | 5.13.2  | activemq-camel
 53 | Failure |  80 | 5.13.2  | activemq-osgi
karaf@root()> bundle:list | grep -i camel
 52 | Active  |  80 | 5.13.2  | activemq-camel
 54 | Active  |  80 | 2.17.0  | camel-blueprint
 55 | Active  |  80 | 2.17.0  | camel-catalog
 56 | Active  |  80 | 2.17.0  | camel-commands-core
 57 | Active  |  80 | 2.17.0  | camel-core
 58 | Active  |  80 | 2.17.0  | camel-jms
 59 | Active  |  80 | 2.17.0  | camel-spring
 60 | Active  |  80 | 2.17.0  | camel-karaf-commands
karaf@root()>
{noformat} , Is there any ETA for this issue? Or is there a known workaround?
As far as I can tell the issue prevents upgrading to Camel >= 2.17.0 if ActiveMQ is in use and the runtime is Karaf., Hi Ralf,

I believe that to resolve this, the AMQ guys will have to remove their dependency on spring-dm (which is in some ways incompatible with Spring 4.0 and higher). You could try my patch for AMQ-6301 and see if that solves the problem. However, I'm not sure that embedding spring-dm will fix compatibility with Camel 2.17 since it relies on Spring 4.1... I've only tested that patch with Camel 2.15 and 2.16 with Spring 4.0.

https://github.com/apache/activemq/pull/187

Please let me know if you have success with my patch! Thanks., This has been resolved in AMQ-6301 for Camel 2.16.x.  Camel 2.17 is still broken because of the spring 4.x dependency.

The plan is to drop spring DM completely and have full spring 4.x compatibility soon but that will require Camel 2.18., [~soleger], [~cshannon], thank you for your input! Going with Camel 2.18 is OK for me, as long as there is a way forward., Following up on Ralf's comment. Anyone working on this? quite a major component for automated integration testing. Anyone know a work around? I'm on camel 2.1.8.2 still got this issue, Hi [~cjruffy], have you tried upgrading to ActiveMQ 5.14? I recently upgraded our infrastructure to use ActiveMQ 5.14 (which included my fixes for AMQ-6301) and it was compatible inside Karaf 4.0.8 with Camel 2.18 and 2.19.

Also, you may need to look at what version of Karaf you are using, there were some major changes to the way that features are resolved and installed even within the point releases for 4.0. You might try 4.0.6 and higher if you can., Closing this out as this should be working now based off of the work done in AMQ-6301 and AMQ-6597]