[The problem seems to be located in the NetworkChannel class.  The statusChanged() method is call for the releaseRemote() which in turn calls for a stop() on the channel object.  In this case it is the ReliableTransportChannel, which effectively disables it for recovery purposes.

There have been major changes to the NetworkChannel class in the past few weeks.  I hope some can jump in here and provide some guidance., Okay, this one seems to be beyond anything I can personally address. Changes for issue AMQ-287 attempted to fix problems with missing messages, but caused the problem with unable to reconnect.  I suspect that just backing that change out would be to simplistic.  I will have to leave it to someone with better understanding protocol of networked brokers.  , Hi Dennis, could you please attach the steps to reproduce the problem?

Using rev 401, I successfully performed this test:
1- Run broker 1 (port 61616)
2- Run broker 2 (port 61617)
3- Stop broker 1
4- Start broker 1
5- ant consumer -Durl=tcp://localhost:61616
6- ant producer -Durl=tcp://localhost:61617

This test works fine, ie produced messages are successfully consumed.
, Sorry, never was able to get things setup to run tests via ant, but I can understand that the test you defined would work.  Here is the

1) broker 1 started (waits for connection to broker 2)
2) broker 2 started (broker 2 creates network channel broker 1, broker 1 creates network channel to broker 2)
3) broker 1 stopped (broker 2 network channel remoteConnection is now close)
4) broker 1 started (broker 1 creates network channel to broker 2)

Since broker 1 has created a network channel with broker 2, broker 2 can forward messages to clients attached to broker 1.  However the reverse is not true since broker 2 never reestablishes the network connectin with broker 1.

If you were to reverse you  consunmer / producer relationship, the test would fail

, Should be fixed in SVN HEAD.  Removed calls to releaseRemote() on channel disconnect.  Also added fix to handle channel reconnects - looks like a broker restart was always problematic before the consumer has had a chance to establish a networkBridge.

Steps to test the fix:
1- Start broker1 (port 61616)
2- Start broker2 (port 61617)
3- Restart broker1
4- ant consumer -Durl=tcp://localhost:61617
5- ant producer -Durl=tcp://localhost:61616]