[I am attaching activemq.xml file with this., If you can provide some test cases that show how you are using the broker when the db.data file grows it would help to diagnose this., We are using activemq pool connection library in our client application.Is there any document that explain about how and when the db.data file will be cleared. I will try to make a test case and generate the same issue. , @Krishnadasan T S, perhaps the following link may be of interest to you http://activemq.apache.org/why-do-kahadb-log-files-remain-after-cleanup.html.
, in my case db-*.log are cleaned as normal. There is no pending  .log files(there will be always one file) in kahadb folder. But db-*.data file is getting larger and it is never cleaned up. in the above given link it is saying about db-*.log write. But it is not telling about how and when db.data file getting cleared. Can i get some guidance or document about that.  , there is no explicit cleanup of db.data, it holds the binary tree index, the expectation is that it will reach a maximum when the maximum depth of a queue is reached or the max number of destinations are created. 
The only solution may be a periodic rebuild of the index through a stop,delete db.data, restart cycle.
Does your use case require unlimited numbers of destinations or durable consumers or just really large queue depths?, Hi,

thanks for a quick reply

We are using fixed number of queues.  Is it applicable to topics also. In the case of topics there is such a scenario like we are creating a topic for each login by appending login id and a newly created session key. so this will be different for each login for a same client. This is not queue but topic. Is this can create the above issue. One thing is that previous topics created for a client will not be used again, so will it be automatically deleted from the binary tree index or I need to explicitly delete it. How to delete topic, i could not see api for delete in jms spec. 

Although now this system is not that large, we really want to scale number of clients. We have a working system, which has nearly 30000 clients base perday, which uses proprietory technologies like Tibco Rendezvous Messaging system,Oracle DB etc. Our goal of this application, which uses open source technologies (activemq, mysql, jboss etc) is to replace that big system with in a 1 year of target. So your support in solving such issues will be very helpful to me.   , Hi,

As per documentation it is said that "The metadata store contains the complete broker metadata, consisting mainly of a B-tree index giving the message locations in the data logs". So if the previous data logs files are cleared then this B-tree node corresponding to that file also will be cleared write. So in that case these B-tree will be shrinking and growing  periodically. I don't know i am write or wrong. In my case there is only current working data-*.log file (only one file)  there, previous files are cleared.

 So can i conclude that the cause for growing db.data is because of the strategy of topic creation logic mentioned in the previous post.

 , To get the unused topics cleaned up, see: http://activemq.apache.org/delete-inactive-destinations.html

Note: that the index file(db.data) will not shrink, but should stabilize one the maximum is reached. The db.data file is a collection of data pages that can get reused once they are free, but unused destinations will need to be deleted if they are created at runtime., Thanks for your reply.

I am going to change the run time creation logic of destination. Then will monitor the db.data size. thanks for your valuable suggestions. , downgraded to major - let us know if this is now resolved in your environment :), No feedback on resolution using newer version, assuming that its fixed., As per my previous reply we have made changes to our application, It will go to production with in a month then only i can give the status. Thanks for your reply.
]