[This is a test case for the error. , Analyzing the problem further it seems that the proxy consumer cannot be found once the remote consumer closes. Though the close event is propagated, it is not processed. 
The following diff addresses the problem. It seems, that the consumer id is being changed once the proxy consumer is created both for queues and topics. This makes sense
in case of topics and durable subscribers as those must survive when the consumer disconnects. For queues that does not make sense as a durable subscriber is not needed 
to trigger a desired persistence mechanism. For these reasons the class DurableConduitBridge has been modified according to the following diff:

++++ Snip 

Index: src/main/java/org/apache/activemq/network/DurableConduitBridge.java
===================================================================
--- src/main/java/org/apache/activemq/network/DurableConduitBridge.java	(revision 745834)
+++ src/main/java/org/apache/activemq/network/DurableConduitBridge.java	(working copy)
@@ -82,17 +82,11 @@
         }
         //add our original id to ourselves
         info.addNetworkConsumerId(info.getConsumerId());
-        // not matched so create a new one
-        // but first, if it's durable - changed set the
-        // ConsumerId here - so it won't be removed if the
-        // durable subscriber goes away on the other end
-        if (info.isDurable() || (info.getDestination().isQueue() && !info.getDestination().isTemporary())) {  
-            info.setConsumerId(new ConsumerId(localSessionInfo.getSessionId(), consumerIdGenerator
-                .getNextSequenceId()));
-        }
+
         if (info.isDurable()) {
             // set the subscriber name to something reproducible
-
+            info.setConsumerId(new ConsumerId(localSessionInfo.getSessionId(), consumerIdGenerator
+                    .getNextSequenceId()));
             info.setSubscriptionName(getSubscriberName(info.getDestination()));
         }
         info.setSelector(null);


++++ snap

This patch didn't break any existing test and also succeeded with the NetworkBrokerDetachTest provided earlier. 

, This file contains the patch that presumably fixes the issue. It has been created based on the ActiveMQ 5.3.0 trunk., patch applied with thanks to trunk: r747384]