[running the scheduled package: org.apache.activemq.broker.scheduler - from activemq-unit-tests would mostly verify if there is any code that depends on the messageId being the jobId, [^amq7002-master.patch]

Please find attached a patch for AMQ-7002.

The code change is to start using ID_GENERATOR to set JobId when scheduling a job instead of using messageId.

The test suits in Broker, unit tests & use cases all pass with this change in place.

A unit test, AMQ7002Test, has been created to exercise this code.

In short the unit test configures a broker with redelivery plugin installed, and send a message to a virtual topic with two consumers.
The consumers will perform a rollback operation, this causes the scheduler to come into play.
When then check that the jobs in the scheduler have unique IDs.

If we do not have the ID_GENERATOR in play than this test case fails, with the ID_GENERATOR we get the unique IDs we require.

JobIDs need to be unique in the scheduler. Under the existing code its possible for a race condition in which two or more jobs get the same JobID while having different payloads, the ID_GENERATOR resolves this issue by ensuring each job ID is unique.

Please review this patch for both the AMQ 5.15.x and 5.16.x (master) branches. 

I'd like to thank jgenender, joed, hkesler, and gtully for helping in identifying the issue and how to test/exercise the fix., Commit e0aa091d9ef16fb3f2a570a95bbd4326abc58941 in activemq's branch refs/heads/master from gtully
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=e0aa091 ]

AMQ-7002 - ensure uniqueue jobids, fix and test via patch from Jamie goodyear applied with thanks
, Commit 4cbb913271c6c41196c425dd9c32050d6a3d7030 in activemq's branch refs/heads/activemq-5.15.x from gtully
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=4cbb913 ]

AMQ-7002 - ensure uniqueue jobids, fix and test via patch from Jamie goodyear applied with thanks

(cherry picked from commit e0aa091d9ef16fb3f2a570a95bbd4326abc58941)
, patch applied, thanks!, -1

No regression testing added for existing store, please revert and provide tests., I don't see any issue with the change in the format of the job id string.

the generator is already used in the code base:

https://github.com/apache/activemq/blob/57795bafcea290c6879bb288822435c480a9212d/activemq-kahadb-store/src/main/java/org/apache/activemq/store/kahadb/scheduler/JobSchedulerImpl.java#L753

 , [^AMQ7002-messageId.patch]

Hi [~tabish121], [~gtully], please see the above update patch.

This patch ensures that MessageID format is honored., Commit 76490a2c7f3a95c3861bb2dec76c4cc16f5dae3c in activemq's branch refs/heads/master from [~jgenender]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=76490a2 ]

AMQ-7002 - Change jobid identifier to messageid format
, Commit 3397a972139214720faa93d8e900ac4b9ac851b7 in activemq's branch refs/heads/activemq-5.15.x from [~jgenender]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=3397a97 ]

AMQ-7002 - Change jobid identifier to messageid format
]