[Is this related to AMQ-368 ?, From my understanding this is a bit different from amq-368 in terms of case scenario. There is no actual message sent or received, it continually just creates and disconnects a consumer which eventually leads to the exception above. The similarity is it doesn't destroy the connection on the database right away when it's supposed to have been destroyed., We are also experiencing this problem using Oracle 9i as the backend.  Over the course of the day, the number of sessions open from ActiveMQ slowly gets larger and larger.  Eventually (approx 24 hours), it exhausts all of the processes available in Oracle and nothing else can connect.  Re-starting ActiveMQ then clears all of the Oracle sessions and everything goes back to normal.  Our ActiveMQ server isn't actually doing much at the moment as we've only just installed it and haven't started using it for anything serious.

The relevant sections of our configuration file are below.  I've deliberately only got a small number of connections in the pool to try and alleviate the running out of connections problem.  It's strange that it can keep getting connections without exhausting the pool, which is what I thought would happen if you reach the maxActive number of connections and wait the maxWait time for one to become available.

    <persistence>
      <cachePersistence>
        <journalPersistence directory="../var/journal">
          <jdbcPersistence dataSourceRef="oracle-ds"/>
        </journalPersistence>
      </cachePersistence>
    </persistence>

  <bean id="oracle-ds" class="org.apache.commons.dbcp.BasicDataSource" destroy-method="close">
    <property name="driverClassName">
      <value>oracle.jdbc.OracleDriver</value>
    </property>
    <property name="url">
      <!-- Use a URL like 'jdbc:hsqldb:hsql://localhost:9001' if you want to connect to a remote hsqldb -->
      <value>jdbc:oracle:thin:@//host:1521/SID</value>
    </property>
    <property name="username">
      <value>user</value>
    </property>
    <property name="password">
      <value>password</value>
    </property>
    <property name="defaultAutoCommit">
      <value>false</value>
    </property>
    <property name="poolPreparedStatements">
      <value>true</value>
    </property>
    <property name="initialSize">
        <value>1</value>
    </property>
    <property name="maxActive">
        <value>2</value>
    </property>
    <property name="minIdle">
        <value>0</value>
    </property>
    <property name="maxIdle">
        <value>1</value>
    </property>
    <property name="maxWait">
        <value>2000</value>
    </property>
  </bean>
, Jonas,

If you get a chance, can you try to recreate this problem using the latest 4.0-SNAPSHOT?

Thanks,
Hiram, duplicate.]