[Unit test added, The message will be filtered as a duplicate when the rollback attempts to place it back onto the DLQ1 queue in the no restart case.  In the restart case the queues are essentially all fresh so the message is not tagged as a duplicate because that broker instance has in fact not seen that message in that queue before as it was just freshly baked following the restart.  If you were to repeat the sequence a second time following the restart the message would again be filtered as a duplicate as it has now passed through DLQ1 once before during this broker run.  , That is correct, a broker restart does not resolve the issue permanently. I was also thinking that the broker ignored it as a duplicate or something along those lines.
I can add another failing test case for the case you mentioned but I think the nature of the issue is clear, or isn't it?, It does seems like there is an issue going on in that the move case implies that the duplicates tracking should probably roll back the audit to allow the message to cycle again.  I'm not sure yet where that might be going wrong but a debug of the move process might reveal that.  Will add this to the list of things to check out.  , I dug a little deeper and the issue is that the setup you have were the message passes through multiple DLQ's makes it quite tricky to not capture the message as a duplicate when it passes through the chain of Queues again.  The move does rollback the message from the audit of DLQ2 but the broker doesn't know that the message was previously in DLQ1 and so it can't run back through and remove the message from the audit of that Queue.  You can work around this by disabling the Audit for your dead letter strategies which will prevent the tiered DLQ's from filtering out the message on repeated cycles through them.  , Thanks for looking into this. I have disabled audit for the DLQs and the messages cycle through as expected now., Workaround exists and the behavior is not unexpected given the chain of DLQ strategies and the forced looping that is occurring.  ]