[I have been working on this for a while now.  I tried a bunch of things. 

1) i made changes to RegionBroker.java in the addconnection so when a new connection request comes in and there is a oldcontext associated with the clientid then to explicitly close the old connection by getting it from the oldcontext and closing it. this solves the problem of having multiple connections on the server side to a client who has one connection from his side.

In a scenario where a client is disconnected for some reason(unpluggint he cable or the system crashing) and if there is no reconnect at all, there is noway the server knows to close the connection. server keeps sending to that connection. the outqueue on the socket increases to close to 98000 and then the server does not serve the other connected clients as well., Then also i tried to set the setKeepAlive on the socket to true and also lowered the server's timeout, keepalivetime and no of probes to low no's (in the RH linux config)so the system will knock off the connection. but even this does not seem to help., hi!!
 I am using activeMQ supports for Ajax in my application. i've created queues like amq.sendMessage("queueName", message);
 and to receive a message i've added listener like amq.addListener(myId, myDestination, myHandler.revMessage);

 When i send request with amq.sendMessage("queueName", message); it will make JMS message, fetch response and 
 send the message back to myHandler. this code works fine.. 

the problem is that if network connection lost, all handlers will also lost and the handlers would not be able to get response back from JMS.. requests are getting fine to activeMQ server and the response is also generating and MessageListenerServlet fail to send back response to javascript...

Is there any way to activate handlers again when network connection got enabled after disabled.

Thank you

Quoted from: 
http://www.nabble.com/-jira--Created%3A-%28AMQ-1746%29-ActiveMQ-server-does-not-release-the-connection-on-a-reconnect-tp17486710p17486710.html

, saira, i think an exception would be thrown on the clientside when a disconnect happens, in which case you will have to manually reconnect to the server. , hi!! 
  
When i disable the network i got the following exception at activemq console, after network connection has established again, the javascript application running on same machine (where server is running also) works fine but the other machines running same javascript application  connected to my machine(server running on my machine) unable to work properly.. in this case all handlers are lost which are establised using amq.addListener("id", myTopic, myHandler); MessageListenerServlet fail to get JMS response 

ERROR MulticastDiscoveryAgent        - Failed to advertise our service: default. 
ActiveMQ-4.alive.%localhost%tcp://sgul:61616 
java.net.NoRouteToHostException: No route to host: Datagram send failed 
        at java.net.PlainDatagramSocketImpl.send(Native Method) 
        at java.net.DatagramSocket.send(DatagramSocket.java:612) 
        at org.apache.activemq.transport.discovery.multicast.MulticastDiscoveryA 
gent.doAdvertizeSelf(MulticastDiscoveryAgent.java:361) 
        at org.apache.activemq.transport.discovery.multicast.MulticastDiscoveryA 
gent.doTimeKeepingServices(MulticastDiscoveryAgent.java:345) 
        at org.apache.activemq.transport.discovery.multicast.MulticastDiscoveryA 
gent.run(MulticastDiscoveryAgent.java:307) 
        at java.lang.Thread.run(Thread.java:595) 


Quoted from: 
http://www.nabble.com/-jira--Created%3A-%28AMQ-1746%29-ActiveMQ-server-does-not-release-the-connection-on-a-reconnect-tp17486710p17751779.html

, On the Ajax issue, can you upgrade to the latest release and try to use it with multicast turned off?, On the nms client reconnect issue, we didn't manage to reproduce it. can you try the latest versions of the broker and nms lib and see if you still see the problem. If you do, please provide a test case or a step-by-step guide how to reproduce it.]