[Cipher suites are configurable so you just need to match up what your .NET client can support:  http://activemq.apache.org/ssl-transport-reference.html, As noted in https://access.redhat.com/solutions/1165803, NMS does not support configuring the cipher suites on the client side. If you attempt it, it gives the following error:

{code}
Apache.NMS.NMSException: Invalid Uri parameter: transport.acceptInvalidBrokerCert=true,transport.enabledCipherSuites=SSL_RSA_WITH_RC4_128_SHA,SSL_DH_anon_WITH_3DES_EDE_CBC_SHA
   at Apache.NMS.Util.URISupport.ParseQuery(String query) in c:\dev\NMS\src\main\csharp\Util\URISupport.cs:line 84
   at Apache.NMS.ActiveMQ.ConnectionFactory.set_BrokerUri(Uri value) in c:\dev\NMS.ActiveMQ\src\main\csharp\ConnectionFactory.cs:line 205
   at Apache.NMS.ActiveMQ.ConnectionFactory..ctor(Uri brokerUri, String clientID) in c:\dev\NMS.ActiveMQ\src\main\csharp\ConnectionFactory.cs:line 104
   at Apache.NMS.ActiveMQ.ConnectionFactory..ctor(String brokerUri) in c:\dev\NMS.ActiveMQ\src\main\csharp\ConnectionFactory.cs:line 89
   at ActiveMQPOC.QueuePublisher..ctor(String queueName, String brokerUri, String clientId, String consumerId) in C:\TFS\code\ActiveMQPOC\ActiveMQPOC\ActiveMQPOC.cs:line 129
Press any key to exit...
{code}

So how can the ActiveMQ server be updated to change their cipher suites? As noted, this is a change between ActiveMQ 5.13 and 5.14, so should be fixable on the server side., I gave a valid reason as to why it WAS a problem, and that it was server side, and you arbitrarily close it. You haven't even looked at the code to see what changed on the ActiveMQ side have you? Great supportive community., If you read the documentation linked, you will see that you can configure the broker side TransportConnector to enable cipher suites that have become disabled most likely due to an update in your JVM which turned them off because they are considered insecure.  If you think that there is a specific comment that intentionally disabled certain cipher suites broker side and can provide us with that commit we can take a look but I'm not aware of any.  If you need help configuring the broker the Users mailing list is the place to ask operational questions.  

If you want to get the NMS client to support changing cipher suites then I'd recommend opening a JIRA and better yet contributing a patch to add the functionality, contributions are always welcomed.  ]