[I should add that the broker was shut down successfully (no exceptions/problems in the log) before started again.

If the broker was run for a shorter time like an hour or less, this issue does not take place., would it be possible to attach a zip/tar.gz of your store directory so that this could be reproduced. It looks like it is in the middle or recovery but it should not take hours. How big is the store?, This is the data store of a productive broker with procurement data. For confidential reasons I can not post it here.

These are the file sizes:
ls -l
total 530240
-rw-r--r-- 1 root root 33556012 May  5 09:33 db-10.log
-rw-r--r-- 1 root root 33555666 May  5 10:42 db-11.log
-rw-r--r-- 1 root root 33556967 May  5 11:40 db-12.log
-rw-r--r-- 1 root root 33556179 May  5 12:45 db-13.log
-rw-r--r-- 1 root root 33554986 May  5 13:55 db-14.log
-rw-r--r-- 1 root root 33555934 May  5 15:35 db-15.log
-rw-r--r-- 1 root root 33554839 May  5 16:05 db-16.log
-rw-r--r-- 1 root root 33030144 May  5 16:08 db-17.log
-rw-r--r-- 1 root root 33556869 May  4 14:00 db-1.log
-rw-r--r-- 1 root root 33556347 May  4 14:53 db-2.log
-rw-r--r-- 1 root root 33554523 May  4 15:20 db-3.log
-rw-r--r-- 1 root root 33555765 May  4 16:07 db-4.log
-rw-r--r-- 1 root root 33554705 May  4 17:05 db-5.log
-rw-r--r-- 1 root root 33555131 May  5 08:58 db-6.log
-rw-r--r-- 1 root root 33555786 May  5 09:01 db-7.log
-rw-r--r-- 1 root root 33555139 May  5 09:03 db-8.log
-rw-r--r-- 1 root root 33555024 May  5 09:06 db-9.log
-rw-r--r-- 1 root root  1564672 May  5 16:08 db.data
-rw-r--r-- 1 root root   837208 May  5 16:08 db.redo
-rw-r--r-- 1 root root        0 May  5 16:08 lock
, We had to restart one broker and this time the issue did not show up. Here in the log we can see that it only takes 5 seconds to read the datastore.

2010-05-07 15:43:25,569 | DEBUG | loading | org.apache.kahadb.index.BTreeIndex | main
...
2010-05-07 15:43:25,637 | DEBUG | loading | org.apache.kahadb.index.BTreeIndex | main
2010-05-07 15:43:30,851 | INFO  | Replayed 68230 operations from the journal in 5.213 seconds. | org.apache.activemq.store.kahadb.MessageDatabase | main

, We also see this issue on 5.3.1-fuse-01-00. Occasionally on restarts (graceful), Kaha hangs on startup and we have to delete the entire store (and loose messages) to get it going again. A strange and probably related symptom is that the store seems to grow indefinitely. Although there should be only a few in-flight messages, our current, corrupted store has 40 data-queue files (128MB each). The data is too sensitive to publish here, but we can arrange that privately if needed.

The problem is in KahaStore.generateInterestInMapDataFiles where the while-loop is alternating between two item ids in an infinite loop., It's worth mentioning that the broker has moderate load (about 100 messages per minute). Most messages are very small, but about 50-150 per day are 1-3MB in size. 

Dennis: Are you sending big messages?, In the past I came accross similar issue in the other application. In short: not synchronized, concurrent put/get operations on HashMap can cause infinite loop.
See this blog: http://lightbody.net/blog/2005/07/hashmapget_can_cause_an_infini.html

I think this problem has been fixed already (at least in current trunk) by adding synchronization on inflightTransactions map in getInflightTx method. In 5.3.1 this map wasn't synchronized and I think that caused your broker hang. 
, I believe this issue has been fixed.  Try a later version or the 5.6-SNAPSHOT to verify. , reopen to set fix version to 5.6, closing again with correct fix version]