[Patch to make SimpleDiscoveryAgent#start(...) asynchronous., Hi Stirling,

thanks for the patch - it doesn't look like its from trunk though (so finding it hard to see what you've changed) - could you get src from trunk and make the patch again ? 

thanks,.

Rob, Hi Rob,

Sorry for the delay!  I missed your comment, and we just ran into this issue again when we upgraded to AMQ 5.6.0.  I've attached an updated patch based on the AMQ trunk.  The patch uses the SimpleDiscoveryAgent's taskrunner to launch concurrent bridge creation attempts at startup.  The unit test verifies that startup is concurrent.  I also had to change EmbeddedBrokerTestSupport so that it properly initialized the auto-fail thread., how does this relate to https://issues.apache.org/jira/browse/AMQ-3195 which provides for async start up of network connectors. Are the two approaches competing or necessary?, This issue is complimentary to AMQ-3195.  AMQ-3195 addressed the case where *multiple* network connectors started synchronously.  Within a single network connector, the bridges were started synchronously.  AMQ-2541 addresses the behaviour within a single network connector so that the bridges are started asynchronously.  The rationale for AMQ-2541 is the same as AMQ-3195 --- sometimes establishing a bridge can be very slow and holds up subsequent bridge formation.

In our use case, we only have a single network connector, but it is configured with multiple URLs.  Since this is a single network connector, AMQ-3195 does not help since the multiple URLs within the network connector are attempted synchronously.  AMQ-2541 adds asynchronous connection establishment within the network connector., We are getting the same problem due to this defect.

The primary node takes time in startup when other nodes are down.

Please let me know if it is fixed or are you planning to fix it.

, with the fix in https://issues.apache.org/jira/browse/AMQ-3195 does the workaround, of using a configured network connector per url rather than static(a,b,c) work for you?
This issue is not on the radar for 5.10 at the moment., Using networkConnectorStartAsync  does not solves our problem.
]