[AAARRRGGGG! 

Okay I just realised that a simple override of getStatistics() will not work anyway.  The inheritance tree is totally wrong.

Class o.c.a.m.JMSSessionStatsImpl extends o.c.a.m.StatsImpl implements j.m.j.s.JMSSessionStats

and 

Clall o.c.a.m.StatsImpl implements j.m.j.s.Stats, o.c.a.m.Resettable

In the reset() method 
  The call to getStatistics returns j.m.j.s.Statistic[] but all the o.c.a.m stats objects implement the j.m.j.s.Stats interface not j.m.j.s.Statistics.  

As a result you can't get there from here., differences for o.c.a.m.StatsImpl.java, differences for o.c.a.m.JMSEndpointStatsImpl.java, differences for o.c.a.m.JMSSessionStatsImpl.java, differences for o.c.a.m.JMSConnectionStatsImpl.java, After pondering the problem for a while, I figure that quickest fix was to have the o.c.a.m.StatsImpl extend the o.c.a.m.StatisticImpl class.  That makes all getStatistics() method work properly.  But another issue that is that the JMSEndpointStatsImpl, JMSSessionStatsImpl and JMSConnectionStatsImpl  classes are aggrating containers and not all the aggregate counters are added the StatsImpl map.  As a result each of these classes have to have an override of the reset() method to clear all member counters. While I am sure that there is a lot more that of work to do in the statistics package, I have attached dif files for each of the files listed above.  These changes have gotten me to a point but where I can track and log stats in my client code.

One large hole that I ran across in my testing was in the area of destination stats.  I saw some hooks where attempts are made to record each message, but it seems that the stats objects are just dereferenced after it is updated.  Next update happens on an entirely new object.  I thought about trying to fix this to, but I am not sure how to handle the selection of a previously created stats object.  I think it would have to be something like a combination of classloader instance and destination to have it work properly within a app server environment., am a bit snowed at the moment; fancy applying this one?, applied patch from Dennis - many thanks!]