[Do you have a test case that can reproduce this issue?
Have you tried using a later release such as 5.5 or a 5.6-SNAPSHOT?, Unable to reproduce and no test case provided., I was also seeing this error in a high load system with embedded AMQ,  but was unable to reproduce in a small / simple test case.

The exception was originating from a single thread with a transacted session, running in a bigger application (a subtle timing issue?).
The thread was creating TextMessages from external events, sending to a queue then committing the session, shortly after the same thread would read back from that queue and send to another queue then commit again.
It was the send to the 2nd queue that would very occasionally throw the NullPointer.  In 30 – 40 thousand iterations over a 12 hour period I'd see the NullPointer maybe 20 times.  I could not however contrive a test case to reliably reproduce it.

What I could do however was to put the JVM in debug mode and catch the NullPointer.

What I found was

public int getSize() {
        if (size  0 && content  null && text != null) {
            size = getMinimumMessageSize();
            if (marshalledProperties != null) {
                size += marshalledProperties.getLength();
            }
            size = text.length() * 2;        <<<< null pointer thrown here
        }
        return super.getSize();
    }

Exception occurred: java.lang.NullPointerException (to be caught at: org.apache.activemq.ActiveMQSession.send(), line=1,700 bci=447)"thread=Thread 50", org.apache.activemq.command.ActiveMQTextMessage.getSize(), line=148 bci=57
148                size = text.length() * 2;

MQ IN SMA.TEST.ORBITAL.01.CT/MQ_LOOP_BACK.1[1] list
144                size = getMinimumMessageSize();
145                if (marshalledProperties != null) {
146                    size += marshalledProperties.getLength();
147                }
148 =>             size = text.length() * 2;
149            }
150            return super.getSize();
151        }
152        
153        public String toString() {
Thread 50[1] print text
 text = null

Since the check that text != null and the accessing of text it was being set to null.

I was running version 5.3.0, and suspected the cause of the NullPointer to be the
	text = null;
assignment at the end of the beforeMarshall() method in ActiveMQTextMessage.  This looks to be the only place it could be set to null.

See 
https://issues.apache.org/jira/browse/AMQ-2103
https://issues.apache.org/jira/browse/AMQ-2966

The “text = null;” assignment is present in AMQ versions 5.3.0, 5.3.1, 5.3.2, 5.4.0, 5.4.1
and removed in 5.4.2 and subsequence versions.

Unable to upgrade to 5.4.2 (or newer) in the short term, but needing to avoid this problem immediately I rebuilt 5.3.0 removing the “text=null;” assignment and have not experienced the NullPointerException since.]