[AMQ-4328 fix needed to be confined to the async side, the duplex responder side., Commit 8e00c6c2bc30e38cee585d9de97b511ed664951b in activemq's branch refs/heads/master from [~gtully]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=8e00c6c ]

[AMQ-6640] fix duplicate suppression sync request on responder end of duplex network connector only b/c that has the async local transport. Additional test. Ensure broker sync is conditional on the need for duplicate suppression which should only be necessary in ring topologies when properly configured
, it is still not exactly right - need to rationalise the use of sync and async vm transports on either end of the duplex pipe, there is a need for some async processing because there is contention., Commit d84a58656c0b3fcb2aad04e47ef843bf379a25f0 in activemq's branch refs/heads/master from [~gtully]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=d84a586 ]

[AMQ-6640] allign use of sync vm transport usage on duplex end of networkconnector with initiator end. only duplexinbound for forwarding is async to allow thread for responses. vm transport options applied in one place and test more deterministic w.r.t the hang scenario
, Commit 5ac9657c123993e7f4bac16ed79e2c9763ea45d1 in activemq's branch refs/heads/master from [~gtully]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=5ac9657 ]

[AMQ-6640] shrink test duration for ci boxes
, network connector internal vm transports are a all sync with the exception of the duplex end forwarding transport such that the vm dispatch thread can compete with inbound responses for acks without blocking, Commit 4ef1fc74cf8068b5c41cc1f4d1c97967658a465b in activemq's branch refs/heads/master from [~gtully]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=4ef1fc7 ]

[AMQ-6640] either broker dispatch to bridge or bridge dispatch to broker needs to be async - dispatchAsync network option is the trigger for the vm transport to be sync in line with the current defaults. original BacklogNetworkCrossTalkTest scenario exposed this. upshot is dispatchAsync=false is not compatible with duplicate subscription suppression which is fair.
, network connector options suppressDuplicate[Queue|Topic]Subscriptions (which is used in ring topologies (not the norm)) requires the default true value for attribute dispatchAsync.
]