[still not fixed. Found this issue in 5.9.1 ActiveMQ., The latest version is 5.12.1, recommend you use that. , Can you please confirm if this issue has been fixed in 5.12.1? Do you use function like timeout to prevent such issues in 5.12.1?, Can someone please confirm? , There has been some other fixes for the failover transport in 5.12.1 so as Tim said, you should try the latest to see if this is still a problem.

There was no change to specifically use a timeout for this method call, however just simply putting a timeout wouldn't fix the actual problem anyways.  If the client code is hanging when calling syncSendPacket then the reason that it's hanging should be fixed versus just having a timeout period.

If it's still a problem when running 5.12.1 I would recommend that you submit a test case that demonstrates this issue, if possible., Thanks for replying. currently its not possible for us to upgrade to 5.12.1. We had this issue twice in last three months but we aren't able to reproduce this issue.

Could you please provide us with change sets with fixes for failover transport in 5.12.1?
Many thanks:)
, The source code is mirrored on Github (https://github.com/apache/activemq), you can easily check the change set yourself there.  , There is no indication that there is a client side issue here, appears to be working as designed. , Out of office until 16-11-2015
, Issue still happening in 5.13.0:
sun.misc.Unsafe.park(Native Method)
java.util.concurrent.locks.LockSupport.park(LockSupport.java:175)
java.util.concurrent.locks.AbstractQueuedSynchronizer$ConditionObject.await(AbstractQueuedSynchronizer.java:2039)
java.util.concurrent.ArrayBlockingQueue.take(ArrayBlockingQueue.java:403)
org.apache.activemq.transport.FutureResponse.getResult(FutureResponse.java:48)
org.apache.activemq.transport.ResponseCorrelator.request(ResponseCorrelator.java:87)
org.apache.activemq.ActiveMQConnection.syncSendPacket(ActiveMQConnection.java:1381)
org.apache.activemq.ActiveMQConnection.ensureConnectionInfoSent(ActiveMQConnection.java:1495)
org.apache.activemq.ActiveMQConnection.start(ActiveMQConnection.java:522)]