[I will provide a PR for this issue., GitHub user pdudits opened a pull request:

    https://github.com/apache/activemq/pull/175

    https://issues.apache.org/jira/browse/AMQ-6210

    Do not store selector information of temporary destinations.
    
    Since the selector information is not cleared after the destination is removed, the cache grows with every temporary destinations, and a use case where a consumer would ever reconnect to a temporary queue for reception is hard to imagine.

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/pdudits/activemq amq-6210

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/activemq/pull/175.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #175
    
----
commit 24c843774cbd8712382ec098d039d05480bb4c38
Author: Patrik Dudits <patrik@dudits.net>
Date:   2016-03-14T09:16:02Z

    https://issues.apache.org/jira/browse/AMQ-6210
    
    Do not store selector information of temporary destinations. Since the selector information is not cleared after the
    destination is removed, the cache grows with every temporary destinations, and a use case where a consumer
    would ever reconnect to a temporary queue for reception is extremely rare.

----
, Commit f3ecc293f023e2a75a2c243d361f7a3fc9800f67 in activemq's branch refs/heads/master from [~tabish121]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=f3ecc29 ]

https://issues.apache.org/jira/browse/AMQ-6210

Don't cache selectors for temp destinations.  , Commit 48ba714b3083b86a84ed3419df4fde21ec61e5d8 in activemq's branch refs/heads/master from [~tabish121]
[ https://git-wip-us.apache.org/repos/asf?p=activemq.git;h=48ba714 ]

https://issues.apache.org/jira/browse/AMQ-6210

Clean up and apply filtering for temp destinations to removeConsumer as
well.  

This closes #175, Github user asfgit closed the pull request at:

    https://github.com/apache/activemq/pull/175
, Thanks for incorporating. I would like to point at AMQ-6029 yet, where I add ignores on network subscriptions and queue browsers, which are also kind of consumers, that are not permanent, and have empty selectors.]