[Attaching unit test., Running locally with the supplied test using the latest trunk code and I cannot get any of these exceptions., FWIW, I also get similar errors using a Perl client. Here is what gets logged:

{code}
2012-10-26 08:26:02,971 [ActiveMQ NIO Worker 49] WARN Transport - Transport Connection to: tcp://1.1.4.3:34160 failed: javax.net.ssl.SSLException: Received fatal alert: bad_record_mac
2012-10-26 08:26:02,979 [ActiveMQ NIO Worker 48] WARN Transport - Transport Connection to: tcp://1.1.4.3:34161 failed: javax.net.ssl.SSLException: Received fatal alert: bad_record_mac
2012-10-26 08:26:03,006 [ActiveMQ NIO Worker 48] WARN Transport - Transport Connection to: tcp://1.1.4.3:34162 failed: javax.net.ssl.SSLException: Received fatal alert: bad_record_mac
2012-10-26 08:26:14,780 [ActiveMQ NIO Worker 49] WARN Transport - Transport Connection to: tcp://1.1.4.3:34190 failed: javax.net.ssl.SSLException: Inbound closed before receiving peer's close_notify: possible truncation attack?
{code}, Timothy, it still fails for me, I've tried in 3 different hardware with both java 6 & 7. Which test did you run exactly?

My patch add a test to {{StompLoadTest.java}} but you should run {{StompNIOSSLLoadTest.java}} test, I do run:
{noformat}
mvn -Dtest=StompNIOSSLLoadTest#testStompSlice test
{noformat}, Yea, was running the wrong test last night, to many hours starring NIO is not good for the brain.  I'm seeing this as well, not sure what is going on., Tim, any progress on this one?, Nope, patches welcomed. , Note that the attached test is no longer valid against trunk code. , FWIW, We are seeing similar problems on openwire nio+ssl under load as well, observed on both 5.7.0 and 5.8.0.

I have created AMQ-4312 to track that issue, with an attached test case., Patch available in AMQ-4312 should fix this issue as well., Managed to get this one again after some more testing.  , Since STOMP+NIO+SSL inherits most of the NIO+SSL functionality, it is likely this issue is broken by AMQ-4321 as well., Ran the failing STOMP NIO test on both my machines for awhile and don't see the problem anymore so this looks to be sorted now. , Fixed]