[Hi,

I have just seen this issue as well (AMQ 3.1), although the second thread in my case was an already established TcpTransportChannel thread.

Found one Java-level deadlock:
=============================
"JmsSessionDispatcher: 8":
  waiting to lock monitor 0x0110d9b0 (object 0xea8a1488, a java.lang.Object),
  which is held by "TcpTransportChannel: Socket[addr=/170.137.15.50,port=36873,localport=61616]"
"TcpTransportChannel: Socket[addr=/170.137.15.50,port=36873,localport=61616]":
  waiting to lock monitor 0x0110d9f8 (object 0xea8a13a8, a org.activemq.ActiveMQMessageConsumer),
  which is held by "JmsSessionDispatcher: 8"

Java stack information for the threads listed above:
===================================================
"JmsSessionDispatcher: 8":
        at org.activemq.ActiveMQMessageConsumer.processMessage(ActiveMQMessageConsumer.java:428)
        - waiting to lock <0xea8a1488> (a java.lang.Object)
        - locked <0xea8a13a8> (a org.activemq.ActiveMQMessageConsumer)
        at org.activemq.ActiveMQSessionExecutor.dispatch(ActiveMQSessionExecutor.java:110)
        at org.activemq.ActiveMQSessionExecutor.run(ActiveMQSessionExecutor.java:95)
        at java.lang.Thread.run(Thread.java:595)
"TcpTransportChannel: Socket[addr=/170.137.15.50,port=36873,localport=61616]":
        at org.activemq.ActiveMQMessageConsumer.processMessage(ActiveMQMessageConsumer.java:422)
        - waiting to lock <0xea8a13a8> (a org.activemq.ActiveMQMessageConsumer)
        at org.activemq.ActiveMQMessageConsumer.setMessageListener(ActiveMQMessageConsumer.java:243)
        - locked <0xea8a1488> (a java.lang.Object)
        at org.activemq.transport.NetworkMessageBridge.createRemoteConsumer(NetworkMessageBridge.java:168)
        at org.activemq.transport.NetworkMessageBridge.start(NetworkMessageBridge.java:157)
        at org.activemq.transport.NetworkChannel.createBridge(NetworkChannel.java:479)
        at org.activemq.transport.NetworkChannel.addConsumerInfo(NetworkChannel.java:443)
        at org.activemq.transport.NetworkChannel.addConsumerInfo(NetworkChannel.java:436)
        at org.activemq.transport.NetworkChannel.onConsumerInfo(NetworkChannel.java:239)
        at org.activemq.broker.impl.DefaultBroker.fireConsumerInfo(DefaultBroker.java:723)
        at org.activemq.broker.impl.DefaultBroker.addMessageConsumer(DefaultBroker.java:254)
        at org.activemq.broker.impl.BrokerContainerImpl.registerMessageConsumer(BrokerContainerImpl.java:355)
        at org.activemq.broker.impl.BrokerConnectorImpl.registerMessageConsumer(BrokerConnectorImpl.java:171)
        at org.activemq.broker.impl.BrokerClientImpl.consumeConsumerInfo(BrokerClientImpl.java:493)
        at org.activemq.broker.impl.BrokerClientImpl.consume(BrokerClientImpl.java:345)
        at org.activemq.transport.TransportChannelSupport.doConsumePacket(TransportChannelSupport.java:374)
        at org.activemq.transport.TransportChannelSupport.doConsumePacket(TransportChannelSupport.java:368)
        at org.activemq.transport.tcp.TcpTransportChannel.run(TcpTransportChannel.java:311)
        at java.lang.Thread.run(Thread.java:595)


I am using embedded brokers, and the problem showed up about 9 hours after the process had started.  An event driver was feeding messages all that time.  Unfortunately, my full log file got truncated over night, so I am not sure whether there was something that may have happened that lead to this condition.

This was the first time for the problem, and so I don't know whether it is repeatable or not.  Have you repeated this situation?  If so, under what circumstances?  I can change the setMessageListener method to be synchornized, but as I haven't reproduced the issue, I don't know the full effects of that change.

We would like some feedback on this from the developers, as we are looking at a very large scale usage of AMQ.

, No I haven't reproduced this issue. Once it was discovered, I fixed my version of ActiveMQ, to ensure it didn't happen again.

When I was looking at it, I thought that either the setMessageListener() method could be made synchronized (this was the fix I performed on my build of ActiveMQ), or that the messageListenerGuard could be held only for the actual assignment of the new message listener to the field, and not for the processMessage() call as well. Either of these would prevent the deadlock. But the former would mean that you couldn't guarantee all messages that would be processed via processMessage() would be processed by that specific message listener that you set (Someone else could set the message listener to something else, before the processMessage() call could reacquire the messageListenerGuard).

ActiveMQ seems to run fine with the setMessageListener() method synchronized, so I would recommend that this should be the way forward., Oops...this line:

But the former would mean that you couldn't guarantee all messages 

should have read

But the latter (reducing the scope of the messageListenerGuard lock being held) would mean that you couldn't guarantee all messages, Matt,

Thanks for the response.  I will take a look at the code, given the second option you detailed as well.

Kevin., I have a quick and dirty test case which gets the deadlock /most/ of the time on my dual core machine. , I've added your test case to SVN as AMQ336Test.java - many thanks!

I've patched the code to fix up the locking around the setting of the MessageListener which I'm pretty sure should fix your issue. I also removed a few unnecessary synchronized methods which should further reduce the possibility of getting any deadlocks with this code.

While I'm pretty confident this resolves the issue, if you still see any issues with this issue, please let us know - we can always reopen this issue if you can in any way reproduce this problem again., James,

I think you probably intended to make ActiveMessageConsumer.stop() unsynchronised too, since you changed it to use the SynchronizedBoolean, and it touches no other state.

BTW, that JUnit test was actually from me, not from Matthew.  Not that I'm vain or anything!

Sean.]