[For what it's worth, [Apache ActiveMQ Artemis|http://activemq.apache.org/artemis/] (a sub-project of Apache ActiveMQ) employs a caching mechanism so that whatever login module is being used isn't called *every* time an authentication is performed.  It's controlled by a simple time-out.  You can see the details in [org.apache.activemq.artemis.core.security.impl.SecurityStoreImpl|https://github.com/apache/activemq-artemis/blob/master/artemis-server/src/main/java/org/apache/activemq/artemis/core/security/impl/SecurityStoreImpl.java], Use the cached LDAP Authorization Map: http://activemq.apache.org/cached-ldap-authorization-module.html, Hi Timothy,
I am talking about AUTHENTICATION, not authorization. The cached LDAP Authorization Map does NOT help at all. 
In our case, we have hundreds of application servers, and we use pooled connection factory with max connection number of 5. The ActiveMQ server has to create more than a thousand connections to LDAP service when it is trying to establish the huge number of connections from application servers. That does not make sense and ldap server could deny access due to the huge number of connections to it. Think about if we have 5 ActiveMQ servers, each server has to create 1000 connections to LDAP server. sooner or later, the ldap server will be exhausted.

This is an real ISSUE when we are trying to adopt ActiveMQ for big application clusters.

Thanks, Hi Justin,
Is there any release schedule for this project? We are trying to adopt ActiveMQ as our message bus for our application servers, but since we use ldap authentication and authorization, we soon found the ldap service itself will become a bottleneck due to huge requirements for establishing connections from ActiveMQ servers. 

Thanks, [~alt_alt], the Apache ActiveMQ Artemis broker has had [3 releases already|http://activemq.apache.org/artemis/download.html]., Hi Justin,
It looks like another project instead of a plugin in ActiveMQ, have you considered to fix this issue in the future release of ActiveMQ, it is really important for us to adopt ActiveMQ for huge clusters of application servers.

Thanks, That's correct.  ActiveMQ Artemis is not a plugin to ActiveMQ but a broker in and of itself.  Artemis supports clustering.  Most of the same kinds of clustering features that ActiveMQ 5.x supports are also supported in Artemis so if you want a huge cluster then you can certainly have it with Artemis., Hi Justin,
Thanks for your reply, but the problem is that we already setup ActiveMQ as our message bus and it is already online for production now. It should be no easy for us to replace it with another one. So we still hope the fix coming in the future release of ActiveMQ. Is that possible?

Thanks, looks like we could pull back the fix from artemis for this. I don't see any reason why we cannot cache the ldap context and reuse it for subsequent logins. There may even be a way to pool ldap connections., Cool! Thanks Gary!]