[Thanks, gonna take a look., Thanks JB,

I have one more founding on client side.
There is an exception:
{code}
org.apache.activemq.transport.failover.FailoverTransport	Transport (tcp://activemq-vm-primary:61616) failed , attempting to automatically reconnect: java.io.IOException: Encountered a String value that is too long to encode.
{code}

It could be the case that client tries to inject long binary property into JMS message, receives IOException and trying to reconnect. After some time, unlimited re-connections kills the server.

I am not 100% sure that is the cause, but perhaps it helps to your analyse, The following client code configured with failover transport will kill the server after some time:

{code}
public void onMessage(Message message) {
...
 StringBuffer bigBuffer = new StringBuffer(Short.MAX_VALUE);
 for(int i = 1; i < Short.MAX_VALUE; i++) { 
   bigBuffer.append("1"); 
 }
 throw new RuntimeException(bigBuffer.toString());
}
{code}

I see two AMQ problems here:
1) Exception message have to be controlled and limited before set in dlqDeliveryFailureCause: some exceptions coming from thirdparty and not under client handler control. Following code in ActiveMQMessageConsumer.rollback() have to be fixed:
{code}
  ack.setPoisonCause(new Throwable("Exceeded redelivery policy limit:" + redeliveryPolicy
      + ", cause:" + lastMd.getRollbackCause(), lastMd.getRollbackCause()));
{code}
It is necessary to check length of lastMd.getRollbackCause().toString() and cut to reasonable length


2) Failover reconnection by EVERY IOException is IMO very dangerous, GitHub user ashakirin opened a pull request:

    https://github.com/apache/activemq/pull/274

    AMQ-6894: limit poison exception message to 1024

    AMQ-6894: Limit poison exception message to 1024 to avoid IOException be encoding

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/ashakirin/activemq master

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/activemq/pull/274.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #274
    
----
commit d0dab2e88b44702d26dd0883c9940b97ee03fdeb
Author: Andrei Shakirin <andrei.shakirin@...>
Date:   2018-02-07T18:28:55Z

    AMQ-6894: limit poison exception message to 1024

----
]