[Sorry, in the second config the journal dataDirectory should be "${activemq.base}/activemq-broker2-data".

For additional info, see this thread: http://www.nabble.com/Weird-problem-with-network-of-brokers-tf3964843s2354.html, why is the network TTL=5 ? - It should be 1 - I think this could be your problem, I've changed the networkTTL. It looks like it's running OK now, only I don't understand how this could be the problem. According to the documentation, this is the *maximum* number of brokers the message can travel through. I don't see how increasing it can result into duplicate messages (because that was which i was seeing). The number of messages in the topics rose quickly to ~ 30.000, even while I've sent only about 50 messages to the topic.

The problem is that I haven't found I reliable way to reproduce this behaviour, but I've seen it on a few occasions already. If I encounter it again (with TTL=1 settings), I'll report it here., Unfortunately I get the same behaviour again. I can't find a reliable way to restore a network of brokers after one broker is brought down, other than shutting down all brokers and removing the data directories.

This specific behaviour is perhaps a bug in the loop detection? I could image it gets a message from the broker, sees it as a new messages, and forwards it again to the other broker, ad infinitum. In any case, not being able to restore a network of brokers without problems makes the network practically useless., I get the same problem. Do we know why it is happening and is there a workaround?, Testcase demonstrating persistent message not forwarded. It uses a memory adapter as persistence. When the first broker restarts, it does not forward the persistent message to the other broker. I'm not sure it tests exactly the problem outlined in this issue, it might be that it is just a problem with reloading presistent messages, but it's a start.

*Had an error, didn't close connections, so deleted testcase again*, Here is a theory. If this issue is the same as AMQ-961 then it could be that the following happens:

* If there are persistent messages, maybe it takes some time for one of the brokers to start, making the transport interrupt.
* If there are no persistent messages, both network connectors start reliably.

In any case, the fix to AMQ-961 (applied a bit after 4.1.1) will fix the problem, it will restart the bridge whenever the transport resumes.
 
]