[We seem to be sending the correct amount of data out for the target message, so we probably need to dig into the AMQP JMS client code to see what's going on during the message unmarshal in order to get a better idea of what's going on. , The issue in the code seems to stem from a max header frame size value in the AMQP client code.  When the value is greater than the default 32768 than an error is triggered.  This doesn't unblock the receive call though just drops the incoming message so that's why this test case fails.  If you tweak the max frame size value in the code then things start working., Appears that we aren't setting the max frame size option on the proton transport which causes the QPid JMS side to then default to its preset 32768 value.  We need to ensure that we set the max frame size before the transport is considered initialized otherwise it throws an IllegalStateException., Seems that setting the max frame size on the proton Transport to much more than 1mb causes issues either in proton or with the QPid JMS client code.  The default in the JMS client is set at 32768 by default, maybe there's a reason for that given the maturity of that code base. , Can anyone please clarify this issue?  Is this a productive issue, in which version? Does the problem only occur in specific combinations with activemq as amqp broker and qpid client only? Why is the qpid jms client mentioned when amqp is the protocol used? 
This would have an impact in evaluating activemq + amqp for my project. Thanks. , This occurs in our test against the QPid JMS client: http://qpid.apache.org/components/qpid-jms/

Tests against the client 0.24 and above show this issue.  YMMV with other clients, we haven't tested.  , Hi Timothy, 
thanks for your explanation and updates for this issue. 
Do you know about any plans and a concrete timeline for release 5.10 having this one fixed? , First we'd need to figure out if its a broker or client issue.  Releases are done when they're done, no definite time line for this.  , I think this may be addressed by https://issues.apache.org/jira/browse/QPID-5456, Fixed by Tim's latest change and QPID-5456.  Thanks Gordon.
]