[Patch to fix MQTT publish packet id generation, Hi Dhiraj,

I ran the tests with the patch and I think I see a regression.

{code}testResendMessageId(org.apache.activemq.transport.mqtt.MQTTSSLTest)  Time elapsed: 0.039 sec  <<< ERROR!
java.net.ProtocolException: Command from server contained an invalid message id: 2{code}

Wonder if you can reproduce this on your side?, Hi Dejan,

I was able to reproduce the error, but the failure doesn't happen every time the tests are run. I investigated a little more and looks like its related to AMQ-4712. The tests fail when the client apparently reads the same SUBACK packet twice, even though the server only sends it once. 

Since the same tests have no issues in the non-SSL MQTTTest, it seems like an issue in SslProtocolCodec.secure_read(). But I am not familiar with the code so can't narrow it down further. 

Can we mark the failing test as ignored in MQTTSSLTest for now, and get the fix in for non-SSL case? 

Thanks,
Dhiraj. , On further testing, it doesn't seem to be happening in SslProtocolCodec.secure_read(). Its hard to pin down where its happening, MQTTProtocolCodec seems to be reading the same buffer twice, but I can't determine why its doing so. , I am attaching an updated patch with a fix in a unit test for another intermittent failure when messages arrive slightly out of order for overlapping subscriptions. I have also refined the tests to add a slight delay after removing and creating subscriptions in testResendMessageId(), which seems to let the test pass now. 

Please test with the updated patch instead of the previous one. , patch applied with thanks in http://git-wip-us.apache.org/repos/asf/activemq/commit/67f151fe, Packet id generation must resume id sequence after client reconnects, Attaching patch3 to fix packet id generation, resolves resendMessageId() test failures, also adds a couple of extra unit tests to check id generation for cleansession=0 and cleansession=1, patch applied on trunk with thanks.  Tests are all passing here., Thanks Tim. I pulled from masterrep/trunk and see that the changes to MQTTTest in .patch3 were not merged. , Adding patch4 for unit tests for cleansession 0 and 1 id generation, Added in the missing test. , Dhiraj, can we consider this resolved now?, [~tabish121] Yes, we can mark this resolved, Fixed on trun]