[Can you provide any further details here, broker logs?  Unit tests?  Broker config?  Context on when this happens/happened?  Anything???, Unfortunately I haven't been able to reproduce yet though I'm not doing the firewall testing like I was doing which may have precipitated this.

I would think just checking for negative numbers might help on the server side...seems to me that's not something that should ever happen.   How could Pending ever go negative?

Michael D. Black
Senior Scientist
Advanced Analytics Directorate
Advanced GEOINT Solutions Operating Unit
Northrop Grumman Information Systems

, One thing I can add....here is the script I was running to test our error checking.
Our system retrieves a small message containing a document name from "activemq" below and then gets the document itself from another system (a mysql database called UDR).

The script either blocks the IP address completely (network down) or rejects the packet (service down).

So my suspicion is that doing "./fw.sh activemq down" or "./fw.sh activemq reject" or the combo is what caused this.  Perhaps in the middle of a receive or while the receive was in wait status.  And messages were being deposited in the topic (though probably at rate of maybe 1 to 10 per second...it's a realtime news feed so it varies).  During my testing the topic queue did have thousands of messages waiting since I was not pulling them off until empty for my testing.
We are on a WAN with about 25ms latency to the activemq system.

I probably tested doing this several dozen times and eventually noticed the negative numbers in the topic it was using.  All other topics were fine (though I think were the ones mainly using the activemq system).  I could try and recreate this but it's going to be random I'm sure.  And my guys on the other end of the WAN won't be happy if they have to restart ActiveMQ again.

And I'll note again...we had a bug where we were trying to reconnect an already-opened connection.  But I doubt that was the cause since it never gets to the queue in that situation.

So the 2 most likely situations IMHO:
#1 receive() is blocked and packets are either dropped or rejected during that time
#2 receive() is receiving message and packets are either dropped or rejected during that time perhaps messing with the autoacknowledge.

I'd say the odds of #2 seem small but with 25ms delays it's more than feasible for me to have hit that occurrence.

So if you receive a message and drop the connection before it's autoacknowledged could that cause it? 

#!/bin/sh
if [ "$1" == "" ];then
echo Usage: $0 [udr activemq up] [down reject]
echo To turn off firewall "$0 up"
exit 1
fi
if [ "$1" == "udr" ];then
IPADDR=10.2.100.214
PORT=8080
shift
fi
if [ "$1" == "activemq" ];then
IPADDR=10.2.100.209
PORT=61616
shift
fi
if [ "$1" == "down" ];then
echo $IPADDR down
iptables -A INPUT -s "$IPADDR" -j DROP
fi
if [ "$1" == "reject" ];then
echo port $PORT reject
iptables -A OUTPUT -p TCP --destination $IPADDR -j REJECT --reject-with tcp-reset
#iptables -A OUTPUT -p TCP --dport $PORT -j REJECT --reject-with tcp-reset
fi
if [ "$1" == "up" ];then
echo iptables flushed
iptables --flush
fi


Michael D. Black
Senior Scientist
Advanced Analytics Directorate
Advanced GEOINT Solutions Operating Unit
Northrop Grumman Information Systems

, Not reproducible test case or other information.  Recommend testing against a 5.9-SNAPSHOT to see if the KahaDB hardening that we've done changes anything. ]