[Yeah I got test failures also sometimes. But not consistent., -------------------------------------------------------
 T E S T S
-------------------------------------------------------
Running org.apache.activemq.transport.mqtt.MQTTNioTest
Tests run: 20, Failures: 0, Errors: 0, Skipped: 0, Time elapsed: 44.976 sec
Running org.apache.activemq.transport.mqtt.MQTTSSLTest
Tests run: 18, Failures: 0, Errors: 1, Skipped: 0, Time elapsed: 42.161 sec <<< FAILURE!
Running org.apache.activemq.transport.mqtt.MQTTTest
Tests run: 18, Failures: 0, Errors: 0, Skipped: 0, Time elapsed: 41.016 sec

Results :

Tests in error:
  testReceiveMessageSentWhileOffline(org.apache.activemq.transport.mqtt.MQTTSSLTest): Command from server contained an invalid message id: 1

Tests run: 56, Failures: 0, Errors: 1, Skipped: 0, Rob did you have hours to spare to look into MQTT test failures?

Would be good to get this fixed for the 5.9 release.
Also if there is some issues on the mqtt-client side you can get that fixed and a new release out., Hey JB, can you re-run the tests? I think *at least one (the first one)* of them should be fixed now.

When I run the tests, I can only get the one Claus posted about to fail. Let us know what you find., Thanks for the update. Let me try again.

I keep you posted., Guys, I took a look at this tonight. Goes deep... I won't have time to continue looking at it for a few days because i'll be with family, but if someone else wants to pick it up, here's what I found..

Somehow, the MQTT client is seeing two SUBACK frames for the same messageId (as indicated from the error: Command from server contained an invalid message id: 1). The broker logs that it only sends it once.  

So I took a peak at the SSLTransport and MQTTProtocolCodec... seems things are okay in that the next action is advanced properly from header to body, but for some reason, the readBuffers actually do have two instances of the SUBACK frame....

Digging deeper, it seems the SSL Transport is "reading" those frames off the wire, but I suspect incorrectly. It *might* have some issues w/ how it deals with buffer underflow/overflow, but I couldn't pin it down for sure.

If nobody else gets to it, i'll pick it up later this weekend when I get a sec.  , I've seen this on all the transports not just SSL transport, all the MQTT tests will fail with this extra SUBACK packet from time to time., I just saw a case where testSendMQTTReceiveJMS hung on one of the CI boxes.  I'll attach a stack trace.
, Added @Ignore to testReceiveMessageSentWhileOffline in both MQTTSSLTest and MQTTNioTest as both were failing regularly on CI.
, @Kevin I think you can probably close this one now, the tests all seem pretty stable for MQTT]