[TestDFSUpgrade has failed in #532 in a different way, see
http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/532/testReport/org.apache.hadoop.dfs/TestDFSUpgrade/testUpgrade/

junit.framework.AssertionFailedError: expected:<1790222743> but was:<3731403302>
	at org.apache.hadoop.dfs.TestDFSUpgrade.checkResult(TestDFSUpgrade.java:74)
	at org.apache.hadoop.dfs.TestDFSUpgrade.testUpgrade(TestDFSUpgrade.java:142), TestDFSUpgrade also failed for the patch in HADOOP-1601. 

Test results: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/517/testReport/
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/517/console

But the tests succeeds when running locally. 
, bq. junit.framework.AssertionFailedError: expected:<1790222743> but was:<3731403302>

The above failure can occur if java's File.listFiles() returns different order of files. The documentation says there are no gaurantees on the order. Any comments on what the (ununnounced) order would be, pressumably in the same order as readdir() call.

I myself could not reproduce this assert failure. Was this ever seen outside the Solaris build machine?

, bq. Was this ever seen outside the Solaris build machine?

The test cases for HADOOP-1601, which is not even remotely related to dfs, succeeds on my x86 machine, but consistently fails on the hudson server. , Enis, since you have such a good luck with triggering this failure, could include small 'sortFiles.patch' with your patch for HADOOP-1601 and make it patch available again?, Thanks Raghu, I guess i will wait for HADOOP-1726 to be fixed. Until then all the patches will fail.  , There are two issues in the Jira. 
 - NPE reported in the description
 - assert failure reported in first and seconnd comments. 

sortFiles.patch fixes only the second problem. I will file another jira that is more suitable for sortFile.patch and will make that patch available.
, Filed HADOOP-1749 for the second issue. Linked it with HADOOP-1601.
, NPE in TestDistributedUpgrade is not seen since 20 of july ( i checked hudson builds). Nearly one third of the nightly builds failed with assertion failure error, which is addressed in HADOOP-1749. Dhruba, do you recall any specific build number so that we can check in hudson?
, I remember seeing the NPE with trunk the beginning of August. If we have not seen it since then we can close this issue. Thanks., NPE is not seen for a while, so closing this issue for now, If NPE pops again, we can reopen this. ]