[I tracked this behavior change down to HADOOP-15554.  I believe the problem stems from Parser#handleInclude parsing the included sub-resource directly into the Configuration {{properties}} member which bypasses the ordering of properties returned by the Parser#parse method., Really? I thought I'd been seeing the "correct" behaviour, but maybe not. I do chained /nested XIncludes though, The behavior will only be noticed if an included resource overrides a previously set property from the same resource doing the include.  If the include was overriding a value from a previously parsed resource (like core-default.xml) then the problem does not manifest.

The parser directly sets the included properties on the conf as a side-effect of parsing but the non-included properties are returned as a parse result and those results are iterated to set them.  The sideband processing of includes effectively reverses the order in which properties are processed if the xinclude appears after the property setting in the original resource.

Here's the simple code I used to test it:
{code:title=testconf.java}
import org.apache.hadoop.conf.Configuration;
class testconf {
    public static void main(String[] args) throws Exception {
        Configuration conf = new Configuration();
        System.out.println("myconf = " + conf.get("myconf"));
    }
}
{code}

Using this sample code with a core-site.xml and included file setup as described in the JIRA description, The following shows what I get at two adjacent commits on the trunk line:
{noformat}
$ git log -1
commit f51da9c4d1423c2ac92eb4f40e973264e7e968cc
Author: Andrew Wang <wang@apache.org>
Date:   Mon Jul 2 18:31:21 2018 +0200

    HADOOP-15554. Improve JIT performance for Configuration parsing. Contributed by Todd Lipcon.
$ mvn clean && mvn install -Pdist -DskipTests -DskipShade -Dmaven.javadoc.skip -am -pl :hadoop-common
[...]
$ java -cp "hadoop/testconf:hadoop/apache/hadoop/hadoop-common-project/hadoop-common/target/hadoop-common-3.2.0-SNAPSHOT/share/hadoop/common/*:hadoop/apache/hadoop/hadoop-common-project/hadoop-common/target/hadoop-common-3.2.0-SNAPSHOT/share/hadoop/common/lib/*:." testconf
myconf = val1
{noformat}
So the above shows the broken behavior.  core-site.xml set myconf to val1 then xincluded another file which set it to val2, yet the property acts as if the xinclude occurred at the top of core-site.xml.  Moving one commit earlier in time shows the expected behavior:
{noformat}
$ git checkout HEAD~1
Previous HEAD position was f51da9c... HADOOP-15554. Improve JIT performance for Configuration parsing. Contributed by Todd Lipcon.
HEAD is now at 5d748bd... HDFS-13702. Remove HTrace hooks from DFSClient to reduce CPU usage. Contributed by Todd Lipcon.
$ mvn clean && mvn install -Pdist -DskipTests -DskipShade -Dmaven.javadoc.skip -am -pl :hadoop-common
[...]
$ java -cp "hadoop/testconf:hadoop/apache/hadoop/hadoop-common-project/hadoop-common/target/hadoop-common-3.2.0-SNAPSHOT/share/hadoop/common/*:hadoop/apache/hadoop/hadoop-common-project/hadoop-common/target/hadoop-common-3.2.0-SNAPSHOT/share/hadoop/common/lib/*:." testconf
myconf = val2
{noformat}
, Hi [~jlowe] and [~eepayne]

Thanks for reporting same. I think this is the same issue reported during 3.2.0 RC0 time. Correct?

Does this need some revert or partial revert of HADOOP-15554 as I could see a good set of changes in that work? 

I think I need to hold on to RC once this is resolved. Pls correct me otherwise. Thanks., This is not quite the same issue as discovered during the RC0 voting period, as that's HADOOP-15973.  Eric and I have been discussing this quite a bit offline, and he said that rolling back to the commit before HADOOP-15554 did not fix HADOOP-15973, so they are related but slightly different issues.  We _think_ there's a way to fix both of them with the same change, and Eric is actively working on that.  I agree that we should hold the RC for these fixes, as not loading the intended config settings properly could lead to very bad behavior depending upon the property which was accidentally, silently dropped after upgrading.
, This was fixed by HADOOP-15973.]