[namenode -checkpoint and backup nodes were added in 0.21 and they are not in 0.20.203 release., I do not think this is a problem for 0.20.203., Suresh - They are present in the docs, so one would think they exist in 203 as well. The docs surely ought to be fixed if these features are not present.

(This since OP had posted a link that's 203 doc specific), Reopening since the issue of docs is valid. There are CN and BN node docs on the tagged svn rev: http://svn.apache.org/repos/asf/hadoop/common/tags/release-0.20.203.0/src/docs/src/documentation/content/xdocs/hdfs_user_guide.xml, (What I mean is the bad docs ought to be removed, not the inclusion of CN/BN)., I have removed this from the docs., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12481942/hadoop-7297.patch
  against trunk revision 1133125.

    +1 @author.  The patch does not contain any @author tags.

    +0 tests included.  The patch appears to be a documentation patch that doesn't require tests.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-HADOOP-Build/600//console

This message is automatically generated., Christoph,

Thank you very much for contributing a patch fix!

Since CN and BN nodes are both not present in this release, all documentation that refers to it around ought to be removed. Could you re-up a fresh patch with all relevant documentation and references removed?

I'm unsure as to how it got in (perhaps a bad documentation cherry-pick while implementing the branch?)

I think the QA failed to apply the patch because of Eclipse specific lines in it (as seen on top). Could you try with a simple {{svn diff}} or a {{git diff --no-prefix}} and re-upload?, If the patch is against non-trunk, the QA Bot isn't smart enough to apply a patch., (Cancelling patch, needs more removals), Christoph - can you remove the rest of the references to backup and checkpoint node? I'll manually test the patch since it's a bit of a pain without Jenkins.

Thanks. -jg, Updated patch that removes all references. This almost caused confusion again, so picked it up myself.

(Note: Excuse the space/tab warning on the only modification line in the patch, if you note the other lines, I've tried to maintain it the same as <4sp><tab><tab>.), Also, what's the branch to do 0.20 stuff? I see one branch each for 203, 204 and 205, which is mighty confusing. Why can't we be cutting out on a serial 0.20 line? That branch has been stagnant for quite a while now, too.

But anyway, this patch was against branch-0.20-security-203, and hopefully portable (forward/backward/???) to other branches., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12492712/hadoop-7297.patch
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    +0 tests included.  The patch appears to be a documentation patch that doesn't require tests.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-HADOOP-Build/125//console

This message is automatically generated., +1. For 20-only patches, you should make and commit them against the "branch-0.20-security". I believe the specific release branches are so that, once an initial RC is cut, people can continue to commit to 20-security without it going into a later rc. So here, you should commit just to branch-0.20-security, and then it will be picked up for the 206 release., Thanks for +1 Todd. Committed to branch-0.20-security.

Unfortunately am unable to remove that 'archived fix version' 0.20.203.1 which isn't gonna be. The true fix version remains 0.20.206., Seems the document of 0.20.205.0 still has this issue: http://hadoop.apache.org/common/docs/r0.20.205.0/hdfs_user_guide.html#Checkpoint+Node, Tony,

Yes, will be fixed in 1.1.0's doc publishing. Sorry about this., Closed upon release of Hadoop-1.1.0.]