[These need to be public so that they can be run as shell commands, no?, It looks like they don't actually. Although I had missed that rationale for them being public., There may also be folks who start daemons in-process who this would break.  I think we should support that as a public API, no?, This patch makes JobTracker, TaskTracker, several LOGs package private.
It also adds a deprecated LineRecordReader and TaskCompletionEvent constructors that are compatible with 0.17., The problem is that JobTracker and TaskTracker are very wide interfaces. I'd much rather have users use JobClient and access the JobTracker via that interface than the JobTracker directly., > The problem is that JobTracker and TaskTracker are very wide interfaces. 

Wide public interfaces?  Really?  Stuff needed outside mapred package?

Also, if we reorg the tree so that daemon code is no longer in the same jar as client code (HADOOP-2884), we'll only publish javadoc for the client code, so what's public in the daemon code will matter a lot less.  Is it worth trying to fix this now?

> I'd much rather have users use JobClient and access the JobTracker via that interface than the JobTracker directly.

+1.  But some folks deploy Hadoop daemons in other containers (e.g., as a servlet, SmartFrog, etc.) so we still want someone to be able to write something like 'new JobTracker(conf).start()', and not be forced to write such code in the mapred package.
, -1 for this patch.  This is a backwards incompatible change to public APIs proposed after the freeze.  If anything we should fix the incompatibilities introduced, not eliminate the APIs., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12383879/compat.patch
  against trunk revision 666620.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    -1 javadoc.  The javadoc tool appears to have generated 1 warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    -1 findbugs.  The patch appears to cause Findbugs to fail.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2644/testReport/
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2644/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2644/console

This message is automatically generated., This patch fixes most of the api compatability problems between 0.17 and 0.18, by introducing deprecated methods., You might file a new issue now, while you're thinking about it, to remove all these deprecations.  The patch could be generated by simply reversing this patch., I'm going to only apply the non-deprecated changes to trunk to avoid the cleanup work., +1 this patch looks fine to me., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12384242/api-fix.patch
  against trunk revision 669333.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 6 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2688/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2688/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2688/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2688/console

This message is automatically generated., I just committed this., Integrated in Hadoop-trunk #523 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/523/])]