[abandonFileInProgress() in ClientProtocol is deprecated.  We should remove it as well., memleak.txt attached. 

Koji confirmed that this leak exists and it could lead to many other INode objects to leak, using a simple one node cluster and manually inturrupting writing one of the files.

, 0.17 won't be good enough for the big grids without this. , The patch that is tested manually is attached. As my comment in the patch describes, we do different things when a block is removed in different context. What is done a block is removed from NameNode should be in one place. This patch only fixes the observed leak.

I was thinking of writing unit test using abandonFileInProgress() but it is already deprecated. Since it is fairly simple patch and tested manually, it is probably ok not to have a unit test., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12382016/HADOOP-3382.patch
  against trunk revision 656153.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2463/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2463/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2463/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2463/console

This message is automatically generated., Thanks to Koji for helping the investigation and verification of the fix., I guess HADOOP-3382.patch is for 0.16.  Should we also remove all datanodes from BlockInfo?, created HADOOP-3390 to remove ClientProtocol.abandonFileInProgress(), > Should we also remove all datanodes from BlockInfo?
Possibly. Please see my comment in the code and in jira above. There is no explicit and/or consistent policy regd what needs to be cleaned up. I didn't want to fix that in this jira. 

Pretty much in all these cases datanodes would not completed the block. I will add cleaning up the datanodes part. 
, Updated patch adds block to invalidated blocks for any datanodes that have this block. Ideally processBlockReport should handle this. When it iterates, if a block does not have any file associated with it, it should be removed.
, +1 patch looks good, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12382065/HADOOP-3382.patch
  against trunk revision 656270.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2469/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2469/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2469/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2469/console

This message is automatically generated., TestMiniMRBingUp failes. This is very simple test and does not even use DFS. The failure seems to another case of HADOOP-3354 (thanks Lohit). I think this patch can be committed., I just committed this., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12382065/HADOOP-3382.patch
  against trunk revision 656480.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2474/console

This message is automatically generated., Integrated in Hadoop-trunk #492 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/492/])]