[
The attached patch removes timeout processing out of lock around low level selector keys. The purging loop is executed only once in few minutes and extra iteration is ok., As the reporter of the thread mentioned: we've been running with this patch now for a few days and haven't had to restart mapreduce again yet. This seems to have fixed the issue. (Thanks!), Thanks Aaaron. I propose this for 0.19.1 and 0.20.0. Not a blocker for most users., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12393108/HADOOP-4552.patch
  against trunk revision 709609.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3524/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3524/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3524/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3524/console

This message is automatically generated., The thread stack that Aaron sent. Note that "Thread 9" and "Thread 37" block each other.

Regd locking on Selectors, please read the small section "Concurrency" on Java doc for Selectors : http://java.sun.com/javase/6/docs/api/java/nio/channels/Selector.html
, +1 This looks right to me.
I would include in this jira more information about the issue, otherwise it is hard to understand the problem.
The stack trace mentioned in the mail-thread should be attached and a link to the Selector documentation would be helpful., I just committed this., Integrated in Hadoop-trunk #659 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/659/])
    . Fix a deadlock in RPC server. (Raghu Angadi)
]