[Attaching patch for trunk.

This patch adds the documentation changes to cluster_setup.xml and modifies AccessControlList so that it is writable and creation of objects through Reflection utils is possible.

Please review and provide your comments., The configuration name for the acls enabled should be mapreduce.cluster.acls.enabled following the nomenclature in branch 0.21 and trunk., Fix cluster_setup.xml to document mapred.acls.enabled that it is needed in both JT's and TT's conf files if at all.

Other than that the patch looks good.
, Attaching new patch changing the flag name from mapred.acls.enabled to mapreduce.cluster.acls.enabled in the documentation.
Also mentioned that this flag is to be set in the configuration files of JobTracker and all TaskTrackers., +1 for the patch. Submitting it through Hudson., Unit tests passed on my local machine.

ant test-patch gave:

     [exec] -1 overall.
     [exec]
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec]
     [exec]     -1 tests included.  The patch doesn't appear to include any new or modified tests.
     [exec]                         Please justify why no new tests are needed for this patch.
     [exec]                         Also please list what manual steps were performed to verify this patch.
     [exec]
     [exec]     -1 javadoc.  The javadoc tool appears to have generated 1 warning messages.
     [exec]
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec]
     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs warnings.
     [exec]
     [exec]     +1 release audit.  The applied patch does not increase the total number of release audit warnings.
     [exec]
     [exec]     +1 system tests framework.  The patch passed system tests framework compile.


Javadoc warnings are existing ones in current trunk and not related to this patch.

No new unit test is added in this patch as the patch is mostly documentation changes for MAPREDUCE-1664., I just committed this to trunk. Thanks Ravi!, Integrated in Hadoop-Common-trunk #453 (See [https://hudson.apache.org/hudson/job/Hadoop-Common-trunk/453/])
    HADOOP-6922. COMMON part of MAPREDUCE-1664. Makes AccessControlList a writable and updates documentation for Job ACLs. Contributed by Ravi Gummadi.
, Integrated in Hadoop-Common-trunk-Commit #378 (See [https://hudson.apache.org/hudson/job/Hadoop-Common-trunk-Commit/378/])
    ]