[Until the file is closed, the access time of a file is same as the modification time. Thus, access times need not be stored in the OP_ADD transaction. Neither does it need to be saved in the leases (INodeUnderConstruction).

The file close transaction OP_CLOSE needs to store access times, and it does., What about append?
Is it ok to change aTime to mTime during append. Or do we want to keep the original aTime?, I am handling "append" as precisely the same as "opening the file at creation time and writing to it". I am assuming that every modification to a file also counts as an "access" to the file, hence every modification (including appends) should update the access time as well., I am not arguing about the semantics of the access time field, I am saying that when saving it into the edits log you should save exactly that field rather than another one.
So, if you want to set accessTime to the value of the modificationTime you assign that value to that field. But when you serialize accessTime in {{logOpenFile()}} to the disk you should serialize that field rather than something else. I cannot even understand which of them (the first or the second) corresponds to which time until I look at the loading code.
This is what I mean., Are you saying that this is not a bug but more of a coding-structure convention? I  am not able to understand the benefit of your approach.
, I think the correct way to fix this is changing logOpenFile(...) to write only mtime but not atime.  However, this will introduce a layout change.

+1 to the patch.  Konstantin's change makes the code more clear.  Otherwise, it is hard to understand why writing the same number twice., I lust committed this.
I put it under improvements. Not a bug according to Dhruba., This patch needs a disk format change. We have to guarantee that leases persisted by earlier versions of code are read correctly. I do not see the patch attached to this JIRA do these things. Am I missing something?, The patch does not change neither the layout of data on the disk nor the values written. According to your previous comments the values of access and modification time are the same when the open file record is written., Integrated in Hadoop-trunk #630 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/630/])
    ]