[Is the problem to do with reducers waiting happening consistently across multiple jobs? , The job tracker log, you can see the attempts that I made to use hadoop job -kill-task

Furthermore, you'll notice that the reducers in question get started, but then disappear:

andreas@andi-lap:/tmp/bug$ grep tip_200808070013_0001_r_000020 hadoop-hadoop-jobtracker-ec2-67-202-58-97.compute-1.amazonaws.com.log
2008-08-07 00:15:07,184 INFO org.apache.hadoop.mapred.JobTracker: Adding task 'task_200808070013_0001_r_000020_0' to tip tip_200808070013_0001_r_000020, for tracker 'tracker_ec2-75-101-217-112.compute-1.amazonaws.com:localhost/127.0.0.1:53783'
2008-08-07 05:51:35,978 INFO org.apache.hadoop.mapred.JobTracker: Kill task attempt failed since task tip_200808070013_0001_r_000020 was not found

The last mapper was finished around or before 3:30 GMT (if I did not overlook one),
and the reducers produced a long repetition of:

2008-08-07 07:02:39,191 INFO org.apache.hadoop.mapred.ReduceTask: task_200808070013_0001_r_000013_0 Got 0 known map output location(s); scheduling...
2008-08-07 07:02:39,191 INFO org.apache.hadoop.mapred.ReduceTask: task_200808070013_0001_r_000013_0 Scheduled 0 of 0 known outputs (0 slow hosts and 0 dup hosts)
2008-08-07 07:02:44,200 INFO org.apache.hadoop.mapred.ReduceTask: task_200808070013_0001_r_000013_0 Need 67 map output(s)
2008-08-07 07:02:44,200 INFO org.apache.hadoop.mapred.ReduceTask: task_200808070013_0001_r_000013_0: Got 0 new map-outputs & 0 obsolete map-outputs from tasktracker and 0 map-outputs from previous failures
, Andreas, the reason why kill failed is that you specified the TIP ID rather than the taskID. Regarding the reducers stuck on fetching events, it looks like this is a case of HADOOP-3155. We are trying to find the problem leading to this. In the meantime, if this happens again, could you pls let us know the output of
$ bin/hadoop job -events <jobId> 0 1000000

Also, pls apply the patch posted on HADOOP-3155 (https://issues.apache.org/jira/secure/attachment/12387565/patch-3155-debug-0.17.txt). Please watch for when this happens again, and if it happens again, please attach a log of the tasktracker (provide logs of two such trackers if you can) on which the reduces get stuck, and a log of the tasktracker (just one is enough) on which reduces succeed.

I did notice from your logs that the JT got restarted while the TTs were up and I wonder whether that is somehow related to the issue described in HADOOP-3155., Moving this from 0.17.2, since I'm trying to cut a 0.17.2 release candidate and this is not diagnosed. , Closing this as stale.]