[The code in configuration looks like this:

{code}
        // Ignore this parameter if it has already been marked as 'final'
        if (attr != null && value != null) {
          if (!finalParameters.contains(attr)) {
            properties.setProperty(attr, value);
            if (storeResource) {
              updatingResource.put(attr, name.toString());
            }
            if (finalParameter)
              finalParameters.add(attr);
          } else {
            LOG.warn(name+":a attempt to override final parameter: "+attr
                     +";  Ignoring.");
          }
        }
{code}

While the check for value being null is required before adding the property to the 'properties' instance, adding it to finalParameters or for that matter even updatingResource shouldn't be an issue even if the value is null. This would certainly fix the current issue. Thoughts ?, Patch with the fix, +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12418238/patch-6227.txt
  against trunk revision 809491.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/4/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/4/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/4/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/4/console

This message is automatically generated., Yahoo! distribution patch. The patch for branch 0.20 will not apply to this distribution with HADOOP-6184 already in., Code changes look fine to me. +1., I just tested this fix on a single node cluster so as to enable/disable mapred debug script by setting it to null. The patch works as expected. A null value marked as final on server side can no longer be overridden by clients., +1, I just committed this to trunk. Thanks, Amareshwari !

I did not commit to the 0.20 branch, because there's an active vote in progress and did not think this existing bug should block the release. If decided otherwise, we can commit to the 0.20 branch as well., Integrated in Hadoop-Common-trunk-Commit #4 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Common-trunk-Commit/4/])
    . Fix Configuration to allow final parameters to be set to null and prevent them from being overridden. Contributed by Amareshwari Sriramadasu.
, Integrated in Hadoop-Common-trunk #82 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Common-trunk/82/])
    . Fix Configuration to allow final parameters to be set to null and prevent them from being overridden. Contributed by Amareshwari Sriramadasu.
, Editorial pass over all release notes prior to publication of 0.21. Bug.]