[3334_20080501.patch: reverted the accidental changes of FSEditLog format in HADOOP-3283., 3334_20080501.patch => 3337_20080501.patch, This patch works on my old file system image. Minor comments, please
- remove import of UTF8
- provide comments on the 2 new methods *FSEditLog() explaining what they are for., 3337_20080501b.patch: incorporated Konstantin's comments., Wouldn't this affect readFields() and write() of DatanodeDescriptor (used everywhere : RPCs etc) ? This patch looks like a problematic hack. I think this needs to be fixed better. If EditLog requires to read and write differently these different serialization should used there instead of everywhere., DatanodeDescriptor is not used in RPC only DatanodeInfo., > I think this needs to be fixed better. 

I agree.  We will remove storing DatanodeDescriptor to FSEditLog In HADOOP-3329 soon.  Therefore, I don't want to introduce layout change or protocol change in this patch., Does it mean the current patch is ok?

But we should not have wrong implementations of Writable interface for DatanodeDescriptor, right? 

Could you describe the fix (and may be problem)?

> We will remove storing DatanodeDescriptor to FSEditLog In HADOOP-3329 soon.

Was this stored before HADOOP-3283? , > DatanodeDescriptor is not used in RPC only DatanodeInfo.

Sure it is. Even if it is not, I don't think its a good practice to silently break the contract because we think the contract is not used (yet), (especially for widely used interfaces like Writables)

Example use: ClientProtocol.getBlockLocations() returns {{LocatedBlocks}}, if you trace its implementation, you will see that LocatedBlock is created using DatanodeDescriptor (around FSNamesystem.java:747) .. so DatanodeDescriptor.read() etc do get called out side of FSEditLog.
, > Example use: [...]
Actually this is not a potential problem, rather real one. Most unit tests fail with this patch., Raghu, thank you for pointing out that DatanodeDescriptor is sent in RPC in some hidden way.

3337_20080502.patch: created a subclass to fix this bug., 3337_20080502b.patch: use static methods instead of subclass., DatanodeDescriptor is not sent over RPC and is not supposed to. You can never get DatanodeDescriptor on the other end.
DatanodeDescriptor is sort of a name-node private class.
Although the actual class is DatanodeDescriptor, rpc serializes the base class DatanodeInfo  
using its Writable implementation and sends the latter over the network.
The problem here is that the serialization intended for DatanodeDescriptor (which is only serialized to disk) 
is mixed with the serialization of DatanodeInfo  (which should be used only for rpc).
We have been through this before.
I think we should introduce 2 new static methods in the DatanodeDescriptor that would provide serialization to disk., -1 overall.  Here are the results of testing the latest attachment 
http://issues.apache.org/jira/secure/attachment/12381344/3337_20080502b.patch
against trunk revision 645773.

    @author +1.  The patch does not contain any @author tags.

    tests included -1.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    javadoc +1.  The javadoc tool did not generate any warning messages.

    javac -1.  The applied patch generated 462 javac compiler warnings (more than the trunk's current 458 warnings).

    release audit +1.  The applied patch does not generate any new release audit warnings.

    findbugs +1.  The patch does not introduce any new Findbugs warnings.

    core tests +1.  The patch passed core unit tests.

    contrib tests +1.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2371/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2371/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2371/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2371/console

This message is automatically generated., Tested manually.

The 4 new javac warnings are due to the use of UTF8 for backward compatibility., I just committed this. Thanks Nicholas!, Integrated in Hadoop-trunk #483 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/483/])]