[Can we remove FSDirectory.waitForReady too? I believe it is just used to wait for the image to be loaded., Possible blocker for 0.13 release. Investigation in progress., This patch makes sure that the access to clusterMap is synchronized in open., Other modifications to blocksMap don't lock blocksMap. Many places the the access is under global FSNamesystem lock. But not all accesses to blocksMap is under lock. We will need to fix all of them, possibly by moving it under global lock. 

I am not sure if the patch fixes any issue. Can you clarify why the change is correct or helps?
, I agree with Raghu. In the current code, the blocksmap is protected by the global FSNamesystem lock. , I did not realize that blocksMap is protected by a global lock. I do not think that this is a good approach to ensure a structure integrity by acquiring a global lock. But anyway I can change my patch to acquire a global lock. But there are some non-public methods in FSNamesystem that do not acquire a global lock but access blocksMap. Shall we fix them?, I hesitate to add a global lock to open since it will slowdown map/reduce jobs when all tasks open a file in the beginning. I'd like to mark this issue as a non-blocker for two reasons. First I do not think that the chance of getting inconsistent data is high. Even if open may return inconsistent data, dfsClient has a retry mechanism which allows it to recover from any error. Second Dhruba is working on adding fine grain locks to dfs. This issue can be easily resolved after his work is done., I agree with Hairong. I am removing this one from the Blocker list., I think this needs to be fixed for 0.13. I would propose fixing it as Raghu suggests by locking the FSNameSystem for open., Maybe we can make the open method synchronized on the FSNamesystem global lock for the 0.13 release. A more finer-grain lockign odel is part of 1309 and will be scheduled for the following release., I meant "hadoop-1306" and not (hadoop-1309)., This patch makes both open and getDatanodeHints synchronized on FSNamesystem global lock. Similiar to open, getDatanodeHints also access blocksMap, but was not synchronized., +1. Code reviewed., +1

http://issues.apache.org/jira/secure/attachment/12357311/open applied and successfully tested against trunk revision r537939.

Test results:   http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/138/testReport/
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/138/console, I just committed this.  Thanks, Hairong., Integrated in Hadoop-Nightly #90 (See http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Nightly/90/)]