[There's nothing for Yetus to fix here., [~aw] Thanks for your comment. Another incident here. 

https://builds.apache.org/job/PreCommit-HDFS-Build/15707/console

The core failure seems to be some kind of auth failure, I am not sure if it is related to network issues as you are describing.

{noformat}
WARNING: The following packages cannot be authenticated!
  oracle-java8-installer
[91mE: There are problems and -y was used without --force-yes
[0mThe command '/bin/sh -c apt-get -q install --no-install-recommends -y oracle-java8-installer' returned a non-zero code: 100
{noformat}

if this is indeed due to network issues -- would it be possible to either pre-install Java or avoid these hosts from jenkins for a while ? Chris seemed to think this was happening on H2 most of the time.



below is the larger slice of failure stack , in case you want to take a look at it.

{noformat}
The following extra packages will be installed:
  java-common wget
Suggested packages:
  default-jre equivs binfmt-support visualvm ttf-baekmuk ttf-unfonts
  ttf-unfonts-core ttf-kochi-gothic ttf-sazanami-gothic ttf-kochi-mincho
  ttf-sazanami-mincho ttf-arphic-uming firefox firefox-2 iceweasel
  mozilla-firefox iceape-browser mozilla-browser epiphany-gecko
  epiphany-webkit epiphany-browser galeon midbrowser moblin-web-browser
  xulrunner xulrunner-1.9 konqueror chromium-browser midori google-chrome
Recommended packages:
  gsfonts-x11
The following NEW packages will be installed:
  java-common oracle-java8-installer wget
0 upgraded, 3 newly installed, 0 to remove and 0 not upgraded.
Need to get 422 kB of archives.
After this operation, 1042 kB of additional disk space will be used.
WARNING: The following packages cannot be authenticated!
  oracle-java8-installer
[91mE: There are problems and -y was used without --force-yes
[0mThe command '/bin/sh -c apt-get -q install --no-install-recommends -y oracle-java8-installer' returned a non-zero code: 100
{noformat}
, Another one bites the dust -- https://builds.apache.org/job/PreCommit-HADOOP-Build/9691/console

Adding here to keep track of the issue., Yetus doesn't control where jobs get run by individual projects. A few times in HBase we've had to blacklist some of the yahoo! hosts for super bad configurations. Hadoop could use the same jenkins label restriction HBase does, it's named "yahoo-not-h2". But I don't know if y'all expect to have jobs run on other hosts., Docker image comes from hadoop/dev-support/docker/Dockerfile.  Moved issue to HADOOP., [~busbey] Do you have instructions or pointers to how to disable running on these nodes ? may be just avoiding these nodes is a workable solution for now., someone from the Hadoop project with access to change job configs on the ASF build infra would need to update the relevant jobs to limit which nodes they can run on. I haven't dug into the Hadoop jobs enough yet to know which Jenkins features are already used to choose build nodes., Just to provide evidence that it's not a Java download thing:

https://builds.apache.org/job/PreCommit-HADOOP-Build/9697/console
, Thank you for the update. I appreciate it. I agree that it does look like network issue.
 Any suggestions on how we can get this fixed / reduce the incidence of this during builds ?  , Move the gear out of Yahoo. :), I also had a couple of Jenkins failures. Hoping this issue can be fixed soon since it blocks many patches moving forward. Thanks.

HDFS-10514:
https://builds.apache.org/job/PreCommit-HDFS-Build/15728/console
https://builds.apache.org/job/PreCommit-HDFS-Build/15734/console

HDFS-9461:
https://builds.apache.org/job/PreCommit-HDFS-Build/15712/console
https://builds.apache.org/job/PreCommit-HDFS-Build/15722/console
https://builds.apache.org/job/PreCommit-HDFS-Build/15726/console
https://builds.apache.org/job/PreCommit-HDFS-Build/15727/console
]