[Attaching the patch. 

The patch does the following:
 - Removes a dependency on cygwin sed utility to generate build.native ant property (same pattern is used in HADOOP_HOME\build.xml)
 - Sets the missing java.library.path property in the ant contrib test target 
, This looks good to me.  I'll take it for a test run and comment again with the test results as soon as I get some resources for a VM., +1

Do we know which tests will behave differently with or without native library?, Chuan, my plan was to try running {{TestGridmixSubmission}} and check logs to see that {{NativeCodeLoader}} found the library.  Unfortunately, it failed with:

{quote}
13/05/24 10:41:00 ERROR util.Shell: Failed to detect a valid hadoop home directo
ry
java.io.IOException: HADOOP_HOME or hadoop.home.dir are not set.
{quote}

Specifically, I was running "ant -Dwindows=true -Dtestcase=TestGridmixSubmission test-contrib" from the root of the branch-1-win repo.  Ivan, is there something else that we need to do to verify this, or does this look like a problem?, Attaching the updated patch., Thanks Chuan and Chris for reviewing!

Bq. Specifically, I was running "ant -Dwindows=true -Dtestcase=TestGridmixSubmission test-contrib" from the root of the branch-1-win repo. Ivan, is there something else that we need to do to verify this, or does this look like a problem?
I just took a quick look and indeed there is another (slightly orthogonal) problem here. Basically HADOOP_HOME is not set when contrib tests are run resulting in the above error. Looks like we did not catch this problem earlier because we set HADOOP_HOME as part of our build environment initialization. I went ahead and fixed this as part of this Jira since it’s also related to contrib tests on Windows (v2 patch). Good catch Chris!
, +1 for version 2 of the patch.  TestGridmixSubmission passed for me, and I verified in the logs that it loaded hadoop.dll.  Thanks very much, Ivan!, I committed the patch to branch-1-win. Thanks Chris and Chuan for the review!]