[branch-1 patch: removed unused import and converted hostname to lower case., in branch-1.0 fsck uses fetchServiceTicket and there is no useKsslAuth option., in trunk fsck uses spengo and will be fixed by HADOOP-8878, Arpit -you should really use {{toLowerCase(Locale.EN_US)}}, otherwise the case conversion will fail in places where upper/lower case rules are different (example: turkey), @Steve

Thanks for the heads up. I followed the same approach that HADOOP-7988 followed to convert the service principal hostnames to lower case with locale.

My be should open up a different jira to make them all handle locale. Let me know what you think., i meant without locale info in the above comment., once HADOOP-8878 gets committed i will change this patch to use the method in KerberosUtil so we are going through the same code path., updated the patch to use the method in kerberosUtil.getServicePrincipal.

That method uses LOCALE.US in toLowerCase, here is the test patch output

{code}
[exec] 
     [exec] -1 overall.  
     [exec] 
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec] 
     [exec]     -1 tests included.  The patch doesn't appear to include any new or modified tests.
     [exec]                         Please justify why no tests are needed for this patch.
     [exec] 
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec] 
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec] 
     [exec]     -1 findbugs.  The patch appears to introduce 9 new Findbugs (version 1.3.9) warnings.
     [exec] 
     [exec] 
     [exec] 
     [exec] 
     [exec] ======================================================================
     [exec] ======================================================================
     [exec]     Finished build.
     [exec] ======================================================================
     [exec] ======================================================================
{code}

Findbugs warnings are not related to this patch.

No tests added as TestSecurityUtil as appropriate coverage., +1 for the branch-1 change., I committed the patch to branch-1. Thank you Aprit., included in branch-1.1, Closed upon release of 1.1.1.]