[Note this is present in the 2.2.0 package -> current, and also effects Ubuntu 12.04 as well as 14.04, I tried the community built hadoop-2.5.0 in ubuntu 14.04, and the pi job can run correctly.
Here is the environment.
JDK
{code}
ubuntu@master:~/hadoop-2.5.0$ java -version
java version "1.7.0_55"
OpenJDK Runtime Environment (IcedTea 2.4.7) (7u55-2.4.7-1ubuntu1)
OpenJDK 64-Bit Server VM (build 24.51-b03, mixed mode)
{code}
Ubuntu
{code}
ubuntu@master:~/hadoop-2.5.0$ lsb_release -a
No LSB modules are available.
Distributor ID:	Ubuntu
Description:	Ubuntu 14.04 LTS
Release:	14.04
Codename:	trusty
{code}
From your error message:
bq. OpenJDK 64-Bit Server VM warning: You have loaded library /home/ubuntu/hadoop/hadoop-2.2.0/lib/native/libhadoop.so.1.0.0 which might have disabled stack guard. The VM will try to fix the stack guard now.
why have hadoop-2.2.0 here?, sorrr wei, we had reproduced the same problem on both version of hadoop 2.2.0 and 2.5.0.. posted error log for hadoop 2.2.0 but the issue is the same on 2.5.0.

, Wei, did you run your test on a single node or multi-node installation?, Hi, [~asanjar], I run both in a single-node and 3-node environments.
IMO, the error msg seems related to the 32-bit libraries. If I remember correctly, the built libraries in hadoop are built with 32-bit architecture, so we may face some problems when running with 64-bit architecture, like when we enable the cgroups. But normally, the 32-bit built libraries shouldn't cause any problem., I agree with your assumption, it could be related to 64 bit vs 32 bit libraries. However, I would assume for performance reasons build should provide both 64 & 32 bit libraries .
meanwhile we are going to test hadoop on a 32 bit Ubuntu environment to validate the theory ., As a Ubuntu user and developer, how I could help the apache community to fix this problem? could we add a build option to include/build with native 64 bit libraries, only if it is set. I am sure using 64 libraries would improve performance, Moving bugs out of previously closed releases into the next minor release 2.8.0., I'm going to close as a cannot reproduce...it's an old version of Hadoop and it did work on xubuntu for me anyway]