[1) Move Type name constants into SerDe thrift ddl file 
2) Cleanup SerdeInfo object to have only serializationLib (ie name of the class to be loaded) & name as specific fields. Move other properties into generic key/val hash map 
3) Add numbered ids to thrift structures 
4) change the name of the locationURI field of Database object to description 
5) Specify that only range partitioning is allowed 
6) Use isTableExists instead of exception catching 
7) Read jpox config variables from hive-default.xml instead of jpox.properties
8) Change Partition.getPath() return a single path instead of list of paths., 9) Add unit tests for stand-alone & thrad-safe metastore server, can you update the description with the tasks since that gets sent along with emails?
, We are referring to lists as arrays for all user facing statements...

Inline Comments:
ql/src/test/results/clientpositive/input3.q.out:2: We should stick to array. The last feedback that we got from the analysts was that array is more intuitive than lists.
metastore/src/java/org/apache/hadoop/hive/metastore/MetaStoreUtils.java:276: list to arrays
metastore/src/java/org/apache/hadoop/hive/metastore/MetaStoreUtils.java:332: Call this default instead of d? , +1

looks good., need to update some files, after resolving conflicts., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12390401/hadoop-4175-2.patch
  against trunk revision 696846.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 12 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3314/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3314/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3314/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3314/console

This message is automatically generated., The test failures are not related to this patch. The failed tests are all in the mapred/scheuduler area. I see the same tests failing for other patch submissions. Unless somebody thinks otherwise, I will commit this patch later today., Please do NOT commit this patch. This patch is included in http://issues.apache.org/jira/browse/HADOOP-4205.
, The patch is included and committed with http://issues.apache.org/jira/browse/HADOOP-4205]