[A port of the HADOOP-7101 patch to branch-1 can be found at,

https://github.com/mattf/hadoop-common/commit/c639ce0ec3cd57571bf73010f767f32962dfd509

While I did red-green test it (-Dtestcase=TestUserGroupInformation passes before addition of unit test, fails after addition of unit test, passes after addition of the patch). I would like Claus to verify it fixes his specific instance of this issue., [~cibsen@e-ma.net] Can you please point to where in 0.20 branch this code has been merged to?, BTW the port of HADOOP-7101 was straightforward. I am going to to just merge the change from that to branch-1 as a part of that jira., Suresh, I am not a Hadoop committer. I am just an end user who suffered from this issue and reported / responded on these tickets. I cannot point you to the code base / branch. That is the Hadoop team who knows where their code lives.




, Suresh, see HADOOP-7101 this ticket had fixed version marked as 0.22.0. And I take that as the fix went in that branch/release.

The problem is that this fix never went into any of the 1.x branches.

See more details by Torsten who commented at HADOOP-7101, I only found the HADOOP-7101 on the 0.23.0 and later branches/tags

$ git tag --contains 5cbfd7c039a4810fae58f2d53b0e9cf0cd307fcf | head -n3
release-0.23.0
release-0.23.0-rc0
release-0.23.0-rc1

The fix, marked 0.22, may be in error., [~farrellee] Thank you for pointing out the releases and clearing things.

bq. Suresh, I am not a Hadoop committer. I am just an end user who suffered from this issue and reported / responded on these tickets. I cannot point you to the code base / branch. That is the Hadoop team who knows where their code lives.
That is reasonable. However, in several comments you indicated the release as 0.2. This is indeed a release from may be 5-6 years ago and is not in use any more. My reason for asking you to point out the release is to understand the exact release you are talking about, so that I can out figure the release you were pointing out. When pointing out the issues, using the right release numbers would help.

I also think there may be some confusion around release numbering and upgrade paths. It indeed is confusing.
* Hadoop community decided to call the release 0.20.205 as 1.0 due to its stability. It is off of 0.20 branches.
* 0.22, 0.23 and 2.x are later releases. These are off of the branches that come after 0.20. Hence upgrade from 0.22 or 0.23 to 1.0 is going from a later release to a release based on older branch. The right upgrade path is to go from 0.23 to 2.0. Going from 0.23 to 1.0 is not a supported upgrade path.

bq. The problem is that this fix never went into any of the 1.x branches.
Based on the above explanation, not all the major fixes go from 0.23 and 2.0 releases to 1.x release. Only the issues that are flagged by the community as important goes to 1.x releases. , Old JIRA for branch-1, resolving.]