[In FileSystem.Cache.get, if fs is null and cache is empty, a shutdown hook is added to close all filesystem. 

When Namenode is down and Jobtracker wants to connect, Filesystem cache being empty,  the shutdown hook was added during the first trial. Since NameNode is down, createFileSystem fails. When the jobtracker tries again, fs is null and cache is still empty; so, it wants to add shutdown hook again . Thus there is IllegalArgumentException saying Hook previously registered.
The solution could be add addShutdown hook once createFileSystem succeeds. Here is a patch doing the same., -1 overall.  Here are the results of testing the latest attachment 
http://issues.apache.org/jira/secure/attachment/12378484/patch-3027.txt
against trunk revision 619744.

    @author +1.  The patch does not contain any @author tags.

    tests included -1.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    javadoc +1.  The javadoc tool did not generate any warning messages.

    javac +1.  The applied patch does not generate any new javac compiler warnings.

    release audit +1.  The applied patch does not generate any new release audit warnings.

    findbugs +1.  The patch does not introduce any new Findbugs warnings.

    core tests +1.  The patch passed core unit tests.

    contrib tests +1.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2036/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2036/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2036/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2036/console

This message is automatically generated., +1 thanks, Amareshwari!, This shouldn't require a testcase. 
I just committed this. Thanks, Amareshwari!, Integrated in Hadoop-trunk #441 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/441/])]