[Changed component to 'fs'. These don't look like DFS files., Even I see these errors now a days. I see these errors for a bunch of machines across jobs. So I thought it was due to bad disk/sector., These errors are not new and is caused due to bad disks. The framework handles them by reexecuting tasks on other nodes. I don't think this is an issue with the framework (unless there are problems with the implementation of the checksum system which i doubt)., I doubt if these are real disk problems. Same disks are used for DFS files also, we should see multiple blocks deleted due to these errors in NameNode log if that is the case.
, We should track where these problems occur. Are these occuring on random hosts across multiple jobs for a particular set of machines or do they happen on specific machines. That should give some direction - if they happen on specific machines we can do a health check on all the disks of those machines..., One user reported this problem.

2 checksum error happen on the same node.  Although checksum failure happen at different time,

On a single node, 

Task task_200803121849_0433_r_000208_0
2008-03-15 05:28:35,738 INFO org.apache.hadoop.fs.FSInputChecker: Found checksum error: org.apache.hadoop.fs.ChecksumException: Checksum error: /tmps/3//mapred-tt/mapred-local/task_200803121849_0433_r_000208_0/map_8850.out at 8437760

and 

Task 
2008-03-15 05:27:11,025 INFO org.apache.hadoop.fs.FSInputChecker: Found checksum error: org.apache.hadoop.fs.ChecksumException: Checksum error: /tmps/3//mapred-tt/mapred-local/task_200803121849_0433_r_000047_0/map_10813.out at 4214784

but merging of these files seem to happened before almost at the same time on the same disk.

2008-03-15 05:18:31,720 INFO org.apache.hadoop.mapred.ReduceTask: task_200803121849_0433_r_000208_0 Merge of the 786 files in InMemoryFileSystem complete. Local file is /tmps/3/mapred-tt/mapred-local/task_200803121849_0433_r_000208_0/map_8850.out

and 

2008-03-15 05:18:26,157 INFO org.apache.hadoop.mapred.ReduceTask: task_200803121849_0433_r_000047_0 Merge of the 788 files in InMemoryFileSystem complete. Local file is /tmps/3/mapred-tt/mapred-local/task_200803121849_0433_r_000047_0/map_10813.out

Could this be related?

, The first stack trace indicates that the checksum error appears while serving the map output while the second is in the reduce phase. But in both the cases the file resides on the same disk (#4)! 
This is also true for the log messages from Koji  (disk #3). I think its a disk related problem. I haven't seen this error with trunk for long. Can some verify this? Can someone attach logs so that it can be analyzed further?, Several Pig users see this problem persistently after the upgrade of Mitril to hadoop 16.

Do we know when this issue is going to be resolved? Thanks., This was probably resolved at some point long ago. Gone stale now, and doesn't seem to occur anymore.

Marking resolved as can't reproduce.]