[I will be starting with getting streaming to use apache commons-cli parser as in HADOOP-675, Sanjay, please take at look at APIs in commons-cli 2., I have the cli2 implementation in place, there is one issue with cli2 which is holding it back. Command line arguments with -jobconf and -env get merged in the same properties set in CLI's parser and after parsing we dont know what property was passed with which trigger. 
I have raised on CLI jira CLI-126. I'll submit the patch once i resolve this one.. 

(http://issues.apache.org/jira/browse/CLI-126) in case auto link doesnt work for other projects. , Moved input path ( glob pattern ) checks and errors to JobClient as part of HADOOP-619 and removed from streaming. Also job client converts the patterns into actual files and writes back to jobconf . InputFormatBase is changed to accept files as input also. Will submit the patch in a while. 
comments ? , This patch replaces commandline processing with apache CLI2. 
Input validation is not done as part of this patch as thats moved to JobClient now. It validates -mapper, -reducer, -combiner, -file attributes to be files present and accessible on disk. 
It doesn't validate a file to be an executable, that is not available through java File API until Java 6. For now it runs "chmod +x" on the file if its present and accessible. 
comments?
, does the patch address the case where the mapper or reducer are not shipped as part of the command?
arguments to -file should be verified locally, but arguments to -reducer and -mapper should be verified against the cluster nodes, unless listed under -file.
, Yoram: This patch doesnt take care of the fact that mapper and reducer are not shipped along. There are couple of other open issues which should take care of that - HADOOP-805 and HADOOP-797, Updated patch, now it doesnt check for -mapper/reducer/combiner on localdisk of submit node. it runs chmod 0777 on -files and if after that files is not readable/writable/exists it throws error. 
, Sorry this patch has sat idle so long!

I tried this patch out and it messed up the usage. In particular, with no options it should print the usage:

oom@cdev6009> bin/hadoop jar build/hadoop-streaming.jar
07/01/05 11:19:58 ERROR streaming.StreamJob: Missing required option -input
Required argument: -input <name>

With -help it is a little better, but the old usage was far nicer to read:

oom@cdev6009> bin/hadoop jar build/hadoop-streaming.jar -help
07/01/05 11:20:43 ERROR streaming.StreamJob: Unexpected -help while processing -input|-output|-mapper|-combiner|-reducer|-file|-dfs|-jt|-inputreader|||-cacheFile|-cacheArchive|-verbose|-info|-debug|-inputtagged
Required argument: -input <name>
, Sorry this patch got hung up for long. Here is an updated version. 

CLI2 help printing is buggy and I couldnt get it to print proper messages, so reverted back to original print messages. As such we dont get some great improvement by using CLI2 here. The code for checking for validating input paths is already moved to the mapred job client now as part of HADOOP-619. 
, Looks like Sanjay has done the whole nine yards here; any feedback?, +1, because http://issues.apache.org/jira/secure/attachment/12350384/Hadoop-476_1.patch applied and successfully tested against trunk revision r506778., I just committed this.  Thanks, Sanjay!]