[TestSocketIOWithTimeout uses a block size of 4192 bytes to simulate a partial write. This seems to be a valid in x86 architecture where the default minimum blocksize is 4096. 
This testcase fails in PowerPC where the default minimum block size is 65536 bytes (64KB). So for PowerPC, using a blocksize little more than 64K , say 65632(65536 + 96) holds good for this scenario.
I attached a patch here where i made it very general by introducing NativeIO.POSIX.getCacheManipulator().getOperatingSystemPageSize() to get the page size.
I tested my patch in both ppc64 and x86 linux machines., Any update on this defect ?, {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12686812/HADOOP-9627-v1.patch
  against trunk revision bda748a.

    {color:green}+1 @author{color}.  The patch does not contain any @author tags.

    {color:green}+1 tests included{color}.  The patch appears to include 1 new or modified test files.

    {color:green}+1 javac{color}.  The applied patch does not increase the total number of javac compiler warnings.

    {color:green}+1 javadoc{color}.  There were no new javadoc warning messages.

    {color:green}+1 eclipse:eclipse{color}.  The patch built with eclipse:eclipse.

    {color:red}-1 findbugs{color}.  The patch appears to introduce 3 new Findbugs (version 2.0.3) warnings.

    {color:green}+1 release audit{color}.  The applied patch does not increase the total number of release audit warnings.

    {color:green}+1 core tests{color}.  The patch passed unit tests in hadoop-common-project/hadoop-common.

Test results: https://builds.apache.org/job/PreCommit-HADOOP-Build/5254//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-HADOOP-Build/5254//artifact/patchprocess/newPatchFindbugsWarningshadoop-common.html
Console output: https://builds.apache.org/job/PreCommit-HADOOP-Build/5254//console

This message is automatically generated., Findbugs warnings are unrelated to this patch., Hello [~Ayappan].  Thank you for posting this patch.

This issue had been created as a follow-up to HADOOP-8982, which skipped a portion of the test when running on Windows.  The scope of the current issue is intended to re-enable that portion of the test on Windows after figuring out in detail the test assumptions that do not hold true on Windows.

It sounds like you've found a new problem.  I'm going to change the title of this issue to clarify that it is specific to Windows.  I recommend filing a new issue for the PowerPC problem that you found and attaching your patch there.  If you want to notify me on that new issue, I'd be happy to code review and commit for you.  The change looks good to me., Hi Chris, i opened a new issue HADOOP-11462 and attached the patch over there., Moving bugs out of previously closed releases into the next minor release 2.8.0., \\
\\
| (x) *{color:red}-1 overall{color}* |
\\
\\
|| Vote || Subsystem || Runtime || Comment ||
| {color:red}-1{color} | patch |   0m  0s | The patch command could not apply the patch during dryrun. |
\\
\\
|| Subsystem || Report/Notes ||
| Patch URL | http://issues.apache.org/jira/secure/attachment/12686812/HADOOP-9627-v1.patch |
| Optional Tests | javac unit findbugs checkstyle |
| git revision | trunk / d3797f9 |
| Console output | https://builds.apache.org/job/PreCommit-HADOOP-Build/7093/console |


This message was automatically generated., patch wont apply as HADOOP-11462 contained the same patch]