[On a related note, we should really use CheckStyle (http://checkstyle.sourceforge.net) to enforce the coding styles. Currently, when I run checkstyle (with sun's style conventions, which we use for Hadoop) I get tons of warnings on almost each and every source file.
, CheckStyle is LGPL, so cannot be included in an Apache project.

I would not oppose someone submitting a patch that adds style checking to the "test" target, so that tests fail if style is incorrect.  In general, the "test" target should test for patch acceptability., Could the "test" target use CheckStyle? I notice Apache Jetspeed uses it (http://portals.apache.org/jetspeed-1/code-standards.html)., > Could the "test" target use CheckStyle?

Sure.  We cannot include the checkstyle jar in svn, so it should be optional.

> I notice Apache Jetspeed uses it

Looking at:

http://svn.apache.org/viewvc/portals/jetspeed-1/trunk/build/build.xml?view=markup

Checkstyle looks to be optional and is only used if the developer has independently downloaded and installed checkstyle.  One could instead make build.xml download checkstyle, but that's frowned on., Irrational fear of a second return has lead to lots of unnecessary code branches, in my experience. I'd rather see a return early in a function that a nested if branch that includes the rest of the body of the function., The patch is available., +1, because http://issues.apache.org/jira/secure/attachment/12349851/hadoop-948.patch applied and successfully tested against trunk revision r503864., This purports to improve the style, yet it does not conform to Hadoop's stated style guidelines.  In particular, Hadoop prefers code that indents two spaces per level, and this patch adds new code that indents four-spaces per level., The rest of the metrics package also uses 4-space indentation.  It would not be useful to change just one method in one class to use the Hadoop 2-space indentation convention - the whole package should be changed at once.  At the same time, the excess carriage-return characters that got in there should be removed, but there shouldn't be any code changes.

Alternatively, we could consider switching hadoop over to the de-facto industry standard which is a 4-space indentation.  
, Oops, I think we sneaked this change in accidentally in another patch.  Sorry.  This issue can be closed now.
, This was included in HADOOP-954.]