[One challenge here is that we aren't going to easily tell if an FS is an object store, not unless HADOOP-9565 or equivalent gets in, [~stevel@apache.org] Thanks for your comment.
Yes you're right, it would be difficult to distinguish object store unless HADOOP-9565 is committed. Since the jira is halted for a long time, do you have any idea when the jira can move on so that I can fix this issue?, no, no timetable.


What would be good would be some special section in {{hadoop-common-project/hadoop-common/src/site/markdown/FileSystemShell.md}} on "fs shell commands and object stores"

* why you can get not found exceptions on an {{-fs ls s3a://bucket }} URL if you leave off the trailing /  (it's because there's no homedir, and the shell assumes its a relative path)
* distcp atomic not working
* why you should use {{fs -put -d}} to upload files without the rename
* why you should use {{-skipTrash}} when deleting things
* why you shouldn't put secrets in the URLs, e.g.  s3n://awsId:secret@mybucket/

Looks also like the document doesn't even mention put's -d and -f options, so it could do with a quick comparison of what usage info gets printed in a {{hadoop fs}} message and what the docs say, updating the docs.

Would you be willing to do this?, HADOOP-13655 covers the JIRA for documenting the issue; this one looks at the software side of things, [~stevel@apache.org] Sorry for the late response, I'm quite busy last week.
Yes, I'm glad to do the job. I will focus on the items you mentioned in comment 3 and update HADOOP-13655.
Thanks for your comment., Actually, I did the writeup this weekend anyway; I was testing some of the latest S3a changes and distcp/FS shell, so went through and updated the docs.

Have a look at the pull request and review the text: your comments there will help get the docs into a shape for everyone to find useful, after which we can commit it to Hadoop 2.7.4+, [~stevel@apache.org] Sure, thanks for your effort., having been playing with distcp, I consider HADOOP-15281 a priority item as it means that every upload forces a rename of data, even without the -atomic operator]