[[~eyang] - IMO, we need to revert both HADOOP-14077 and HADOOP-13119 and then determine whether to address the original issue.

Let's please be clear on what that problem is - can you verify whether the following summarizes it properly?
 # There are deployments that only allow access through a single proxy entry point
 # Some resources that are accessible through proxies should only be accessible for admins
 # Proxyuser enforcement is generally used to restrict proxies from impersonating admins and super users for obvious reasons

Due to the paradox created by the facts in 2 and 3 above we have the following situation, we need to decide whether we should either:
 # Disable certain paths for proxy users as they are intended only for direct access by authenticated users and deployments described in #1 above are out of luck
 # Open the proxyuser enforcement rules to allow admin access for specific paths

Personally, I don't believe that the fact that certain resources can't be accessed in deployments that only allow impersonation means that we should redefine the proxyuser enforcement strength.

I think that it is valid to consider strengthening the proxyuser enforcement to deny access to specific sensitive resources.

Whether or not certain resources are too sensitive for impersonation can be left up to the deployment., [~lmccay] Thank you for the summary.  This is aligned with the original problem statement.  Role based ACL in standard J2EE web application would be the right approach to solve the authorization problem.  User can describe in web.xml which url resource are allowed by roles.  Roles are mapped to groups of users.  It would be nice to do the same in Hadoop.  Hadoop web applications don't quite follow J2EE design pattern.  This made the problem hard to solve for Hadoop.  We can start by turning Hadoop jetty Java code back to configuration, and maps to roles.  In doing so, we might finish in 2-3 years of hard labour.  There might be better ways to resolve this issue that we need to explore.

HADOOP-13119 is back ported to Hadoop 2.8.x as a new feature in Hadoop 2.8.  Do we revert HADOOP-13119 from 2.8.x or we keep HADOOP-13119 as the temp solution until the new work is completed?, Revert it from all branches and put it back to proper proxyuser rules enforcement.

Also, we should add the block of a configurable set of resources so that they can't be accessed via impersonation since impersonation isn't intended for admin users and some resources may be considered sensitive enough to limit to admins.

We can then have a discussion on whether we want to extend impersonated to admins or not.

I personally don't think we should but perhaps it can be controlled enough with proper config.

 , [~lmccay] Sorry, until a better proposal is feasible to secure /log and /jmx, there is no good enough reason to justify the revert of HADOOP-13119.  [~arpitagarwal]'s report was not valid on HADOOP-13119, and HADOOP-13119 does provide better security for authorized users than anonymous to access /log.  I can not agree on the revert on HADOOP-13119 at this time.
, Today, hadoop offers two roles, cluster admin, and normal users.  New system monitor role might be required for separation of duty for service hosting companies.  The following table shows a rough sketch of roles required to map to Hadoop web applications:

HDFS
| /logs | cluster admin |
| /jmx | system monitor |
| /conf | cluster admin |
| /stacks | system monitor |

YARN
| /logs | cluster admin |
| /jmx | system monitor |
| /conf | cluster admin |

This separation will prevent leaks of customer information.]