[Patch to fix this based on the same pattern pattern utilized by hadoop-mapreduce-project\pom.xml and hadoop-common\pom.xml, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12521000/FixPackageBuild.patch
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-HADOOP-Build/812//console

This message is automatically generated., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12521081/FixPackageBuild-CommonPart.patch
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-HADOOP-Build/815//console

This message is automatically generated., Per conversation on common-dev: the Hadoop QA can't apply this patch because it runs from a sub-directory, and this patch changes things under hadoop-dist.
The manual testing I did: successfully built using the command "mvn clean package -DskipTests -Pdist -Dtar" under Windows with this patch and the one in MAPREDUCE-3540, and got a single-node cluster up & running. Note that unit tests and some basic functionality (e.g. running MR jobs) are still broken in my Windows environment - which should hopefully be fixed in future JIRA's., Hi Mostafa,

I do not have a Windows env. ready to test this out, but the changes seem to be straight-forward when looking at it. Does this cover out all packages on trunk today, then?

Can you also add a few words on the reason why you've made the switch from the project dir to the base dir specifically, just so we have a record?, Thanks Harsh. Yes, after applying this and MAPREDUCE-3540 I can (almost) build all of the packages in trunk today on Windows. The one that's still giving me trouble is hadoop-dist on Windows 8 because of the Cygwin cp permissions behavior (see StackOverflow thread [here|http://stackoverflow.com/questions/8421049/how-to-use-cp-exe-from-cygwin-and-preserve-permissions]), but that's another issue.

I didn't switch from project dir to base dir, all this patch does is make sure to use cygpath in Windows., this doesn't happen on trunk (which builds happily on windows), so closing as cannot reproduce]