[Will hdfs://host:port also work with Hadoop 0.16 ?, I meant this to be an issue for hadoop 0.17. Would we want HOD in contrib of 0.17 to work with hadoop-0.16? In  that case (though I have not tried it) am not sure. need to test it., bq. Would we want HOD in contrib of 0.17 to work with hadoop-0.16? 

I don't know currently if it is a requirement. Will check and get back. However, if the answer is a Yes to my question, we don't even have to check. Can you please test it nevertheless ?, Attaching a patch. This prepends "hdfs://" to fs.default.name in the hadoop-site.xml generated both on client and server sides. Also verified that the hdfs://host:port format generated works with Hadoop 0.16 too.

With this patch, client commands no longer print the deprecation message. All,  except hadoop jar command which is still doing the same despite changing the fs.default.name to use this URI format. This might be because there are other places in hadoop which are still using the deprecated host:port format instead of the URI format. Another place where I've seen this is hadoop logs pointing to NameNode initialization time.

The same format fs.default.name is now being generated by HOD not only on JT, TT and client side, but *also* on NN and DN, which seems to work fine, but is that ok, Mahadev?, - In hodcleanup, we generate a temporary hadoop-site file for uploading the hadoop logs. The change should reflect here also.
- We need unit tests for this, as HADOOP-2775 is now committed. *smile*

Otherwise, patch looks good. I verified it works fine for HADOOP 0.15 as well.

Can someone please check why hadoop jar prints the warning message on using the deprecated file system URI format, even though fs.default.name is set to hdfs://host:port ?,     *  Not making the change In hodcleanup since, as part of fix for HADOOP-2899, we are doing away with generating hadoop-site.xml in hodcleanup.
    * Added unittests.

Submitting the patch.

Will check why hadoop jar still prints these warning messages.
, Submitting the patch., bq. Not making the change In hodcleanup since, as part of fix for HADOOP-2899, we are doing away with generating hadoop-site.xml in hodcleanup.

... which I just submitted... *smile*, One small problem. The test cases in testHodRing.py are leaving behind the confdir and logdir directories under /tmp/hod-username/test_HadoopCommand_tempDir. These should be removed.

Another thing is in testHadoop.py, we don't seem to be using the testingDir variable anywhere. Should we remove it ?

Otherwise, +1. Functionality is fine. Verified with trunk that the warnings are now gone., +1 overall.  Here are the results of testing the latest attachment 
http://issues.apache.org/jira/secure/attachment/12378252/HADOOP-2936.1
against trunk revision 619744.

    @author +1.  The patch does not contain any @author tags.

    tests included +1.  The patch appears to include 8 new or modified tests.

    javadoc +1.  The javadoc tool did not generate any warning messages.

    javac +1.  The applied patch does not generate any new javac compiler warnings.

    release audit +1.  The applied patch does not generate any new release audit warnings.

    findbugs +1.  The patch does not introduce any new Findbugs warnings.

    core tests +1.  The patch passed core unit tests.

    contrib tests +1.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2005/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2005/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2005/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2005/console

This message is automatically generated., Given that the functionality is in place, and only the tests need to be slightly changed, we should go ahead with committing. I will file a separate JIRA for changes to the test cases, I just committed this. Thanks, Vinod!, Integrated in Hadoop-trunk #434 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/434/]), Integrated in Hadoop-trunk #435 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/435/])]