[Attaching a patch.

On client side, hadoop-tmp-dir is now created under hod.temp-dir/user.jobid/ and dfs.client.buffer.dir in hadoop-tmp-dir/dfs/tmp. On daemons side, hadoop-tmp-dir is created under work-dirs/...../hadoop-tmp, everything else remains unchanged., Thanks for confirming the requested priority. Please let  me know if you need more details.

+1 for making the change.
, Attaching two patches: HADOOP-3103.for.16 and HADOOP-3103.for.17.
   * The patch for Hadoop 17 has testcases, while the one for Hadoop 16 doesn't (and it cannot have, 'coz the testcase framework is not there in 16).
   * testcases are written for verifying the presence of the parameter only on the client side. Testcases for server side are more involving. Skipping them for now, seems ok, 'coz, as of now, the parameter is not going to be used at all on the server side.
   * As per Hemanth's comments(outside Jira), making hadoop.tmp.dir as a single value parameter instead of a comma separated list, which seems to be how hadoop.tmp.dir is being used currently.
   * Hadoop.tmp.dir *is* marked final on daemons side, so client side config parameter won't override this on the server side., This patch for 16 seems to be not against the branch. Can you pl. regenerate., Pch.. Stupid mistake. Reattaching both patches again., +1 for the patch. Validated against both 16 branch and trunk. Verified the hadoop.tmp.dir value is set to the hod.temp-dir and dfs.client.buffer.dir is set to hadoop.tmp.dir/dfs/tmp. Verified also that while running a job, the jar file is expanded in this directory, and it is cleaned up at the end., Running through hudson., -1 overall.  Here are the results of testing the latest attachment 
http://issues.apache.org/jira/secure/attachment/12378704/HADOOP-3103.1.for.17
against trunk revision 619744.

    @author +1.  The patch does not contain any @author tags.

    tests included +1.  The patch appears to include 3 new or modified tests.

    javadoc -1.  The javadoc tool appears to have generated 1 warning messages.

    javac +1.  The applied patch does not generate any new javac compiler warnings.

    release audit +1.  The applied patch does not generate any new release audit warnings.

    findbugs +1.  The patch does not introduce any new Findbugs warnings.

    core tests +1.  The patch passed core unit tests.

    contrib tests +1.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2078/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2078/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2078/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2078/console

This message is automatically generated., Console output shows that javadoc warnings are related to src/java/org/apache/hadoop/net/SocketInputStream.java:137 and src/java/org/apache/hadoop/net/SocketOutputStream.java:132. There appear to be two javadoc warnings thus, but the final results report only one (??).

In any case, the warnings are not pertinent to this patch. Patch is committable., I just committed this. Thanks, Vinod!, Integrated in Hadoop-trunk #444 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/444/])]