[I suspect this is more of a drawback of the TestMiniMRWithDFS than the MR-framework itself...

MiniMrCluster.waitUntilIdle checks for any 'running' tasks on the TaskTracker... post HADOOP-840 the TaskTracker the cleanup actions are queued and are done offline, which the test-case isn't aware of ; which I suspect leads to a timing issue where the TaskTracker is rightly *idle* and the 'cleanup thread' hasn't kicked in yet...

Should we add a 'sleep' in MiniMRCluster.waitUntilIdle or perhaps another api to check if the job has finished and has been cleaned-up? Thoughts?, I've fixed org.apache.hadoop.mapred.TaskTracker.isIdle() to check if there are tasks waiting to be cleaned-up; what do you guys think of this approach - this is 'correct' according to the existing documentation of TaskTracker.isIdle(); however it means that TaskTracker.offerService() now waits for cleanup to complete before asking the JobTracker for new tasks (which is what the comment in offerService() is explicit about too)...

In all, this is a fix for TaskTracker.isIdle() - thoughts?
, +1, Thanks for the review Owen., -1, because the javadoc command appears to have generated warning messages when testing the latest attachment (http://issues.apache.org/jira/secure/attachment/12349364/HADOOP-912_20070122.patch) against trunk revision r497927. Please note that this message is automatically generated and may represent a problem with the automation system and not the patch., I'd wager the javadoc warning wasn't related to this patch, and seems like HADOOP-916 fixed it..., +1

The automated Hadoop QA process got tripped up on the javadoc warnings introduced by the HADOOP-908 patch.  The process didn't catch those warnings because a new patch was added (and committed) after Hadoop QA had already tested the first patch.  A clear deficiency in the automated patch test system is that it tests the latest patch on a JIRA *only* when the state goes from Open to Patch Available the *first* time., -1

I'm still seeing the same failure (although much less often) with this patch., I'll take a second look, needs another fix I think..., +1

This morning, I can't reproduce the problem anymore w/ this patch.  I vote to commit it., Thanks for verifying Nigel... this patch fixes a real bug in TaskTracker.isIdle() which, at the very least, leads the TT to ask the JT for a new task too early. I vote we commit this and take up any further issues as a separate bug., I just committed this.  Thanks, Arun!, +1

The automated Hadoop QA process is getting tripped up on the javadoc  
warnings introduced by the HADOOP-908 patch.  The process didn't  
catch those warnings because a new patch was added (and committed)  
after Hadoop QA had already tested the first patch.  A clear  
deficiency in the automated patch test system is that it tests the  
latest patch on a JIRA *only* when the state goes from Open to Patch  
Available the *first* time.



]