[Attaching a patch that
1) Pass the conf when compressor is created
2) One test case to make sure no compression is done when NO_COMPRESSION is being set.
3) Added one extra check in codectest which compare the original and compressed output.  Not directly related to this Jira.  , +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12440413/HADOOP-6669-0.patch
  against trunk revision 927979.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/436/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/436/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/436/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/436/console

This message is automatically generated., Hm. Didn't know that native library is not used in hudson testing.

My unit test was testing
1) gzipcodec-native
2) defaultcodec-native
3) defaultcodec-non-native

(1) and (2) are skipped in hudson testing.

Hudson testReport showing
bq. 2010-04-01 00:15:52,882 WARN  compress.TestCodec (TestCodec.java:testCodecInitWithCompressionLevel(373)) - testCodecInitWithCompressionLevel for native skipped: native libs not loaded

Testing manually, (2) and (3) failed without the patch and succeeded with the patch.
, +1

I committed this. Thanks, Koji!, Backport to y20]