[The second bug is my fault. My patch for HADOOP-6591 was based on a patch for a version of hadoop 0.20 that didn't have fileStatusesIndex(). It doesn't break anything because we haven't committed the patch that generates the v2 files. However, it does prevent that patch from passing the unit tests., Unfortunately the unit tests for HarFileSystem must be inside MAPREDUCE, since that is where HadoopArchives (the archive creation tool) resides., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12439255/HADOOP-6645.patch
  against trunk revision 923619.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/422/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/422/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/422/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/422/console

This message is automatically generated., Mahadev, Nicholas, can one of you take a quick look at this patch? It's a simple one and I've already tested it with TestHarFileSystem., {code}
-      String parentString = parent.getName();
+      String parentString = parent.getName() + Path.SEPARATOR;
{code}

rodrigo,
  do the tests fail without adding the Path.SEPERATOR? Why is it necessary to append a path.separator?, Thanks for looking at it, Mahadev!
If we don't add the separator, the selection if will pass for /fooo/bar2 when we ask to list the contents of /foo in the example I gave in the JIRA description. Adding Path.SEPARATOR makes sure that we only select children of the right parent, and not children of a parent that is an extension of the right one.

The current unit tests don't cover this case... However, unit tests are in the MAPREDUCE project and I can't add them in HADOOP patches like this one. To avoid errors, we have to commit this patch first and then add new unit tests to MAPREDUCE. :-(, good catch rodrigo. Sorry just skimmed through the description and thats why the stupid question above! :) 


+1 for the patch. , also, are you adding test case to MAPREDUCE-1585 ? It would be good to have a good test case for the above!, Yes I am. I just haven't had the time to upload the new patch yet.

It's a good test case to have., I just committed this. thanks rodrigo!, Integrated in Hadoop-Common-trunk-Commit #208 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Common-trunk-Commit/208/])
    .  Bugs on listStatus for HarFileSystem (rodrigo via mahadev)
, Integrated in Hadoop-Common-trunk #285 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Common-trunk/285/])
    .  Bugs on listStatus for HarFileSystem (rodrigo via mahadev)
, It seems that TestHadoopArchives in mapred is failing after this., I'm checking it., I think I found the problem.

My bad! I tested it against my local version of mapreduce, in which I had taken TestHadoopArchives out. I'm reopening the task and will submit a new patch, after I do some extra testing., I didn't cover the case in which the parent directory is "/", This new patch should fix the problem., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12439606/HADOOP-6645.hotfix.patch
  against trunk revision 926421.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 common tests.  The patch failed common unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/428/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/428/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/428/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/428/console

This message is automatically generated., trying hudson again!, rodrigo,
 the tests still fail for me. Are you sure it fixes the tests for you?, Yes, they passed for me.

It's a bit tricky to test things from a different hadoop-common jar, though. For ant to take the right file I had to run "ant mvn-install" on my hadoop-common install. Thencleared the jar inside ~/ivy2/cache/... (this is very important), went to my hadoop-mapreduce install and ran "ant test -Dresolvers=internal -Dtestcase=TestHadoopArchives".

Did you do all that too?, I tried a short cut of copying hadoop-core.jar from the common build to build/ivy/lib..... looks like ivy does some weird thing where it replaces it with the one fetched from ivy cache. but clean up everything and use maven install seems to work.... I wonder why we have to use ivy for all this (maven all over would have been a better choice).... , Yes, ivy does replace things from its cache. I was running into this problem before I learned the maven tricks with ivy cache deletion., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12439606/HADOOP-6645.hotfix.patch
  against trunk revision 926421.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/429/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/429/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/429/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/429/console

This message is automatically generated., Mahadev, Nicholas, Can one of you just double check if this new patch passes the TestHadoopArchives test? I've already tested it in my machine but with this whole ivy/maven complexity, I would feel more comfortable if someone else checked it (so that I don't break trunk once more).

Feel free to commit the patch afterward, if you think it's okay., rodrigo, 
 I ran the tests on mapreduce with this patch and the test passes!, Great! Can you commit it?, I just committed this. thanks rodrigo!, Integrated in Hadoop-Common-trunk-Commit #209 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Common-trunk-Commit/209/])
    . Re: Bugs on listStatus for HarFileSystem (rodrigo via mahadev)
, Integrated in Hadoop-Common-trunk #287 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Common-trunk/287/])
    . Re: Bugs on listStatus for HarFileSystem (rodrigo via mahadev)
]