[patch for review; ensures all resources are closed using IOUtils
, Bill, I see you are cleaning up when something fails 

+      InputStream in = null;
+      try {
+        in = srcFS.open(src);
+        IOUtils.copyBytes(in, new FileOutputStream(dst), conf);
+      } catch (IOException e) {
+        IOUtils.closeStream(in);
+      }

but shouldnt the exception be rethrown?
, patch for review

updated patch to rethrow exceptions, and replaced some loops with foreach, This is Bill's patch with the same filename as the original patch, and some (minor) spacing changes in the assignment operators. , submitting Bill's patch for hudson to play with., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12386180/HADOOP-3592.patch
  against trunk revision 677470.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2883/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2883/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2883/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2883/console

This message is automatically generated., bq. This is Bill's patch with the same filename as the original patch, and some (minor) spacing changes in the assignment operators.

To preserve the relevant history, whitespace and style changes are generally deferred until the lines are changed for a purpose. Are any of the differences between the updated and the original patches specifically related to this JIRA?, -the whitespace changes were only in the new lines bill had added; just spacing them apache style
-the original patch cleaned up on failure, but didnt rethrown the exception; this version does.

, Sorry, I'd missed that Bill had uploaded two patches and you had modified the second and removed his updated version. Thanks for reviewing this.

Most of these changes modify style, not functionality, but many are useful cleanups. +1, I just committed this. Thanks Bill and Steve, The patch committed breaks TestCLI.  See HADOOP-3809., Reverting the patch. 

There are multiple issues with the patch :

# Unit test TestCLI failed during Hudson for this jira and is caused by it.
# Patch committed is not same as the patch attached (check svn revision 678692).
# Code clean ups are useful but we need to be really careful and review every change. E.g.
#* This patch replaces lot of  {{'inorout.close()'}} calls with {{IOUtils.closeStream(inorout)}}, which is pretty dangerous.
#* {{closeStream()}} should only be used if you want to ignore exceptions from close(). i.e. what happens when {{out.close()}} fails in {{copyMerge()}}? You could end up with truncated file.
#* I think every other code clean up should be carefully reviewed.
 , {quote}
Unit test TestCLI failed during Hudson for this jira and is caused by it.{quote}

i'll take a look; an early patch passed clean for me.

{quote}
This patch replaces lot of 'inorout.close()' calls with IOUtils.closeStream(inorout), which is pretty dangerous.
closeStream() should only be used if you want to ignore exceptions from close(). i.e. what happens when out.close() fails in copyMerge()? You could end up with truncated file.
{quote}

Right. So the patch needs work or IOUtils needs to provide a rethrow, cos having io leaks left around is no good either., > So the patch needs work or IOUtils needs to provide a rethrow, cos having io leaks left around is no good either.

Yes, we should not have leaks, of course. I guess the patch needs work. It would be nice to have a patch that just fixes the leak you found. A clean up patch can be submitted later either part of this jira or another one.

{{IOUtils.closeStream()}} is a utility but not a replacement for {{close()}}. , See HADOOP-2926 for more discussion about close()/closeStream() etc., For review. This is a reworked patch focusing only on dstFS.create and srcFS.open. It passes TestCLI for me, Looks pretty good. 

One minor issue : The change to {{copyMerge()}} (the second hunk in the patch) does not seem to change any functionality. Error handling is exactly same as before, right?
, Integrated in Hadoop-trunk #581 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/581/]), Should this item be resolved?, Resolved as? The patch has not been committed yet., Updated patch removes the middle hunk from Bill's patch. No other changes.
, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12390423/HADOOP-3592.patch
  against trunk revision 696957.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3317/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3317/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3317/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3317/console

This message is automatically generated., Test failures seem unrelated., I just committed this. Thanks Bill., Integrated in Hadoop-trunk #611 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/611/])]