[Can someone familiar with PigInputFormat comment if it is actually not trying to skip beyond the file length. It might be depending on skip() return to identify EOF (nothing wrong with that).. But with HADOOP-1470, skip() is implemented as a wrapper over seek(), which throws an EOFException  when we try to seek past. 

If skip in Pig package is supposed to be valid then we can check if there is some other bug.

, Regardless of PigInputFormat, skip should not throw an EOFException.   
The InputStream.skip contract is that it returns the actual number of  
bytes skipped.




, Here is a similar exception i saw with a regular sort run with the current trunk (as of July 17, 2007). This happened during the map output serving from the local filesystem.

Map output lost, rescheduling: getMapOutput(task_200707171649_0001_m_000996_0,411) failed :
java.io.IOException: Illegal seek
	at sun.nio.ch.FileChannelImpl.position0(Native Method)
	at sun.nio.ch.FileChannelImpl.position(FileChannelImpl.java:266)
	at org.apache.hadoop.fs.RawLocalFileSystem$LocalFSFileInputStream.getPos(RawLocalFileSystem.java:96)
	at org.apache.hadoop.fs.BufferedFSInputStream.getPos(BufferedFSInputStream.java:48)
	at org.apache.hadoop.fs.FSDataInputStream.getPos(FSDataInputStream.java:41)
	at org.apache.hadoop.fs.ChecksumFileSystem$ChecksumFSInputChecker.readChunk(ChecksumFileSystem.java:196)
	at org.apache.hadoop.fs.FSInputChecker.readChecksumChunk(FSInputChecker.java:234)
	at org.apache.hadoop.fs.FSInputChecker.read1(FSInputChecker.java:189)
	at org.apache.hadoop.fs.FSInputChecker.read(FSInputChecker.java:157)
	at java.io.DataInputStream.read(DataInputStream.java:132)
	at org.apache.hadoop.mapred.TaskTracker$MapOutputServlet.doGet(TaskTracker.java:1980)
	at javax.servlet.http.HttpServlet.service(HttpServlet.java:707)
	at javax.servlet.http.HttpServlet.service(HttpServlet.java:820), 
The above two traces are very different. The second one is not expected. It is just doing a sequential read. 

The first might be or might  not be expected with the current FSInputStream.. I could not get hold of the Pig code that causes it ( where is RandomSampleLoader.java ?). 

skip can be corrected to be inline to comply with standard contract of skip(). But that won't fix  the second trace. Devaraj, please let us know if you see this again.
, Devaraj's error case is different from the reported error. Devaraj, please file a different jira if you see your error again.

The attached patch fixes the reported error in the following approach:
1. FSInputChecker allows both seek & skip to pass EOF without throwing an EOFException;
2. Both ChecksumFileSystem and dfs disallow seek & skip to pass EOF; Skip returns the actuall number of bytes skipped. If it passes EOF, it returns less number of bytes;
3. Add unit test cases to make skip returns the right value and does not throw EOFException;, +1.

For some reason I did not make skip() in DFSClient.cc synchronized. Could you add this in this patch? Thanks., skip of DFSClient is synchronized., +1

http://issues.apache.org/jira/secure/attachment/12362273/skip.patch applied and successfully tested against trunk revision r558243.

Test results:   http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/448/testReport/
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/448/console, I just committed this.  Thanks, Hairong!]