[Attaching simple fix., Thanks for the bug report, Hung-Chih. Attaching two version of patches. The trunk version applies to 0.23, and trunk. The 0.22 version applies to others., Thanks Milind. Nice to hear from an old colleague.

Hung-chih
, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12497074/7651-22.patch
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-HADOOP-Build/247//console

This message is automatically generated., Looks like the almighty hadoop-qa tried to apply the 0.22 patch to trunk. :-(, Milind, do you really need to change "stat" to full path "/usr/bin/stat" for MacOS in 0.22 patch? I'd rather keep it as it was before., Konstantin, sorry my mistake. I generated that patch from a tree modified for another issue. Let me upload a new patch for 0.22., canceling patch for 0.22. , Attaching correct 0.22 patch., submitted new 0.22 patch., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12499462/7651-22.patch
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-HADOOP-Build/300//console

This message is automatically generated., Milind could you please resubmit your patch for trunk as is. Then Jenkins will pick it up instead of the 0.22 version. Could you run test target for 0.22 locally., Hung-Chih, since I am currently busy in a lot of other work, can you report the results of your manual testing here, after applying the appropriate patch ? Thanks., Since Avro has replaced the Hadoop RCC, shouldn't we just close this?, \\
\\
| (x) *{color:red}-1 overall{color}* |
\\
\\
|| Vote || Subsystem || Runtime || Comment ||
| {color:red}-1{color} | patch |   0m  0s | The patch command could not apply the patch during dryrun. |
\\
\\
|| Subsystem || Report/Notes ||
| Patch URL | http://issues.apache.org/jira/secure/attachment/12499462/7651-22.patch |
| Optional Tests | javadoc javac unit findbugs checkstyle |
| git revision | trunk / f1a152c |
| Console output | https://builds.apache.org/job/PreCommit-HADOOP-Build/6263/console |


This message was automatically generated.]