[{{HttpServer}} supports adding two types of servlets - external and internal servlets. External servlets are user facing servlets and servlet filters can be added for the URLs corresponding the servlets. For internal servlets, filters are not added. In Hadoop-3854, not attaching filter was considered to be deficiency, and hence the corresponding method {{HttpServer.addInternalServlet()}} was deprecated to track this.

Current thought is to undeprecate the method to fix java warnings. If the need arises enable/add functionality to enable filters for internal servllets with a separate jira., +1 patch looks good

(should this fix javac warnings instead findbugs?), Here is the result of test-patch result. No test cases added because the change only undeprecates a method. I am not sure what is triggering eclipse classpath and release audit warnings
     [exec] -1 overall.  
     [exec] 
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec] 
     [exec]     -1 tests included.  The patch doesn't appear to include any new or modified tests.
     [exec]                         Please justify why no tests are needed for this patch.
     [exec] 
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec] 
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec] 
     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs warnings.
     [exec] 
     [exec]     -1 Eclipse classpath. The patch causes the Eclipse classpath to differ from the contents of the lib directories.
     [exec] 
     [exec]     -1 release audit.  The applied patch generated 490 release audit warnings (more than the trunk's current 488 warnings)., > I am not sure what is triggering eclipse classpath and release audit warnings

I think you might have done something wrong.  Could you try ant test-patch again?, After running the tests again, I do not see eclipse classpath issue. However the release audit is still being printed. The two new warnings are:
  [javadoc] JDiff: warning: change from deprecated to undeprecated for method FileSystem.isDirectory
  [javadoc] JDiff: warning: change from deprecated to undeprecated for method HttpServer.addInternalServlet

First one comes from a change that was made earlier. The second undeprecation is the intent of this patch. I propose committing this patch, given the release audit warning is expected.

     [exec] -1 overall.
     [exec]
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec]
     [exec]     -1 tests included.  The patch doesn't appear to include any new or modified tests.
     [exec]                         Please justify why no tests are needed for this patch.
     [exec]
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec]
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec]
     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs warnings.
     [exec]
     [exec]     +1 Eclipse classpath. The patch retains Eclipse classpath integrity.
     [exec]
     [exec]     -1 release audit.  The applied patch generated 496 release audit warnings (more than the trunk's current 494 warnings)., I have committed this.  Thanks, Suresh!]