[So if the namenode is taking a long time to respond, and if the task is not  doing statusUpdates in the interim, this could result in tasks timing out at the tasktracker on statusUpdates and getting killed. Could this be connected to HADOOP-2076 in some way?, Just realized that in HADOOP-2076, the tasks were getting killed because they could not connect to the tasktracker. So this issue may not be the cause of that one., Good patch. Code looks good. + 1.

II think the listPaths API on a directory used to return the size of the entire directory subtree. However, the listStatus API on a directory does not do so. If your application is not relying the original behaviour of listPaths then this change makes sense., Promoting this for Christian., +1 overall.  Here are the results of testing the latest attachment 
http://issues.apache.org/jira/secure/attachment/12369007/2158.patch
against trunk revision r602270.

    @author +1.  The patch does not contain any @author tags.

    javadoc +1.  The javadoc tool did not generate any warning messages.

    javac +1.  The applied patch does not generate any new compiler warnings.

    findbugs +1.  The patch does not introduce any new Findbugs warnings.

    core tests +1.  The patch passed core unit tests.

    contrib tests +1.  The patch passed contrib unit tests.

Test results: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/1300/testReport/
Findbugs warnings: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/1300/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/1300/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/1300/console

This message is automatically generated., I just committed this. Thanks Christian., Integrated in Hadoop-Nightly #329 (See [http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Nightly/329/]), Upload patch into the 0.15 branch as well.
, Fix checked into the 0.15 branch., Integrated in Hadoop-Nightly #332 (See [http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Nightly/332/])]