[Attaching a patch.
 - TestHighRAMJobs, TestProcfsBasedProcessTree and TestTaskMemoryManager all run successfully now.
 - Changed documentation to reflect the change to kilobytes.
 - For the sake of clarity, also mentioned that memory is in kilobytes in JobConf, TaskTracker and TaskTrackerStatus., Running it through Hudson., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12389746/HADOOP-4129
  against trunk revision 693524.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 6 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3220/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3220/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3220/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3220/console

This message is automatically generated., How about keeping the calculations in 'bytes' but allowing ppl to use GB/MB/KB suffixes in the config file?, The least count of the memory needs of TT and tasks will be kB or perhaps even mB. We don't need to track byte level memory sizes. Further, as Hemanth pointed out, this is consistent with the fact that ulimits are also mentioned in kB. So, I'll leave the computations to be in kB.

Discussed with Arun about the ability to mention memory with GB/MB/KB suffixes in config files. Yes, it seems to be a good to have, which can prevent the problems like the ones that occured with the test case. I'll create another JIRA and mark it for 0.19., Patch looks good to me. 

I agree that we can keep the computation in kb, instead of bytes., I just committed this. Thanks, Vinod!, Integrated in Hadoop-trunk #611 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/611/])]