[Fixed error in description in re: # of tests.  Otherwise issue made no sense., test patch doesn make any decision on the no of tests run. If the tests fail it fails the build. It is hudson which parses the junit test results from the xml file.

BTW hudson didnt run any core-test for HDFS-450
it failed for create-configure-c++ so didnt run test-core target
so -1 for core test
and hdfsproxy test failed so -1 for contrib test.

test-patch script doesnt do any count on the no of test run.

, Im closing this resolved invalid.
This is how hudson works and this has nothing to do with the test-patch script., > BTW hudson didnt run any core-test for HDFS-450
Why it is related to BTW HDFS-450?  Typo?

I think Jakob was talking about [this test results|https://issues.apache.org/jira/browse/HDFS-458?focusedCommentId=12732863&page=com.atlassian.jira.plugin.system.issuetabpanels%3Acomment-tabpanel#action_12732863].  It got +1 on contrib test.

Giridharan, could you take a second look?, > Why it is related to BTW HDFS-450? Typo? 
Oops, I got a typo. It should be "Why it is related to HDFS-450? Typo? ", I've spoken with Giri about this offline.  Hopefully he'll re-open the issue soon., my bad, I mistook hdfs-458 for hdfs-450 and made the inference.

But looking the core-test console log:
http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-vesta.apache.org/25/console

     [exec]     [junit] Tests run: 1, Failures: 1, Errors: 0, Time elapsed: 3.745 sec
     [exec]     [junit] Test org.apache.hadoop.hdfs.server.datanode.TestInterDatanodeProtocol FAILED

TestInterDatanodeProtocol test failed for some reason; and hudson while parsing the xml results didn't consider the test failure.

since there is a failure in the test-core ant target test-patch script gave a -1 for this patch for core test.

I'm not sure why hudson didn't consider this failure while generating the test report.
I closed this invalid b'coz I pretty much know test-patch doesn't consider the no of tests being run by previous and current hudson build jobs.

http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-vesta.apache.org/25/testReport/org.apache.hadoop.hdfs.server.datanode/TestInterDatanodeProtocol/

If you think I'm missing something please reopen this jira.

Thanks,, Well I imagine it's worth finding out why Hudson let through a patch that failed a test without reporting it.  This is a pretty big issue if it's happening with other patches; can you please follow up on it?, I agree with you and I would follow up with this issue. 
But this is for the first time I'm hearing something like this.

If you agree that this not something to do with test-patch then I can openup a different jira and deal with hudson issue or we can file a bug with hudson dev.

thanks, Hi Giri,

If another jira is being opened for this, can we make sure an link the issues for tracking?  I think it is agreed that this is not a test-patch issue, but rather a hudson issue.

Thanks,
-Gary, filed a jira for trackin 
https://issues.apache.org/jira/browse/HDFS-502
tnx!
]