[I have a feeling that there was somewhat similar issue opened already for against the Configuration but I can't find a corresponding JIRA :(, FWIW, I realized this a while back and concluded it wouldn't be a problem because unix user names are not supposed to contain the "." character.

Also, note that though valid Kerberos principal names may contain the "." character, the search for a proxy user user name in the configuration is performed *after* the {{auth_to_local}} mapping is applied, so that may be present a valid work-around., Sorry fellers,
POSIX ("Portable Operating System Interface for Unix") standard (IEEE Standard 1003.1 2008) states:

http://pubs.opengroup.org/onlinepubs/9699919799/
(from section 3, definitions)

3.431 User Name
A string that is used to identify a user; see also User Database. To be portable across systems conforming to POSIX.1-2008, the value is composed of characters from the portable filename character set. The <hyphen> character should not be used as the first character of a portable user name.

3.278 Portable Filename Character Set
The set of characters from which portable filenames are constructed.

A B C D E F G H I J K L M N O P Q R S T U V W X Y Z
a b c d e f g h i j k l m n o p q r s t u v w x y z
0 1 2 3 4 5 6 7 8 9 . _ -
, Hello, I was trying to run Hive on Windows today. And I am not able to run it because my Windows username contains a (.)dot.

Is this not a blocker issue? Hive seems to not work without impersonation, impersonation is impossible because of the current JIRA and impersonation cannot be turned off, it seems.

Is there any workaround?, [~k4kaliazz], I have a similar problem as yours. I failed to launch HiveServer2 in linux since my username contains a (.)dot too. Finally, I disabled impersonation in it by setting hive.server2.enable.doAs to false in hive-site.xml., We have same issue on cdh-5.14, we have in produciton and now we need revert because of this issue., [~xsonnek] that's an interesting observation. This issue has been here since practically the inception of Hadoop. What version did you revert to that doesn't have this problem?]