[Attached patch closes the sockets opened in {{fetchBlockByteRange()}}. Closing 'reader' is strictly not required but probably a good thing.

I think this patch uses IOUtils.closeStream() appropriately, let me know if you see other wise.

Regd unit test : TestCrcCorruption fails without this patch and passes with it when the the process is restricted to 1024 file descriptors. We could make hudson restrict the fds to 1024 as well. Otherwise it does not seem straight fwd to make sure all the sockets opened any where in Hadoop are closed when the test finishes.. , Attached patch fixes one more bug that contributed to this problem :

{{BlockReader.checksumOk()}} is part of data read protocol and it should be inside BlockReader class. Earlier it was invoked by {{FSInputStream.read()}} only because BlockReader did not have access to the socket. Now the socket is stored. No API is changed. Since checksumOk() was invoked only by regular read and not by the position read used by unit test. This combined with the fact that the socket was not closed made the DataNodes wait on the socket.
, +1 This patch makes sure that the socket opened in fetchBlockByteRange is closed before the function returns., Thanks Hairong., -1 overall.  Here are the results of testing the latest attachment 
http://issues.apache.org/jira/secure/attachment/12378509/HADOOP-3067.patch
against trunk revision 619744.

    @author +1.  The patch does not contain any @author tags.

    tests included -1.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    javadoc +1.  The javadoc tool did not generate any warning messages.

    javac +1.  The applied patch does not generate any new javac compiler warnings.

    release audit +1.  The applied patch does not generate any new release audit warnings.

    findbugs +1.  The patch does not introduce any new Findbugs warnings.

    core tests +1.  The patch passed core unit tests.

    contrib tests +1.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2073/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2073/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2073/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2073/console

This message is automatically generated., This is in fact triggered by a unit test. See the first comment above., I just committed this., Integrated in Hadoop-trunk #443 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/443/])]