[Attaching patch for Y20 distribution.  Manually tested; unfortunately a not unit-testable.  Patch for trunk shortly.  Most of this work is Kan's., Updated patch with new file.  Forget git add, get sad..., Updated patch with more specific logic and unit test., I don't think that the check to make sure the 2 component of the krbtgt is the realm is necessary. Other than that, it looks good., > I don't think that the check to make sure the 2 component of the krbtgt is the realm is necessary.

It's needed since we want to use the original TGS ticket issued by the user's original realm, not any intermediate TGS tickets that were cached in the Subject by previous operations. Those intermediate TGS tickets may be issued for realms that are different from the target realm of the current request, which will cause the current get service ticket operation to fail., +1 on the patch., Shouldn't this be looking for the default realm?

Something like:

{code}
Config.getInstance().getDefaultRealm()
{code}

That seems a lot more understandable than making sure the two components are the same., > Shouldn't this be looking for the default realm?
The default realm may not be the home realm of the current user you want to get a service ticket for., uploaded a new patch based on Jakob's patch (not for commit to trunk) 
1. Moved SecurityUtil.java from hdfs to core.
2. Added comments on the possible presence of cross-realm TGT's in the Subject's credential cache., +1, Be more explicit about this lousy method we have to have, but no one should use..., Patch for common trunk uploaded., HADOOP-6603.1.patch is submitted for hudson tests., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12446784/HADOOP-6603.1.patch
  against trunk revision 953388.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    -1 javadoc.  The javadoc tool appears to have generated 1 warning messages.

    -1 javac.  The applied patch generated 1032 javac compiler warnings (more than the trunk's current 1022 warnings).

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/577/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/577/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/577/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/577/console

This message is automatically generated., Fixed a javadoc., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12446806/HADOOP-6603.2.patch
  against trunk revision 953388.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    -1 javadoc.  The javadoc tool appears to have generated 1 warning messages.

    -1 javac.  The applied patch generated 1032 javac compiler warnings (more than the trunk's current 1022 warnings).

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/578/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/578/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/578/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/578/console

This message is automatically generated., Both javadoc and javac warnings are related to sun.security.krb5.Config 
"warning: sun.security.krb5.Config is Sun proprietary API and may be removed in a future release", +1, I've committed this.  Resolving as fixed., Integrated in Hadoop-Common-trunk-Commit #295 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Common-trunk-Commit/295/])
    HADOOP-6603. Provide workaround for issue with Kerberos not resolving cross-realm principal. Contributed by Kan Zhang and Jitendra Pandey.
, Integrated in Hadoop-Common-trunk #363 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Common-trunk/363/])
    HADOOP-6603. Provide workaround for issue with Kerberos not resolving cross-realm principal. Contributed by Kan Zhang and Jitendra Pandey.
]