[This patch makes following change:
The default behavior for getCanonicalServiceName is to just return the uri as the string, because calling SecurityUtil.buildDTServiceName doesn't make sense for many file systems. DFS and Hftp override getCanonicalServiceName to call buildDTServiceName , Can you please add javadoc to the FileSystem method indicating the distinction between local file systems with no authority and remote file systems with authority and the expected behavior. We should also consider annotating this method as private in trunk., Does this change not also need to be made on trunk?, Trunk doesn't have this NPE problem. But, I agree with Suresh to annotate this method as private (to hadoop) in trunk., Javadoc updated addressing Suresh's comment., +1 for the patch. If there are no unit tests for this functionality, we should add one.

Can you please create a trunk jira to annotate this method as private and stable. Stable since changing this would be backward incompatible., Jitendra, if HADOOP-7602 goes to trunk, would it be good to put this change in as well for consistency?  , It seems to me that this issue (and also HADOOP-7602) got introduced in MAPREDUCE-2780. I would prefer that the trunk patch for that jira, doesn't introduce this issue or the issue in HADOOP-7602. We should port the tests though.
, The patch includes a test for local file system just to make sure NPE is not being seen., bq. Trunk doesn't have this NPE problem.

Why not? From a cursory examination of the code, it looks like trunk should have the exact same issue., bq. Why not? From a cursory examination of the code, it looks like trunk should have the exact same issue.
MAPREDUCE-2780 changed the behavior of buildDTServiceName() which started throwing an NPE for filesystems without valid authority. Since MAPREDUCE-2780 is not in trunk yet, the behavior is not there yet. The fix was to let FileSystem without a valid URI override the getCannonocalServiceName() eg: HADOOP-7602, Jitendra, as part of this bug please commit the unit test for NPE on local file system, to trunk, so we'll know if it ever recurs there.  Thanks., This Jira hasn't been updated since a long time. Are we still experiencing this NPE?, I did not hear anything since last couple of days. 0.23 is going into maintenance mode. Re-targeting this to 3.0.0. Also removing the fix version. It should be modified once the patch is committed., Mit! You shouldn't remove the Fix Version. This patch HAS gone into 0.20.205, My bad. I did not see any commit message above or any comment saying someone will check in the changes.
I see that the patch is committed to 0.20.205. Thanks for pointing this [~raviprak].]