[How about we change scheme and authority to lower cases in the Key constructor?, > How about we change scheme and authority to lower cases in the Key constructor? 

That should work.  We create a new Key for nearly every file we touch, but adding a few string allocations is probably insignificant.  There is String.CASE_INSENSITIVE_ORDER, but I don't know of a case-insensitive hashCode implementation for strings..., Patch for review. 

The patch lowercases scheme and authority in the ctor so the string op only happens once per Key and not once per equals/hashcode check. Key and Cache were made default visible to allow testing. , +1 This looks good to me., I think it would be more safe for keeping scheme and authority to null instead of setting them to empty strings.  Have you run all the unit tests?, +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12387423/HADOOP-3785.patch
  against trunk revision 682978.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3013/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3013/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3013/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3013/console

This message is automatically generated., > I think it would be more safe for keeping scheme and authority to null instead of setting them to empty strings.

Nicholas, do you have an objection to committing this patch as-is?, > I think it would be more safe for keeping scheme and authority to null instead of setting them to empty strings. 

I did this because of NPEs in one of the tests. It's easy to put a null version of the patch together, but I'd like know what the problem would be (and I guess why it's ok for these fields to be null at all) , I checked the URI class.  I cannot make it returning an empty string.  It always returns null when the scheme/authority is missing.  So I think this patch is good to be committed., I just committed this. Thanks, Bill, Integrated in Hadoop-trunk #586 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/586/])]