[This has been observed only on sort500, I've tried in-vain to reproduce this on smaller clusters..., I've tried in-vain to reproduce this over the past week, as such here is a 'debug patch' to help us track this better in the future. I propose we commit this for now and keep an eye on this henceforth..., Forgot to add that the patch has the following 'debug' properties:
1. Logs the first key & value lengths for intermediate map-outputs both on the serving end (jetty) and the client end (reducer's shuffle)
2. Dumps the in-memory buffer to disk in-case of the observed exceptions.

Also, I've fixed a possibly subtle bug with flushing output-streams for compressed map-outputs in IFile.Writer.close()., Resubmitting to hudson..., I have two comments:
1) The second seek  in TaskTracker::doGet seems expensive esp because it is only for debugging. It can be optimized to get the same info.
2) The comment   " // TODO: Remove this after a 'fix' for HADOOP-3647   // WARN: This won't work for compressed map-outputs!" should be removed from ReduceTask.java.
, Updated patch, this optimizes the seeks., +1, Hudson seems be to in strife... I've verified that patch passes all unit tests locally and 'ant test-patch' doesn't balk too.

{noformat}
     [exec] -1 overall.     [exec]     +1 @author.  The patch does not contain any @author tags.     
     [exec]     -1 tests included.  The patch doesn't appear to include any new or modified tests.     
     [exec]                         Please justify why no tests are needed for this patch.     
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.     
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs warnings.
{noformat}

This patch only adds some logging, doesn't merit a test-case., I just committed this., Integrated in Hadoop-trunk #581 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/581/]), Attaching error logs from a failed run that could be related to this issue.
]