[These scripts were initially declared to use sh, however they didn't work correctly under all versions of sh.  The problem is that most developers of these scripts develop on Linux, where sh and bash are the same program.  Thus it is *very* easy for bash-specific features to creep into these scripts.  So, if we switch them back to sh but don't have folks who are daily testing the trunk on a non-bash-based sh, then we are likely to deliver releases where these fail in strange ways.  Right now they fail in a predictable way if you don't have bash installed, so there's no confusion.  So I am reluctant to make this change unless I am convinced there are several developers who track trunk changes using a non-bash-based sh.

How hard is it to install bash on FreeBSD?
, This is the purpose of compile (and testing) farms at SourceForge (see http://sourceforge.net/docman/display_doc.php?docid=762&group_id=1), is there such a possibility at Apache?

I understand your concern that your changes might introduce new incompatibilities.  But at the contrary, you may prevent users from adopting Hadoop by having very Linux-specific constructs.  FYI I'm working in a group of persons that intend to deploy Hadoop on Linux, FreeBSD, Cygwin and Solaris systems.

There are simples rules to follow that could ensure compatibility:

* "> file 2>&1" instead of ">& file"
* ". file" instead of "source file"
* Not using /proc (Linux-specific)

Best regards., We currently do not have unit tests for the scripts, nor does Apache have a FreeBSD compilation server.

I think there were more subtle problems with the scripts than those you mention, although I've forgotten the details.  Have you succeeded, with your patch, to use the scripts to manage a FreeBSD cluster?

I do not wish to discourage in any way your group from using Hadoop.  Is installing bash on FreeBSD difficult?  If it is, and your group will be regular Hadoop users, then perhaps we should commit this patch.
, Yes, with my patch, the Hadoop scripts is deployed and runs on FreeBSD.

BTW I didn't mention in the previous comment, "if [ -a file ]" constructs are not compatible.

Installing bash on FreeBSD is straightforward provided that you symlink /bin/bash to /usr/local/bin/bash.  But we must address Solaris deployment soon, and installing bash is more complicated., I just committed this.  Thanks, Jean-Baptiste.]