[Basically, batch script expansion caused the problem. 
Here is how the expansion happens on Windows:
1. cmd.exe passed "/tmp/*" to %HADOOP_HOME%\bin\hadoop script
2. hadoop script also passes "/tmp/*" to %HADOOP_HOME%\bin\hdfs.cmd
3. the expansion is done by the shell function make_command_arguments in hdfs.cmd. If it has problem expanding the name, it just simply drop it.
4. when FsShell gets the request, either it gets a list of expended name or no name. FsShell doesn't know the expended names are from outside HDFS. When there is no name with some command, FsShell complains and prints the usage information.
{noformat}
:make_command_arguments
  if "%2" == "" goto :eof
  set _count=0
  if defined service_entry (set _shift=2) else (set _shift=1)
  if defined config_override (set /a _shift=!_shift! + 2)
  for %%i in (%*) do (                        <== expansion happens here!!!
    set /a _count=!_count!+1
    if !_count! GTR %_shift% (
        if not defined _hdfsarguments (
          set _hdfsarguments=%%i
        ) else (
          set _hdfsarguments=!_hdfsarguments! %%i
        )
    )
  )
  set hdfs-command-arguments=%_hdfsarguments%
  goto :eof
{noformat}
Using single quotation marks around the pathname may result in getting the pathname dropped by the above function. Therefore it is not a good workaround. Looks like the above function needs to be fixed.
, I don't think the batch script should be attempting any expansion.  {{FsShell}} and other commands are going to expand both local and/or remote paths via {{FileSystem}} so no pre-expansion is necessary.  Any pre-expansion is going to cause problems if option args contain glob chars, and it may also cause unintended expansion of relative paths intended for a remote fs that happen to match to local paths (ie. /tmp/*.txt will expand to local fs paths even if the default fs is hdfs)., correct. The above mentioned function is to process the rest of the arguments from user input. The expansion is just a bad side effect., This should have been fixed with HADOOP-8739, right?, HADOOP-8739 should fix the same problem. Resolve this as dup., dup of HADOOP-8739]