[HADOOP-1238, HADOOP-1238 and this issue address different things. Note that here I stress on the thing that metrics reporting should happen periodically as opposed to only happening during task execution start/end boundaries., Attached is a patch that makes TaskTrackerMetrics implement the Updater interface. Also, a new metrics to report the number of taskSlots has been added., +0, new Findbugs warnings

http://issues.apache.org/jira/secure/attachment/12358730/1446.patch
applied and successfully tested against trunk revision r543222,
but there appear to be new Findbugs warnings introduced by this patch.

New Findbugs warnings: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/228/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Test results:   http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/228/testReport/
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/228/console, 
The TaskTracker fields mapTotal and reduceTotal now need to be declared volatile, since they are being accessed from the Metrics thread.

Also, completeTask is wrong.  Actually, it was wrong before your changes (my bad).  Now, as soon as one task has been completed, it will report one task being completed every blurb period regardless of the actual number. The suggested fix is to add a numCompletedTasks field to TaskTrackerMetrics, and make completeTask simply increment that field. Then doUpdates should call incrMetric(numCompletedTasks), and afterwards set numCompletedTasks=0.

In general, all the metrics in a MetricsRecord should be updated in the same place in the code, and update() should be called immediately afterwards.  

, Attached is a patch with David's comments incorporated. Also, fixed two unrelated places whre findbugs reported inconsistent synchronization., +1

http://issues.apache.org/jira/secure/attachment/12358746/1446.patch applied and successfully tested against trunk revision r543622.

Test results:   http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/234/testReport/
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/234/console, 
The changes look correct, but I don't like the change to TaskRunner, the adding of synchronization on the TaskTracker object:

        synchronized (tracker) {
          vargs.add(tracker.taskReportPort + "");        // pass umbilical port
        }

I think it would be much better to add a synchronized getTaskReportPort method to TaskTracker and make the taskReportPort field private.

, Made the tasktracker field taskReportPort private and added a synchronized getter., +1

http://issues.apache.org/jira/secure/attachment/12358897/1446.1.patch applied and successfully tested against trunk revision r544206.

Test results:   http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/245/testReport/
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/245/console, +1

Code reviewed.  Looks good.
, Committed! Thanks, Devaraj.]