[Good catch. The code has been like this for a long time, so it might be ok to schedule this for 0.20. Do you agree? Can you pl attach a patch?, Attached patch removes breaking out of "for" loop on encountering bad block. With this change, the bad block is ignored and the remaining blocks are transferred from one Datanode to another., Updating the patch..., For the same reason, should we do a try-catch in the second part of the loop?  Otherwise, an IOException thrown within the loop leads to exiting the method., Nice catch Nicholas. Here is the updated patch., Another update to the patch to catch the IOExcpetions in the for loop that could interrupt the block transfer, +1 patch looks good, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12392619/HADOOP-4388.patch
  against trunk revision 709609.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3526/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3526/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3526/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3526/console

This message is automatically generated., No tests are added since the changes are obvious and there is no easy way to a new test for this bug., I just committed this.  Thanks, Suresh!]