[- created firstBlock in the constructor of DFSOutputStream, not in DFSOutputStream.nextBlockOutputStream().

- modified the RetryPolicy for create, so that it won't retry if there is an AlreadyBeingCreatedException.

- removed deprecated class UTF8 in DFSClient., added a junit test, The patch looks very reasonable to me. Although it does not apply to the trunk.
Other than that I am
+1, I do not think that this patch should change the retry policy of AlreadyBeingCreatedException. Instead, it should change the copy utility so that it takes an additional flag indicating if the destination file should be overwritten or not., Codes are reused from the patch in HADOOP-1595., Unlinked HADOOP-1595 since there are more discussion in HADOOP-1595

In this patch, RetryPolicy remains unchanged.
 , +1

http://issues.apache.org/jira/secure/attachment/12362707/999_20070727b.patch applied and successfully tested against trunk revision r560014.

Test results:   http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/480/testReport/
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/480/console, 1. I'd prefer that this patch does not change the use of UT8 to String. The change is not related to this issue. I think it is better to do it in a separeate jira.
2. This patch makes the namenode to create the first block when an application calls create. A side effect is that a block needs to be created for a zero length file. Also with this change, all block allocation code pieces are not in one place as before. 

Does it make more sense that we change the semantics of file creation at the server side? It seems to me that it is cleaner if startFile only creates a pendingCreate but does not create a block., - revert the UTF8 changes

- changed FSNamesystem.startFile so that is only starts file but not allocates the first block.

Thank you, Hairong., + The code looks good., +1

http://issues.apache.org/jira/secure/attachment/12362804/999_20070730.patch applied and successfully tested against trunk revision r560014.

Test results:   http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/484/testReport/
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/484/console, - added a junit test for coping zero size file, -1, build or testing failed

2 attempts failed to build and test the latest attachment http://issues.apache.org/jira/secure/attachment/12362837/999_20070730b.patch against trunk revision r561200.

Test results:   http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/488/testReport/
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/488/console

Please note that this message is automatically generated and may represent a problem with the automation system and not the patch., this one should be applied to the trunk, -1, build or testing failed

2 attempts failed to build and test the latest attachment http://issues.apache.org/jira/secure/attachment/12362848/999_20070730c.patch against trunk revision r561200.

Test results:   http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/489/testReport/
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/489/console

Please note that this message is automatically generated and may represent a problem with the automation system and not the patch., -1, build or testing failed

2 attempts failed to build and test the latest attachment http://issues.apache.org/jira/secure/attachment/12362892/999_20070730c.patch against trunk revision r561382.

Test results:   http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/491/testReport/
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/491/console

Please note that this message is automatically generated and may represent a problem with the automation system and not the patch., Not sure why the previous patch cannot be applied.  Re-make one without changing the codes., +1

http://issues.apache.org/jira/secure/attachment/12362908/999_20070731.patch applied and successfully tested against trunk revision r561432.

Test results:   http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/492/testReport/
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/492/console, I just committed this. Thanks Nicholas!]