[Attaching patches for trunk and 20 branch.  This is essentially a documentation change.  Tested manually., I had the issue moved to Common rather than HDFS since the affected file is FsShell.java, within the Common subproject., submitting patch., Ran unit tests locally.  Passes all common unit tests., test-patch:
{noformat}
     [exec] -1 overall.  
     [exec] 
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec] 
     [exec]     -1 tests included.  The patch doesn't appear to include any new or modified tests.
     [exec]                         Please justify why no new tests are needed for this patch.
     [exec]                         Also please list what manual steps were performed to verify this patch.
     [exec] 
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec] 
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec] 
     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs warnings.
     [exec] 
     [exec]     +1 release audit.  The applied patch does not increase the total number of release audit warnings.{noformat}
No unit tests because is documentation change.  Manual step as documented in jira description.  , -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12413065/HADOOP-478-v20.patch
  against trunk revision 792812.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/563/console

This message is automatically generated., +1 patch looks good., Hudson tried to apply v20 patch, which is why I ran test-patch manually.  Both pathces apply fine.  Patch is ready to be committed., I have committed this.  Thanks, Jakob!]