[Here is a junit test case that reproduces this issue.  Most of the code that this bug deals with is not outside-testable, so values and method contents were copied and pasted into the test case with corresponding line numbers., here's an svn diff done from the release-xxx dir.  I let my cluster run with this patch in place for the day and i haven't seen any occurances of the out of space exception., Making this a blocker since a job would be badly affected if the tasks run into the situation described., should the computation be (((size-1)/bytesPerSum) + 1) * 4 + CHECKSUM_VERSION.length?

, I have a +2 in my calculation because there's another int that's written right after the header in the checksum file at ChecksumFileSystem:306.  That int is the BytesPerSum value.  I guess it could be more explicit by adding a separate term of 4 instead of adding a +2.

As to whether the size should be +1 or -1 when being divided by bytesPerSum... i don't think it matters since we +1 the result.

So maybe the final computation should be:

(((size-1)/bytesPerSum) + 1) * 4 + CHECKSUM_VERSION.length + 4, (((size-1)/bytesPerSum) + 1) * 4 + CHECKSUM_VERSION.length + 4 seems right to me., What if size is zero?   Another way to write it would be : 

( (size + bytesPerChecksum -1)/bytesPerChecksum) * 4 + CHECKSUM_VERSION.length + 4 

, This patch fixes the checksum file system to use integer math instead of floating point math and includes a test case. It also updates the checksum filesystem to cache the value of bytes per a checksum rather than continually refetching it from the config., > As to whether the size should be +1 or -1 when being divided by bytesPerSum... i don't think it matters since we +1 the result.
+1 is gives wrong value when ( size  == (n*bytesPerChecksum - 1 ) ).
, +1 to Owen's patch.

Thanks Richard. That was a good catch with the floats. findbugs catches similar non-obvious math errors. May we should inform findbugs guys.
, I just committed this., Integrated in Hadoop-Nightly #280 (See [http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Nightly/280/])]