[This scenario will not occur in environments running a static HDFS cluster and using HOD only for Map/Reduce clusters. It will only occur if a static HDFS cluster is present and we use HOD for bringing up our own HDFS and Map/Reduce clusters. The latter is a case only in test environments, that too in a few limited cases., I am marking this a blocker for Hadoop 0.18, because test environments are going to suffer once upgraded to Hadoop 0.18., Attaching patch(trivial). Tested with hadoop 0.18 and hadoop 0.17 tarballs, verified that dfs.datanode.ipc.address gets written into Datanode configuration only in the earlier case., Reviewed patch. Tested with hadoop 0.15, 0.17 and hadoop 0.18, and noted that the new parameter gets written for hadoop 0.18 and above.

+1, The ipc port numbers of datanodes can be different since the datanodes will inform the NameNode about the ipc port they are using during datanode registration., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12384118/HADOOP-3564.1
  against trunk revision 668612.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2673/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2673/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2673/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2673/console

This message is automatically generated., Writing test cases will require some refactoring of HOD code, which is not currently in the scope. Relied on cross testing to make sure things are working. The fix can be committed., I just committed this. Thanks, Vinod!, Integrated in Hadoop-trunk #522 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/522/])]