[This fixes the problem.
I also introduced messages stracking status of long running benchmarks., +1 Looks good, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12383613/NNThroughputBenchmarkLogMsg.patch
  against trunk revision 664226.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2621/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2621/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2621/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2621/console

This message is automatically generated., Wouldn't it better to wait until the namenode leaves safemode rather than forcing it out?, Assigning it back to 0.18 because  HADOOP-3320 needs it., > Wouldn't it better to wait until the namenode leaves safemode rather than forcing it out?

I you start the name-node with an existing image and all data-nodes are down, which is what the benchmark does,
then there is no chance the name-node will leave safe-mode naturally. So I have to force it out., Filed HADOOP-3520 for the TestDFSUpgradeFromImage failure., I just committed this., Integrated in Hadoop-trunk #520 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/520/])]