[When calling out to contrib targets using trunk the following message appears (e.g. for "ant clean-contrib"):

{code}
[subant] No sub-builds to iterate on
{code}

This seems to have been happening since HADOOP-5107 which added {{inheritall="true"}} to the subant call. I notice that {{inheritall="true"}} was only added to common's top-level build file, HDFS and MapReduce didn't have it added. Anyone know why?

Anyway, this patch removes {{inheritall="true"}} which causes the contrib targets to work again. I've also fixed the test contrib modules that are included since they mistakenly refer to HDFS and MapReduce modules (a vestige of the project split?)., This should go into 0.21.0 too since HADOOP-5107 went in there, so I'm changing it to be a blocker., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12429230/HADOOP-6451.patch
  against trunk revision 894706.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/245/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/245/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/245/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/245/console

This message is automatically generated., Tested locally; +1

I committed this. Thanks, Tom!, Integrated in Hadoop-Common-trunk-Commit #140 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Common-trunk-Commit/140/])
    . Fix build to run contrib unit tests. Contributed by Tom White
, Integrated in Hadoop-Common-trunk #218 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Common-trunk/218/])
    . Fix build to run contrib unit tests. Contributed by Tom White
]