[Currently capacity scheduler checks for presence of default queue while starting up, ideally scheduler should not rely on any specific queue to be configured., A straight forward patch. Attaching the patch removing the check from {{CapacityScheduler}} and added a new test case., - The variable 'DEFAULT_QUEUE_NAME' can be removed.
- Maybe unrelated to this patch, but the new raiseStatusChangeEvents should be used in atleast one more test case, testSchedulingInformation. Can you please check this, and other usages of the old raiseStatusChangeEvents method ?

Otherwise, the code changes are fine., Attaching patch incorporating Hemanth's comment:

* Add {{raiseStatusChangeEvent(JobQueueManager, QueueName)}} to {{testSchedulingInfo()}}

No other test case needs it because places where {{raiseStatusChangeEvent()}} is being used is with single default queue., Running thro hudson., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12406348/HADOOP-5718-2.patch
  against trunk revision 770321.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/266/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/266/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/266/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/266/console

This message is automatically generated., Attaching patch for branch 20., The earlier patch for trunk did not apply to trunk because of commit of HADOOP-5726. However, the patch for branch 0.20 is applying cleanly. I ran ant test-patch on this to make sure it still approves. Capacity scheduler tests also run fine. So, I will commit this patch to both 0.20 and trunk., I committed this to trunk and branch 0.20. Thanks, Sreekanth !, Integrated in Hadoop-trunk #827 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/827/])
    . Remove the check for the default queue in capacity scheduler. Contributed by Sreekanth Ramakrishnan.
]