[Attached patch does the following :

* Renames conflicting arguments for receiveBlock().
* Replaces mirrorOut's accesses with : {code}
try {
  access mirrorOut;
} catch (IOException e) {
  handleMirrorOutError(e);
} {code}
* Note that with HADOOP-1702, number of places where mirrorOut is written to goes down and reduces repeat of the above pattern.
* It does not change any other behaviour. If this goes after HADOOP-3033, the patch will be smaller since 'currentWrite' is removed there., Updated patch to latest 0.16 branch., All code looks good except the first block.

This portion of code is used when the socket connection is being set up. At this point, it is better for the connection request to fail if any one mirror fails so that the client can get a fresh new set of 3 datanodes for the pipeline and start all over again., > client can get a fresh new set of 3 datanodes for the pipeline and start all over again.
This patch does not change anything when a client is writing data. This affect only when one datanode is transferring (re-replicating) block to more datanodes., Conceptually, there is not much difference between failure while connecting or while writing to mirror. In both cases, it just means the transfer did not happen to mirror., +1. Code looks good., Thanks Dhruba., -1 overall.  Here are the results of testing the latest attachment 
http://issues.apache.org/jira/secure/attachment/12378264/HADOOP-3007.patch
against trunk revision 619744.

    @author +1.  The patch does not contain any @author tags.

    tests included -1.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    javadoc +1.  The javadoc tool did not generate any warning messages.

    javac +1.  The applied patch does not generate any new javac compiler warnings.

    release audit +1.  The applied patch does not generate any new release audit warnings.

    findbugs +1.  The patch does not introduce any new Findbugs warnings.

    core tests +1.  The patch passed core unit tests.

    contrib tests +1.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2017/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2017/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2017/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2017/console

This message is automatically generated., I just committed this., Integrated in Hadoop-trunk #436 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/436/])]