[Replaces the iterator with direct access to the map of open files. Since closing a file removes it from the map, there is no need to clear the map at the end., Proposed patch fixing HADOOP-3639, The exception is
{code}
Exception in thread "Thread-5" java.util.ConcurrentModificationException
        at java.util.TreeMap$PrivateEntryIterator.nextEntry(TreeMap.java:1100)
        at java.util.TreeMap$KeyIterator.next(TreeMap.java:1152)
        at org.apache.hadoop.dfs.DFSClient.close(DFSClient.java:212)
        at org.apache.hadoop.dfs.DistributedFileSystem.close(DistributedFileSystem.java:228)
        at org.apache.hadoop.fs.FileSystem$Cache.closeAll(FileSystem.java:1379)
        at org.apache.hadoop.fs.FileSystem.closeAll(FileSystem.java:230)
        at org.apache.hadoop.fs.FileSystem$ClientFinalizer.run(FileSystem.java:215)
{code}, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12384658/patch-dfs-close
  against trunk revision 671385.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 5 new or modified tests.

    -1 patch.  The patch command could not apply the patch.

Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2734/console

This message is automatically generated., Fixed the patch file. The previous one was generated with svn diff. Sorry., Hi Benjamin, the file patch-dfs-close-v2 has some repeated codes and so it cannot be compiled.  Since the test is simple, could you move it to TestDistributedFileSystem?  Also, you need to shutdown the MiniDFSCluster object.  See TestDistributedFileSystem.testFileSystemCloseAll() as an example.
, Removed duplicate lines from patch; moved test case to TestDistributedFileSystem, +1 patch looks good except there are some compiler warnings in the test.  I have fixed these warnings., I forgot to remove the un-used imports.  Updated the patch, This problem also exists in 0.17.  Should we set it as a 0.17.1 blocker?, Passed the tests locally.  Try Hudson., Found a bug: if out in DFSClient.close() is null for some reason, then the loop is an infinite loop., Avoid infinite loop in DFSClient.close if out == null by removing entries with null value from pendingCreates map, +1 patch-dfs-close-v3_3 looks good, We should remove the map entry from pendingCreates for each name in any case.  So I think it is better to remove it in the beginning.  Otherwise, if there is an IOException thrown by out.close(), the entry won't be removed., patch-dfs-close-v4.patch: remove the map entry in the beginning, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12384870/patch-dfs-close-v4.patch
  against trunk revision 672376.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 5 new or modified tests.

    -1 patch.  The patch command could not apply the patch.

Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2756/console

This message is automatically generated., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12384870/patch-dfs-close-v4.patch
  against trunk revision 672376.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 5 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2766/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2766/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2766/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2766/console

This message is automatically generated., Passed all tests.  (Why got -1 in contrib tests?  A bug in Hudson?)  This one is ready to be committed., I've just committed this. Thanks, Benjamin!, Integrated in Hadoop-trunk #535 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/535/]), Integrated in Hadoop-trunk #581 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/581/])]