[During the cleanup, (the time JT is waiting for the cleanup to get launched, and while cleaning up), the JobStatus should be "CLEANUP". This makes the tasks get KillTaskAction immediately and makes slots free. Thoughts?, On second thought, adding the new JobStatus looks big change,  we can have a boolean set while the job is cleaning up instead of state change., Else where in HADOOP-4035, I needed to check if a job is being killed to avoid duplicate kills. For this I had already introduced a boolean killInProgress which is set in JobInProgress.terminate(). We'll need to sync up depending on which JIRA goes in first., Attaching patch with following changes:

1. changed TaskInProgress.shouldClose(attemptId) to return true if the tip has failed. This will make sure cleanup task will get a slor free.
2. the gaurd in obtainNewMap/ReduceTask for tasksInited is changed to gaurd for JobState as RUNNING
3. kill setup Tips when there is a kill from commandLine 
4.  Fixed setup task failures when
     i) kill-task for setup task from commandLine 
     ii) lost tracker on which setup task is running., test-patch result:
{noformat}
     [exec]
     [exec] -1 overall.
     [exec]
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec]
     [exec]     -1 tests included.  The patch doesn't appear to include any new or modified tests.
     [exec]                         Please justify why no tests are needed for this patch.
     [exec]
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec]
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec]
     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs warnings.
     [exec]
     [exec]     +1 Eclipse classpath. The patch retains Eclipse classpath integrity.
     [exec]
{noformat}

All the core and contrib tests passed on machine except TestMiniMRDebugScript(due to HADOOP-4410)

Did not include any unit test because it is difficult to simulate the corner-cases. Did the manual testing for the following:
1. Killed job when all slots are full. made sure cleanup is launched and job is killed.
2. Killed job during setup.
3. Killed job during cleanup.
4. Kill task action for setup during setup
5. kill task action for cleanup during cleanup
, Ran Sort benchmark on big cluster., I just committed this. Thanks, Amareshwari!, Integrated in Hadoop-trunk #634 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/634/])
    ]