[This is working as designed. 

{quote}
Possible fixes
   1. Return a new object each time for next(). This might have significant overhead.
{quote}
This is the problem that was fixed. Forcing the inner loops of map/reduce to allocate objects is a huge cost.

{quote}
   2. Return a new object for unknown object types and reuse the same object for known types (like Text). Remove "if (this==anObject) return true;" check from all equals() methods for known objects.
{quote}
No, this will make the semantics much more confusing.

{quote}
   3. Document clearly that all user-defined classes must implement an equals() method, which doesn't do the "if (this==anObject) return true;" check (ie. push the problem to the user).
{quote}
I don't understand your point. *Any* equals function must return true if this == anObject.

It *should* be documented better in the reduce interface that the iterator returns the same (modified) value each time., Here is a javadoc patch for the reduce. Does this help?, Much better! I hope that users will notice., The version for 0.18 and 0.19., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12383779/reduce-doc-19.patch
  against trunk revision 666340.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2635/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2635/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2635/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2635/console

This message is automatically generated., My mistake. The javadoc modification is not a blocker. The blocker is HADOOP-3526., I just committed this., Integrated in Hadoop-trunk #522 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/522/])]