[Block replication and block creation should be different: block creation allows partial block but block replication should be atomic, either replicate the entire block or do nothing., This patch removes all traces (in-memory & on disk) of a temporary block if block replication fails., # {{file.delete()}} in {{unfinalizeBlock()}} should check the return value and log if unsuccessful.
# It would be good to designate a method for block and meta files removal. It could be reused in {{invalidate()}} and {{unfinalizeBlock()}}, may ne other places too.
# Reverse the condition for checking whether the transfer is replication-related in {{BlockReceiver.removeBlock()}}.

I verified that temporary block is removed when failed transfer is initiated by block replication or replacement (the balancer).
And is not removed if this a client write, which is what the patch is intended to do.
, This patch incorporates all Konstantin's review comments., This patch makes two more changes:
1. FSDataSet.unfinalize returns if the block is not in ongoingCreates list;
2. BlockReceiver initializes fields srcDataNode & datanode before intializing checksum. This is to avoid NullPointerException in removeBlock in case an exception is thrown when intializing field checksum., +1
Let us create a separate issue for reusing delBlockFromDisk() where it should/can be used. This patch goes to 0.18 so we want to minimize changes., Ant test-core was successful:
BUILD SUCCESSFUL
Total time: 127 minutes 28 seconds

Ant test-patch result:
     [exec] +1 overall.

     [exec]     +1 @author.  The patch does not contain any @author tags.

     [exec]     +1 tests included.  The patch appears to include 5 new or modified tests.

     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.

     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs warnings.

     [exec]     +1 Eclipse classpath. The patch retains Eclipse classpath integrity.
, > Let us create a separate issue for reusing delBlockFromDisk() where it should/can be used..
I created HADOOP-4812., I've just committed this., Integrated in Hadoop-trunk #684 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/684/])
    . Failed block replication leaves an incomplete block in receiver's tmp data directory. Contributed by Hairong Kuang.
]