[4779_20081204.patch: removed the following methods:

- public short getReplication(Path src) throws IOException

- public abstract boolean delete(Path f) throws IOException;

- public long getLength(Path f) throws IOException 

- public long getBlockSize(Path f) throws IOException, +1.
There are some redundant imports in files you modify. Would be good to remove them as well.
Should be marked as incompatible change., 4779_20081218.patch: removed unused imports and updated with trunk., {noformat}
     [exec] -1 overall.  
     [exec] 
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec] 
     [exec]     +1 tests included.  The patch appears to include 18 new or modified tests.
     [exec] 
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec] 
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec] 
     [exec]     -1 findbugs.  The patch appears to cause Findbugs to fail.
     [exec] 
     [exec]     +1 Eclipse classpath. The patch retains Eclipse classpath integrity.
{noformat}

The detail findbugs report (newPatchFindbugsWarnings.html) does not contain any warning.  I suspect the test-patch script does not work correctly in this patch., Tested locally, only TestMapReduceLocal failed but it is not related, see HADOOP-4907., I just committed this., Usage of the fs.delete(Path) method in datajoin causes compile error. Attaching one liner patch to fix it. , Not just data_join, compilation for many more contrib projects is failing, like failmon, index, streaming etc., Right, should have run ant clean first. I'm working on the patch. , Attached patch
- fixes contrib usages of fs.delete(Path)
- deprecates ClientProtocol#delete(Path)
- removes InMemoryFileSystem#delete(Path)
- adds int recursive argument to delete() in libhdfs

, I have reverted 4779_20081218.patch., Since there are quite a few deprecated FileSystem methods and some of them are quite involved, let's create sub-issues for removing them., All deprecated methods are removed except getStatistics(Class<? extends FileSystem> cls) which was deprecated in 0.20 and cannot be removed it in 0.21.  Closing this., Editorial pass over all release notes prior to publication of 0.21., Linking in the jira where these were added back.]