[Patch improves docs. New hadoop fs -help du reads:
{noformat}
-du [-s] [-h] <path>:   Show the amount of space, in bytes, used by the files that 
                match the specified file pattern. The following flags are optional:
                  -s   Rather than showing the size of each individual file that
                       matches the pattern, shows the total (summary) size.
                  -h   Formats the sizes of files in a human-readable fashion
                       rather than a number of bytes.

                Note that, even without the -s option, this only shows size summaries
                one level deep into a directory.
                The output is in the form 
                        size    name(full path)
{noformat}

Also edited the HTML docs. I did not edit the Chinese src/docs/cn/src/documentation/content/xdocs/hdfs_shell.xml - not sure how non-speakers are supposed to keep those up-to-date., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12425171/hadoop-6375.txt
  against trunk revision 836019.

    +1 @author.  The patch does not contain any @author tags.

    +0 tests included.  The patch appears to be a documentation patch that doesn't require tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/140/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/140/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/140/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/140/console

This message is automatically generated., + 1 , Patch looks good. , +1

I committed this. Thanks, Todd!, Integrated in Hadoop-Common-trunk-Commit #91 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Common-trunk-Commit/91/])
    . Sync documentation for FsShell du with its implementation.
Contributed by Todd Lipcon
, Integrated in Hadoop-Common-trunk #167 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Common-trunk/167/])
    . Sync documentation for FsShell du with its implementation.
Contributed by Todd Lipcon
, This JIRA has a regression (see HDFS-792 for more information)]