[This was on trunk, not 0.16.1, This is definitely repeatable. The test fails consistently, mukund can you try with this patch. DU uses current working directory as the test directory. I fixed it to use its own directory under build. This does not fix the creation of tmp .nfs files but should pass the tests. 

I am unable to recreate the problem on my machine., The problem is probably caused by TestCopyFiles.  It might be the case that TestCopyFiles deletes some files which are not closed properly.  So that the OS creates some temporary .nfs files.  TestDU sees these files in the beginning of the test (since it is reading the test root directory).  These files are cleaned up by the OS, therefore, TestDU cannot see them again and says "No such file or directory".

A more correct way is to fix TestCopyFiles so that all files are closed probably.  However, since the codes in TestCopyFiles are complicated, it is much easier to fix it by changing the test directory in TestDU, as done by Mahadev.  We should fix TestCopyFiles later.

Comment on hadoop-2813_1.patch:
Codes are good.  Could you clean up DU_DIR at the end of the test?, Test passes with the patch. Thanks Mahadev, this patch deletes the directory after the test is complete., +1, +1 overall.  Here are the results of testing the latest attachment 
http://issues.apache.org/jira/secure/attachment/12375705/hadoop-2813_2.patch
against trunk revision 619744.

    @author +1.  The patch does not contain any @author tags.

    tests included +1.  The patch appears to include 3 new or modified tests.

    javadoc +1.  The javadoc tool did not generate any warning messages.

    javac +1.  The applied patch does not generate any new javac compiler warnings.

    release audit +1.  The applied patch does not generate any new release audit warnings.

    findbugs +1.  The patch does not introduce any new Findbugs warnings.

    core tests +1.  The patch passed core unit tests.

    contrib tests +1.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1805/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1805/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1805/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1805/console

This message is automatically generated., I just resolved this. Thanks Mahadev!, Integrated in Hadoop-trunk #405 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/405/]), This problem existed in the 0.16 branch as well so I merged it to that branch., Integrated in Hadoop-trunk #424 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/424/])]