[I think the problem is that some of the bit-shift operations in TupleWritable with the Long field, written, are done with Integers. I've attached a patch which I think fixes this problem and unit tests to test it.   , Would it be possible to add a unit test for this?, There should be a unit test added to TestTupleWritable as part of the original patch., I was also thinking of raising a separate JIRA on replacing the written field in TupleWritable with a java.util.BitSet so that you can do joins over 64 datasets - do you have an opinion on this?, Sorry, I don't know what I was thinking about the unit test. +1 on the patch

bq. I was also thinking of raising a separate JIRA on replacing the written field in TupleWritable with a java.util.BitSet so that you can do joins over 64 datasets - do you have an opinion on this?

It might motivate some long-deferred work on memory consumption as well, but I think that's a good idea., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12403606/HADOOP-5571-1.patch
  against trunk revision 758593.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/142/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/142/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/142/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/142/console

This message is automatically generated., I committed this. Thanks Jingkei, Integrated in Hadoop-trunk #796 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/796/])
    ]