[Now that Azure Datalake Gen 2 is public, abfs is the connector getting active development of new features & performance. That'd be the one to work on ... I don't see it there either.

Note the strict test policy for object store patches...it's in the documentation for that tools/hadoop-azure module. Thanks, I should add: serving up the etag as the file checksum would be nice —lets you do backups which use a change in the etag as the sign of a file being out of date

 Look at

* class to describe the etag hadoop-common-project/hadoop-common/src/main/java/org/apache/hadoop/fs/store/EtagChecksum.java
 * HADOOP-13282 is the change to S3A to add this; HADOOP-15287 the discovery we'd better make it optional to stop distcp backups from HDFS failing, as too many jobs weren't using {{-skipCrc}} on the command line, it , Thanks for the pointers, [~stevel@apache.org]. I'll take a stab at implementing this over the next couple of weeks., I started working on a branch here: [CatalystCode/hadoop-16005|https://github.com/apache/hadoop/compare/trunk...CatalystCode:hadoop-16005].

Note that for now I'm implementing {{getXAttr}} and {{setXAttr}} on the old wasb connector. This is because I'm familiar with the Azure Blob Storage SDK but not with the new Azure Datalake Gen 2 API -- implementing {{getXAttr}} and {{setXAttr}} in terms of the SDKs that's more familiar for me will let me better focus on understanding the hadoop-azure codebase itself instead of also having to learn about the new Azure Datalake Gen 2 API at the same time. I'll port the changes required for {{getXAttr}} and {{setXAttr}} to abfs once I have a better understanding of what's going on in the hadoop-azure codebase overall. Hope that's okay, [~stevel@apache.org]., It looks like {{getXAttr}} and {{setXAttr}} now work for the wasb connector ([screenshot of the attributes set by the unit test|https://user-images.githubusercontent.com/1086421/50312485-7b222c80-0476-11e9-8c8f-4595aedd115c.png])., GitHub user c-w opened a pull request:

    https://github.com/apache/hadoop/pull/452

    HADOOP-16005: Add XAttr support to WASB and ABFS

    As discussed in [HADOOP-16005](https://issues.apache.org/jira/browse/HADOOP-16005), this pull request implements `getXAttr` and `setXAttr` on hadoop-azure's WASB and ABFS file-systems.
    
    The changes were tested against the following Azure storage account configurations:
    
    - WASB: StorageV2, RA-GRS replication in East US (primary) West US (secondary). [WASB test session screenshot](https://user-images.githubusercontent.com/1086421/50362109-699f5a00-0534-11e9-97c9-e8a7cee6e6c6.png). All tests pass and the ABFS tests are skipped as expected.
    
    - ABFS: StorageV2 with Data Lake Storage Gen2 preview enabled, RA-GRS replication in East US (primary) West US (secondary). [ABFS test session screenshot](https://user-images.githubusercontent.com/1086421/50361278-fea05400-0530-11e9-9cb4-cc23dec87cfc.png). All ABFS tests pass but the WASB tests fail since the storage account hasn't implemented the blob endpoints yet.
    
    The test-patch script passed: [test-patch output](https://user-images.githubusercontent.com/1086421/50377952-50aaad80-05f5-11e9-8ea2-b7bf99fc7509.png).

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/CatalystCode/hadoop hadoop-16005

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/hadoop/pull/452.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #452
    
----
commit 1c8303a5af1016455d23ce78508f911a10af4e77
Author: Clemens Wolff <clewolff@...>
Date:   2018-12-20T21:30:56Z

    Add setXAttr and getXAttr to WASB and ABFS

----
]