[is this a regression?, Yes it is. I will submit a patch to fix it., I am marking this as a Blocker since it is a regression from earlier releases., I am submitting an initial patch to fix the problem. I will see if I can add a junit test later., Looks like we need the same fix in DF.java as well.
, I thought DF.java needed the same fix as well. But it turns out that DF works right.  Although both use the same condition, their if statements are opposite., :). Thats right. I saw the same conditional there and didn't look more to verify., The patch includes:
1. a unit test to make sure that du does not run every time getUsed is called.
2. restructure DU, DF, and Command so that the code that checking if a shell command needs to be run is factored into the parent class Command., 1. You need to initialize Command.lastTime in the constructor the way it was done in DF.
The idea is that the interval can be set to MAX_LONG, which means that I want to execute the command once and never there after.
2. Could you please make a test case for that too.
3. I'd rename Command to ShellCommand. We have many other commands like UpgradeCommand, BlockCommand, etc.
So it is confusing., The patch incorporates Konstantin's comments., +1, +1 overall.  Here are the results of testing the latest attachment 
http://issues.apache.org/jira/secure/attachment/12366783/du2.patch
against trunk revision r580487.

    @author +1.  The patch does not contain any @author tags.

    javadoc +1.  The javadoc tool did not generate any warning messages.

    javac +1.  The applied patch does not generate any new compiler warnings.

    findbugs +1.  The patch does not introduce any new Findbugs warnings.

    core tests +1.  The patch passed core unit tests.

    contrib tests +1.  The patch passed contrib unit tests.

Test results: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/850/testReport/
Findbugs warnings: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/850/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/850/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/850/console

This message is automatically generated., I just committed this. Thanks Hairong!, Integrated in Hadoop-Nightly #257 (See [http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Nightly/257/]), Integrated in Hadoop-Nightly #258 (See [http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Nightly/258/])]