[Here is a patch that modifies test-patch/test-patch.sh to use git instead of svn. Instead of having the build pass the SVN_REVISION, I compute the GIT_REVISION automatically. 

I am not sure if this is the right script though. All the scripts seem to running ant commands and not mvn commands.

[~gkesavan] - please advise on whether this is the right file to change, and if similar changes are to be made on any other files. Thanks. , Thanks Giri for pointing to the right file. 

Here is a patch that uses git instead of svn. , {color:green}+1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12664250/hadoop-11001-2.patch
  against trunk revision .

    {color:green}+1 @author{color}.  The patch does not contain any @author tags.

    {color:green}+1 tests included{color}.  The patch appears to include 1 new or modified test files.

    {color:green}+1 javac{color}.  The applied patch does not increase the total number of javac compiler warnings.

    {color:green}+1 javadoc{color}.  There were no new javadoc warning messages.

    {color:green}+1 eclipse:eclipse{color}.  The patch built with eclipse:eclipse.

    {color:green}+1 findbugs{color}.  The patch does not introduce any new Findbugs (version 2.0.3) warnings.

    {color:green}+1 release audit{color}.  The applied patch does not increase the total number of release audit warnings.

    {color:green}+1 core tests{color}.  The patch passed unit tests in .

    {color:green}+1 contrib tests{color}.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-HADOOP-Build/4545//testReport/
Console output: https://builds.apache.org/job/PreCommit-HADOOP-Build/4545//console

This message is automatically generated., Hi Karthik, this is probably a stupid question but where is the address of the new repo configured? Thanks, Arpit., Also related, where is the bootstrap code for cloning into a new build slave? Or is that done manually?, I think the repo and other bootstrap is handled by how the Jenkins jobs are configured. [~gkesavan] would know better. , patch LGTM. Answering the repo Q, yes, in the Jenkins job conf that is set., that was a +1, Thanks Tucu. I ll go ahead and commit this now. 
, Committed to trunk, branch-2, branch-2.5 and branch-2.5.1. 

Thanks for your reviews, Arpit and Tucu. , {code}
+    $GIT reset --hard
{code}
Can we find an alternative to the above ?
Currently patchprocess directory is one level above ${WORKSPACE} which may cause some problem., Are we sure it is the {{git reset --hard}} and not {{git clean -xdf}}? 

Is it okay to create the patchprocess directory after these calls? , It seems like we're not properly archiving artifacts - eg see https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/4855// which had some warnings reported in the test-patch output, but doesn't have any archived artifacts in order to see what went wrong., Looks like some of the builds were fixed and others weren't. Looking into this. , My bad. Mixed it up with another issue post git. Will look into this early next week if no one else gets to it by then. ]