[Here is a preliminary patch for review.  I still need to finish documenting MiniDFSCluster.  Here are the main changes in this patch:

MiniDFSCluster:
 - use new static create methods on DataNode and NameNode
 - remove Runner threads
 - remove deprecated constructors
 - add new constructor, options, and methods needed by DFS upgrade tests

All Tests:
 - MiniDFSCluster constructor now throws Exception so tests that use it now do too

DataNode and Storage:
 - removed deprecated methods that were only used by MiniDFSCluster
 - removed static method/fields that were created for MiniDFSCluster and are no longer needed, MiniDFSCluster( ... ) constructor should throw IOException rather than Exception.
This will require changing NameNode.createNameNode() to throw IOException instead of Exception., Smaller patch that doesn't change all the tests to throw Exception., This makes HADOOP-1206 obsolete.  The latest patch address Konstantin's concerns.  Thanks Konstantin!, +1, because http://issues.apache.org/jira/secure/attachment/12355057/1203.patch applied and successfully tested against trunk revision http://svn.apache.org/repos/asf/lucene/hadoop/trunk/525596. Results are at http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch, Nigel, 
Do you want to finish the documentation before this is committed? (I noticed some of the javadoc says "PENDING".), Added missing comments., Attaching correct patch., All tests pass on Windows, Linux, and Solaris., +1
This makes MiniDFSCluster simple and clear., -1, because 1 attempts failed to build and test the latest attachment http://issues.apache.org/jira/secure/attachment/12355086/1203.patch against trunk revision http://svn.apache.org/repos/asf/lucene/hadoop/trunk/526215. Please note that this message is automatically generated and may represent a problem with the automation system and not the patch. Results are at http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch, +1, because http://issues.apache.org/jira/secure/attachment/12355086/1203.patch applied and successfully tested against trunk revision http://svn.apache.org/repos/asf/lucene/hadoop/trunk/526215. Results are at http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch, I've just committed this. Thanks Nigel!, Integrated in Hadoop-Nightly #50 (See http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Nightly/50/)]