[As Nigel mentioned in HADOOP-3141, we are seeing this on namenode logs as well., I would recommend this for 0.16.3. The fact that it is currently not harmful is secondary, I think., Setting the earliest next release 0.17. If there is 0.16.3, this should go there too., Patch attached. Server synchronizes on selector.keys() when it iterates over it once every few seconds.  JavaDoc for Selector says we need to synchronize on these sets while accessing them. In this perticular case, IPC handler could enqueue more connections (thus modifying selector.keys()) while Responder iterates over them.

With some artificial sleeps I verified these exceptions show up before the patch and disappear after.

Regd unit test, I think this was straight forward incorrect access of an object and we are correcting it. I don't think this requires a unit test, as such it is not easy to trigger this reliably., Could someone review this? Its a simple patch. Thanks.
, +1. Code looks good., Thanks Dhruba., -1 overall.  Here are the results of testing the latest attachment 
http://issues.apache.org/jira/secure/attachment/12379060/HADOOP-3010.patch
against trunk revision 643282.

    @author +1.  The patch does not contain any @author tags.

    tests included -1.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    javadoc +1.  The javadoc tool did not generate any warning messages.

    javac +1.  The applied patch does not generate any new javac compiler warnings.

    release audit +1.  The applied patch does not generate any new release audit warnings.

    findbugs +1.  The patch does not introduce any new Findbugs warnings.

    core tests +1.  The patch passed core unit tests.

    contrib tests +1.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2137/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2137/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2137/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2137/console

This message is automatically generated., I just commented this. Unit Test omission is explained in the 4th comment above., I just merged this to 0.16 branch., Integrated in Hadoop-trunk #451 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/451/])]