[These are pretty much two separate problems.

I have a fix for b, but it isn't very clean. :), Got a simple fix:
- Remove the hardcoded "-ljvm" in two Makefile.am files.
- Run "autoreconf".

With the attached patch, ant compile-native passes on both Mac OS-X and Linux RHEL 5.1.

, Note, the real changes to the existing code base are really in two files. The remaining changes are caused by "autoreconf".
- ./src/native/Makefile.am
- ./src/native/src/org/apache/hadoop/io/compress/zlib/Makefile.am, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12449607/hadoop-6863-20100715.patch
  against trunk revision 964134.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 1 new or modified tests.

    -1 javadoc.  The javadoc tool appears to have generated 1 warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h1.grid.sp2.yahoo.net/88/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h1.grid.sp2.yahoo.net/88/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h1.grid.sp2.yahoo.net/88/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h1.grid.sp2.yahoo.net/88/console

This message is automatically generated., Hudson is wrong again. The patch does not include new tests, nor does it change any javadocs., I'll try to test this on a multi-arch JVM (Solaris, OS X) today.  , @allen, thanks for helping out., I haven't had a chance to try the patch yet, but it should be noted that it looks it was built with newer automake and I'm guessing newer libtool than the base version we have documented..., I used the version installed on my Mac.  What are the base versions we have documented?

Sent from my iPhone



, New patch that is generated using automake 1.9 aclocal 1.9 and autoconf 2.59., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12450246/hadoop-6863-20100721.patch
  against trunk revision 966911.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 javadoc.  The javadoc tool appears to have generated 1 warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/628/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/628/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/628/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/628/console

This message is automatically generated., bq. -1 tests included. The patch doesn't appear to include any new or modified tests.
This is expected as the patch only touches the build system.

bq. -1 javadoc. The javadoc tool appears to have generated 1 warning messages.
This is false alarm., @allen, do you have objections of having this patch committed?, Right now, yes, because it needs to be tested on a bi-arch jvm., bq. Right now, yes, because it needs to be tested on a bi-arch jvm.
I have tested the patch for both Linux and Mac OS X. Would you help test on other archs?, Java on Snow Leopard is very different than what is on Leopard due it properly supporting the -d flag to flip from 32-bit and 64-bit JVM support.  Last I heard, Yahoo! was still using Leopard., Does anyone else blow configure warnings with this patch?

For example:
configure.ac:46: warning: AC_CACHE_VAL(lt_prog_compiler_static_works, ...): suspicious cache-id, must contain _cv_ to be cached
, bq. Java on Snow Leopard is very different than what is on Leopard due it properly supporting the -d flag to flip from 32-bit and 64-bit JVM support. Last I heard, Yahoo! was still using Leopard.
Ok, I will test it with snow leopard and see if it works.

bq. configure.ac:46: warning: AC_CACHE_VAL(lt_prog_compiler_static_works, ...): suspicious cache-id, must contain cv to be cached
No. I have not seen this. What is the command line that triggers this message? What versions of autotools you are using?, bq. Ok, I will test it with snow leopard and see if it works.
ant compile-native and ant test-core pass on Snow Leopard., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12450246/hadoop-6863-20100721.patch
  against trunk revision 1031422.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://hudson.apache.org/hudson/job/PreCommit-HADOOP-Build/29//console

This message is automatically generated., I do not have access to some box with automake 1.9. The enclosed patch contains all the manual changes.

To commit, please apply the patch, and run "autoreconf"., lots has changed here. closing as stale.]