[The trivial patch doing the fix, {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12546845/HADOOP-8861.patch
  against trunk revision .

    {color:red}-1 patch{color}.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-HADOOP-Build/1537//console

This message is automatically generated., Hadoop QA failed applying the patch as the patch is against branch-1. The issue does not exist in trunk, so fix is needed only for branch-1, I ran tests on branch-1, both commit and smoke tests pass. After that, the build fails saying unable to delete userlog file. I see the same behavior in jenkins builds as well - https://builds.apache.org/job/Hadoop-1-Code-Coverage/159/consoleText, Thanks Amareshwari, for the patch.

Change make sense to me. Do you mind having a small test like TestLocalFileSystem#testSyncable in trunk.
Other than that, +1 for the patch., Moved to 1.2.0 upon release of 1.1.0., Patch with test added in TestLocalFileSystem, {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12549677/HADOOP-8861-2.patch
  against trunk revision .

    {color:red}-1 patch{color}.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-HADOOP-Build/1646//console

This message is automatically generated., Hadoop QA failed to apply the patch since it is against branch-1. I ran the tests on box, the result is the same as earlier - both commit and smoke tests pass. After that, the build fails saying unable to delete userlog file.

Also, the TestLocalFileSystem result:

    [junit] Running org.apache.hadoop.fs.TestLocalFileSystem
    [junit] Tests run: 7, Failures: 0, Errors: 0, Time elapsed: 12.196 sec
 , +1, I will commit it in some time. Thanks Amareshwari, I have just committed to branch-1. 
Committed revision 1400256., Closed upon release of Hadoop 1.2.0.]