[A suspect is HADOOP-3497 which introduced a listing call on the parent directory no matter the path contains globs or not in globStatus. One of our users calls "dfs -get" on many small files under one large directory. It has the same effect of calling dfs -ls many times on the large directory, thus causing NN to do lots of gc and making it less responsive., This patch restores pre-0.20.0 behavior., This patch fixed a bug in the previous patch., Manual tests on dfs -ls/get etc. showed that the patch removed the additional listing call to the parent directory if the input path did not contain a glob., I am not able to get to run all unit tests, but all fs/dfs related unit tests were passed., +1 patch looks good.

I tested manually and ran some related tests.  Everything has worked fine., {noformat}
     [exec] -1 overall.  
     [exec] 
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec] 
     [exec]     -1 tests included.  The patch doesn't appear to include any new or modified tests.
     [exec]                         Please justify why no tests are needed for this patch.
     [exec] 
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec] 
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec] 
     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs warnings.
     [exec] 
     [exec]     +1 Eclipse classpath. The patch retains Eclipse classpath integrity.
     [exec] 
     [exec]     +1 release audit.  The applied patch does not increase the total number of release audit warnings.
{noformat}, I have committed this to 0.20 and above.  Thanks, Hairong!, This jira is related to HADOOP-4693. This jira removes unnecessary listing at the client side. But the fundamental fix should go into NameNode in HADOOP-4693. , Koji did some experiments with the patch. He is too busy to post the results. I am doing this for him.

Directory size with 10,000 files.
About 450 mappers. Each mapper calling dfs -get 10000 times.

Without the fix, namenode was showing 20-30 getblocklocations per sec and 30-40 threads blocked.
With the fix, 600 getblocklocations per sec and almost no blocked threads. , Integrated in Hadoop-trunk #796 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/796/])
    ]