[Isn't this a dupe of HADOOP-6101? I don't see how the bin scripts hit this since they don't appear to use relative paths., This problem occurs when CDPATH is set and includes "." (the present working directory). It is unsafe to assume that cd will not print to standard output.

The bash documentation states:

{quote}
If a non-empty directory name from CDPATH is used, or if ‘-’ is the first argument, and the directory change is successful, the absolute pathname of the new working directory is written to the standard output. 
{quote}

Steps to recreate:

1. export CDPATH=.
2. Run any hadoop script that contains the offending bin=`cd "$bin"; pwd` line

In this case, because CDPATH includes "." and the current value of $bin is "." an invocation of "cd" will cause the current absolute path to be printed to standard output. I have verified this problem occurs under these circumstances using bash 4.1.2(1) on Scientific Linux 6.2.

The safest fix is to find all instances of the following:

{code}
bin=`cd "$bin"; pwd`
{code}

and replace the above with the following:

{code}
bin=`cd "$bin" &> /dev/null; pwd`
{code}, Hi Lane, you may want to reattach a new patch and click the "submit patch" to kick off the automatic hadoop QA process.  In my machine, I got patch apply failure.


⚡ dev-support/test-patch.sh ~/Downloads/HADOOP-6851-0.22.patch 
Running in developer mode


======================================================================
======================================================================
    Testing patch for HADOOP-6851-0.22.patch.
======================================================================
======================================================================



Patch file /Users/jianbwei/Downloads/HADOOP-6851-0.22.patch copied to /tmp
The patch does not appear to apply with p0 to p2
PATCH APPLICATION FAILED




-1 overall.  

    -1 patch.  The patch command could not apply the patch.




======================================================================
======================================================================
    Finished build.
======================================================================
======================================================================
, What should I build my patch against? The latest svn, or a particular release?, I am not sure.  But I guess you can specify the version you patch against when submitting the patch.  I found it is not compatible with trunk and just notice that your patch is for 0.22., next patch version of HADOOP-9902 will include this fix. Closing as a dupe.]