[This patch has three changes:
# NameNode interprets numOfTransfers as numOfBlocks to be replicated. The current code interprets it as numOfTargets to be replicated. This change is made in DatanodeDescriptor#BlockTargetPair.poll(). This prevents empty replication requests as well as empty recover requests.
# The number of targets to be chosen is not capped by the number of transfers. Again NameNode should not treat the number of transfers as the number of targets.
# The third change is not directly related to this issue. But I saw this happen when I debugged this issue. The current code moves a block to the pending replication queue only when it reaches its replication factor. This sometimes causes over-replication because it does not track all pending replications. This patch adds a block to the pending replication queue whenever there is one replication scheduled for this block., +1 on all changes.

Little thing:
{{else}} clause in {{DatanodeDescriptor.BlockQueue.poll()}} can be removed., Thanks Konstantin for the review. This patch fixed the little thing as well., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12402322/numTransfers1.patch
  against trunk revision 755003.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/92/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/92/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/92/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/92/console

This message is automatically generated., I've just committed this., Integrated in Hadoop-trunk #783 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/783/])
    . NameNode should not send empty block replication request to DataNode. Contributed by Hairong Kuang.
, Hi Hairong,

This is an old issue but could you please verify my understanding about this bug? So basically, because the NN keeps send empty replication command, the DN creates a new thread for every empty command, which eats up DN's resource, right?

Many thanks]