[I am reproducing it by running NNThroughputBenchmark -op create once and then repeating it again.
The name-node would not start with the same exception. This is with Fri May 30 trunk.
Don't think we can release 0.18 without a fix. Making it a blocker., Oops! This should not have been unassigned from 0.18.0, In this case, we should probably check whether a file exists before restoring the lease., 3418_20080609.patch: check existence before writing to image., 3418_20080609b.patch: remove lease during delete instead of checking existence before writing to image., 3418_20080610.patch: fixed a bug., I looked at the code and it looks good. +1. 

I wonder if this patch is needed for 0.17. It would be nice if you can run the unit test on the 0.17 branch to determine if this bug exists in 0.17 as well.
, The problem does not appear in 0.17, which could pass the new test in the patch., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12383763/3418_20080610.patch
  against trunk revision 666056.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 6 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2633/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2633/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2633/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2633/console

This message is automatically generated., I just committed this. Thanks Nicholas!, Integrated in Hadoop-trunk #520 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/520/])]