[Well, I just ran the trunk tests on an OSX box and didn't get any failures, so it's something odd about your machine. Which means, unfortunately, you are the only person who can track it down. Sorry

Try doing (in {{hadoop-common/hadoop-common-project}} a clean test of only one test that is failing, then look at what is happening to cause the failure 
{code}
mvn clean test -Dtest=TestFileUtil#testFailFullyDelete
{code}, Please post an email to the user threads with these kind of issues instead of creating Jiras. Jiras are for reporting confirmed bugs., [~aymenjla], are you running as root?  I recently discovered that {{TestDiskChecker}} fails if running as root due to some assumptions in the test code about file permissions.  The test doesn't account for the fact that root is special and can access anything.  Full details are in HADOOP-8973.  Until we fix it, I recommend re-running your tests as a non-root user.

As others have said, please continue discussion on the user list if necessary.  I'm only replying here because I couldn't find an existing thread in the user list, and I wanted to make sure you would see this information.

Hope this helps,
--Chris
, Hi, 

Suresh Srinivas, I will transfert my question to the adequate placement, can you tell me where can i ask it?
Chris Nauroth, Yes i run as root, i don't now how offert root-right to other user-compte on mac-OS (account and right's administrator have also some restrictions and limit disk access), that's why i'm connecting as a root.
I try with other user account and it's failure?? 

If you have other suggestions?
thanks for all for your help., Chris Nauroth, i run the test-execution as other admin-user but i have the same error-message?, [~aymenjla] http://hadoop.apache.org/mailing_lists.html#Developers is the appropriate mailing list.
, Issue is still there with Hadoop 2.6.0 : when running tests as root, there are many extra issues.
When do you plan to fix that ?, IF it is only as root that this problem surfaces, then what is probably happening is that those tests which test file permissions (and expect things to fail if the user has the wrong permissions) are not failing, as the root user can override those tests.

In which case, this would be a WONTFIX. What someone could do is add some JUnit4 logic to skip every single test case which doesn't run as root, but since developing and testing code as root is considered bad form, its unlikely to happen from the active Hadoop developers. Its a maintenance problem too., Thanks for the answer. I understand.
Anyway, though having this (run tests as non-root) in mind, mistakes will still occur, generating loss of time and frustrations.
A global check would help: prevent to run ALL the tests when logged as root. Anyway, it's just a suggestion.]