[It seems to me that this template often regress due to libraries updates or changing paths. This patch try to fix the current breaks and add to tests to test-patch in an attempt to lower the probability they reappears (it checks for missing libraries and directories).

It do not adds things from contrib/ altough, because I'm unsure about what should be added and what should not (for example, fuse-dfs is a C code, something that Eclipse doesn't support out of the box).

What would you like to be in the README ?, Updated patch to add tools source directory (https://issues.apache.org/jira/browse/HADOOP-3512), test jars for the FTPFileSystem, and a README.txt., Tried the latest patch.  I have done the following steps:
# Eclipse svn check out 
# Quit eclipse
# Copy and overwrite existing files from .eclipse.templates/* to the project root
# run "ant test ..." to generate build/test/classes
# Start eclipse, refresh, clean, rebuild
# Eclipse complains "Variable references non-existent resource: ${workspace_loc:/@PROJECT@/build.xml} "
# I change ${workspace_loc:/@PROJECT@/build.xml}  to /@PROJECT@/build.xml

It seems works finally.  

I am not sure whether the steps above are correct.  I think it is not obvious to figure out how to use the template.  It will be great if the README could include some instruction using the template., bq. It will be great if the README could include some instruction using the template.

The README has a link to the wiki where you can find the instructions on how to get it to work. I find Eclipse does need a bit of prodding with refreshes and rebuilds to get it working., > The README has a link to the wiki where you can find the instructions on how to get it to work.

The wiki http://wiki.apache.org/hadoop/EclipseEnvironment describe using eclipse *without* the template and the description in the wiki is already out-dated.

> 7. I change ${workspace_loc:/@PROJECT@/build.xml} to /@PROJECT@/build.xml

Is it a bug?  Or I have to set something in eclipse?, bq. The wiki http://wiki.apache.org/hadoop/EclipseEnvironment describe using eclipse without the template and the description in the wiki is already out-dated.

There's a section called "Configuring Eclipse to build Hadoop" which describes the new process. The section below is the old manual process which is probably out of date and should be removed now.

bq. > 7. I change ${workspace_loc:/@PROJECT@/build.xml} to /@PROJECT@/build.xml
bq. Is it a bug? Or I have to set something in eclipse?

workspace_loc is a built in variable, so you shouldn't have to set anything. I wonder if it is a version problem - I'm using Eclipse 3.3.1.1., >There's a section called "Configuring Eclipse to build Hadoop" which describes the new process.
Oops, I missed it.  I have searched "template" in the Wiki page but nothing was found.

> I wonder if it is a version problem - I'm using Eclipse 3.3.1.1.
Mine is:
Eclipse Platform
Version: 3.3.2
Build id: M20080221-1800
, In the wiki page, it says "Run the eclipse-files ant target."  I have not done it last time.

I just have tried "ant eclipse-files".  Then, @PROJECT@ in Hadoop_Ant_Builder.launch is replaced by an empty string.  When I open eclipse, eclipse says 
{noformat}
An internal error occurred during: "Compute launch button tooltip".
Path must include project and resource name: /build.xml
{noformat}
, Doesn't this need to be fixed for 0.18 as a blocker? Is it ready to be Patch Avail?, *@Tsz Wo (Nicholas), SZE*
Are you running windows ? What is the path to your project ?
The regexp that tries to deduce project's name from the path is {{<regexpmapper from="^.*/([^/]+)$$" to="\1"/>}} I guess that there is something in your path it doesn't like.

*@Owen O'Malley*
It seems not to be ready yet because of the issue above, but if the problem comes from the regexp the fix will be quick., Yes, Windows.  The path is /cygdrive/d/@sze/hadoop/testing, Here is the problem on Windows:  I added
{code}<echo>basedir=${basedir}</echo>{code}
right before <pathconvert property="eclipse.project"> and the ant output is
{noformat}
     [echo]       basedir=d:\@sze\hadoop\testing
{noformat}
Since the path separator in Windows is \, so the pattern does not work.
, Nicholas,

Does this patch fix the problem for you?, +1, hadoop-3480-v2.patch works well in Windows, thanks Tom.
, +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12384431/hadoop-3480-v2.patch
  against trunk revision 671385.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 9 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2733/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2733/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2733/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2733/console

This message is automatically generated., I've just committed this. Thanks Brice!, Integrated in Hadoop-trunk #530 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/530/])]