[This is a Hadoop bug related to https://issues.apache.org/jira/browse/MAPREDUCE-4374. On Windows when setting up environment variable for child tasks, we add quotes to the environment variable values to avoid escaping special characters. In Cmd shell, the quotation marks are set as part of the environment variable value. So when we receive the environment variables in Hadoop code, we should remove the surrounding quotes. We already have code in several places to do so. I am thinking this could be something we missed in previous patch.

It is involved to debug this issue because we need to pass debug opts to oozie, hadoop and child tasks, which are difficult. I tried a different approach, searching for "System.getenv()" across oozie and hadoop projects, and found two suspicious places:
In DistCp.java
{code}
  private static JobConf createJobConf(Configuration conf) {
    ...
    String tokenFile = System.getenv("HADOOP_TOKEN_FILE_LOCATION");
    if (tokenFile != null) {
      LOG
        .info("Setting env property for mapreduce.job.credentials.binary to: "
          + tokenFile);
      jobconf.set("mapreduce.job.credentials.binary", tokenFile);
    }
{code} 

and in UserGroupInfomration.java
{code}
static UserGroupInformation getLoginUser() throws IOException {
  ...
        String fileLocation = System.getenv(HADOOP_TOKEN_FILE_LOCATION);
        if (fileLocation != null && isSecurityEnabled()) {
          // load the token storage file and put all of the tokens into the
          // user.
          Credentials cred = Credentials.readTokenStorageFile(
              new Path("file:///" + fileLocation), conf);
{code}

The first one is very likely to be the root cause of this oozie test failure (see JobClient.readTokensFromFiles() 
{code}
String binaryTokenFilename =
      conf.get("mapreduce.job.credentials.binary");
    if (binaryTokenFilename != null) {
      Credentials binary = 
        Credentials.readTokenStorageFile(new Path("file:///" +  
                                                  binaryTokenFilename), conf);
      credentials.addAll(binary);
    }
{code}
). 

The second one looks like a potential bug we may run into. We need to fix both.
, I attached a patch based on my previous root cause analysis. Oozie test passed after this fix. If we see many such problem, an improvement could be writing a common function to remove quotes from file paths. , Oozie doesn't need to directly read HADOOP_TOKEN_FILE_LOCATION nor set it in the job conf.  It's implicitly read by the UGI.  The env is an implementation detail of how the container executor transfers tokens into a new process., Thanks, [~daryn]. I am sorry. I didn't make the description clear. Attached is the stderr information. Basically TestDistCpActionExecutor calls DistCp in some mapreduceJob. A minicluster is launched for executing this. However, the jobToken file can't be found when the mapred job is running. See the error: 

file:/"D:/git/Monarch/project/oozie-monarch/core/target/test-data/minicluster/mapred/local/0_0/taskTracker/test/jobcache/job_20130725105336682_0001/jobToken"    

The cause of this is the surrounding quotes around the path.  As I mentioned in my previous comment, on Windows when setting up environment variable for child tasks, we add quotes to the environment variable values to avoid escaping special characters. In Cmd shell, the quotation marks are set as part of the environment variable value. So when we receive the environment variables in Hadoop code, we should remove the surrounding quotes.   

Please let me know if you have any concerns or questions., A new patch was attached. I refactored the code using a common method in Shell.java., +1

bq. Oozie doesn't need to directly read HADOOP_TOKEN_FILE_LOCATION nor set it in the job conf. It's implicitly read by the UGI. The env is an implementation detail of how the container executor transfers tokens into a new process.

I think Ozzie uses DistCp in its mapreduce child tasks. Due to how we pass environment variable to child tasks on Windows, all code used by child tasks that accesses the environment variable values need to remove the surrounding quotes first., +1 for the patch.  Thanks, Xi!  I'll commit this later today., Thanks Chuan and Chris, I have committed this to branch-1-win.  Xi, thank you for the patch.  Chuan, thank you for the code review.]