[The last success build is #2576 and beginning from #2577, TestStreamingFailure.testCommandLine keeps failing.  I have downloaded two builds and diff CHANGE.txt.  Below is the output:
{code}
139,141d138
<     HADOOP-1328. Implement user counters in streaming. (tomwhite via
<     omalley)
< 
251,254d247
<     HADOOP-3095. Speed up split generation in the FileInputSplit,
<     especially for non-HDFS file systems. Deprecates
<     InputFormat.validateInput. (tomwhite via omalley)
{code}
Looks like that HADOOP-1328 causes this problem., Its better we cleanup using FileUtil.fullyDelete which cleans up any remaining .crc files. Attached patch fixes this and passes the test., +1 patch looks good, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12383485/HADOOP-3493-1.patch
  against trunk revision 663762.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2597/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2597/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2597/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2597/console

This message is automatically generated., I just committed this. Thanks, Lohit!]