[Owen, like with HADOOP-10141 it is not clear why contributions we at Intel have already made in patches on other JIRAs now need duplicate issues created by you, in order to be discussed? The bytebuffer-based cipher API for Hadoop was contributed by us on HADOOP-9331 and again reused by us on HDFS-5143, where you have now copied this from. If this needs to be discussed both HADOOP-9331 and HDFS-5143 are still open to discussion, let’s do it on one of these JIRAs.
It is good to see there is more and more interest in adopting the work we at Intel have contributed to Apache. However, the community interaction here is not consistent with the Apache way of community over code (for reference: http://theapacheway.com/), and we would like to address this in addition to any technical discussions., Luke,
  I'm trying to get the work committed. HADOOP-9331 and HDFS-5143 put too many issues together into a single un-reviewable issue. I'm pulling parts out so that we can make progress. We need key management with versioning and third party support. No patches had those properties and so I started there with HADOOP-10141. The ByteBuffer API for ciphers is a good idea, but it had substantial issues in HDFS-5143 that needed to be addressed. Doing it in a mega-jira is really difficult, so I cut it out so that we could start a much more focused discussion., Afterr looking at the javax.security.Cipher API more deeply, it does have both byte[] and ByteBuffer methods.

Unfortunately the methods in Cipher are declared final and the actual implementation is done by a nested implementation class. It isn't clear what the performance penalty for using javax.security.Cipher with a openssl-based provider would be, but it doesn't look excessive.

My thoughts are that instead of reinventing the wheel, we should use the standard javax.security.Cipher API with a customer provider that is based on openssl.

Thoughts?, Owen, Did you mean Liu? Assuming you did, here are my thoughts to your comments. If you were not responding to me, sorry for interrupting.

Good to hear you are trying to help commit our work. Hopefully that would not need duplicate JIRAs to be created to discuss the work and even break it up in to smaller pieces. We are already doing that for HDFS-5143 and will also do the same with HADOOP-9331. If you have specific technical review comments please provide the same.

, Hi Owen,  as for “we should use the standard javax.security.Cipher API with a customer provider that is based on openssl.”, we had already done the work, you can find it on 10150. ]