[Patch attached. Copy the resource_manager.options into resource_manager.attrs. 
Also, options can be of type int when substituting the values, so do stringification first.
, resubmitting to Hudson, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12388315/HADOOP-3959.v1.patch
  against trunk revision 689666.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3130/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3130/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3130/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3130/console

This message is automatically generated.,  * TestMiniMRDFSSort.testMapReduceSort is the core test that failed. HOD is not used in core testing, so this failure is not related
 * Contrib test failures were related to pipes. Again HOD not used here.
 * The HOD test suite does not test that options are passed to the resource manager, hence I have added not test.

Hemanth, can you review this patch?, bq. Hemanth, can you review this patch?

Craig, thank you for the patch. I am watching this issue and will surely review it in a couple of days time., resubmitting to Hudson.

I'm keen that something like this makes 0.19, Craig, sorry for holding this up this long. I've seen the patch you've attached, it has some problems. The way you are passing resource_manager.options as nodepooldesc is correct. But the way you've fixed the error that comes up while enabling resource_manager options is not correct. It also is making HOD fail after allocation for me, not for you?

In the code, all keyval pairs used anywhere are formed only by string keys and string values, so assuming an int value and casting it to a string seems to be incorrect. The actual reason why such an int came in was when you enable resource_manager.options, l:nodes is set by HOD to an integer value. I changed it to pass it as a string. This seems to be the correct fix, can you please check this and verify if this works for you? Thanks., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12390109/HADOOP-3959-20080915.txt
  against trunk revision 695690.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3267/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3267/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3267/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3267/console

This message is automatically generated., +1. Works fine for me.

bin/hod allocate -d /tmp/a --resource_manager.options=l:arch=x86_64
or
bin/hod allocate -d /tmp/a --resource_manager.options=l:arch=x86


Worth updating documentation?

C, The attached patch file fixes a small bug which was breaking HOD when the newly enabled {{resource_manager.options}} was used along with wallclock time option, {{-l}}. Other than that patch is the same. I've tested it pass {{-l:ncpus=1}} to the resource_manager.options variable., bq. Worth updating documentation?

Yes. And ideally should be part of this patch. However, given I'd like to get some fixes in before tomorrow, I'd like to update this after the feature freeze date. We normally do this anyway where we verify all the changes made in a release and update documentation for them., +1 for the latest fix., Results of ant test-patch:

     [exec] -1 overall.

     [exec]     +1 @author.  The patch does not contain any @author tags.

     [exec]     -1 tests included.  The patch doesn't appear to include any new or modified tests.
     [exec]                         Please justify why no tests are needed for this patch.

     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.

     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs warnings.

The -1 on tests is explained above. 

Also, I ran hod unit tests manually and they passed. I will commit this patch now., I just committed this. Thanks, Craig and Vinod !, Integrated in Hadoop-trunk #611 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/611/])]