[Ramya, how are you setting the interval to 1 minute?  in hodrc or hadoop-site.xml?

If this is truly broken, why is this marked "minor"?, I haven't tested on 0.19, but we've been using the Trash feature on our clusters for some time .

Could you check if Namenode config also has the non-zero fs.trash.interval? 

- Client uses 'fs.trash.interval' to determine whether to delete files or move them to Trash.

- Namenode uses 'fs.trash.interval' for running the expunge thread to clean up the users' Trash directories.

So your files should be deleted between namenode's  'fs.trash.interval to  'fs.trash.interval * 2' period.

, To explain it in more detail, here is how I carried out the test:
1) Allocate a cluster through HOD
2) Append ><property><name>fs.trash.interval</name> <value>1</value> <description>Number of minutes between trash checkpoints.  If zero, the trash feature is disabled. </description></property> in hadoop-site.xml under the <cluster_dir>
3) ssh to the machine where name node is running and append the same above line in <hodring.temp-dir>/<username>.<jobid>.<hostname>.hodring/0-namenode/confdir
4) Create some files on HDFS and delete it. 
The files are getting deleted and being moved to .Trash but not being removed from .Trash after <fs.trash.interval>, Wait... just to be clear, _after_ the cluster was allocated, you updated the config file of the running namenode? If so, that's not supported and the parameter needs to be given to HOD prior to allocation., Sorry for the mistake Chris. Koji pointed out the right way to execute it. Here is what I followed:
1)  Allocate a cluster through HOD and pass --gridservice-hdfs.cmdline-params=fs.trash.interval=10 to HOD.
2) Append ><property><name>fs.trash.interval</name> <value>10</value> <description>Number of minutes between trash checkpoints. If zero, the trash feature is disabled. </description></property> in hadoop-site.xml under the <cluster_dir>
3) Create some files on HDFS and delete it. 
The files are getting deleted and being moved to .Trash but not being removed from .Trash after <fs.trash.interval>

Interestingly, I set up a stand alone mode and the files were removed from .Trash after <fs.trash.interval>. But the same behavior was not seen in distributed mode., Please mark it as a blocker for 0.19 if required, Verified the issue with Milind and confirming it as a blocker for 0.19., Are you using HOD to create an HDFS cluster? It's not clear from your description that you are.
If you allocate a map/reduce only cluster through HOD set fs.trash.interval for your HOD allocation then that setting will not affect a static external HDFS.

, Sorry, for not being clear. I am using HOD to create a HDFS cluster.
I am not making use of the static external HDFS., bq. Interestingly, I set up a stand alone mode and the files were removed from .Trash after <fs.trash.interval>. But the same behavior was not seen in distributed mode.
It is difficult to imagine circumstances where this would be true. I tried to reproduce this on a small, non-HOD cluster using (0.19, r704262) and trash worked as expected. It looks like this issue is with HOD or its configuration.]