[Is this eligible as a 0.19 blocker?, After successfully splitting directory {{name}}, which contained both {{fsimage}} and {{edits}}, into image only directory  {{name}} and edits only {{editsDir}} I see that {{name}} still contains the edits file. The same happens if I split out the image directory. The old one will still contain {{fsimage}}.

Files that do not correspond to the current directory type should be removed be saveFSImage().

I initially thought it is not a bug. But in fact it is.
Suppose I have an image-only directory {{imageDir}}, which is used to be image+edits directory and therefore contains an old file "edits". I also have an edits-only directory {{editsDir}}, which contains the up to date journal.
Then I by mistake configure  {{imageDir}} to be combined image+edits directory. Since {{fstime}} is the same in {{imageDir}} and {{editsDir}} any of the two edits files can be chosen by the name-node during startup. And if it chooses the old one from {{imageDir}} latest mutations to the name space will be lost., +1 for a fix in 0.19. , This patch fixes the problem.
I also modified and extended TestNameEditsConfigs to cover the problem., Fixed an import warning., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12392339/FSImage.patch
  against trunk revision 705762.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 4 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3489/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3489/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3489/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3489/console

This message is automatically generated., +1 patch looks good

Once you have fixed the typo "not not" in IOException messages, this can be committed., Corrected the typo., I just committed this., Integrated in Hadoop-trunk #640 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/640/])
    ]