[There might be some create-release fixes that didn't make it to branch-2, recommend we check the git log and reconcile., From history on create-release, we only miss YARN-5598 and HADOOP-13996. YARN-5598 is not needed because it is for new YARN UI. HADOOP-13996 fix some gpg timeout issue that we could need it in branch-2. However, both are not related.
Other than that, the only differences for files between two branches is:
2.8 we have following line while 3.x is missing
{code}
run mkdir -p "hadoop-${HADOOP_VERSION}/share/doc/hadoop/"
{code}
But this differences doesn't matter obviously.
It sounds like the problem is not in create-release either. Do I miss anything?, FWIW, a few bits of history:

* create-release and associated code was never intended by me to end up in branch-2.  I don't build or test against branch-2 and haven't in years.  I have no idea if the other build changes in trunk that aren't in branch-2 have any impact.

* The maven commands and the order of operations in create-release were specifically constructed to actually build *everything*.  During create-release's development, it was found that various combinations that we had documented in various locations left many broken and incomplete HTML pages when building the pages for the site.  e.g., jdiff output

* We currently don't link a lot of content that we build, despite a lot of the effort put into maintaining it. e.g., jdiff output

* It might be time to actually make three tarballs instead of two:  src, bin, docs.  This is a relatively simple thing to do by manipulating the tar command lines., Thanks [~aw] for sharing the history here.
I think I found the root cause, just as my comments: https://issues.apache.org/jira/browse/HADOOP-13688?focusedCommentId=15957960&page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel#comment-15957960.
Have a separated doc tar ball may be a good idea here. However, I haven't see other apache projects are going this way, may be we should have a separated JIRA for discussing publicly.
Will resolve this issue as duplicated of HADOOP-13688.]