[The changes that introduced the problem are listed here: http://hudson.zones.apache.org/hudson/view/Hadoop/job/Hadoop-trunk/540/. I wonder, could it be the change to Java 6 (HADOOP-2325)?, yes, it was the change to java 6.  I haven't had time to look at this yet.  I think clover has an issue with the new class file format., I have disabled clover in the nightly build until this can be addressed., Integrated in Hadoop-trunk #581 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/581/]), When we had the problem before we were using Clover 1. This patch updates the build to use Clover 2, which has some differences to do with how the ant task is defined: http://confluence.atlassian.com/display/CLOVER/1.+QuickStart+Guide. You now need to specify a {{clover.home}} property for ant.

I tested with Clover 2.3.2 which is the version on Hudson, and it managed to instrument all the source (which is where it failed before), and run a test. I had to increase the memory available to ant to perform the instrumentation (see http://confluence.atlassian.com/pages/viewpage.action?pageId=79986966), using

{code}
export ANT_OPTS=-Xmx256m
{code}

I think we could try enabling this on Hudson again to see if it works., From a code review perspective, +1.  I haven't run it., I just committed this.  Thanks Tom!, A patch to re-instate Clover for the Hudson nightly build script (in http://svn.apache.org/repos/asf/hadoop/core/nightly).

Nigel, does this look OK to you?, Looks good Tom.  I committed it and re-enabled clover in Hadoop-trunk builds on Hudson.zones., This caused the nightly Hudson build to fail (http://hudson.zones.apache.org/hudson/view/Hadoop/job/Hadoop-trunk/695/), so I've reverted it, pending investigation., I think this should fix it.  The SUPPORT_LIB_DIR had an old version of clover in it and was getting copied into the lib dir., I just commited nightly2.patch.  I'll watch this over the weekend and further tweak if necessary to get our code coverage builds back on track.]