[Also, all error messages should be printed to System.error, not System.out., -Added a help command in both FsShell and DFSAdmin.  
-Changed some error messages to use System.err instead of System.out.

I'll update the wiki page after I get some feedback from the new command descriptions (or if I get no feedback, I'll update it in day).

I'm not sure what the best way to indicate the argument is a file, directory, or glob is so I haven't doen that yet.  The long description usually says though.  Do people have opinions?, Merged in the contents of the previous patch file (provided by Wendy) with the trunk. Ready for code review., 
1) Looks like this will print help for all commands if I say  '-help unknown'. Is that intentional?

2)
+          } else if ("-help".equals(cmd)) {
+            System.err.println("Usage: java FsShell" + 
+                " [-help [cmd]]");
+

This is never excuted, both in  FS and DFS, I think because there is no wrong way to invoke -help command.
, 1)  It was intentional.  It prints all the help info if you ask about anything other than a valid command.  Alternatively, you can change it to have help report back the command doesn't exist in that case, and only have it print all the help if you just say '-help'.
, So, if we have consensus, can we mark this issue as "Patch available"?, 
What about (2) above?

Regd (1), it not conventional to get big dump all the available help.. for most commands we get shorter version.. either way its your choice.
, Incorporated Raghu's comments. Removed the following portion of code:

+ } else if ("-help".equals(cmd)) {
+ System.err.println("Usage: java FsShell" +
+ " [-help [cmd]]");
+ 
, 
I think you need to remove it from DFSAdmin.java also. Thanks.
, Incorporated Raghu's comments. Removed the specified code snippet from DfsAdmin.java too., +1., FsShell is no longer DFS-specific, so usage should show the invocation as "hadoop fs" rather than "hadoop dfs" (which is an alias). Similarly, the -fs option now takes a general FileSystem URI, so while "local" and "namenode:port" are still supported, they are deprecated (see FileSystem#getNamed)., Incorporated Tom's review comments. , +1, because http://issues.apache.org/jira/secure/attachment/12354460/fsshellHelp5.patch applied and successfully tested against trunk revision http://svn.apache.org/repos/asf/lucene/hadoop/trunk/524205. Results are at http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch, I just committed this.  Thanks, Dhruba!, Integrated in Hadoop-Nightly #43 (See http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Nightly/43/)]