[
hmm.. DataNode used create this array even before HADOOP-2758 (at an earlier location). I will check why this didn't show up there.
, Ok, I see why this did not cause the test to fail before HADOOP-2758. Fixing it in sendBlock() won't fix the test, the client will (still) fail with OutOfMemory error. Attaching _a_ fix : it truncates bytePerChecksum to length of the block in BlockSender constructor., Slightly modified patch. Now with the right extension., +1 on the patch.. reviewed.. 
, Thanks Mahadev. I made it patch available early by mistake.
, -1 overall.  Here are the results of testing the latest attachment 
http://issues.apache.org/jira/secure/attachment/12377561/HADOOP-2955.patch
against trunk revision 619744.

    @author +1.  The patch does not contain any @author tags.

    tests included -1.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    javadoc +1.  The javadoc tool did not generate any warning messages.

    javac +1.  The applied patch does not generate any new javac compiler warnings.

    release audit +1.  The applied patch does not generate any new release audit warnings.

    findbugs +1.  The patch does not introduce any new Findbugs warnings.

    core tests +1.  The patch passed core unit tests.

    contrib tests +1.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1937/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1937/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1937/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1937/console

This message is automatically generated., No new tests are needed since this triggered by a unit test.
, I just committed this., Integrated in Hadoop-trunk #426 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/426/])]