[I propose:
# lease monitor should catch all exceptions log an error and continue to run until name-node is running;
# lease monitor should loop until the name-node is {{FSNamesystem.fsRunning}};
# we should check other name-node monitors to do the same thing; better create a base class for monitors implementing this logic.
# we should also take care of the of converting FileUnderConstruction into real files as stated in
https://issues.apache.org/jira/browse/HADOOP-4795?focusedCommentId=12655006#action_12655006, >If a runtime exception is thrown inside the lease monitor, as it happened in HADOOP-4951, the monitor will die although the name-node will continue to run. 

But HADOOP-4951 happened because there was a bug in the code.  Are you saying that we should let the monitor run even there is a bug in it?

> we should check other name-node monitors to do the same thing; better create a base class for monitors implementing this logic.

Took a quick look, FSNamesystem.SafeModeMonitor is not doing the thing you described., > Are you saying that we should let the monitor run even there is a bug in it?

I am saying that this is inconsistent: either the name-node should die with the monitor or the monitor should continue to run if the name-node is running., > 1. lease monitor should catch all exceptions log an error and continue to run until name-node is running;
> 2. lease monitor should loop until the name-node is FSNamesystem.fsRunning;

If we do the above, it will easily end up an infinite loop when there is a runtime exception.  Consider the case that the oldest lease have a problem before it gets renew or remove from the queue.  Then it will keep sitting on the top of the queue.  The monitor will keep checking the same lease, catching the same runtime exception again and again., A reminder that our Code Review Guidelines (http://wiki.apache.org/hadoop/CodeReviewChecklist) include:
- look for accidental propagation of exceptions
- look for unanticipated runtime exceptions
If these guidelines were more consistently followed, they types of problems could be averted., It is generally hard to handle unexpected runtime exception.  I don't think there is anything we can do specifically to lease monitor.  I suggest we close this as "won't fix" and work on HADOOP-4969 for all monitor threads., I'll be responding to mail on 3/24.
]