[- Add --config ${CHUKWA_CONF_DIR} to daily and hourly via crontab
- Remove hardcoded HADOOP_CONF_DIR variable (should use the one in chukwa-env.sh)
- Add some variables to HADOOP_OPTS in order to use chukwa-log4j.properties
, Looks good.
+1, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12400775/HADOOP-5309.patch
  against trunk revision 747169.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3905/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3905/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3905/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3905/console

This message is automatically generated., Any idea why the JVM is crashing in tests?, JVM crash is not related to this patch since we are not testing those scripts.
And I haven't seen anything suspicious on TestAgentClient except that is using the HTTP connector instead of ChunkCatcherConnector.
Patch HADOOP-5302 runs without any problem on 24/Feb/09 01:15 AM
I don't think we need to open a Jira unless it happens again.
, Integrated in Hadoop-trunk #778 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/778/])
    ]