[Patch that changes Hadoop's internal delimiter for list of jars specified via -libjars from using System.getProperty("path.separator") to using a comma.

This is because path.separator is platform-specific and therefore does not serve as an appropriate delimiter across platforms., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12395992/patch.txt
  against trunk revision 764031.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/181/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/181/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/181/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/181/console

This message is automatically generated., The same changes will be required in addFileToClassPath and getFileClassPaths methods also., Patch changing addFileToClassPath and getFileClassPaths methods also to use comma instead of path.separator, Both testpatch and ant test passed on my machine., can somebody please review this?, I agree in spirit, but while you're changing that code you may as well use conf.setStrings and conf.getStringCollection to deal with the comma-delimiting, etc. This way, if those functions eventually get magical comma-escaping ability, you'll benefit for free., I changed getFileClassPaths and getArchiveClassPaths to use getStringCollection. Did not change addFileToClassPath and addArchiveToClassPath, since they add more files to existing configuration.
, How about using something like:

{code}
Collection<String> paths = conf.getStringCollection(key);
paths.add(toAppend);
conf.setStrings(key, paths.toArray());
{code}, Todd, we can do that. but I don't want to do the same, since other methods addCacheFile etc also have similar code. The patch is in consistent with current code. If you insist, this change can be done for all methods by a separate jira., Fair enough - I don't feel strongly about it, just figured it would be good for consistency., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12408681/patch-4864-1.txt
  against trunk revision 777594.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/381/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/381/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/381/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/381/console

This message is automatically generated., The contrib tests that failed have been failing on all tests - unrelated, I have tested with patch. Hadoop command with  -libjars, two files seperate by comma, without a double quote on the -libjars parameters and it passes with this patch. I ran a  sleep command and a streaming command.

I have ran the same wihout the patch and it fails at the map phase saying classNotFoundException., Thanks Iyappan for testing this out., I just committed this. Thanks, Amareshwari!, Can this be committed to branch-0.20? I verified that the same patch applies to branch 0.20 as well, The same patch applies to Yahoo! distribution branch 0.20 also.]