[As per the offline discussion with Hemanth, the Completed and Failed  job table in the _jobqueue_details.jsp_ does not make sense to the user. Moreover currently task schedulers need not be storing in completed and failed jobs in their job queues. So this has to be removed., Attaching patch removing the _completed_ and _failed_ job tables, Attaching latest patch. 
- Removing unused variable., Output for ant test-patch

{noformat}
     [exec] -1 overall.
     [exec]
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec]
     [exec]     -1 tests included.  The patch doesn't appear to include any new or modified tests.
     [exec]                         Please justify why no tests are needed for this patch.
     [exec]
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec]
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec]
     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs warnings.
{noformat}

This patch does not need any test cases as it is a change to the JSP page. The code with in schedulers need not be changed., Based on the offline discussion with Vinod and Hemanth, attaching the lastest patch with following changes:

- Removed all tables and using a single table to display all the jobs in scheduler queue in order which scheduler is looking at.

The rationale behind this is the api _getAllJobs(queue)_ was introduced to look at the jobs in the queue in order which scheduler looks at it. It  was introduced in order for the use case to help users know which position their job is in a particular job queue.
, - The copy from the {{jobs}} Collection to the {{jobsVec}} seems unnecessary. I realize this is because {{JSPUtil.generateJobTable}} takes a {{Vector<JobInProgress>}} as argument. Since JSPUtil is a package private class, I would recommend we change the interface of the {{generateJobTable}} to take a {{Collection<JobInProgress>}}. AFAIK, the way we are using the method does not need this to be a Vector. Note that this change will still work without having to change any clients.

- I think we can remove the heading 'Job List', because we already have another heading saying "Job Summary for Queue:". The text "Sorted by order maintained in the TaskScheduler" could appear directly under the "Job Summary..." heading, and could read "(In the order maintained by the scheduler)", Attaching file with incorporating Hemanth's comments., Looks good to me. Running through Hudson., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12391397/HADOOP-4256-4.patch
  against trunk revision 701307.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3429/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3429/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3429/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3429/console

This message is automatically generated., The core test failed in the patch is not associated with the patch., I just committed this. Thanks, Sreekanth!, Integrated in Hadoop-trunk #626 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/626/])
    . Removes Completed and Failed Job tables from jobqueue_details.jsp. Contributed by Sreekanth Ramakrishnan.
]