[Deleted overly long list of offending statements.  Will attach as a file., Attaching list of various settings for test.build.data, Conflicting instructions have been provided here:

 https://issues.apache.org/jira/browse/HADOOP-4677?focusedCommentId=12650526&page=com.atlassian.jira.plugin.system.issuetabpanels%3Acomment-tabpanel#action_12650526 

Where Chris suggests to use /tmp as default. test.build.data should always be set to build/test/data by ant, shouldn't it? , bq. test.build.data should always be set to build/test/data by ant, shouldn't it? 
By ant, yes.  This happens when running outside of Ant..., +1 setting "test.build.data" to build/test/data
Right now it is simply impossible to run some tests from eclipse because they try to write to "/tmp" or "." and this collides with the data already stored there. All unit test generated data should be under build so that it could be cleaned by the clean compile target., No strong opinion either ways (/tmp or build/test/data). But a quick comment on the following:

bq. Right now it is simply impossible to run some tests from eclipse because they try to write to "/tmp" or "." and this collides with the data already stored there.

I think it is possible to explicitly set it as JVM parameters through -Dtest.build.data=XXX., There are quite a few parameters like this one that need sensible defaults for tests to run in Eclipse.  HADOOP-5911 has the Eclipse configurations I use to start daemons, and the AllTests target runs a lot (but not all) of the tests.

I'm +1 standardizing on test.build.data, but I suspect that once you whack that mole, another one will just spring up.

-- Philip, I think the issue here is whether the path is absolute. Is there a way to have $PROJ_HOME/build/test/data so the default value is an absolute path? Leaving it just build/test/data means eg in TestLocalFSFileContextMainOperations it tries to use /user/eli/build/test/data which doesn't make sense since it's a local fs., I'm going to close this as stale.]