[The issue is because linux does not pass LD_LIBRARY_PATH in list of environment to setuid/setgid executables., Attaching a patch which fixes this issue. This patch can be applied after HADOOP-5981 patch has been applied. , Attaching patch merging with lastest patch on HADOOP-5981, Code changes look ok. We are not adding newlines to the exported environment. Is this OK ? 

Some comments on the test case:
- testEnvironment: The test shouldRun() should be made.
- If the test in TestMiniMRChildTask fails, we will not do cleanup operations like deleting the outDir. I think we should call the runTestTaskEnv method in a try...catch...finally block and in the finally, do cleanup.
- Do we need to check if the job execution fails ?
, Attaching a patch incorporating Hemanths comments., Looks fine to me. +1., Result from ant test-patch

{noformat}
     [exec] +1 overall.
     [exec]
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec]
     [exec]     +1 tests included.  The patch appears to include 6 new or modified tests.
     [exec]
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec]
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec]
     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs warnings.
     [exec]
     [exec]     +1 Eclipse classpath. The patch retains Eclipse classpath integrity.
     [exec]
     [exec]     +1 release audit.  The applied patch does not increase the total number of release audit warnings.
{noformat}, Ant test passed locally., I just committed this. Thanks, Sreekanth !, Integrated in Hadoop-trunk #867 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/867/])
    , This patch is for earlier version of Hadoop. Not to be committed., Hello,

I tried applying hadoop-5980-v20.patch to hadoop-0.20.2 and I got the following error:
patching file src/mapred/org/apache/hadoop/mapred/LinuxTaskController.java
Hunk #1 FAILED at 24.
Hunk #2 FAILED at 125.
2 out of 2 hunks FAILED -- saving rejects to file src/mapred/org/apache/hadoop/mapred/LinuxTaskController.java.rej

v20.patch seems to end abruptly at line 38.  What should I do?

Best Regards,
H]