[Patch for trunk. Works for hadoop-0.20.1 when in the file names java is replaced by core., Well spotted. Assuming that any hostname beginning with a-f is hex is not that sensible.

I thought initially that this would be trivial to write tests for, but of course, it depends on DNS working and the hostname passed in resolving. , The patch looks good to me.
A simple unit test would be using "localhost" and "127.0.0.1" to provide the basic checking.

In FsNamesystems.java resolveNetworkLocation():
    if (dnsToSwitchMapping instanceof CachedDNSToSwitchMapping) {
      // get the node's IP address
      names.add(node.getHost());
    } else {
This kind of logics should be hidden in the interface. The interface should be getting the same input (hostnames).
The above code pass IP to CachedDNSToSwitchMapping but pass hostname to other instances.
It would be good if this part can also be fixed in this patch., Sorry, I forgot that FsNamesystem.java is actually in HDFS. We should file another JIRA for that after this one is fixed., Add the unit test and use the IP pattern to check if the name is already an IP.

@Christian: I am also changing our internal trunk for this part. So I have modified the patch. I hope you don't mind., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12431738/HADOOP-6397-v2.patch
  against trunk revision 904339.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/298/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/298/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/298/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/298/console

This message is automatically generated., Resolving as duplicate as this was independently discovered and fixed in HADOOP-6682 (although without the unit test, which would have been nice).  Further improvement to this function was delegated to HADOOP-6824.]