[This patch fixes the issue for me. On a branch-20 checkout, "ant test-contrib -Dtestcase=TestHdfsProxy" fails before the patch and works after.

I don't know yet if this same issue occurs on trunk., I think (part of) HADOOP-5956 fixed this for 0.21 and trunk. Use the same fix for 0.20 too?, HADOOP-5956 just patched those two particular targets. There are plenty of other targets which have the same issue lurking:

{noformat}
todd@todd-laptop:~/cloudera/cdh/repos/hadoop-0.20$ find src/contrib/ -name ivy.xml | xargs grep -L commons-cli
src/contrib/scribe-log4j/ivy.xml
src/contrib/vaidya/ivy.xml
src/contrib/hdfsproxy/ivy.xml
src/contrib/fuse-dfs/ivy.xml
src/contrib/index/ivy.xml
src/contrib/mrunit/ivy.xml
src/contrib/failmon/ivy.xml
src/contrib/fairscheduler/ivy.xml
src/contrib/capacity-scheduler/ivy.xml
src/contrib/hod/ivy.xml
src/contrib/eclipse-plugin/ivy.xml
src/contrib/data_join/ivy.xml
src/contrib/thriftfs/ivy.xml
{noformat}

perhaps they haven't been triggered yet, but don't you think the idea here is correct?, I was just trying to see if we can get away with minimal changes for this patch alone.

bq. The problem is that the contrib projects don't automatically pull in the dependencies of the "Hadoop" ivy project.
I checked trunk's build files quickly and found that they aren't pulled automatically even in trunk. So we should fix that separately? The reason why I say this is, once we do that, we will no longer need ivy configuration of these common jars in each of the contrib projects. And that would be more changes. What do you think?, Todd,

Could you check whether this issue reproduces on trunk and whether this patch fixes it? The patch looks reasonable -- I think it might need to be applied on trunk and not just 20.

We can always remove redundant ivy dependencies from individual contrib modules later. (Possibly this should be done on a per-contrib basis by the individual contrib module authors?), This doesn't seem to reproduce on trunk, at least with hdfsproxy - I think it's because trunk has been somewhat mavenified. The dependency that ivy.xml specifies on hadoop-core probably pulls in the transitive dependencies. I tested by removing the explicit commons-cli dependency from src/contrib/hdfsproxy/ivy.xml and the test still passed.

Given this, the ivy.xml for the contrib projects can probably be pared down a bit, but I agree with Aaron we should probably leave it up to those authors if it's not causing problems for the overall build., NA post mavenization]