[Currently the failed and killed tasks are cleanedup as soon as they report as finished. But successful tasks are cleanedup at the end of the job, so that the map outputs will be available for the reducers.  But now, since we have <taskid>/work as current working directory for the task, and <taskid>/output directory for intermediate map output files. So, <taskid>/work can be cleanedup for successful tasks as soon as the task is finished.

Here is a patch doing cleanup of workdir for successful tasks., trying to run hudson again., I don't think this is the right approach, we really shouldn't be adding more 'cleanup' methods when we already have one in TaskTracker.TaskInProgress, please do the necessary cleanup there if possible.

Please don't add more to MRConstants.java, WORKDIR should belong to TaskTracker.TaskInProgress., bq. Please don't add more to MRConstants.java, WORKDIR should belong to TaskTracker.TaskInProgress.

WORKDIR is also used in TaskRunner.java, so, I think MRConstant.java is the right place for the public static constant., The patch modifies TaskTracker.TaskInProgress.cleanup() to take a boolean parameter to know whether to delete the whole task directory or only the work directory. For successful task attempts, the work directory is cleaned up as soon as task is finished., trying to run hudson again., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12382994/patch-2427.txt
  against trunk revision 661918.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2534/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2534/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2534/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2534/console

This message is automatically generated., Test failure dfs.TestDistributedUpgrade.testDistributedUpgrade is not related to the patch.

This issue adds cleaning up of local directories in task tracker for succesful task completion as soon as task finsihes. Its difficult to write a unit test for this,  because the all the directories will be deleted at the end of job. TestMiniMRWithDFS.checkTaskDirectories still validates the task directories., I just committed this. Thanks, Amareshwari!]