[> When block does not exist in NameNode's blocksMap, it basically does not belong to the cluster.
As Nicholas pointed out in HADOOP-3804, this check was removed in HADOOP-3002. Fix might be just bring the test back., The patches for 0.18 and trunk in HADOOP-3002 have this problem.  The HADOOP-3002 0.17 patch does not have it., The patch essentially reverts the hunk "@@ -2780,17 +2751,8 @@" from the patch for HADOOP-3002. It moves the check to the beginning of addStoredBlock(). 

The removal of this check was ok in the case of processReport() but not in the case of blockReceived(). , I think we better check whether fileINode == null since fileINode could be null even if the stored block is not null., You are right. A block can exist in blocksMap with out an INode when a file is deleted. Such blocks seem to be removed when the datanodes send block reports.

Updated patch includes the check., +1 patch looks good, Thanks Nicholas. The updated patch is smaller and similar to the first version attached., +1 I like the smaller patch.
I guess I missed the blockReceived() case., It seems that JIRA has a sorting bug:

Sort the the File Attachments table above by "Attached Date".  We get
{noformat}
HADOOP-3776.patch  	2008-07-22 06:01 PM  	Raghu Angadi  	2 kb
HADOOP-3776.patch 	2008-07-23 01:59 PM 	Raghu Angadi 	2 kb
HADOOP-3776.patch 	2008-07-23 12:34 PM 	Raghu Angadi 	3 kb
{noformat}
01:59 PM comes before 12:34 PM.  Does it sort the timestamps as strings?  Or I miss something?, > Does it sort the timestamps as strings? 
yes, thats why 12:30 PM appears below 1:30 PM.
 , -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12386754/HADOOP-3776.patch
  against trunk revision 679286.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2934/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2934/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2934/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2934/console

This message is automatically generated., Patch for 0.18 is attached. Only change from patch for trunk is the path for FSNamesystem.java.

The core test failure during Hudson is expected (HADOOP-3809)., I just committed this., Integrated in Hadoop-trunk #581 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/581/])]