[Use FileUtil.makeShellPath to construct correct path on Windows, I'm not sure why we did getCanonicalPath in the first place, but if there was a good reason for it, shouldn't we do FileUtil.makeShellPath(f.getCanonicalPath()) or something?, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12469702/common-7126-trunk.patch
  against trunk revision 1064919.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

    +1 system test framework.  The patch passed system test framework compile.

Test results: https://hudson.apache.org/hudson/job/PreCommit-HADOOP-Build/207//testReport/
Findbugs warnings: https://hudson.apache.org/hudson/job/PreCommit-HADOOP-Build/207//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://hudson.apache.org/hudson/job/PreCommit-HADOOP-Build/207//console

This message is automatically generated., > FileUtil.makeShellPath(f.getCanonicalPath()) or something?

Yes makeShellPath(f, true) does exactly that.

+1 Looks good to me., I tested it on Windows. TestDFSShell passes with this patch and fails without., I just committed this. Thank you Po., Integrated in Hadoop-Common-22-branch #22 (See [https://hudson.apache.org/hudson/job/Hadoop-Common-22-branch/22/])
    HADOOP-7126. Merge -r 1065900:1065901 from trunk to branch 0.22.
, Integrated in Hadoop-Common-trunk-Commit #492 (See [https://hudson.apache.org/hudson/job/Hadoop-Common-trunk-Commit/492/])
    , Integrated in Hadoop-Common-trunk #593 (See [https://hudson.apache.org/hudson/job/Hadoop-Common-trunk/593/])
    HADOOP-7126. Fix file permission setting for RawLocalFileSystem on Windows. Contributed by Po Cheung.
]