[Patch for Issue HADOOP-2132, The patch is available for review.

Changes:
1. Modified the Kill Method in JobInProgress class to check if the job is either in the "RUNNING" or "PREP" state before killing it and moving it to the failed state.
2. Modified "isSuccessful", "toString", and "is Complete" methods in JobClient to forcefully update their job status (instead of using the cached status) to return the most up-to-date status.
, The code change in JobInProgress and JobClient looks good. 
Some comments in the testcase:
1. The commented  code in testcase needs to be removed.
2.  Is there any reason that testJob.jar is used as jar file for job submission? If not, wordcount can be launched without testJob.jar also., The new patch (incorporating the review comments) is now available for review, +1 patch looks good., Resubmitting patch so that Hudson can pick it up, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12382769/hadoop-2132-v2.patch
  against trunk revision 661918.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 5 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2536/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2536/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2536/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2536/console

This message is automatically generated., dfs.TestEditLog failed with a time out. This is unrelated to the patch.

Here is the log from the Test Report:

org.apache.hadoop.dfs.TestEditLog.testEditLog
Failing for the past 1 build (Since Failed#2536 )
Took 0 seconds.

junit.framework.AssertionFailedError: Timeout occurred. Please note the time in the report does not reflect the time until the timeout.
, I just committed this. Thanks, Jothi!]