[This patch fixes the problem and the testcases. I'm still getting a test case failure in the dist cache one., This patch changes UGI.hashCode to be the identity hash of the Subject and equals to check == between the subjects., This is the updated patch for y20. Not for inclusion., Fixes a testcase that got affected by the UGI changes in hashcode/equals methods., Attaching a straight-forward port for trunk. Changes made to TestFileSystem in the original patch is now applied to TestFileSystemCaching. Changes made to FileSystem.java are ignored since only debug messages were added. Changes made to TestTrackerDistributedCacheManager are also ignored for the same reason. Devaraj's bug fix for Gridmix is not ported at this time since related Gridmix files are not forward ported yet. It's better to incorporate the bug fix when porting Gridmix., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12449172/c6670-02.patch
  against trunk revision 963490.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 6 new or modified tests.

    -1 javadoc.  The javadoc tool appears to have generated 1 warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/609/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/609/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/609/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/609/console

This message is automatically generated., The javadoc warnings are due to KerberosName.java and SecurityUtil.java, and not related to this patch., In TestUserGroupInformation.java there is a repeated check for equality of two UGIs with same subject which can be removed., Attaching a new patch that removes the redundant checking in test per Jitendra's comment. Otherwise, it stays the same., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12449720/c6670-03.patch
  against trunk revision 964939.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 6 new or modified tests.

    -1 javadoc.  The javadoc tool appears to have generated 1 warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/620/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/620/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/620/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/620/console

This message is automatically generated., I just committed this. Thanks, Owen and Kan!, Integrated in Hadoop-Common-trunk-Commit #329 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Common-trunk-Commit/329/])
    HADOOP-6670. Use the UserGroupInformation's Subject as the criteria for equals and hashCode. Contributed by Owen O'Malley and Kan Zhang.
, Integrated in Hadoop-Common-trunk #395 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Common-trunk/395/])
    HADOOP-6670. Use the UserGroupInformation's Subject as the criteria for equals and hashCode. Contributed by Owen O'Malley and Kan Zhang.
, I just tried to compare two UGIs using UserGroupInformation.equals() and it failed, because even though they had the same Subject (.equals), they were not the same instance (==). This seems like a bug which was introduced here. Why was (==) used to compare Subject? Was this intentional?]