[I am assuming that since this JIRA is filed, further discussions on the approach and implementation of this issue will happen here.

In the discussion thread mentioned in the description, it is suggested that the new cleanupTask introduced b HADOOP-3150 is scheduled from the framework directly, as opposed to having it scheduled from schedulers. In general, this seems the right approach. So, +1. 

One question I have (and possibly this was indirectly brought up by Matei as well), should the running of the cleanupTask count as slots used by the Job - as this could impact fairness and capacity limits ? From what I've seen, it appears that each Job has atmost 1 cleanup task - correct ? In that case, it might not be *that* critical to count these for quotas etc. Comments ?, Hemanth, that's right. Every job will have at most one cleanup task (multiple attempts might happen due to failures just like a regular task). I don't think it is critical to keep track of this from the point of view of fairness/quotas, etc., Here is a patch which removes the dependency to assign a cleanup task from scheduler. Now, the JobTracker gets cleanup task for the jobs if any and launches them. If there are no cleanup tasks to be launched, it calls TaskScheduler.assignTasks()., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12389658/patch-4100.txt
  against trunk revision 693048.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3206/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3206/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3206/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3206/console

This message is automatically generated., Looks good to me., I just committed this. Thanks, Amareshwari!, Integrated in Hadoop-trunk #600 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/600/])]