[Attached patch throws InterruptedIOException. TestSocketIOWithTimeout tests this bug., Removed extra import added in earlier patch., +1 The code in SocketIOWithTimeout.java looks good.

I am a little worried about the test case though. because of the fixed timeout values in the test, it might fail on some platforms. Maybe we can make the read wait infinitely without a timeout and then send an interrupt to it and then verify that it exited. This might eliminate having fixed timeouts., Thanks Dhruba.

The test required that thread return in 6 seconds after being interrupted. The latest patch removes that., Attached stale patch last time., The latest patch does not have a timeout for interrupt test., +1 overall.  Here are the results of testing the latest attachment 
http://issues.apache.org/jira/secure/attachment/12377840/HADOOP-3008.patch
against trunk revision 619744.

    @author +1.  The patch does not contain any @author tags.

    tests included +1.  The patch appears to include 3 new or modified tests.

    javadoc +1.  The javadoc tool did not generate any warning messages.

    javac +1.  The applied patch does not generate any new javac compiler warnings.

    release audit +1.  The applied patch does not generate any new release audit warnings.

    findbugs +1.  The patch does not introduce any new Findbugs warnings.

    core tests +1.  The patch passed core unit tests.

    contrib tests +1.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1967/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1967/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1967/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1967/console

This message is automatically generated., I just committed this., Integrated in Hadoop-trunk #432 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/432/])]