[Attaching a patch. This removes dfs.client.buffer.dir generation by HOD. The parameter's actual usage is given up in HADOOP-0.16 itself, which is three versions far from 0.19; no backwards compatibility.

Besides HOD, I can still see other references to the parameter - in comments of Configuration.java (+100), LocalDirAllocator.java(+66) and also generated in the test case TestLocalDirAllocator.java., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12391876/HADOOP-3814-20081010.txt
  against trunk revision 703320.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3438/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3438/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3438/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3438/console

This message is automatically generated., +1 for the patch., The core test failure is not due to the patch. It is the same as HADOOP-4378.

Since I don't have commit rights to branches, can some committer please help and commit this to both the branch and trunk. One point to note is that HOD tracks changes in the file src/contrib/hod/CHANGES.txt. The format of this is same as the format of the main CHANGES.txt file. Please update this file when doing the commit., I just committed this. Thanks, Vinod!, Integrated in Hadoop-trunk #634 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/634/])
    . Remove generation of dfs.client.buffer.dir for the generated hadoop-site.xml. Contributed by Vinod Kumar Vavilapalli.
]