[+1 

The script definitely won't work on SysV sh (which is what /bin/sh is on Solaris).  The export commands should be appearing after the variable is set to be more compatible.  For example:

export JAVA_HOME=blah

won't work, but

JAVA_HOME=blah
export JAVA_HOME

should.  

With the changes that Sun is making in Nevada, this issue may go away at least for Solaris NV+ users. 

, These scripts all used to specify /bin/bash, since that's what /bin/sh maps to for most Hadoop developers, and its thus hard to keep bash-isms from getting committed.  They got switched in HADOOP-352, and I think my concerns about that patch have been confirmed.

I vote to switch all scripts to specify /bin/bash once more, and document /bin/bash as a requirement for Hadoop.  Note that Owen, in HADOOP-1553, recently changed the logging code to require that 'bash' is on $PATH, and I did something similar in HADOOP-1717.  So we currently, in 0.14, rely on bash being installed.  On Solaris bash is not normally installed as /bin/bash, but that seems a small requirement to add.
, Solaris has had /bin/bash since Solaris 8, about 7 years now, if the SUNWbash package from the install media is pkgadd'd.  Granted, it is an ancient version (3.00.16 on Solaris 10 06/06, according to my home machine, at least), but I'm sure we aren't doing anything particularly fancy., Rather that requiring Solaris boxes link /bin/bash to where bash lives, the standard trick is to use:

{code}
#!/usr/bin/env bash
... rest of script ...
{code}

Using the env command to look up bash on the path is cheating, but it is a pretty standard cheat., Here's a patch that converts all Hadoop shell scripts to specify bash with '/usr/bin/env bash'.  Does this work for folks?, Using 

  #!/usr/bin/env bash

works for us on our RedHat Linux systems.

thanks
, +1

http://issues.apache.org/jira/secure/attachment/12364339/HADOOP-1689.patch applied and successfully tested against trunk revision r568706.

Test results:   http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/598/testReport/
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/598/console, I just committed this.]