[Simple patch to rethrow the exceptions., Updated patch with simple test case, Tested Koji's patch and included a test case for the same. Right now have a simple test with invalid input for streaming job and expecting an Exception from StreamJob class. Will update https://issues.apache.org/jira/browse/HADOOP-16, Sorry had updated with wrong patch. Correct patch updated, +1 looks good.
, Patch Available. Thanks., -1, build or testing failed

2 attempts failed to build and test the latest attachment http://issues.apache.org/jira/secure/attachment/12363153/h-1663-streamexception-simpletestcase.patch against trunk revision r563270.

Test results:   http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/520/testReport/
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/520/console

Please note that this message is automatically generated and may represent a problem with the automation system and not the patch., -1, build or testing failed

2 attempts failed to build and test the latest attachment http://issues.apache.org/jira/secure/attachment/12363153/h-1663-streamexception-simpletestcase.patch against trunk revision r564382.

Test results:   http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/539/testReport/
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/539/console

Please note that this message is automatically generated and may represent a problem with the automation system and not the patch., Resubmitting with minor change., o Making minor changes so that  streaming client won't  dump the stack trace unless it's an IOException. (Thanks Owen)

o Changing FileNotFoundException to InvalidInputException
, I tried to use the regression test from the previous patch, but it failed. Can you fix the test, create a unified patch, and resubmit. , Thanks to Owen for inputs. Now instead the code returns error code which is caught in main of HadoopStreaming and exit accordingly. Attached in the modified patch.
Thanks, Patch Available
thanks, -1, new javadoc warnings

The javadoc tool appears to have generated warning messages when testing the latest attachment http://issues.apache.org/jira/secure/attachment/12363721/h-1663-streamexception-as-returncode.patch against trunk revision r565434.

Test results:   http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/548/testReport/
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/548/console

Please note that this message is automatically generated and may represent a problem with the automation system and not the patch., Resubmitting with Nigel & Owens inputs. Formated with proper error codes.
Thanks,, I just committed this. Thanks, Lohit., -1, could not apply patch.

The patch command could not apply the latest attachment http://issues.apache.org/jira/secure/attachment/12363736/h-1663-streamexception-as-returncode.patch as a patch to trunk revision r565981.

Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/555/console

Please note that this message is automatically generated and may represent a problem with the automation system and not the patch.]