[The workaround is to obtain the src. zip file from this URL:
http://archive.apache.org/dist/commons/daemon/source/commons-daemon-1.0.2-native-src.zip

and to build the above tar file for PPC64 on an IBM Power system.
, More details of the workaround are as follows:
1. Download this file: http://archive.apache.org/dist/commons/daemon/source/commons-daemon-1.0.2-native-src.zip or the appropriate version for the build.
2. unzip the above downloaded file in a directory called /home/hadoop/commons (or any directory of your choice)
3. cd /home/hadoop/commons/commons-daemon-1.0.2-native-src/unix 
4. Run ./configure
5. Build the jsvc binary by typing make 
6. Copy the jsvc binary thatr was just built to a new directory called /home/hadoop/commons/commons-daemon-1.0.2-native-src/unix/build
7.Copy the following text files home/hadoop/commons/commons-daemon-1.0.2-native-src directory to the /home/hadoop/commons/commons-daemon-1.0.2-native-src/unix/build directory -- 
 1. LICENSE.txt
 2. NOTICE.txt
 3. RELEASE-NOTES.txt
8. cd to the directory home/hadoop/commons/commons-daemon-1.0.2-native-src/unix/build
9. Create the binary tar file for IBM Power by issuing the following command: 
tar -czvf commons-daemon-1.0.2-bin-linux-ppc64.tar.gz *
10. Copy the file to an appropriate directory where this can be accessed from the hadoop-common build:
11. For branch-1, edit the build.xml file on the build root to point to the binary tar file that was just built:
   <property name="jsvc.location" value="file:///home/hadoop/commons-daemon-1.0.2-bin-linux-ppc64.tar.gz"/>


, If commons doesn't provide a PPC build, please file an issue against commons' project, not hadoop. PPC isn't directly supported by the Hadoop project.

Thanks for the detailed workaround though!, Re-opening to track updating the build for either when there's a commons daemon binary ppc tarball (or if that doesn't happen for some reason we could build / publish our own).  

Ravi, mind filing a daemon (https://issues.apache.org/jira/browse/DAEMON) jira for adding ppc64 and linking it here? , Harsh and Eli - Thanks for your feedback. I have opened the JIRA: https://issues.apache.org/jira/browse/DAEMON-249 as suggested by Eli, Ah sorry about that then Ravi - It slipped my mind that we can provide a downstream artifact too.]