[This bug was introduced in 0.13. Does it mean that we need a fix for 0.13 release too?, > Does it mean that we need a fix for 0.13 release too?

I don't think so.  Folks can upgrade from 0.13 to 0.14.2 to get this fix.
, - I fixed the problem as described above by making edits.new empty at the same time the edits gets emptied.
- I truncate edits files when they are emptied, otherwise it is not clear what is the real file size.
- Based on that modified TestCheckpoint, which now checks edits and image files existence and lengths.
  The test fails with the old code and succeeds with the new.
- Cleaned up EditLogOutputStream: it calls force() now on the FileChannel instead of flush() and synch(). 
This makes the fd member obsolete. I removed it.
- Fsck was failing consistently on my machine because safe-mode was still on when the test was trying
to delete files. It should call waitActive() before deleting.
- Patch for 0.14 is coming soon.
- For hadoop 0.13 in order to avoid this problem one should just start the cluster with -upgrade. Then edits.new
will be merged with the image as well as the edits, but will not be renamed to edits, since it does not
exist in the new image directory., This is the patch for 0.14., +1 overall.  Here are the results of testing the latest attachment 
http://issues.apache.org/jira/secure/attachment/12366970/editsNew-0-15.patch
against trunk revision r581427.

    @author +1.  The patch does not contain any @author tags.

    javadoc +1.  The javadoc tool did not generate any warning messages.

    javac +1.  The applied patch does not generate any new compiler warnings.

    findbugs +1.  The patch does not introduce any new Findbugs warnings.

    core tests +1.  The patch passed core unit tests.

    contrib tests +1.  The patch passed contrib unit tests.

Test results: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/871/testReport/
Findbugs warnings: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/871/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/871/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/871/console

This message is automatically generated., Code looks good., I just committed this. Thanks Konstantin., Integrated in Hadoop-Nightly #260 (See [http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Nightly/260/])]