[This patch fixes the case where rpc metrics were not being pushed to the Metrics client library., Sanjay,
Can you review the patch I have attached.

Thanks
-girish, +1. No tests needed for this patch., Update the patch to reflect the code for 0.16 branch., -1 overall.  Here are the results of testing the latest attachment 
http://issues.apache.org/jira/secure/attachment/12381354/RpcMetrics-0.16.4.patch
against trunk revision 645773.

    @author +1.  The patch does not contain any @author tags.

    tests included -1.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    patch -1.  The patch command could not apply the patch.

Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2374/console

This message is automatically generated., Update patch path from the top level., 0.17 should not wait for this, but if _anything_ else goes into 0.17, this should go with it. We'd really like these statistics from the big grids., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12381615/rpcmetrics.patch
  against trunk revision 655984.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2459/console

This message is automatically generated., Please use HADOOP-3322-3.txt as patch, this patch applies from the top level.  The other patches are not designed to apply from the top level of the source tree., This patch needs to be applied to trunk, Same patch for Hadoop 0.17 Branch, I manually ran test-patch and committed this to 0.17.0 and trunk. Thanks Eric and Girish, Integrated in Hadoop-trunk #492 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/492/])]