[Fix the check that determines whether access times is enabled or not., patch looks fine. But I don't think this is a bug fix since end result of "logical AND (&)" and "conditional AND (&&)" is exactly same. It is just that second condition will always be evaluated in this case of '&'. 

+1 for the patch, though.
, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12394044/setTimesBug.patch
  against trunk revision 719152.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3608/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3608/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3608/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3608/console

This message is automatically generated., > But I don't think this is a bug fix ...

If someone changes isAccessTimeSupported() and introduces a side effect in the future, then "logical AND (&)" and "conditional AND (&&)" are no longer the same.  Also, the performance of them are different.  I would argue that this is a bug although no problems would emerge at this moment., I just committed this. Thanks, Dhruba

This was marked for 0.19.1, but it looks benign; I only committed to trunk. If you think it should go into 0.19.1, I wouldn't object, but the maintainability issue addressed by the bug is moot., Integrated in Hadoop-trunk #675 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/675/])
    . Use correct operator when evaluating whether access time is
enabled Contributed by Dhruba Borthakur.
]