[This patch changes the MultipleOutputs API to provide a way to close files while running the reducer. , -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12513918/hadoop-multiple-outputs.patch
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-HADOOP-Build/577//console

This message is automatically generated., Tarjei,

Perhaps you may want to increase the xceiver limits on your DN to allow more writes?, Harsh: I do not get any xceiver errors in my logs. Shouldn't I get that if that was the problem?
T, You should get them in the DN logs (count exceeded form of messages). Are they not present?, I grepped all my logs for xceiver errors in my logs without finding anyone.
, Ok, thats a little odd. But the NN does exclude DNs based on # of transfer threads load. That is what is affecting you -- error at DN or not, cause of 120 requests of write per task (sure you want small files?). You could also raise your settings 2x and try to see if it elevates or goes away.

In any case, I'm +1 on adding a specific closing API to MultipleOutputs to close a given named output.
Can you however, add it to the mapred.lib.MultipleOutputs (Stable API) as well?

Comments on existing patch btw:
* The javadoc can actually reside over the new function you've added. Something like "This func is useful in reducers where after writing a particular key as an output, you may close it to save on fs connections."
* Once closed, the writer must be moved out of the collection.
* New addition requires test cases, as nothing covers this API call right now. Please add a test case that tests your new method. There are existing tests inside of TestMultipleOutputs (Stable API - you need to add), and TestMRMultipleOutputs (Unstable, new API - your patch).

Thanks!, Canceling patch so that Harsh's comments can be addressed]