[Is the patch intended for trunk, 0.23, or both?, Both 23 and trunk have this mismatch of OK_JAVADOC_WARNINGS, The build results won't tell us much since test-patch.properties is read in before the patch is applied., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12513148/HADOOP-8020.patch
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 eclipse:eclipse.  The patch built with eclipse:eclipse.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed unit tests in .

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-HADOOP-Build/562//testReport/
Console output: https://builds.apache.org/job/PreCommit-HADOOP-Build/562//console

This message is automatically generated., Jonathan, you are reducing the number of allowed Javadoc warnings from 13 to 11, right?, Yes., Jon,
I ran test-patch manually and it looks like there are currently 13 javadoc warnings on trunk and only 11 on branch 23.  Can you double check that this should also apply to trunk?
, That is correct. This should only apply to branch-0.23, it looks like the extra javadoc warnings in trunk are:

[WARNING] hadoop-common-project/hadoop-common/src/main/java/org/apache/hadoop/io/FastByteComparisons.java:25: warning: sun.misc.Unsafe is Sun proprietary API and may be removed in a future release
                                                                                                                                       >  [WARNING] hadoop-common-project/hadoop-common/src/main/java/org/apache/hadoop/io/FastByteComparisons.java:117: warning: sun.misc.Unsafe is Sun proprietary API and may be removed in a future release


That file was added under HADOOP-7761.  It seems like that would be good to pull into branch 23, so perhaps this patch isn't needed if the plan is to merge HADOOP-7761., Canceling the patch until a decision on HADOOP-7761 is made, If that is the case summary saying "Reduce the allowed Javadoc warnings from 13 to 11" would be a better title for the jira I think., Thanks for the catch Suresh. Updated the summary. I first it looked like this was a problem in both trunk and branch-0.23.]