[OBLs reported in FSDataset are not real bugs. So this patch put them in the findbugs exclude file. This patch fix the rest of the bugs. It also fixed improper handling of streams in FSShell and DatanodeBlockInfo. , +1

Please add a brief comment in findbugsExcludeFile.xml to describe the reason for exclusion. Also creating a bug to track getting rid of copyBytes version that closes the streams in the method instead of the caller of the method would be nice., This patch additionally adds a comment in the findbugs exclude file. Once this patch is committed, I will file a jira to deprecate the method copyBytes that allows to  close the streams in the method instead of the caller of the method , -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12408499/findBugs1.patch
  against trunk revision 777330.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    -1 release audit.  The applied patch generated 492 release audit warnings (more than the trunk's current 491 warnings).

    +1 core tests.  The patch passed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/377/testReport/
Release audit warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/377/artifact/trunk/current/releaseAuditDiffWarnings.txt
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/377/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/377/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/377/console

This message is automatically generated., Resubmit the patch to be synced with the trunk., ant testpatch result:
     [exec] +1 overall.
     [exec]
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec]
     [exec]     +1 tests included.  The patch appears to include 3 new or modified tests.
     [exec]
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec]
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec]
     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs warnings.
     [exec]
     [exec]     +1 Eclipse classpath. The patch retains Eclipse classpath integrity.
     [exec]
     [exec]     +1 release audit.  The applied patch does not increase the total number of release audit warnings.
     [exec]

All core tests were passed except for TestJobHistory reported in HADOOP-5920., I've just committed this., HADOOP-5943 is filed to deprecate copyBytes versions that close the pass-in streams., After project split, the change made to findbugExcludeFile.xml is missing in the HDFS subproject. Attaching a patch to introduce the change again., The changed was committed by Hairong before.  We should investigate why the change disappeared., The changed was committed by Hairong before.  We should investigate why the change disappeared., Talked to Suresh.  Look like that the changes was lost during project split., I have re-committed the missing changes to hdfs trunk.  Thanks, Suresh!]