[Patch looks good to me.  Will commit in a day or so unless objection., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12398264/hadoop-core-hash.patch
  against trunk revision 737253.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    +1 core tests.  The patch passed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3756/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3756/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3756/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3756/console

This message is automatically generated., Committed (One line change that improves a random function -- hard to write unit tests for).  Thanks for the patch Jonathan., Committed to 0.20 branch too., The change log should be only in place : under 0.20 on trunk as well on 0.20 branch., Thanks Raghu. I moved the CHANGES.txt entry., My first patch contained a regression: you have to take the remainder _before_ calling Math.abs, since Math.abs(Integer.MIN_VALUE) == Integer.MIN_VALUE still., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12399055/hadoop-core-hash-2.patch
  against trunk revision 739416.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3779/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3779/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3779/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3779/console

This message is automatically generated., Jonathan: please open a new issue to correct the regression., I took a look at the patch and confirmed Math.abs(Integer.MIN_VALUE is negative., Chris, I've reported the problem and attached a patch; I leave it to you to proceed from there as you see best. :), Jonathan-

* A resolved issue is assigned to the person who did the work, not the person responsible for the next step. Since you attached the patch ultimately committed, the issue should be assigned to you.
* Generally, we work 1 patch/issue, so reverting is simple and it's easy to audit work. Reverting your original patch, regenerating a repaired patch (since the new patch assumes the prior one has been committed), and re-committing this issue isn't a good use of anyone's time.

Please create a new issue describing the regression and attach the patch., Integrated in Hadoop-trunk #756 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/756/])
    , I moved the patch that was added to the reopened issue to HADOOP-5255.]