[One of the implementation issues is that we store the configuration information using Properties, which doesn't allow null values. But this can be changed to a Map datastructure, if the requirement is agreed to. Thoughts ?, I'd be reluctant to do this 
# it's hard to send null values over the wire using XML or JSON
# It's harder for other tools to handle.
# It becomes trickier for other data sources to provide configurations if there is null-ness in there too
# It gets really complicated if you ever add cross-referencing of values. Does the NULL value propagate, or does the string "NULL" travel around.
# It gets complex with inheritance. Believe me, I speak from experience here. If I define a null value  and make it final, does it become impossible for anyone ever to define that value?

Which situations are in there that you can't just get away with an empty string instead? , bq. Which situations are in there that you can't just get away with an empty string instead?

Steve, this may work as well. But currently if there's no value defined for a property (i.e. we have something like <value></value> in the config file), this is returned as null, and not as empty string. I suppose this can be changed though ? Is that what you are saying we can do ?

, I tend to agree with Steve. Also, I believe the testing effort for this change might be quite heavy., # Yes, {{<value></value>}}  is effectively the empty string, at least for string values. I guess it gets complex with integers. 
# There's also that trailing whitespace problem, is {{<value>
</value> }} == "" too?
# Nullness is a very strange thing to deal with in text formats; empty strings are simpler. Those things that look for a script could say "script name == empty string => skip". 
# Processing integers is harder. If you do a Conf.getInt(key, 10), and Configuration.get(key) returns "" over null, does that mean you want the default, or null?

Either way, this is quite a big change in the configuration side of things.
, Closing as a dupe since the other jira has code attached., argh wrong jira., HADOOP-11399 adds Configuration#setAllowNullValueProperties() for testing purposes, specifically for *Config* class static Strings to xml comparison (e.g. YARN-2957).  Just FYI in case someone wants to take the logic and run with it as far as fixing all the Configuration accessors for null values.]