[Here's a trivial patch that removes the quotes.

Alternatively, we could get rid of Expires or use Max-Age.

Finally, since this has been broken multiple times perhaps we should add a test against httpclient directly?, Please don't remove the quotes.

By looking at RFC2109:

{code}
   set-cookie      =       "Set-Cookie:" cookies
   cookies         =       1#cookie
   cookie          =       NAME "=" VALUE *(";" cookie-av)
   NAME            =       attr
   VALUE           =       value
   cookie-av       =       "Comment" "=" value
                   |       "Domain" "=" value
                   |       "Max-Age" "=" value
                   |       "Path" "=" value
                   |       "Secure"
                   |       "Version" "=" 1*DIGIT
{code}

It seems we are only off with {{Max-Age}} (ignoring HttpOnly which is not breaking things).

Good idea on adding a test for HttpClient.
, Thanks [~tucu00].

bq. Please don't remove the quotes.
Is this because the value can contain whitespace?

So you want to use Max-Age?  It seems it's not supported by older versions of IE (http://mrcoles.com/blog/cookies-max-age-vs-expires/) -- do we care about that?, on the quotes, we had them, they got removed, that broke things, we added again. They don't do any harm if they are there.

On Max-Age & Expired, i don't think we want to break old browsers. It seems to me an HttpClient bug that uses the presence of Expire to go back to old cookie format, the precense of Version=1 should trump. Can you dig on HttpClient side?, bq. on the quotes, we had them, they got removed, that broke things, we added again. They don't do any harm if they are there.

It's a little more complicated -- HADOOP-10379 made multiple changes like removing the quotes and the Version field.  So it was the combination of changes that broke things, not specifically removing the quotes.

bq. On Max-Age & Expired, i don't think we want to break old browsers. It seems to me an HttpClient bug that uses the presence of Expire to go back to old cookie format, the precense of Version=1 should trump. Can you dig on HttpClient side?

Seems reasonable, I'll dig., Here are a couple of test cases.  You'll notice they fail with the current cookie format and pass without the quotes.

I'm still investigating httpclient's handling of the cookies, as we discussed above., Did a little more digging.  Httpclient is indeed acting like I thought: if there is "expires" it is parsed as a netscape cookie, even if there is a version field.  I'll check with httpclient why that is.  By the way, even if it was parsed as an RFC2109 cookie, it wouldn't parse correctly because the Expires value has non-quoted spaces., Sent an e-mail to the httpclient list.  FWIW, I think we should just remove the quotes, as in my original patch.  It's a valid cookie, at least according to the netscape draft spec, and it works with current versions of httpclient.  That's good because it won't break existing clients and httpclient is popular enough to warrant consideration.  If they consider the above a bug and fix it in a later version, we can upgrade the required httpclient version and have a proper RFC2109 cookie format., Thoughts [~tucu00]?, I tried the tests with the format used in HADOOP-10379 and they seem to pass.  Let me see if I can come up with a test that fails for both those and HADOOP-10710.  I think only then would I be confident in our cookie format., bq. On Max-Age & Expired, i don't think we want to break old browsers. It seems to me an HttpClient bug that uses the presence of Expire to go back to old cookie format, the precense of Version=1 should trump. Can you dig on HttpClient side?

This is a bit complicated -- see the discussion here: http://mail-archives.apache.org/mod_mbox/hc-httpclient-users/201408.mbox/%3C1406895602.17749.8.camel%40ubuntu%3E
In short, it's not a valid Version=1 cookie, but httpclient would like to be able to handle it anyway, see HTTPCLIENT-1546.

I added a patch that does the following:
1) Runs the TestKerberosAuthenticator test cases against Tomcat as well as Jetty, this exposes the bug in HADOOP-10379, which didn't get a test added in HADOOP-10710
2) Adds an httpclient test case to TestKerberosAuthenticator.  This does 2 things:
- Checks that the cookie is actually being processed.  Note that it's possible for the existing tests to pass by doing the SPNego negotiation on each request, rather than relying on the cookie.  But the entity type we use in the test doesn't support repeating, so an exception is raised if the SPNego process repeats
- Verifies that httpclient works with our cookie format (probably not strictly necessary, but nice to have given httpclient's popularity)

So, I think the the test cases are pretty useful for catching regressions.

As for the format itself, I just chose a simple format that passes all the tests.  That seems like a reasonable improvement over what we have now, but I'm not married to the particular format., Once hadoop itself moves over to Java 7 at 2.7, is it possible to use {{java.net.HttpCookie}} directly and delegate this issue to JDK?, Latest version of the patch.

This patch has the following changes from the previous patch:
- Adds a check that a cookie with a proper token is included with each POST request.  This guarantees that the cookies are being handled correctly (i.e. the test can't pass by just redoing negotiate on each request).  The previous patch had a test for this with httpclient, but not with AuthenticatedURL.
- Changes the cookie format.  Note with the new tests, we are checking {jetty, tomcat} x {AuthenticatedURL, HttpClient}.  So we should be pretty confident in any cookie that passes all those tests.  To generate the cookie format, I used jetty 8.1.15.v20140411.  (NOTE: I didn't actually use the Cookie class and the 3.0 servlet API, I called the helper function jetty uses to produce the format: http://archive.eclipse.org/jetty/9.0.0.RC0/apidocs/org/eclipse/jetty/http/HttpFields.html#addSetCookie%28java.lang.String,%20java.lang.String,%20java.lang.String,%20java.lang.String,%20long,%20java.lang.String,%20boolean,%20boolean,%20int%29 ).  It produced a cookie like:
{code}
Set-Cookie=hadoop.auth="u=client&p=client@EXAMPLE.COM&t=kerberos&e=1409128342379&s=R6rNnd4CcMV0bNtK1dNLiJr1ivk=";Expires=Mon, 31-Aug-2026 08:36:23 GMT;HttpOnly
{code}
This is if you set to use version 0 cookies, version 1 is identical with a Max-Age entry added:
{code}
Set-Cookie=hadoop.auth="u=client&p=client@EXAMPLE.COM&t=kerberos&e=1409128342379&s=R6rNnd4CcMV0bNtK1dNLiJr1ivk=";Expires=Mon, 31-Aug-2026 08:36:23 GMT;Max-Age=379069291;HttpOnly
{code}
The Max-Age entry doesn't seem necessary, given even the JDK docs say version 1 is experimental.  Note that I kept the spaces after the ; in our format, as they don't seem to affect anything and make it easier to read.  Also, I tested the new format against Solr on real cluster and it passed, while the old format fails., +1, pending jenkins. Greg, thanks for you patience and for doing all those combinations of scenarios in the tests., {color:green}+1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12664529/HADOOP-10911v3.patch
  against trunk revision 4ae8178.

    {color:green}+1 @author{color}.  The patch does not contain any @author tags.

    {color:green}+1 tests included{color}.  The patch appears to include 2 new or modified test files.

    {color:green}+1 javac{color}.  The applied patch does not increase the total number of javac compiler warnings.

    {color:green}+1 javadoc{color}.  There were no new javadoc warning messages.

    {color:green}+1 eclipse:eclipse{color}.  The patch built with eclipse:eclipse.

    {color:green}+1 findbugs{color}.  The patch does not introduce any new Findbugs (version 2.0.3) warnings.

    {color:green}+1 release audit{color}.  The applied patch does not increase the total number of release audit warnings.

    {color:green}+1 core tests{color}.  The patch passed unit tests in hadoop-common-project/hadoop-auth.

    {color:green}+1 contrib tests{color}.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-HADOOP-Build/4594//testReport/
Console output: https://builds.apache.org/job/PreCommit-HADOOP-Build/4594//console

This message is automatically generated., Thanks Greg. Committed to trunk and branch-2., FAILURE: Integrated in Hadoop-Yarn-trunk #664 (See [https://builds.apache.org/job/Hadoop-Yarn-trunk/664/])
HADOOP-10911. hadoop.auth cookie after HADOOP-10710 still not proper according to RFC2109. (gchanan via tucu) (tucu: rev 156e6a4f8aed69febec408af423b2a8ac313c643)
* hadoop-common-project/hadoop-auth/src/test/java/org/apache/hadoop/security/authentication/client/TestKerberosAuthenticator.java
* hadoop-common-project/hadoop-auth/src/main/java/org/apache/hadoop/security/authentication/server/AuthenticationFilter.java
* hadoop-project/pom.xml
* hadoop-common-project/hadoop-common/CHANGES.txt
* hadoop-common-project/hadoop-auth/src/test/java/org/apache/hadoop/security/authentication/client/AuthenticatorTestCase.java
* hadoop-common-project/hadoop-auth/pom.xml
, FAILURE: Integrated in Hadoop-Hdfs-trunk #1855 (See [https://builds.apache.org/job/Hadoop-Hdfs-trunk/1855/])
HADOOP-10911. hadoop.auth cookie after HADOOP-10710 still not proper according to RFC2109. (gchanan via tucu) (tucu: rev 156e6a4f8aed69febec408af423b2a8ac313c643)
* hadoop-common-project/hadoop-auth/src/test/java/org/apache/hadoop/security/authentication/client/AuthenticatorTestCase.java
* hadoop-common-project/hadoop-common/CHANGES.txt
* hadoop-common-project/hadoop-auth/src/test/java/org/apache/hadoop/security/authentication/client/TestKerberosAuthenticator.java
* hadoop-common-project/hadoop-auth/pom.xml
* hadoop-project/pom.xml
* hadoop-common-project/hadoop-auth/src/main/java/org/apache/hadoop/security/authentication/server/AuthenticationFilter.java
, FAILURE: Integrated in Hadoop-Mapreduce-trunk #1881 (See [https://builds.apache.org/job/Hadoop-Mapreduce-trunk/1881/])
HADOOP-10911. hadoop.auth cookie after HADOOP-10710 still not proper according to RFC2109. (gchanan via tucu) (tucu: rev 156e6a4f8aed69febec408af423b2a8ac313c643)
* hadoop-common-project/hadoop-auth/src/main/java/org/apache/hadoop/security/authentication/server/AuthenticationFilter.java
* hadoop-common-project/hadoop-auth/pom.xml
* hadoop-project/pom.xml
* hadoop-common-project/hadoop-common/CHANGES.txt
* hadoop-common-project/hadoop-auth/src/test/java/org/apache/hadoop/security/authentication/client/AuthenticatorTestCase.java
* hadoop-common-project/hadoop-auth/src/test/java/org/apache/hadoop/security/authentication/client/TestKerberosAuthenticator.java
, We've discovered that this patch has broken the Oozie web console in secure clusters.  The attached trace shows that the cookie is getting truncated after the first occurrence of '='.  Reintroducing the quotes fixes the issue.

I'd like to revert this patch for 2.6.0.  We can reopen this issue if there is still a need to make a subsequent attempt at another patch for something related to HttpClient.  What do others think?

Thanks to [~venkatnrangan] for reporting the bug and providing the root cause analysis that identified this patch., [~cnauroth] do you have a test?  Ideally we'd have a format that worked for as many users as possible.

Also, can you check out HADOOP-11068?  I changed the format there to what's output by the latest jetty but it hasn't been committed.  Perhaps that works for you?, Thanks, Gregory.  From a quick scan of HADOOP-11068, I think that will do the trick.  I'll try it out and report back there.]