[There should also be a unit test for GenericWritable., There is a related issue in nutch NUTCH-434. I will just port this to hadoop as soon as i find some time., This patch delegates object initialization to ReflectionUtils, and changes GenericWritable to implement Configurable. A test case for GenericWritable is added. 
I have also found a subtle bug in {{GenericWritable#set()}}. If {{getTypes()}} returns classes such that a subclass is listed before its superclass, then the type of the wrapped object is set wrong, since {{Class#isInstanceOf()}} returns true. The bug is fixed by comparing class names. , +1

http://issues.apache.org/jira/secure/attachment/12362305/genericWritable_v1.0.patch applied and successfully tested against trunk revision r558831.

Test results:   http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/450/testReport/
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/450/console, It looks good, but rather than compare class names, please compare the class objects themselves.

ie. instead of {{if (clazz.getName().equals(instanceClassName) ...}} do {{if (clazz == instanceClass) ... }}

You also have one line with a 4 space indent that should be 2 spaces., Attaching the patch, which was attached to hadoop-dev previously. 
This version compares classes, rather than class names, adds some javadoc and improves logging in the test case., -1, build or testing failed

2 attempts failed to build and test the latest attachment http://issues.apache.org/jira/secure/attachment/12363235/genericWritable_v1.1.patch against trunk revision r562608.

Test results:   http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/517/testReport/
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/517/console

Please note that this message is automatically generated and may represent a problem with the automation system and not the patch., running test local succeeds, i believe failure of TestDFSUpgrade is not related to this. , -1, build or testing failed

2 attempts failed to build and test the latest attachment http://issues.apache.org/jira/secure/attachment/12363235/genericWritable_v1.1.patch against trunk revision r566467.

Test results:   http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/563/testReport/
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/563/console

Please note that this message is automatically generated and may represent a problem with the automation system and not the patch., Attaching the patch v1.2(no change) incorporating the patch in HADOOP-1696. 
See HADOOP-1696, for details. , Triggering the hudson build to see if the tests passes. The tests used to fail due to HADOOP-1696. , +1

http://issues.apache.org/jira/secure/attachment/12364211/genericWritable_v1.2-sortFiles.patch applied and successfully tested against trunk revision r567877.

Test results:   http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/581/testReport/
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/581/console, You've also patched UpgradeUtilities to sort directories.  This makes good sense, but is it really related to this issue, or should it rather be a separate issue?, The UpgradeUtilities patch is part of HADOOP-1696, either way is ok, we can include it in this patch since it is small enough.
, I'd rather keep it separate from this patch.  I'll commit this without that change, unless someone objects., version 1.2 of the patch with the sortFiles patch was an experiment with Raghu, to see if the failure could be corrected by the patch in HADOOP-1696. I thought we have made it clear in comments in HADOOP-1696, sorry for the extra noise. Now that we saw it is, we can commit patch version 1.1(same as v1.2 w/o sortFiles patch), after HADOOP-1749. 
, I just committed this.  Thanks, Enis!]