[If the lease-renewing thread has fallen behind, what confidence do we have that the client will be able to renew the lease any easier?  Moreover, this approach sounds like it would place more load on the namenode, which it probably doesn't need if it is being slow to respond to lease requests.

Perhaps we could instead change the client to wait for the lease-renewing thread to sucessfully renew things.  But first we should try to better understand the circumstances under which the lease-renewing thread fails to renew things.  It currently waits for half the lease period, then starts trying to renew leases once per second until it succeeds.  That sounds like a fine method to me.  Is the namenode sometimes unresponsive for longer than half lease period?  If so, then waiting until the renewer succeeds would be an appropriate solution, no?
, accelerating lease requests may not be the right approach, given that the typical use case is that the name node is so busy that it wasn't able to reply within half the lease period.
accelerating requests makes sense prior to STONITH, and then the other node should have a high priority thread to reply or risk death, that's clearly not the case here.

Seems like backing off requests is a better policy than accelerating requests., One minute is awfully short to lose your lease that kills a day worth of work. However, if we make the leases longer that will interact badly with a replacement reduce tasks starting. One approach that might be reasonable is to have two time limits:

lease becomes losable: 1 minute
lease is lost: 1 hour

A losable lease is lost when someone tries to create the same file. We need to have a forced timeout to handle the case of clients that disappear where the filename is never written again.

You need to separate out the handling of losable/lost leases on the namenode because once the lease is  declared lost on the name node, the blocks will be deleted. , 
+1 for owen's proposal.

, +1 for the losable (maybe we should call them stale?) leases proposal, A client's lease goes stale if it fails to renew the lease for 1 minute. After that period, if a different client request a lease for the same file, the resouces associated with the original lease gets reclaimed and the new lease-request is satisfied.
A client's lease trasitions from stale to expired after a 1 hour period. At that time all resouces associated with that lease gets reclaimed.

, A client's lease goes stale if it fails to renew the lease for 1 minute. After that period, if a different client request a lease for the same file, the resouces associated with the original lease gets reclaimed and the new lease-request is satisfied.
A client's lease trasitions from stale to expired after a 1 hour period. At that time all resouces associated with that lease gets reclaimed., I just committed this.  Thanks, Dhruba!]