[See HADOOP-9082 for more of the background discussion on the topic of cross-platform build scripts.
, Here is the link to the email thread related to community vote/discussion:
http://mail-archives.apache.org/mod_mbox/hadoop-common-dev/201212.mbox/ajax/%3CCA%2Bz3%2B9H%2B0Yierik3h5JqXXziwsbtm%3Dnp_rAe5_Vs6w9Zui0hxA%40mail.gmail.com%3E, I'm attaching a patch to remove the Python scripting.  I tested the build on Mac, Windows, and Ubuntu, including native support and bundling Snappy on Ubuntu.

For the most part, this is just a revert back to the trunk version of each of these pom.xml files.  There are a few differences for Windows compatibility though:

{code}
-                      ROOT=`cd ${basedir}/..;pwd`
+                      ROOT=`cd ../..;pwd`
{code}

This command was not working on Windows because it would generate a mix of \ and / in the destination path.  (i.e. cd C:\foo\bar/..)  Switching to a relative path and using only / as the path delimiter worked cross-platform.

{code}
-                      run tar czf hadoop-${project.version}.tar.gz hadoop-${project.version}
+                      run tar cf hadoop-${project.version}.tar hadoop-${project.version}
+                      run gzip hadoop-${project.version}.tar
{code}

The 'z' flag for compression causes tar to fork a separate process for gzip.  GnuWin32 tar has a limitation in that fork was never implemented, so this would fail on Windows with "Cannot fork: Function not implemented".  Splitting this into separate tar and gzip commands works cross-platform.

Another option here would have been to control the pipeline explicitly using a shell pipeline (tar | gzip), but the "run" helper function used here isn't compatible with passing a command that has a pipe.

{code}
-                      if [ $? = 1 ]; then
+                      if [ $? != 0 ]; then
{code}

On Windows, failure of the prior command might result in some non-zero exit code other than 1, so I changed this to check for any non-zero exit code.

{code}
-                      tar xzf ${basedir}/downloads/apache-tomcat-${tomcat.version}.tar.gz
+                      gzip -cd ../../downloads/apache-tomcat-${tomcat.version}.tar.gz | tar xf -
{code}

See explanation above about tar failure to fork on Windows.  This one was solveable using gzip | tar.

{code}
+                      BIN_DIR="${BUILD_DIR}/bin"
+                      if [ -d $${BIN_DIR} ] ; then
+                        TARGET_BIN_DIR="${BUILD_DIR}/${project.artifactId}-${project.version}/bin"
+                        mkdir -p $${TARGET_BIN_DIR}
+                        cd $${BIN_DIR}
+                        $$TAR * | (cd $${TARGET_BIN_DIR}/; $$UNTAR)
+                      fi
{code}

This is required to bundle the native Windows components (winutils.exe and hadoop.dll) from the bin directory.
, Thanks for the explanation. I compared the changed files with the counterparts in trunk and saw only the changes of nature you have described above. +1 for the patch., I committed the patch to branch-trunk-win.

Thank you Chris!]