[> We need to decide what access checks to make before allowing a client to use this new API.

So perhaps the dependency should be inverted, HADOOP-1869 should depend on this rather than vice versa?, Hi Doug, the patch in H-1869 implements the policy of requiring read-permission to set the access time and requiring write permission to set modification time. This works in some use-cases. However, this is different from the POSIX standard. 

I would like to get this resolved before shipping 0.19, hence marking it as a blocker., I propose that one can set any arbitrary access time or modification time if one has write permission to the file in question., Write permission is required to set access times on files., +1.

Minor : comment still says : {{'// The caller needs to have write access to set modification times'}}., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12390507/accessTimes.patch
  against trunk revision 697156.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 core tests.  The patch passed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3333/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3333/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3333/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3333/console

This message is automatically generated., This might belong to a different issue: if inode == null in FSNamesystem.setTimes(...), should we throw an exception?  Otherwise, client cannot tell whether the operation is success or failed., I just committed this. Thanks Nicholas and Raghu for your review comments., Integrated in Hadoop-trunk #611 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/611/])]