[Taking a look., HADOOP-9747 removed the call to {{KerberosUtil.hasKerberosKeytab}} which can be seen in the stack trace, so it didn't cause the problem.

Something is iterating {{getPrivateCredentials()}} and removing via the iterator w/o synchronizing on the set.  There's nothing the UGI can do to guard against it.  We need to attempt to track down that bad code., I can't find an offender in hadoop core.  What project (ie. hive, hbase, etc) encountered this issue?, Thanks [~daryn] for your time on this.
Project is [impala|https://github.com/cloudera/Impala] which just calls hdfs via the libhdfs wrapper.

Let me check the versions and get back.., {quote}Let me check the versions and get back..
{quote}
You're right, our version actually was slightly pre-HADOOP-9747. So with HADOOP-9747, we won't run into this exception... Sorry about the misinformation, corrected it in description

I'm gonna resolve this as 'fixed by' it. Though I should chase down where the removal happened - I think you don't have to remove _via the iterator_ to make it throw, just removing without synchronization should do. Not able to find any offender in hadoop code base either., The private credentials set returned by the subject is a synchronized set, so a direct remove is safe.  Remove via iterator is the only way to circumvent the thread-safety.

HADOOP-9747 doesn't/can't fix the problem.  The error just won't happen in the same place. :), Edit:

Searched impala code but don't find any faulty usage. Will just have HADOOP-9747 for now, to 'fix' this exception. The offending case should theoretically come up somewhere else too in the future, which may give more clues...

Thanks for the time here Daryn., Bit my tongue!
Saw this today on a CDH5 run for the first time.... , HI [~xiaochen],

Based on the discussion you had with [~daryn], it seems more reasonable to leave this jira Open, instead of Fixed. 

If we can not reproduce, we can mark it "Cant Reproduce". There is still the culprit to identify.

Thanks.
, Thanks for the comment [~yzhangal].

For the specific stacktrace, it won't appear anymore after HADOOP-9747, which is why I closed the jira.
The issue of 'someone seems to be removing from the synchronizedset without synchronizing' is still there, and seems we can now use HADOOP-15487 to track it. :)]