[- If we couldn't found a complete record AND
we cannot read more, i.e bufferRead == MAX_READ_SIZE 
it's because the record is too BIG
So log.warn, and drop current buffer so we can keep moving

- Add a test case
- Modify AgentControlSocketListener.java to be able:
--> to give a port of 0, so the system will can use any free port. 
--> retrieve the real port from Agent via AgentControlSocketListener, +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12400788/HADOOP-5302.patch
  against trunk revision 747279.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 2 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3907/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3907/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3907/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3907/console

This message is automatically generated., +1 looks good., I just committed this.  Thanks Jerome., Integrated in Hadoop-trunk #767 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/767/])
    .  Added check for record bigger than MAX_READ_SIZE.
(Contribute by Jerome Boulon via eyang)
]