[This patch should fix this bug., Vladimir,

Patch looks good.  It would be nice to have a test for (2).  It may also be appropriate to add an exception if someone passes in a filename with a comma.

-- Philip, Ok, will make the test., Philip,

I tried to create junit test for (2), but I met some difficulties. Seems that I need to start whole cluster from junit test (jobtracker, tasktracker) to
test running job with additional classpath in distributed cache. I'm not familiar with hadoop code, but maybe you or someone could point to the test that I could use as example.

Or there is another option. I can extract piece of code with bug to separate method and test it separately. But I'm not sure it's reasonable to in in 0.18 branch.

Also, I noticed that a comma bug is already fixed in trunk. 
, This patch contains unit-test for (1) and it validates if path to classpath entry contains CLASSPATH_ARCHIVES_SEPARATOR (","), One creates clusters in unit tests using MiniMRCluster, but that's too heavy-weight: I think it's ok to extract the relevant function and test it via unit test.

+1 to the tests for (1).

-- Philip, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12413164/HADOOP-6140-ver2.patch
  against trunk revision 793098.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    -1 patch.  The patch command could not apply the patch.

Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/564/console

This message is automatically generated., HADOOP-6140-ver3.patch contains patch with junit-test for (2), The same fix, but in trunk (0.21): MAPREDUCE-752, HADOOP-6140-ver4.patch is a enhancement of HADOOP-6140-ver3.patch: it extracts comparison statement to separate method and improves junit-tests , path.separator bug is fixed by HADOOP-4864., All the work for this issue should probably be in MAPREDUCE-752.

If this fix is to be included on the 0.18 branch, we'll also need fixes for the 0.19 and 0.20 branches., I'm just going to dupe it to MAPREDUCE-752 at this point.]