[This patch adds a property that will restore the previous behavior, which runs the combiner once for each partition in each spill. It will also run the combiner for single records whose serialized size exceeds the buffer size.

It's marked as deprecated, to be removed in a future release., No. In fact, the opposite was the intent. The types in Hadoop are:

k1,v1 -> map -> k2,v2
k2,v2 -> combiner -> k2,v2
k2,v2 -> reduce -> k3,v3

precisely because the combiner is supposed to be an optimization that could run arbitrary numbers of times. In fact, HADOOP-363 was asking for multiple level combiners from and to memory and was filed two years ago.

The problem is that Pig was depending on the previous semantics and it would be difficult for them to change it to support 0.18 in a timely manner. This backward compatibility is just a short term work around to allow Pig (and possibly other applications that break the abstraction) to work with Hadoop 0.18., Sorry, my comment is out of context. Arkady had asked on the core-dev list:

{quote}
For my education, can someone tell:

was "combiner guaranteed to run once and only once for each map" a documented part of the contract ?
{quote}, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12384172/3586-0.patch
  against trunk revision 668867.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    -1 javac.  The applied patch generated 444 javac compiler warnings (more than the trunk's current 441 warnings).

    -1 findbugs.  The patch appears to introduce 1 new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2678/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2678/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2678/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2678/console

This message is automatically generated., No tests are included, as this behavior will change in future releases. The javac warnings are from the deprecated methods added in support of the workaround. Fixed the findbugs warning., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12384183/3586-1.patch
  against trunk revision 669088.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    -1 javac.  The applied patch generated 444 javac compiler warnings (more than the trunk's current 441 warnings).

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2683/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2683/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2683/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2683/console

This message is automatically generated., As Arun points out, Task isn't a public class, so methods setting/getting this have been moved to JobConf., +1, Does this qualify as an incompatible change?, I just committed this., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12384244/3586-2.patch
  against trunk revision 669343.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2690/console

This message is automatically generated., Integrated in Hadoop-trunk #523 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/523/])]