[I get the following warning:

{noformat}
[WARNING] The requested profile "bintar" could not be activated because it does not exist.
{noformat}

, See the BUILDING.txt document in trunk/.  You need to use package -Pdist -Dtar now., As per Thomas' comment, use '-Pdist' (to create layout only) and '-Pdist -Dtar' (to create layout & tar). 

These changes were introduced with HADOOP-7498 & HADOOP-7496.

, Looks like my comment at 18/Aug/11 22:30 in HADOOP-7496 was not fully addressed.  We need to differentiate -Ptar, and -Pdeb. The packaging idea is the same, but the maven plugins called in the profiles are different.  My comment for HADOOP-7496 +1 at 20/Aug/11 16:18 is for -Pdist is good for creating directory layout. -Pdist would be a profile activate by -Ptar or -Pdeb to ensure that jar files in multiple type of packages have the same md5 signature.  In addition, it is better to standardized use of mvn clean package -Ptar.  HBase already use the -Ptar, -Pdeb convention (HBASE-3606), it would be nice to make them consistent across Hadoop projects.  Thank you. , Please use -Ptar to activate -Pdist and build tarball, @Eric,

As I've commented before, it is not possible to use a profile to activate another profile.

You can not have -Ptar to activate -Pdist.

You have to explicitly activate both -Pdist,tar

Which I'm OK with doing that way.

And for DEB/RPM would be -Pdist,deb & -Pdist,rpm

Does this make sense?

Still, this JIRA says that -Ptar and -Pbintar are broken. So I would close this one and open a new one with right description.

Regarding making things consistent, yes, we have to do that. common & hdfs are in synch already, and as per your feedback they reuse the same pom/assembly for that. We agreed that that would be taken over after merging MR2 into trunk and branching 0.23. There is a JIRA already for that, still many things missing in the JIRA MAPREDUCE-2842.
, I'm fine using another jira.

Is -Dbintar supported?

Once we decide, either way, can someone pls update HowToContribute wiki? I can change it now to read -Dtar, ok?, Arun, '-Pbintar' is now '-Pdist -Dtar', What about -Pdist as implicit build, hence "mvn clean package" would have a runnable directory?  Hence, "mvn package -Ptar,rpm,deb" would build the release builds?, That is possible, but it will add several seconds to package goal and if you are doing 'mvn install -DskipTests' to locally push a change to test things in another project it those seconds are a pain.

Because of this I'd rather leave it decoupled., Primary use case:

With explicit packaging:

 * export HADOOP_*_HOME
 * mvn clean package -Pdist
 * run HDFS
 * run mapreduce
 * Test things

With implicit packaging:

 * export HADOOP_*_HOME
 * mvn clean package
 * run HDFS
 * run map reduce
 * Test things

Build time are the same for both cases because the directory layout is required to run HDFS/MR for testing.

Secondary use case, for projects that depends on Hadoop.

With explicit packaging:

 * mvn clean install -Pdist

With implicit packaging:

 * mvn clean install

Build time is 12 seconds slower for implicit file packaging on a Mac laptop.

The secondary use case is less frequent than the primary use case.  Developer who modifies Hadoop and their dependent project is a much smaller group.  In addition, they will probably run mvn clean install in a module rather than top level.  The amount of time saved is almost non-existed.  I am in favor of making it shorter to type for primary use case.

, Eric,

If you are building from trunk/, Maven will run all phases in every sub-module. This means that will create the dist for common/hdfs/mapred and any other module that produces a distribution.

That will add up to many more developer seconds.

Furthermore, if you want to have ON by default, you can easily do that by adding the following to your *~/.m2/settings.xml* file:

{code}
<settings>
  ...
  <activeProfiles>
    <activeProfile>dist</activeProfile>
  </activeProfiles>
  ...
</settings>
{code}

I hope this is an acceptable solution a for you.
, bq. You have to explicitly activate both -Pdist,tar
bq. Which I'm OK with doing that way.
bq. And for DEB/RPM would be -Pdist,deb & -Pdist,rpm
bq. Furthermore, if you want to have ON by default, you can easily do that by adding the following to your ~/.m2/settings.xml file:

{noformat}
<settings>
  ...
  <activeProfiles>
    <activeProfile>dist</activeProfile>
  </activeProfiles>
  ...
</settings>
{noformat}

The proposal works, but it could be improved, if we use -Dtar to activate profile dist, and tar?

Hence, the command would be:

{noformat}
mvn clean package -Dtar
{noformat}
, I'm afraid Maven profile property activation does not work when inheriting the profile from a parent (and we want to do that not to dup POM logic)

, Thank you for the full explanation.  I am fine to resolve this issue as won't fix unless others feel strongly about the long parameters to pass to maven., Closing as agreed.

Eric, FYI, I've tried used properties or cascading profiles when I was doing HADOOP-7496 to do exactly what you where suggesting (that is why I knew it was not possible, I wanted to do the same at first)]