[It appears that this was introduced with changeset 949658.  Here is a partial diff of org.apache.hadoop.fs.FileUtil:

{noformat}
@@ -258,7 +258,7 @@
                                   Configuration conf, String addString) throws IOException {
     dstFile = checkDest(srcDir.getName(), dstFS, dstFile, false);
 
-    if (!srcFS.getFileStatus(srcDir).isDir())
+    if (srcFS.getFileStatus(srcDir).isDirectory())
       return false;
{noformat}

Notice that in addition to switching from isDir() to isDirectory(), this change also dropped the negation on the front of the condition.  I'll attach a simple one-line patch to restore functionality.  I've also added a unit test to cover the FileUtil.copyMerge API.  I'd like to volunteer for HADOOP-6387 next, and I want this unit test in place as a regression test while I work on that.
, I've attached the patch.  Could I please have a code review?  Thank you., I've reviewed the patch, and it looks good to me., Tests failed for me until I also changed the file merge to sort the files.  This is probably a good idea anyway.  Here's a new version of the patch with that change., Thanks, Aaron and Doug.

I'm following the directions from http://wiki.apache.org/hadoop/HowToContribute .  I don't see the "Submit Patch" link to trigger Hudson though.  Is there something else that I need to do?
, Doug already marked the ticket patch available.

Not quite sure why Hudson hasn't picked it up yet - might just be taking some time to get around to it (the HDFS tests take quite a while to run.), Ran test-patch by hand.

{code}
-1 overall.  

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    -1 javadoc.  The javadoc tool appears to have generated 1 warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 system tests framework.  The patch passed system tests framework compile.
{code}

The javadoc test seems broken, as it fails even when I run test-patch with an empty patch file., I just committed this.  Thanks, Chris!, Integrated in Hadoop-Common-trunk-Commit #402 (See [https://hudson.apache.org/hudson/job/Hadoop-Common-trunk-Commit/402/])
    HADOOP-7006. Fix 'fs -getmerge' command to not be a no-op.  Contributed by Chris Nauroth.
, Integrated in Hadoop-Common-trunk #494 (See [https://hudson.apache.org/hudson/job/Hadoop-Common-trunk/494/])
    HADOOP-7006. Fix 'fs -getmerge' command to not be a no-op.  Contributed by Chris Nauroth.
]