[I don't think we change the instructions.

We actually like those tests to compile; even if you don't run the tests, the -test artifacts are needed downstream and so have to be published. Furthermore, the cost of a compile is low (compared to test runs), and it will catch static changes immediately.

I do think its' a local problem with your system, and that this is something you're going to need to fix -adding some details on the wiki afterwards may be useful, or we could add an IBM-platform extension to the BUILDING.TXT. But those -test artifacts are used downstream (example, base FS compatibility tests are pubished in hadoop-common-test, and picked by external FS suppliers), and publishing a hadoop build, even locally, without those artifacts, is risky., I've investigated a bit more.
Build-wise with -DskipTests, the problem files are 
hadoop-2.6.0-src/hadoop-yarn-project/hadoop-yarn/hadoop-yarn-registry/src/test/java/org/apache/hadoop/registry/secure/TestSecureLogins.java
./hadoop-common-project/hadoop-common/src/test/java/org/apache/hadoop/security/ssl/KeyStoreTestUtil.java
because they import java-vendor-specific package names (the former, com.sun.security.auth.module.Krb5LoginModule; the latter, several symbols from sun.security.x509. )
Substituting com.ibm. for both sun. and com.sun. allows my build to complete (with the IBM JDK).
The hadoop code has several runtime checks for the JRE, so it looks as if others are changing the imports outside of the build process to get around the lack of conditional compilation.
Should the two files causing this build failure be generated (earlier in the build) with the vendor-specific imports?, they should be reworked to support IBM JVMs... that's a bug on its own.

JVM-specific stuff should be hidden in {{KerberosUtil}} and use reflection to pick up the right thing., {{TestSecureLogins}} (my code) only uses the com.sun stuff in one test, {{testKerberosAuth()}}, which was written to try and diagnose kerberos login problems (especially on windows). If should be able to switch to using reflection with {{KerberosUtil}} helping —and remember, this will be needed for Java 9 too—, or it could just be commented out with a "re-enable for windows if you really need to".

{{KeyStoreTestUtil}} cut sun.security packages in HADOOP-10847.. one of your colleagues' work. Grab trunk or branch-2 and start from there., See also HADOOP-11783 .]