[+1 The lack of a HADOOP_TASKTRACKER_OPTS definition looks like an oversight (these variables were introduced in HADOOP-2551). HADOOP_TASKTRACKER_OPTS is already honoured by bin/mapred, so no changes are needed there.

Bernd, have you tested this manually? There's currently no easy way to write an automated test for this change., I did test this manually indeed. The patch is in active use in my env.

There are things like http://code.google.com/p/jbash/ which might help setting up a test, but just for this small improvement it seem like overkill.  , -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12468028/hadoop-7098.patch
  against trunk revision 1076314.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://hudson.apache.org/hudson/job/PreCommit-HADOOP-Build/299//console

This message is automatically generated., Good to know.

Regenerating patch from top level so Hudson can check it., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12472646/HADOOP-7098.patch
  against trunk revision 1076314.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

    +1 system test framework.  The patch passed system test framework compile.

Test results: https://hudson.apache.org/hudson/job/PreCommit-HADOOP-Build/300//testReport/
Findbugs warnings: https://hudson.apache.org/hudson/job/PreCommit-HADOOP-Build/300//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://hudson.apache.org/hudson/job/PreCommit-HADOOP-Build/300//console

This message is automatically generated., I've just committed this. Thanks Bernd!, Integrated in Hadoop-Common-trunk #620 (See [https://hudson.apache.org/hudson/job/Hadoop-Common-trunk/620/])
    HADOOP-7098. Tasktracker property not set in conf/hadoop-env.sh. Contributed by Bernd Fondermann.
, Integrated in Hadoop-Common-trunk-Commit #517 (See [https://hudson.apache.org/hudson/job/Hadoop-Common-trunk-Commit/517/])
    ]