[I think it is simpler to just describe what happened :

 * Some datanode went down and X and Y are the remaining replicas for B (of length 53384156) .
 * NN asked X to replicate the block B  to P
 * P reported B as corrupt since CRC failed on its side.
 * NN marks B on X as corrupt.
 * NN asks Y to replicate  B to Q
 * Y reports the following error in the log and reports the block as corrupt.
    ** _Can't replicate block B because on-disk length 53384156 is shorter than NameNode recorded length 134217728_
 * This mismatch happened since when P reported the first corruption, it used a block object with default length of 128 MB, and NN incorrectly keeps that object in its neededReplication queue.

This affects only 0.20 since 0.20 started reporting length and CRC mismatches during replication attempts.

, This patch makes sure that the block stored in blocks map is added to neededReplications queue when NN handles bad block report., This patch additionally handles the case that the reported bad block does not belong to any file. In this case, NN logs the information and put the block into invalidate blocks queue., +1. 

Probably better to call 'blockInfo' 'storedBlock' or just reassign 'blk'., This patch changes the name to be storedBlockInfo as suggested., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12404481/reportBadBlock2.patch
  against trunk revision 761407.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-minerva.apache.org/104/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-minerva.apache.org/104/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-minerva.apache.org/104/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-minerva.apache.org/104/console

This message is automatically generated., Hudson process seems to have a problem. It did not run all unit tests and then declared a test failure. Ant test-core got past on my local machine:

BUILD SUCCESSFUL
Total time: 128 minutes 2 seconds, I manually tested this patch and it worked., I just committed this., Integrated in Hadoop-trunk #796 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/796/])
    . All the replicas incorrectly got marked as corrupt. Contributed by Hairong Kuang.
, Attached a patch for testing this fix.]