[Similar issue has been created for Map/Reduce (MAPREDUCE-1369, see Issue Links). Perhaps, a similar issue should be also created for HDFS., Please review the submitted patch.

The patch is the same as in MAPREDUCE-1369, attached at 2010-01-11 04:04 AM (with different line numbers), and details are the same as described in the comment to MAPREDUCE-1369 added at 11/Jan/10 04:12 AM. , +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12429870/HADOOP-6374.patch
  against trunk revision 897023.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 1 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/268/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/268/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/268/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/268/console

This message is automatically generated., Please review the submitted patch. Thanks., Please review the submitted patch. Thanks., Please review the submitted patch. Thanks., +1 patch looks good. I see that a similar JIRA has been open for MapReduce. I think the same needs to be done for HDFS subproject.

I also have ran all Common's tests and they seem to be just fine with the patch in place. I'm going to commit it., I've just committed this to the trunk. Thanks Anatoli!, Integrated in Hadoop-Common-trunk #229 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Common-trunk/229/])
    , Integrated in Hadoop-Common-trunk-Commit #147 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Common-trunk-Commit/147/])
    ]