[[~aw], do you have any trouble or usecase for this?

Proxy user is feature for services like oozie and I think it is not problem to prohibit impersonation without explicit configuration.
, Maybe it was accidental. Example, a service like hdfs gets an incoming request from the hdfs principal. It doesn't make sense to have some code like

{code}
if (!ugi.getCurrentUser().equals(ugi.getRealUser() { UGI.createProxyUser(...)}
{code}
that only creates two code paths, and requires whoever is writing the security code to consider this use case., bq.  do you have any trouble or usecase for this?

I hit it several times while playing around with WebHDFS on an unsecure cluster.  This particular case is almost certainly more fallout from the 2.4/2.5 hack job on WebHDFS auth.

bq.   I think it is not problem to prohibit impersonation without explicit configuration.

How about this: if there is no proxy entry for a given user, then self impersonation is allowed.  This protects against the few cases where self impersonation would be a bad thing, because at least in all the cases I'm thinking of, those services always have a proxy entry anyway.,  bq.  if there is no proxy entry for a given user, then self impersonation is allowed. This protects against the few cases where self impersonation would be a bad thing, because at least in all the cases I'm thinking of, those services always have a proxy entry anyway.

I'm happy with this, though need someone who understands the hadoop security model to offer valid opinions, bq. I hit it several times while playing around with WebHDFS on an unsecure cluster.

If {{ProxyUsers#authorize}} is called when it should not be, it is a bug and should be fixed rather than changing authorization scheme.
, bq. If ProxyUsers#authorize is called when it should not be, it is a bug and should be fixed rather than changing authorization scheme.

There is no difference between a user authenticating as themselves and a user authenticating as themselves and requesting to proxy to their own account, especially if we put in the clause about there mustn't already exist a proxy config entry.

As to a bug, I'd love to go back to pre-2.5.0 NN HTTP handling before everything got massively screwed up despite us (a year later) still dealing with the fallout, but I don't see that happening.  But again: it's sort of irrelevant.  There's no real difference here from a security perspective.]