[The EOF exception caused as follow:

BlockCompressorStream compresses the input data block-by-block. For each block, the uncopressed block length is first written to the underlying output stream, followed by compressed chunks, each consists of a chuck-length and compressed chunk-data. 

So BlockCompressorStream writes an int of 0 to the underlying output stream when compressing empty file, without any following chunks. 

BlockDecompressorStream decompresses the underlying compressed input stream block by block. For each block, it reads the uncompressed block length and then reads the chunk length and compressed chunk. 

So BlockDecompressorStream read 0 and get EOF exception trying to read chunk length when decompressing previous compressed empty file.

, Patch attached.

Return -1 to indicate EOF when reading a 0 block length., New patch attached, including test case., +1, I've seen this issue in production as well. Fix and test case look good, except please add the apache header to the test case, and preferably update the test case to JUnit 4 style, Thank you for your advice. 

New patch attached with apache header and JUnit 4 style test case., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12440828/BlockDecompressorStream.java.patch
  against trunk revision 930096.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/443/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/443/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/443/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/443/console

This message is automatically generated., I've just committed this. Thanks Kang Xiao!, Re-opening as there was a compilation problem., Running updated patch through Hudson., Integrated in Hadoop-Common-trunk-Commit #399 (See [https://hudson.apache.org/hudson/job/Hadoop-Common-trunk-Commit/399/])
    Reverting HADOOP-6663.
HADOOP-6663.  BlockDecompressorStream get EOF exception when decompressing the file compressed from empty file.  Contributed by Kang Xiao.
, Integrated in Hadoop-Common-trunk #493 (See [https://hudson.apache.org/hudson/job/Hadoop-Common-trunk/493/])
    Reverting HADOOP-6663.
HADOOP-6663.  BlockDecompressorStream get EOF exception when decompressing the file compressed from empty file.  Contributed by Kang Xiao.
, I ran the tests and test-patch manually:

{noformat}
     [exec] +1 overall. 
     [exec]
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec]
     [exec]     +1 tests included.  The patch appears to include 4 new or modified tests.
     [exec]
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec]
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec]
     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs warnings.
     [exec]
     [exec]     +1 release audit.  The applied patch does not increase the total number of release audit warnings.
     [exec]
     [exec]     +1 system tests framework.  The patch passed system tests framework compile.
{noformat}, I've just committed this., Integrated in Hadoop-Common-trunk-Commit #404 (See [https://hudson.apache.org/hudson/job/Hadoop-Common-trunk-Commit/404/])
    HADOOP-6663.  BlockDecompressorStream get EOF exception when decompressing the file compressed from empty file.  Contributed by Kang Xiao.
, Integrated in Hadoop-Common-trunk #496 (See [https://hudson.apache.org/hudson/job/Hadoop-Common-trunk/496/])
    HADOOP-6663.  BlockDecompressorStream get EOF exception when decompressing the file compressed from empty file.  Contributed by Kang Xiao.
, Copied the same change Kang Xiao made to 0.20.2 since I needed it for that version.]