[In HADOOP-6122, we found that  patchJavacWarnings=64 but trunkJavacWarnings=124., > ...  HDFS and MapReduce seem not having this problem.
I was wrong.  HDFS and MapReduce also have this problem.

The project is not cleaned when patchJavacWarnings.txt is generated.  Some java source files may be already compiled and they will not be compiled again.  As a result, the warnings inside those files won't be reported.  Note that there is a clean when trunkJavacWarnings.txt is generated.

c6124_20090701.patch: add clean before tar, Giridharan, c6124_20090701.patch does not fix the entire problem.  There are still some additional bugs in test-patch.sh.  Since you are the assignee, I will leave this issue to you.  Thanks for working on this., Hope this can be fixed soon.  Otherwise, patches with javac warnings may get in without being noticed.  Changed the priority to "critical"., Quite a few javac warnings are getting in without being detected.  See MAPREDUCE-716 and MAPREDUCE-743.

Giridharan, if you are not going to work on this soon, please un-assign yourself.  Someone else may want to work on this., this patch adds the clean target before calling the tar while searching for javac warnings and also address the issue mentioned as part of HADOOP-6077., HADOOP-6124.patch has some good changes for HADOOP-6077 but it did not fix the problem in this issue.
{noformat}
     [exec] There appear to be 122 javac compiler warnings before the patch and  
64 javac compiler warnings after applying the patch.
{noformat},      [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec] 
     [exec]     -1 javac.  The applied patch generated 100 javac compiler warnings (more than the trunk's current 99 warnings).
     [exec] 
     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs warnings.
     [exec] 
     [exec]     +1 release audit.  The applied patch does not increase the total number of release audit warnings.

applied the hadoop-6124.patch and tested a hadoop patch that introduced a javac warning. Here is the result. 
test-patch was able to parse and show the increase in the no of javac warnings.

, If the patch works for you, it may work for Hudson.  Let's give it a try.

+1 Patch looks good., Script testing is not yet supported (see HADOOP-6174).  So I am going to commit this without submitting to Hudson., I have committed this.  Thanks, Giridharan!, Integrated in Hadoop-Common-trunk #45 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Common-trunk/45/])
    . Fix javac warning detection in test-patch.sh.  Contributed by Giridharan Kesavan
, Integrated in Hadoop-Hdfs-trunk #40 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Hdfs-trunk/40/])
    . Fix javac warning detection in test-patch.sh.  Contributed by Giridharan Kesavan
, Integrated in Hadoop-Mapreduce-trunk #39 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Mapreduce-trunk/39/])
    . Fix javac warning detection in test-patch.sh.  Contributed by Giridharan Kesavan
]