[I compared hadoop-project/pom.xml and the last hadoop-common/ivy/libraries.propertie.
There is one more:
* hsqldb.version=1.8.0.10, 1.8.0.7, I believe hsqldb is only used in mapreduce, so it doesn't have to be in hadoop-common/pom.xml. All tests in hadoop-common are passing without it.  Was there any reason it was downgraded from 1.8.0.10 to 1.8.0.7? We have been on 1.8.0.10 for over two years, so it doesn't seem like a merge error., I've got the versions manually from the ivy/libraries.properties file, I've either had a typo or those were the version in common/ivy/libraries.properties.

If hadoop-commons does not use hsqldb please submit a patch removing it from hadoop-common/pom.xml., There are also other dependencies that are dubious, and I plan to follow up with a dependencies clean up JIRA.
, I just happened to notice hsqldb and there may be more. As you said, these can be cleaned up in a separate JIRA.

+ 1 for the patch.  Please make sure the new ones are published to the maven repo., +1 I successfully ran the unit tests and test-patch (no new tests since this is bumping dependency version numbers):

{noformat}
-1 overall.  

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 system test framework.  The patch passed system test framework compile.
{noformat}, I've just committed this. Thanks Alejandro., Integrated in Hadoop-Common-trunk-Commit #746 (See [https://builds.apache.org/job/Hadoop-Common-trunk-Commit/746/])
    HADOOP-7536. Correct the dependency version regressions introduced in HADOOP-6671. Contributed by Alejandro Abdelnur.

tomwhite : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1158347
Files : 
* /hadoop/common/trunk/hadoop-common/CHANGES.txt
* /hadoop/common/trunk/hadoop-project/pom.xml
]