[The following incompatible changes were noticed between branch-1 and branch-2 caused by HADOOP-8551
1. mkdir would create parent directories in branch-1 if they did not exist. In branch-2 users have to explicitly send mkdir -p
2. Create a multi level dir in branch 1 something like
mkdir /test/1
/test would get permissions 755 and /test/1 would get the permissions based on your umask settings
however if you run the command in branch-2
mkdir -p /test/1
both /test and /test/1 will get the permissions based on your umask.
These are significant changes that we should document., In hadoop 2.x the files listed in dfs.hosts and dfs.hosts.exclude have to exist otherwise namenode will throw a file not found exception and exit., Here are other incompatible changes:
{noformat}
HDFS-3034. Remove the deprecated DFSOutputStream.sync() method.

HDFS-3755. Creating an already-open-for-write file with overwrite=true fails

HDFS-2676. Remove Avro RPC.

HDFS-3138. Move DatanodeInfo#ipcPort to DatanodeID.

HDFS-3164. Move DatanodeInfo#hostName to DatanodeID.

HDFS-2887. FSVolume, is a part of FSDatasetInterface implementation, should
not be referred outside FSDataset.  A new FSVolumeInterface is defined.
The BlockVolumeChoosingPolicy.chooseVolume(..) method signature is also
updated.

HDFS-1825. Remove thriftfs contrib.

HDFS-3446. HostsFileReader silently ignores bad includes/excludes

HDFS-3137. Bump LAST_UPGRADABLE_LAYOUT_VERSION to -16.
Upgrade allowed from only release 0.18 onwards

HDFS-2210. Remove hdfsproxy.

HDFS-2303. Unbundle jsvc.

HDFS-1526. Dfs client name for a map/reduce task should be unique
among threads.

HDFS-1536. Improve HDFS WebUI.

HDFS-1073. Redesign the NameNode's storage layout for image checkpoints
and edit logs to introduce transaction IDs and be more robust.
Please see HDFS-1073 section below for breakout of individual patches.

HDFS-538. Per the contract elucidated in HADOOP-6201, throw
FileNotFoundException from FileSystem::listStatus rather than returning
null.

HDFS-602. DistributedFileSystem mkdirs throws FileAlreadyExistsException
instead of FileNotFoundException.

HDFS-544. Add a "rbw" subdir to DataNode data directory.

HDFS-576. Block report includes under-construction replicas.

HDFS-636. SafeMode counts complete blocks only.

HDFS-644. Lease recovery, concurrency support.

HDFS-570. Get last block length from a data-node when opening a file
being written to.

HDFS-657. Remove unused legacy data-node protocol methods.

HDFS-658. Block recovery for primary data-node.

HDFS-660. Remove deprecated methods from InterDatanodeProtocol.

HDFS-512. Block.equals() and compareTo() compare blocks based
only on block Ids, ignoring generation stamps.

HDFS-873. Configuration specifies data-node storage directories as URIs.

HDFS-905. Use the new UserGroupInformation from HDFS-6299. 

HDFS-984. Persistent delegation tokens.

HDFS-1016. HDFS side change for HADOOP-6569. This jira changes the
error message on the screen when cat a directory or a non-existent file.
{noformat}

We should add a page with these incompatibilities categories as API related, operations related etc., a) This is stale
b) The Incompatible flag in JIRA + Apache Yetus releasedocmaker automatically does this work

Closing as Won't Fix.]