[Hello [~Swagat].  These tests are intended to be run using an empty bucket, dedicated strictly for the purpose of running these tests.  Quoting the same documentation:

{quote}
The contents of each bucket will be destroyed during the test process: do not use the bucket for any purpose other than testing. Furthermore, for s3a, all in-progress multi-part uploads to the bucket will be aborted at the start of a test (by forcing fs.s3a.multipart.purge=true) to clean up the temporary state of previously failed tests.
{quote}

It is by design that the test aborts if it actually finds anything in the bucket that would be deleted.  That protects people from accidentally pointing the test suite at a bucket containing critical production data and deleting all of it.  Note the comment in {{AbstractContractRootDirectoryTest#testListEmptyRootDirectory}}:

{code}
  @Test
  public void testListEmptyRootDirectory() throws IOException {
    //extra sanity checks here to avoid support calls about complete loss of data
    skipIfUnsupported(TEST_ROOT_TESTS_ENABLED);
    FileSystem fs = getFileSystem();
    Path root = new Path("/");
    FileStatus[] statuses = fs.listStatus(root);
    for (FileStatus status : statuses) {
      ContractTestUtils.assertDeleted(fs, status.getPath(), true);
    }
    assertEquals("listStatus on empty root-directory returned a non-empty list",
        0, fs.listStatus(root).length);
  }
{code}

I have verified that the test passes as expected when running with an empty bucket.

Does this make sense?  If so, I would like to resolve this issue as "Not a Problem"., Hi [~cnauroth] you can resolve this issue. The documentation does help but I feel if we fail the tests in such cases with an exception stating "Non empty bucket found, hence failing the test" would make it more clear., bq. The documentation does help but I feel if we fail the tests in such cases with an exception stating "Non empty bucket found, hence failing the test" would make it more clear.

[~Swagat], that's a great suggestion.  Thanks!  Let's keep the issue open to track making that change.  Are you interested in contributing a patch?, Hi [~cnauroth] I can contribute to the patch but this jira looks wrong for this patch.
To clarify, I had created this patch to point an issue I was hitting. 
What we have agreed on, is we need a way for the s3a tests to throw an exception("stating Failing test since Non empty bucket found") if someone by mistake entered a non empty s3 bucket in the conf file.

I will create a separate jira for doing this.  , And we should close this jira out as "Not a problem", [~Swagat], it sounds like a good plan.  I'm closing this one now., There's something related, HADOOP-12977. You can't actually do an rm -f / on S3a. I think we should consider allowing that, Of course. one way to have a test here which guarantees to have an empty root dir is: have a dedicated s3 bucket purely for these tests. This is something which could perhaps be shared, because with no data to publish, it's costs should be nearly $0]