[[~wheat9] - is this really a blocker for 2.5? IIUC, this has been a long-standing issue. Will it be okay to move this out, since no one seems to be working on it? , I'm okay to move it out. [~daryn], can you share your insights on this issue?, We are using this in YARN - TimelineServer and/or RM web-services. If removing this is a blocker, we should also fix YARN., [~wheat9] and [~daryn], what's the alternative solution if AuthenticatedURL is not used? Is it possible to fix the aforementioned problems instead of defaulting the feature?

In addition to YARN RM and TimelineSever, HttpFS seem to still use AuthenticatedURL as well. We also notice that there're the parallel effort to improve the http authentication code (HADOOP-10799)., The double SPNEGO authentication issue Daryn refers to is a problem of the KerberosAuthenticator, he is correct when stating that JDK does automatically SPNEGO when within a Kerberos login context, just created HADOOP-10850 for it.

Regarding removing {{AuthenticatedURL}} altogether, I disagree on that. The fallback functionality is useful, HttpFS uses it for testing and now KMS is using it as well, plus YARN RM and TimelineServer. So we should work on fixing it, rather than trashing it.

In addition, with the work that I'm doing in HADOOP-10799 (adding delegation token support) & HADOOP-10835 (adding proxy user support) it simplifies significantly the client side code eliminating a big chunk of repetitive security related code that currently is done by the component doing HTTP calls instead by a security library. , (Moving this out of 2.5)

We can continue this conversation and handle this in 2.6. , I'm lowering the prio of this from major. I think we all agree that it's an issue that we should address, but I see no reason this should be considered a blocker., Just commented in HADOOP-10850, I think we should close this JIRA and HADOOP-10850 as invalids., Moving bugs out of previously closed releases into the next minor release 2.8.0., If AuthenticatedURL is trouble, at the very least it should be tagged as deprecated and pulled out when not needed]