[Attaching patch.

Patch was originally part of the fix for HADOOP-8414 but was separated into its own Jira as it can generally stand alone. 
, +1 Assuming test-patch comes back clean, looks good!, Updated patch - ran through dos2unix, Committed to the Windows branch. Thanks Ivan., This is also applicable for trunk & branch-2 (and maybe 23) since it's not windows specific.  Would someone please also commit it there?, bq. This is also applicable for trunk & branch-2 (and maybe 23) since it's not windows specific. Would someone please also commit it there?
Let me create a trunk compatible patch and attach it here. After that it should not be a problem for Sanjay (or someone else) to commit it., Attaching a trunk compatible patch.

While running tests on trunk, I noticed one issue with the original patch, so also attaching a patch with the fix for branch-1-win., +1 Updated patches look good!  On a slight tangent, it may make sense for a null authority to be translated to the default fs.  That would be separate jira though., Reopen for committing to trunk and other branches., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12531179/HADOOP-8440-branch-1-win.patch
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-HADOOP-Build/1094//console

This message is automatically generated., Ivan, a testcase for branch-1-win patch would be very useful... thanks!, Attaching new patch for branch-1-win that backports the trunk testcase which caught the problem., bq. Ivan, a testcase for branch-1-win patch would be very useful... thanks!
Thanks for reviewing Arun! I attached a new patch with a backported testcase from trunk.

Just to clarify, we have two patches that we want committed here:
 - HADOOP-8440-branch-1-win.2.patch should go to brach-1-win
 - HADOOP-8440-trunk.patch should go to trunk

For some reason, Hadoop QA tried to apply the branch-1-win patch to trunk and failed. Let me know if I can do something on my end so that this does not happen in the future., bq. On a slight tangent, it may make sense for a null authority to be translated to the default fs. That would be separate jira though.
@Daryn: My take would be to hold off with a new Jira until we have a user scenario that justifies the need. Don't mind opening the Jira if you feel strong about this though., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12531716/HADOOP-8440-branch-1-win.2.patch
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 1 new or modified test files.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-HADOOP-Build/1107//console

This message is automatically generated., Attaching the patch again so that Jenkins picks up the right patch for trunk.

HADOOP-8440-branch-1-win.2.patch should be committed to branch-1-win manually., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12532264/HADOOP-8440-trunk.patch
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 1 new or modified test files.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 eclipse:eclipse.  The patch built with eclipse:eclipse.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed unit tests in hadoop-common-project/hadoop-common.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-HADOOP-Build/1120//testReport/
Console output: https://builds.apache.org/job/PreCommit-HADOOP-Build/1120//console

This message is automatically generated., +1 trunk patch looks good, Ivan, the changes you made in HADOOP-8440-branch-1-win.2.patch are not in the trunk patch. Were you planning to update the trunk patch?, bq. Ivan, the changes you made in HADOOP-8440-branch-1-win.2.patch are not in the trunk patch. Were you planning to update the trunk patch?
Thanks for reviewing Sanjay. All changes should be there. As I ported a test case {{testHarUri}} back from trunk to branch-1-win, we are seeing some discrepancy in how the changes are laid out (per Arun's request above). , Review and committed (HADOOP-8440-branch-1-win.2.patch) to hadoop-1 windows branch., Resolving as this is committed to branch-1-win. This way, the state of active Jiras is up to date under HADOOP-8079. Will reference this Jira once we get to fixing this in trunk., We also need this fix in trunk and branch-2. , +1 for the trunk patch.  I verified it on Mac and Windows.  I'll commit this., Integrated in Hadoop-trunk-Commit #4054 (See [https://builds.apache.org/job/Hadoop-trunk-Commit/4054/])
    HADOOP-8440. HarFileSystem.decodeHarURI fails for URIs whose host contains numbers. Contributed by Ivan Mitic. (Revision 1501424)

     Result = SUCCESS
cnauroth : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1501424
Files : 
* /hadoop/common/trunk/hadoop-common-project/hadoop-common/CHANGES.txt
* /hadoop/common/trunk/hadoop-common-project/hadoop-common/src/main/java/org/apache/hadoop/fs/HarFileSystem.java
* /hadoop/common/trunk/hadoop-common-project/hadoop-common/src/test/java/org/apache/hadoop/fs/TestHarFileSystem.java
, I committed to trunk, branch-2, branch-2.1-beta, and branch-2.1.0-beta.  Thank you to Ivan for the original patch, and thank you to Chuan for the additional help reviewing and testing on trunk., Integrated in Hadoop-Yarn-trunk #266 (See [https://builds.apache.org/job/Hadoop-Yarn-trunk/266/])
    HADOOP-8440. HarFileSystem.decodeHarURI fails for URIs whose host contains numbers. Contributed by Ivan Mitic. (Revision 1501424)

     Result = SUCCESS
cnauroth : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1501424
Files : 
* /hadoop/common/trunk/hadoop-common-project/hadoop-common/CHANGES.txt
* /hadoop/common/trunk/hadoop-common-project/hadoop-common/src/main/java/org/apache/hadoop/fs/HarFileSystem.java
* /hadoop/common/trunk/hadoop-common-project/hadoop-common/src/test/java/org/apache/hadoop/fs/TestHarFileSystem.java
, Integrated in Hadoop-Hdfs-trunk #1456 (See [https://builds.apache.org/job/Hadoop-Hdfs-trunk/1456/])
    HADOOP-8440. HarFileSystem.decodeHarURI fails for URIs whose host contains numbers. Contributed by Ivan Mitic. (Revision 1501424)

     Result = FAILURE
cnauroth : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1501424
Files : 
* /hadoop/common/trunk/hadoop-common-project/hadoop-common/CHANGES.txt
* /hadoop/common/trunk/hadoop-common-project/hadoop-common/src/main/java/org/apache/hadoop/fs/HarFileSystem.java
* /hadoop/common/trunk/hadoop-common-project/hadoop-common/src/test/java/org/apache/hadoop/fs/TestHarFileSystem.java
, Integrated in Hadoop-Mapreduce-trunk #1483 (See [https://builds.apache.org/job/Hadoop-Mapreduce-trunk/1483/])
    HADOOP-8440. HarFileSystem.decodeHarURI fails for URIs whose host contains numbers. Contributed by Ivan Mitic. (Revision 1501424)

     Result = FAILURE
cnauroth : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1501424
Files : 
* /hadoop/common/trunk/hadoop-common-project/hadoop-common/CHANGES.txt
* /hadoop/common/trunk/hadoop-common-project/hadoop-common/src/main/java/org/apache/hadoop/fs/HarFileSystem.java
* /hadoop/common/trunk/hadoop-common-project/hadoop-common/src/test/java/org/apache/hadoop/fs/TestHarFileSystem.java
]