[Here's a patch that removes the public create method. It is not a straight revert of HADOOP-5438 since in the intervening time since this was committed the codebase has been split into three projects, and FileContext has been introduced which uses some of the same underlying code.

The HDFS part of this patch is in HDFS-609., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12447173/HADOOP-6826.patch
  against trunk revision 954647.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 javadoc.  The javadoc tool appears to have generated 1 warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/585/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/585/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/585/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/585/console

This message is automatically generated., There are no new tests since this patch removes code. The javadoc warning is an unrelated warning due to sun.security.krb5.* imports (from HADOOP-6526 and HADOOP-6603?) - is anyone looking at this?, This revert-patch looks good to me, +1, I've committed this., This broke compilation of mapreduce trunk., Raised MAPREDUCE-1885 in mapreduce project to fix the compilation issue because of this FileSystem api change., Tom/Dhruba,
I think this commit should be reverted. FileSystem.create() is a public api and hence cannot be removed like this. Ideally it should be deprecated. Do you agree?, hi amar, this API never made it to any "release" of Hadoop. Better to remove it now than to ship a release with a bad API., Ravi, I missed that this affected MapReduce: sorry about that! Thanks for opening an issue, and creating a patch to fix MapReduce trunk.

Amar, This reverts an unreleased API, so we don't need to deprecate it. In fact, the API was broken in some cases (HDFS-609) so we shouldn't release it., Integrated in Hadoop-Common-trunk #374 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Common-trunk/374/])
    HADOOP-6826.  Revert FileSystem create method that takes CreateFlags.
, Integrated in Hadoop-Mapreduce-trunk-Commit #523 (See [https://hudson.apache.org/hudson/job/Hadoop-Mapreduce-trunk-Commit/523/])
    ]