[Attaching patch. This also addresses HADOOP-2946 and HADOOP-2949.

 - When external host is not specified or set to False in either gridservice-mapred or hdfs sections and if any of tracker_port/info_port/fs_port is *missing*, HOD no longer complains. Earlier, it used to fail saying "tracker_port/info_port/fs_port are not defined", even though they are not used at all.
 - When external host is not specified or set to False in either gridservice-mapred or hdfs sections and any of tracker_port/info_port/fs_port or _host_ is *invalid*, HOD no longer complains. Earlier, it used to fail saying invalid tracker_port/info_port/fs_port or _host_ is specified , even though they are not used at all.

HADOOP-2946:
 - Currently HOD client side *does not* check for the pkgs directory in gridservice-hdfs. But it *is* needed to be checked on the ringmaster where it *is* going to be used, irrespective of whether the external option is specified or not.. So, no fix needed for HADOOP-2946, leaving it as invalid.

HADOOP-2949:
 - If tarball is specified, HOD no longer validates for the pkgs directory in gridservice-hdfs or mapred sections as these are not going to be used anyway. Earlier, it used to validate and fail with error code 6 (Ringmaster failure)., The patch does not work. It throws a KeyError in bin/ringmaster if no tarball is specified, because we are assuming it will be available in the patched code.
, Reattaching patch, fixing the above issue., New patch handles the hostname and port related problems well.

However, there are two issues with the patch for the ringmaster:
- Consider a scenario where gridservice-hdfs is external. If the ringmaster node does not contain a valid pkgs option in the gridservice-hdfs section and no tarball is used, the current code will fail. It need not. Because the ringmaster code never uses the gridservice-hdfs.pkgs option. It only uses the gridservice-mapred.pkgs option. This is what was intended in HADOOP-2946. 
- If tarball is not specified and gridservice-mapred has an invalid location, the failure is not recorded in the log file. This is a regression.

Other than above two, I think the rest is fine., {quote}
     Consider a scenario where gridservice-hdfs is external. If the ringmaster node does not contain a valid pkgs option in the gridservice-hdfs section and no tarball is used, the current code will fail. It need not.
{quote}

Fixed this.

bq.  If tarball is not specified and gridservice-mapred has an invalid location, the failure is not recorded in the log file. This is a regression.

Checked that this is not a regression.

Reattaching patch fixing the first issue., Looks like both issues are addressed. Looking at the code.

+1 for the patch., Resubmitting to see if Hudson picks it up now., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12383019/HADOOP-2961.2
  against trunk revision 661918.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2531/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2531/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2531/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2531/console

This message is automatically generated., I just committed this. Thanks, Vinod!]