[The problem was that read() return data even if gotEOS for datanode connection is already set because there could be data left in FSInputChecker buffer (upto 512 bytes). The attached patch sends checksum only when 'gotEOS' changes from false to true.

I will attach a trunk patch that removes the debug log.
, patch for trunk is attached., Hi Raghu, is it possible to set gotEOS to be true only once?, > Hi Raghu, is it possible to set gotEOS to be true only once? 
yes. it is set to true only once in {{readChunk()}}, and readChunk() return -1 if it is called again., OK I see. Now I understand the code better. The problem was caused by the data buffering. The confusing part is that gotEOS represents the end of "raw" stream not the block stream.

+1., Thanks Hairong.
Here is test-patch output :
{noformat}
     [exec] -1 overall.  

     [exec]     +1 @author.  The patch does not contain any @author tags.

     [exec]     -1 tests included.  The patch doesn't appear to include any new or modified tests.
     [exec]                         Please justify why no tests are needed for this patch.

     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.

     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs warnings.

     [exec]     +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

{noformat}

This functionality is already covered TestDataBlockScanner.
, I just committed this., Integrated in Hadoop-trunk #646 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/646/])
    . DFSClient should invoke checksumOk only once. (Raghu Angadi)
, Is this supposed to have fixed HADOOP-4562?, Yes. I will close HADOOP-4562., Since HADOOP-3914 is committed to 0.18, I think this should go into 18 as well.
, patch for 0.18., +1 on the 0.18 patch., Just committed to 0.18.3., Integrated in Hadoop-trunk #653 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/653/])
    new section for 0.18.3. and  is moved to 0.18.3
]