[Fixed Text to use ThreadLocal encoders/decoders., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12387218/HADOOP-3863_0_20080730.patch
  against trunk revision 680823.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2985/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2985/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2985/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2985/console

This message is automatically generated., This looks good, but I'd suggest renaming to be {DE,EN}CODER_FACTORY to make it clear that each thread will get a different one., Renamed the variable, same patch., The test failure (org.apache.hadoop.hdfs.TestFileAppend2.testComplexAppend) is unrelated., I filed HADOOP-3874 to address this.  (We should file bugs whenever unrelated tests fail, no?), > The test failure (org.apache.hadoop.hdfs.TestFileAppend2.testComplexAppend) is unrelated. 

I am not sure whether it is unrelated since this patch changes a core class and this is the first time that TestFileAppend2.testComplexAppend fails.  TestFileAppend2.testComplexAppend create a number of threads appending files concurrently.  It seems to me that it might be related.  Could we try Hudson one more time?, I just committed this. Thanks, Arun!, According to CharsetDecoder javadoc http://java.sun.com/javase/6/docs/api/java/nio/charset/CharsetDecoder.html, there is a specific sequence of *decoding operations*.  In particular, we should call reset() before using the decoder.  It seems we are not following it., Fair point, Doug - taken; although it seems TestFileAppend2 works consistently on my machine.

Nicholas - we are are using http://java.sun.com/javase/6/docs/api/java/nio/charset/CharsetDecoder.html#decode(java.nio.ByteBuffer) which does the whole 'decoding' operation, ditto for encoding., > Nicholas - we are are using http://java.sun.com/javase/6/docs/api/java/nio/charset/CharsetDecoder.html#decode(java.nio.ByteBuffer) which does the whole 'decoding' operation, ditto for encoding.

Thanks Arun, I missed this.

BTW, TestFileAppend2 also works consistently in my Windows and Linux machines.
, Integrated in Hadoop-trunk #581 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/581/])]