[Many people have been testing and possibly running with java7 so I think its safe to say its supported.  As you say we should update the docs and  as Eli mentioned in one of the email threads create a jenkins build to run with java7., Testing yes, but aren't many tests failing?, I personally haven't run them recently.  Probably.  We had most cleaned up at one point but some probably broke again - thats why we need jenkins with it., Oracle's last security update was on 04-03-2013 and did include a patch for Java 6. It's not clear that the next one will.

Alternatively, RedHat has stated that they'll keep maintaining OpenJDK 6 - does Hadoop work on OpenJDK-6's JRE?

In general, any update on this?, This is becoming more of an issue. If I'm reading this correctly, this means that Java 6 installs currently have known security issues that will never be fixed:

http://blog.trendmicro.com/java-security-situation-quietly-got-much-worse/?sf17098354=1, We (Cloudera) have been running all of the Hadoop tests and more on Java 7 for some time, and to my knowledge have found no actual issues. A fair number of test failures, but all of those have been spurious, and we've been working through fixing them as we find them., @Kevin: the security issues are all related to sandbox-breaches in the Java browser plugins. What oracle mean is "they will no longer issue monthly or emergency patches for the latest set of 0-day exploits being seen in the field"

# this is not relevant to server-side Java at all
# everyone should always turn off the java browser plugin, because the oracle patches trail the exploits by 0-31 days.

This doesn't mean that anyone wants to stay with Java6, only that Hadoop places load on the JVMs in a way that almost nothing before has done, and that can find and break a JVM in odd ways -which is also why everyone is keen to point out the specific java versions used.

A lot of people are using it on Java7, openjdk7, and we should update the docs for hadoop 2.1 to say that, Obsolete. 1.7 is mentioned on the wiki page.]