[This was being developed as part of MAPREDUCE-1018. Following the split of the documentation files in MAPREDUCE-1404, the cluster_setup guide moved to the Hadoop common project. Hence that part of the patch in MAPREDUCE-1018 needs to move as well., The attached patch moves the changes to cluster_setup.xml that were being tracked in MAPREDUCE-1018 over to this JIRA. It also makes necessary adjustments to external links., Marking as blocker for 0.21, so changes can go in along with MAPREDUCE-1018. Both of these are necessary for users to make sense of the memory related options Hadoop offers., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12446883/HADOOP-6821.patch
  against trunk revision 953517.

    +1 @author.  The patch does not contain any @author tags.

    +0 tests included.  The patch appears to be a documentation patch that doesn't require tests.

    -1 javadoc.  The javadoc tool appears to have generated 1 warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/579/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/579/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/579/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/579/console

This message is automatically generated., +1, The javadoc warnings are related to Sun's security packages being imported and are unrelated to this patch., +1 for the patch from my side too. Hemanth/Tom, please commit this to common project., I've just committed this. Thanks Hemanth!, Integrated in Hadoop-Common-trunk-Commit #309 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Common-trunk-Commit/309/])
    HADOOP-6821.  Document changes to memory monitoring.  Contributed by Hemanth Yamijala.
, Integrated in Hadoop-Common-trunk #367 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Common-trunk/367/])
    HADOOP-6821.  Document changes to memory monitoring.  Contributed by Hemanth Yamijala.
]