[The DFSClient uses a random number generator to generate the name of the temporary file where the latest block of the file-being-written-to is cached. The above problem could theoretically occur if two instances of DFSClient gets the same value from the random number generator at around the same time.

I am suspecting that "enabling speculative execution" somehow results in more number of concurrent tasks on the same node and this increase the probability of same tmp file being used concurrently by multiple tasks. Hence we see this problem more often when speculative-execution is switched on.

An alternative is to use File.createTempFile. This method will fail if the file already exists, otherwise it will be created atomically.
, Use File.createTempFile() to generate the name of the backup file., +1, -1, build or testing failed

2 attempts failed to build and test the latest attachment http://issues.apache.org/jira/secure/attachment/12358649/tempBakcupFile.patch against trunk revision r543607.

Test results:   http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/231/testReport/
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/231/console

Please note that this message is automatically generated and may represent a problem with the automation system and not the patch., +1

http://issues.apache.org/jira/secure/attachment/12358649/tempBakcupFile.patch applied and successfully tested against trunk revision r543622.

Test results:   http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/233/testReport/
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/233/console, This patch conflicts with HADOOP-1372. This patch should use the LocalDirAllocator to avoid the conflict with HADOOP-1372, and perhaps the LocalDirAllocator should be extended to provide an equivalent of the File.createTempFile method (mainly because createTempFile guarantees atomicity in the file name)., I would still like this one to be applied first. HADOOP-1372 is not yet ready for submission. I would apply your comments to HADOOP-1372.

, +1

http://issues.apache.org/jira/secure/attachment/12358649/tempBakcupFile.patch applied and successfully tested against trunk revision r543622.

Test results:   http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/237/testReport/
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/237/console, +1 (considering the last comment from Dhruba)., I've just committed this. Thanks Dhruba!, Integrated in Hadoop-Nightly #121 (See [http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Nightly/121/]), This is a possible candidate for any patch release on 0.13, Here is a patch for this problem for the 0.13 release (if anybody needs it).]