[Attaching a preliminary patch for review. 

1. To simplify the code, I chose the simple use model of a cluster-wide property that either you use encryption for all your RPC connections or not. There is no support for selective encryption on a per-connection basis. 

2. Removed splitKerberosName() method and use KerberosName class instead

3. re-factored createSaslServer methods from Server to SaslRpcServer to have better encapsulation of SASL_PROS.

4. SASL_PROS is set according to the conf used to call UGI.setConfiguration(conf). Otherwise, it defaults to no-encryption. Anyone sees any problem here?
, an updated patch for current trunk, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12453821/c6902-04.patch
  against trunk revision 1036130.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    -1 javadoc.  The javadoc tool appears to have generated 1 warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

    +1 system test framework.  The patch passed system test framework compile.

Test results: https://hudson.apache.org/hudson/job/PreCommit-HADOOP-Build/108//testReport/
Findbugs warnings: https://hudson.apache.org/hudson/job/PreCommit-HADOOP-Build/108//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://hudson.apache.org/hudson/job/PreCommit-HADOOP-Build/108//console

This message is automatically generated., I put a few comments here:
https://reviews.apache.org/r/270/, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12453821/c6902-04.patch
  against trunk revision 1071364.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    -1 patch.  The patch command could not apply the patch.

Console output: https://hudson.apache.org/hudson/job/PreCommit-HADOOP-Build/264//console

This message is automatically generated., Canceling the patch as it is over a year old.]