[So I'm OOTO on a crappy windows laptop right now and am having a lot of trouble running tests.  I also am not really sure what the patch submission process is (first submission for me).  Can someone help me through this or alternatively just pick up for me at this point?  This patch definitely needs review and may need a couple tweaks, but it's moving the codebase in the right direction., Hi Michael! Thanks a lot for your contribution. Please read through https://wiki.apache.org/hadoop/HowToContribute . Would you please be able to write unit tests to demonstrate problems in the existing code, and to prove that your patch fixes them?
, Yeah I'd love to.  I'm not convinced I can write anything that's 100% foolproof though because the bug is occasional livelock in an area of the code with weak concurrency semantics.  Do you have any experience with unit testing for livelock?  If not, that's fine, I'll put something together that at least demonstrates the problem., Wrote a test for it, but as I mentioned I'm OOTO and on a windows laptop right now, so basically nothing works (can't even run tests because nothing works on windows).  I could table this for the week until I'm back to a linux machine or someone else could try applying this and seeing if it works properly.  It's a pretty serious bug IMO (though it's been around forever basically), so I feel like it should get prioritized relatively high for getting into the next release., bq. At best, this leads to potentially expensive wasted work. At worst, as is the case for Spark, it can lead to deadlocks/livelocks, especially when the same configuration object is passed into both calls.
Can you describe this more and how the current code causes this?

IAC, the patch doesn't apply anymore, needs to fix code-formatting, and more testing etc.

Given this is still in progress, I'd move this out into 2.7.3 as I am considering a 2.7.2 RC this weekend. Let me know if you have comments/concerns etc. Thanks., [~mharris], please see my comment above.

Moving it out of 2.7.2 per my comment above., [~vinodkv] yep no problems here.  This has shifted off of me on my side of the world and has also reduced in priority as we've bandaided over it by using coarser grained synchronization at a higher level of our stack.  Still should get fixed here, but it's not critical for us anymore.  Thanks!, As Michael mentioned, reduced the priority and removed the target version.]