[this is a bug introduced by my patch to HADOOP-771.  I will fix it as soon as possible., attaching patch for this. I havent added a unit test. Will add shortly.. mukund can you try with this patch?, this patch gets rid of an unnecessary exception thrown by delete., this patch includes a test... and remves windows lien delimiters in the file also... 

, - I think it is better to change FilterFileSystem.delete(Path f) (or even FileSystem.delete(Path f)) to make it calling FilterFileSystem.delete(f, true), instead of changing ChecksumFileSystem.delete(Path f)

- In ChecksumFileSystem.delete(Path f, boolean recursive), if f is a directory, it calls fs.delete(f, recursive).  I think the checksum files won't be deleted.

- We need a test for deleting a tree for testing the recursive parameter.

- In RawInMemoryFileSystem.delete(Path f, boolean recursive), the recursive parameter is ignored., -  makes sense for fileter filesystem to have it ... 

- this would work in our case since checkssum is in the same dir and file..
- ill add a test case
- raw in memory does not have an idea of directories .., here is a patch with nicholas's comments incorporated.

, +1, +1 overall.  Here are the results of testing the latest attachment 
http://issues.apache.org/jira/secure/attachment/12378157/HADOOP_3025_4.patch
against trunk revision 619744.

    @author +1.  The patch does not contain any @author tags.

    tests included +1.  The patch appears to include 4 new or modified tests.

    javadoc +1.  The javadoc tool did not generate any warning messages.

    javac +1.  The applied patch does not generate any new javac compiler warnings.

    release audit +1.  The applied patch does not generate any new release audit warnings.

    findbugs +1.  The patch does not introduce any new Findbugs warnings.

    core tests +1.  The patch passed core unit tests.

    contrib tests +1.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1993/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1993/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1993/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1993/console

This message is automatically generated., I just committed this. Thanks Mahadev!, Integrated in Hadoop-trunk #435 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/435/])]