[Unit test to demonstrate HADOOP-4975., I believe the test above fails because in Parser.java [line: 313] calls Parser.getConf() to create a copy of the JobConf. Parser.getConf() which in turn uses the JobConf(JobConf) [JobConf.java line:138] constructor to create a copied instance. I think problem is that that particular JobConf constructor doesn't copy the reference to the classLoader to the new JobConf instance.

Should the JobConf/Configuration constructor copy the classLoader reference, or should it be set in Parser.getConf()?, I've attached the one line change that fixes this problem for me and allows the test case previously submitted pass - I made the change to the Parser class, but I think the question is still open about whether the change should go into the Configuration(Configuration) constructor., The fix looks good.

Would you mind combining your proposed fix and the unit test into a single patch, per the contribution [guidelines|http://wiki.apache.org/hadoop/HowToContribute] (per said guidelines, please replace tabs with two spaces)?, Combined unit test and fix in a single patch and fixed formatting as requested., {noformat}
     [exec] +1 overall.  
     [exec] 
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec] 
     [exec]     +1 tests included.  The patch appears to include 3 new or modified tests.
     [exec] 
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec] 
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec] 
     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs warnings.
     [exec] 
     [exec]     +1 Eclipse classpath. The patch retains Eclipse classpath integrity.
{noformat}, I committed this. Thanks, Jingkei, Is it possible to get this patch into the 20.0 release?, bq. I made the change to the Parser class, but I think the question is still open about whether the change should go into the Configuration(Configuration) constructor.
Yes. I figured out that the solution is to move the changes to Configuration(Configuration), when I'm trying to change join package to use new api. Raised HADOOP-6103 for the Configuration changes.]