[Following are some of the ways this issue can be addressed 
1) Fix {{JobTracker.getParent()}} to return {{null}} in case {{null}} is passed. This means that the scheduler will select nothing for the _not-yet-resolved_ trackers. The only problem is we are wasting task-tracker's processing cycles.
2) Throw a IOException with appropriate message like {{"Not Yet Found"}}. Here (1) seems like a better option and also we are wasting the cycles.
3) Define a new action for the task tracker like {{RETRY}} where the task tracker waits for some time before resending its old heartbeat. 
4) Randomly give some task rather than wasting cycles.
More? Thoughts? Comments?, I'd go with an option where the tasktracker returns empty-handed. This will keep things simple at the cost of wasting very few cycles while the JobTracker is resolving the tasktracker., Here a patch for review. This patch solves the problem at hand. The expected behaviour in such a case (as per HADOOP-2119) is to schedule any (random) task to such a tracker. I am testing the patch., Submitting ..., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12384265/HADOOP-3590.patch
  against trunk revision 669479.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2696/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2696/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2696/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2696/console

This message is automatically generated., I dont think this requires a test case. , I just committed this. Thanks, Amar!, Integrated in Hadoop-trunk #524 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/524/])]