[
DFS client uses {{LocalDirAllocator.createTmpFileWrite()}}

{{LocalDirAllocator}} explicitly states that it does not check for write permissions. I think it should try different directory when create on one dir fails (for whatever reason).

Also during initialization it ignores the error while trying to {{mkdirs(dir[i])}}., By simply reading the code, it seems that LocalDirAllocator does fail over to a different directory  when a tmp directory is not writable when allocating a new directory. But if the allocated directory becomes not writable while data is writing, dfs does not handle the error. 

Christian, could you please publish the failure stack trace? So I am able to pinpoint the error. Thanks., I ran several tests and found out that createFile failed in the case that one of the directories specified in dfs.client.buffer.dir does not exist and it is on a readonly disk. The uploaded patch fixes this problem. Christian, could you please help me check if the patch solves your reported problem? Thanks., This patch includes test cases., It looks good, except that you should always call them exist/mkdir in the other order:

if (fs.mkdir(path) || fs.exists(path)) { ... }

that way if the code is run in multiple threads, it never returns false.
, Thank you Owen for reviewing the patch. This new patch reflects his comment., -1 overall.  Here are the results of testing the latest attachment 
http://issues.apache.org/jira/secure/attachment/12367402/localDirAllocator2.patch
against trunk revision r583309.

    @author +1.  The patch does not contain any @author tags.

    javadoc +1.  The javadoc tool did not generate any warning messages.

    javac +1.  The applied patch does not generate any new compiler warnings.

    findbugs +1.  The patch does not introduce any new Findbugs warnings.

    core tests +1.  The patch passed core unit tests.

    contrib tests -1.  The patch failed contrib unit tests.

Test results: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/912/testReport/
Findbugs warnings: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/912/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/912/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/912/console

This message is automatically generated., I just committed this. Thanks Hairong!, Integrated in Hadoop-Nightly #267 (See [http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Nightly/267/])]