[Mark as blocker, need mapreduce metrics for performance analysis., Looks like HADOOP-544 removed a cast from long to float by pure oversight..., Same patch, fixed the filename... *smile*, The patch works!  Thank you Arun. :), -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12386772/HADOOP-3521_0_20080723.patch
  against trunk revision 679286.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2937/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2937/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2937/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2937/console

This message is automatically generated., -1 on this patch until there is a unit test., Nigel, this is really hard to write a unit test since it depends on a particular implementation of AbstractMetricsContext. 
I propose we put this in for now (0.18.0) since it's a regression and remove it in a later version via a separate jira... thoughts?, ok.  +1.

, I just committed this.

I've opened HADOOP-3826 to revert this in a future release., Integrated in Hadoop-trunk #581 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/581/])]