[The current behaviour is that the Path class (which reperesents the file) tries to get the filesystem from it's own uri. If there is no scheme (e.g "test.seq") in the uri it looks for the filesystem in the conf/hadoop-site setting. One way is to trace all the test programs and locate usage of Path and make changes wherever necessary. Another way is to change Path itself to accommodate a feature to mention if the file is local. like Path(String pathstring, boolean isLocal).. so the path can simply do a if isLocal return FileSystem.getLocalFS(). 
Please comment. , Changed TestSequenceFile to create file (instance of Path) with the current file system uri. , -1, because the patch command could not apply the latest attachment (http://issues.apache.org/jira/secure/attachment/12351320/TestSeqFile.patch) as a patch to trunk revision r507276. Please note that this message is automatically generated and may represent a problem with the automation system and not the patch., Changed only the TestSequenceFile program as the other test programs run just fine. This particular program, for large record counts, asks the file (Path) for it's fs which is where the error lies.. hence made the change only here. , The corrected patch., +1, because http://issues.apache.org/jira/secure/attachment/12351328/TestSeqfile.patch applied and successfully tested against trunk revision r508345., The -local option is mostly obsolete, now that filesystems can be specified in paths., Remove -local command-line parameter and determine FileSystem from the path URI given on the command line., I've attached what I think is an improved patch.  Does this work for you?, Removing the  "-local" option means we'd have to mention the fs in either the file name (file:///[absolute-path]/test.seq) or in conf/hadoop-site.xml fs.default.name. If we'r ok with this.. we have no use for -local. , There are other test programs that use -local viz. TestArrayFile and TestSetFile. Making similar changes to these., This patch has changes made to all test programs that use "-local", including Doug's changes to TestSequenceFile. Thanks for your inputs., I just committed this.  Thanks, Gautam!]