[I hope the forrest document will subsum http://wiki.apache.org/hadoop/DevelopmentCommandLineOptions so that the very out-of-date wiki page can be removed., since I am not an expert on all the other dfs options of upgrade finalize and others options, i can try to fill in but let others fill it with more information. But sure thing this would be the most useful thing that dfs would have :)... , first version of the forrest document for dfs shell. suggestions are welcome... , an updated forrest doc... thanks rob for the review and changes!, trying hudson!, -1 overall.  Here are the results of testing the latest attachment 
http://issues.apache.org/jira/secure/attachment/12377314/Hadoop_2908_2.patch
against trunk revision 619744.

    @author +1.  The patch does not contain any @author tags.

    tests included -1.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    javadoc +1.  The javadoc tool did not generate any warning messages.

    javac +1.  The applied patch does not generate any new javac compiler warnings.

    release audit +1.  The applied patch does not generate any new release audit warnings.

    findbugs +1.  The patch does not introduce any new Findbugs warnings.

    core tests +1.  The patch passed core unit tests.

    contrib tests +1.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1953/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1953/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1953/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1953/console

This message is automatically generated., I just committed this. Thanks Mahadev!, atatching html and pdf files., attaching pdf file, Integrated in Hadoop-trunk #428 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/428/])]