[This fixes the compile error, but not the lack of unit tests (HADOOP-1807), +1

http://issues.apache.org/jira/secure/attachment/12364742/1806.patch applied and successfully tested against trunk revision r570633.

Test results:   http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/642/testReport/
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/642/console, Maybe we should include the target ant-tasks in target package?, That's a good idea; added "ant-tasks" dependency on "package" target., Shouldn't we also make the "compile" task depend on "compile-ant-tasks"?, Hmm... it's inexpensive to build, but it's rarely necessary, particularly for developers. The current patch is sufficient to catch compile errors before commit; until the antlib has unit tests, the only time someone would actually build it is if they have a particular use for it. Even then they'd only rebuild it to accommodate incompatible API changes. Either way, it accounts for a second or two during builds so whatever., The "compile" target should compile all the code it can, no?  It's the default target.  It seems strange to me to use the "package" target in order to get compilation errors.  If folks only want to compile a subset of things, then they can use the "compile-core", etc. targets., *nod* Soright, +1

http://issues.apache.org/jira/secure/attachment/12364795/1806-2.patch applied and successfully tested against trunk revision r570937.

Test results:   http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/649/testReport/
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/649/console, I've been told that this patch doesn't restore the original behavior; I'm pulling it back for now., OK. This should do the trick., -1, build or testing failed

2 attempts failed to build and test the latest attachment http://issues.apache.org/jira/secure/attachment/12364804/1806-3.patch against trunk revision r570983.

Test results:   http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/651/testReport/
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/651/console

Please note that this message is automatically generated and may represent a problem with the automation system and not the patch., +1

http://issues.apache.org/jira/secure/attachment/12364804/1806-3.patch applied and successfully tested against trunk revision r571256.

Test results:   http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/657/testReport/
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/657/console, Compile dependency compile-ant-tasks, package dependency ant-tasks seems reasonable. +1 for me. , I just committed this.  Thanks, Chris!]