[Actually there are many other configure tools involved besides automake. From my /usr/local/ here are a set of working versions:

https://gist.github.com/3079069

and this is a corresponding set of failing versions from my /usr/:

https://gist.github.com/3079113, libtool is supposed to only work with 'bash' as its header defines:
{code}
#! /bin/bash
{code}

In Hadoop build.xml, we use 'sh' to execute 'libtool'. On many systems, 'sh' is linked to 'bash'. On Ubuntu, 'sh' is linked to 'dash'. Using 'dash' to run 'libtool' results this build error. The patch modifies build.xml to involve 'bash' directly., libtool already references bash, so it can be used as exec, and no need to worry about the shell., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12535942/HADOOP-8580-branch-1.patch
  against trunk revision .

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-HADOOP-Build/1235//console

This message is automatically generated., slightly different patch: exec libtool directly., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12538528/hadoop-8580-branch-1.gs.patch
  against trunk revision .

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-HADOOP-Build/1236//console

This message is automatically generated., Gera, I think this is a 1.0 problem. "Submit patch" is only used for trunk., Chuan, I would like to clarify whether you request a patch for the trunk., No. I just want to point out this problem does not affect trunk because trunk has moved to use Maven. "Submit patch" triggered Hadoop QA to apply the patch to trunk, and hence all the -1's., +1 (non-committer) for the second patch.

Applying this patch allowed me to build native on Ubuntu 12.04. The workaround I had been using was to symlink /bin/sh to /bin/bash., +1 as non-committer as well., patch looks good, verified on ubuntu and centos. +1, I committed the patch to branch-1.

Thank you Gera for the patch., Closed upon release of Hadoop 1.2.0.]