[Below is the output of bin/hadoop balancer
{noformat}
Balancing took x milliseconds
09/03/17 05:38:37 ERROR balancer.Balancer: java.lang.NullPointerException
        at org.apache.hadoop.net.NetUtils.createSocketAddr(NetUtils.java:134)
        at org.apache.hadoop.net.NetUtils.createSocketAddr(NetUtils.java:123)
        at org.apache.hadoop.hdfs.server.datanode.DataNode.createSocketAddr(DataNode.java:152)
        at org.apache.hadoop.hdfs.server.balancer.Balancer.createNamenode(Balancer.java:849)
        at org.apache.hadoop.hdfs.server.balancer.Balancer.init(Balancer.java:840)
        at org.apache.hadoop.hdfs.server.balancer.Balancer.run(Balancer.java:1418)
        at org.apache.hadoop.util.ToolRunner.run(ToolRunner.java:65)
        at org.apache.hadoop.hdfs.server.balancer.Balancer.main(Balancer.java:791)
{noformat}

Also when balancer is run with invalid threshold value such as  bin/hadoop balancer -threshold -1, it throws the usage message and also displays the time taken to balance. This is a regression. Only a usage message is expected.
{noformat}
Expect a double parameter in the range of [0, 100]: -1
Usage: java Balancer
          [-threshold <threshold>]      percentage of disk capacity
Balancing took x milliseconds
{noformat}
, what was the value that you set for fs.default.name?, This error can occur when you set "fs.default.name" as file:/// or hdfs:///. If you specify the namenode address correctly, this error won't occur., bq. what was the value that you set for fs.default.name?
hdfs://<hostname>:<port no>, I am not able to reproduce the NullPointerException if fs.default.name is set to be hdfs://<hostname>:<port no>. Please provide more information how to reproduce this. Could you please add a printf statement to see what's the value of target that's passed to NetUtils.createSocketAddr? Thanks., Hairong, regardless of fs.default.name, an NPE exposed on the command line has *got* to be the wrong action., This is not unique to Balancer. The same piece of code is used in DataNode, Secondary Name etc, whoever needs to connect to NameNode., Nigel, I am not saying that throwing NullPointerException at the command line is not a bug. But what I am trying to figure out is if this is a blocker to 0.20. The answer is no if the error was introduced by a wrong setup/configuration., The fs.default.name  property should be mentioned in core-site.xml and not in hdfs-site.xml. If it is mentioned there, then this nullPointer exception wont occur.

Since balancer balances the namenode, it looks for namenode information under core-site.xml. if it is not able to find it it gives NullPointer Exception. 

I tested to make sure of this., bq. The fs.default.name property should be mentioned in core-site.xml and not in hdfs-site.xml. If it is mentioned there, then this nullPointer exception wont occur.
Correct. Verified it. The test environment had the fs.default.name in hdfs-site.xml and not in core-site.xml. Hence closing the issue. 
Thanks Iyappan.]