[It is better to remove DatanodeDescriptors from the fsimage and store only that much information that is required to generate a new storageid for new datanodes., 
Currently NameNode does not need storage ids across restarts (we think. let me know otherwise). Based on this, proposal is to not to store *any* datanode information in the fsimage. When namenode restarts, it just generates a new storage id for each datanode that registers. Rest of the storageid/datanode behavior remains the same as now.

For webUI, proposals in the description are fine.
, There are two related issues here :
 # Datanodes displayed in webui and "dfs -report"
 # Policy regd storing all the known storage ids and datanodes persistently in Namenode. 

I will file a different jira for the second one.
, 
new config {{dfs.report.datanode.timeout.hours}} is added.

A dead datanode is listed on webui or 'dfsadmin -report' if
 - the node is present in "dfs.hosts" file or
 - It is not listed in "dfs.hosts.exlude" and it has been inactive for less than "dfs.report.datanode.timeout.hours", The code looks good. A few comments:

1. FSnamesystem.getDatanodeListForReport excludes nodes that are listed in dfs.hosts.exclude. Maybe a better option wold be to show them with a status of "Excluded". Currently, it shows "Decommisioned" or "In Service".

2. The comment in FSnamesystem.getDatanodeListForReport talks about "dfs.report.datanode.timeout.day" but it should be "dfs.report.datanode.timeout.hours".

3. Maybe a unit test case that tests this functionality would be really nice. , New patch attached.

bq. 1. FSnamesystem.getDatanodeListForReport excludes nodes that are listed in dfs.hosts.exclude. Maybe a better option wold be to show them with a status of "Excluded". Currently, it shows "Decommisioned" or "In Service".

Currently there is no state shown for deadnodes. Note that this method looks at dfs.hosts.exclude only for datanodes that are considered dead.

bq. 2. The comment in FSnamesystem.getDatanodeListForReport talks about "dfs.report.datanode.timeout.day" but it should be "dfs.report.datanode.timeout.hours".

Done. Good catch. You actually read the comments!

bq. 3. Maybe a unit test case that tests this functionality would be really nice.
This is a very non-consequential functionality. It only affects Namenode front page and 'dfsadmin -report'. Let me know if we really need to add a unit test. I did test it. , +1. , Thanks Dhruba., -1, build or testing failed

2 attempts failed to build and test the latest attachment http://issues.apache.org/jira/secure/attachment/12365101/HADOOP-1138.patch against trunk revision r572826.

Test results:   http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/682/testReport/
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/682/console

Please note that this message is automatically generated and may represent a problem with the automation system and not the patch., 
Earlier patch did not show the nodes that were listed in exlude file (dfs.hosts.exlude). But this broke TestDecommission. The current patch treats these nodes just like the normal dead nodes., Also this will conflict with HADOOP-1838, if it is committed earlier., +1

http://issues.apache.org/jira/secure/attachment/12365214/HADOOP-1138.patch applied and successfully tested against trunk revision r573081.

Test results:   http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/693/testReport/
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/693/console, This is not considered necessary after HADOOP-1762., I think that if the includes list or the excludes list is present, these nodes should always show up in the UI. This allows the administrator to accurately know the state of his cluster.(  However, we do not need to automatically remove datanodes from the UI if they are dead for a certain period)., 
There is too much stuff in this jira. I filed a new one HADOOP-1933. Should nodes from both the lists be listed or only from include list... please comment in HADOOP-1933.
, HADOOP-1933 has follow-up discussions.]