[Proposed solution would be serialize the *blockSize* with *INode* in S3.
On the same lines while reading we can de-serialize accordingly.

But, this solution leads to backward compatibility problem., Looks S3 is getting the size directly from actual size of first block.

{code}
private static long findBlocksize(INode inode) {
      final Block[] ret = inode.getBlocks();
      return ret == null ? 0L : ret[0].getLength();
    }
{code}

 I too also think to serialize block size into INode as DFS. Lets see is there any specific reason do like this for S3 alone. Can someone clarify who involved initially in S3FileSystem implementations?

Here the problem is till the firstblock completes, we will not know exact blocksize if i am not wrong. Is this your issue?

Thanks
Uma
 , Attaching the patch for issue with corresponding source code and test code modifications.

The change doesn't breaks compatibility. The exisiting files can be read in same manner.
The patch adds one more field in the *INode* - *blockSize*.
Same is serialized and de-serialized as required., The fix is provided on trunk...., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12495024/HADOOP-7623.patch
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 8 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed unit tests in .

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-HADOOP-Build/200//testReport/
Console output: https://builds.apache.org/job/PreCommit-HADOOP-Build/200//console

This message is automatically generated., \\
\\
| (x) *{color:red}-1 overall{color}* |
\\
\\
|| Vote || Subsystem || Runtime || Comment ||
| {color:red}-1{color} | patch |   0m  0s | The patch command could not apply the patch during dryrun. |
\\
\\
|| Subsystem || Report/Notes ||
| Patch URL | http://issues.apache.org/jira/secure/attachment/12495024/HADOOP-7623.patch |
| Optional Tests | javadoc javac unit findbugs checkstyle |
| git revision | trunk / f1a152c |
| Console output | https://builds.apache.org/job/PreCommit-HADOOP-Build/6264/console |


This message was automatically generated.]