[Patch which addresses the issue. This is identical to the version that's in trunk, just at a different path.

To test this, I ran {{ant -Dtestcase=TestAuthenticationFilter test-core}} which passed successfully., Sorry, the previous patch was a back-port of the trunk patch post inclusion of HADOOP-7621. Since HADOOP-7621 isn't yet included in branch-0.20-security, that patch won't compile. (I had some changes staged for a HADOOP-7621 back-port, which is why it passed for me.)

What's attached now is {{o.a.h.security.TestAuthenticationFilter}} from trunk without the changes made by HADOOP-7621., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12495420/HADOOP-7666-branch-0.20-security.patch
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    -1 release audit.  The applied patch generated 1 release audit warnings (more than the trunk's current 0 warnings).

    +1 core tests.  The patch passed unit tests in .

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-HADOOP-Build/216//testReport/
Release audit warnings: https://builds.apache.org/job/PreCommit-HADOOP-Build/216//artifact/trunk/patchprocess/patchReleaseAuditProblems.txt
Console output: https://builds.apache.org/job/PreCommit-HADOOP-Build/216//console

This message is automatically generated., +1. Downloaded and read the revised backport, and test passes for me.

{code}
Testsuite: org.apache.hadoop.security.TestAuthenticationFilter
Tests run: 1, Failures: 0, Errors: 0, Time elapsed: 0.38 sec
------------- Standard Output ---------------
2011-09-22 00:05:53,303 WARN  conf.Configuration (Configuration.java:<clinit>(191)) - DEPRECATED: hadoop-site.xml found in the classpath. Usage of hadoop-site.xml is deprecated. Instead use core-site.xml, mapred-site.xml and hdfs-site.xml to override properties of core-default.xml, mapred-default.xml and hdfs-default.xml respectively
------------- ---------------- ---------------

Testcase: testConfiguration took 0.375 sec
{code}, Thanks a lot for the review, Harsh. I've just committed this., Closed upon release of Hadoop-1.1.0.]