[4704_20081120.java: obvious fix, The patch covered all the doc in .java files. But there are some more in forrest(listed below), do you want to fix them also?
1. conf/hadoop-default.xml : line- 1204
2. src/contrib/chukwa/docs/paper/chukwa_08.tex : line - 91
3. src/docs/src/documentation/content/xdocs/cluster_setup.xml: line -102
4. src/docs/src/documentation/content/xdocs/hdfs_permissions_guide.xml: line - 46 and 51
5. src/docs/src/documentation/content/xdocs/mapred_tutorial.xml: line - 1869
6. src/docs/src/documentation/content/xdocs/streaming.xml: line - 51, 55 and 295
7. src/mapred/org/apache/hadoop/mapred/lib/aggregate/package.html: line - 73
 
, > The patch covered all the doc in .java files. But there are some more in forrest(listed below), do you want to fix them also?

This patch only need to be committed to trunk.  We probably should fix the forrest doc and hadoop-default.xml in earlier versions like 0.19 and 0.18.  So let's do it in a separated issue.  Thanks for looking at this, Amareshwari!, In ResetableIterator:
{noformat}
  * This interface defines an iterator interface that will help the reducer class
  * for re-grouping the values in the values iterator of the reduce method
- * according the their source tags. Once the value re-grouped, the reducer can
+ * according the source tags. Once the value re-grouped, the reducer can
  * perform the cross product over the values in different groups.
{noformat}
The fix doesn't clarify much, here. The comment should probably read:
{noformat}
  * This defines an iterator interface that will help the reducer class
  * re-group its input by source tags. Once the values are re-grouped,
  * the reducer will receive the cross product of values from different groups.
{noformat}

In HarFileSystem:
{noformat}
-    // get the fs DataInputStream for the the underlying file
-    // look up the index.
+    // get the fs DataInputStream for the underlying file look up the index.
{noformat}
The two comments probably shouldn't be joined.

The rest looks good, 4704_20081125.patch: incorporated Chris' comments., +1 Looks good, {noformat}
     [exec] +1 overall.  

     [exec]     +1 @author.  The patch does not contain any @author tags.

     [exec]     +1 tests included.  The patch appears to include 13 new or modified tests.

     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.

     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs warnings.

     [exec]     +1 Eclipse classpath. The patch retains Eclipse classpath integrity.
{noformat}, The patch only changes javadoc.  No code change is introduced.

I just committed this., Integrated in Hadoop-trunk #672 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/672/])
    . Fix javadoc typos "the the". (szetszwo)
]