[This two line patch resolves the issue described in this JIRA. Please review for inclusion in future release. (PS. I'm sure I ticked license granted!), +1 for the fix.

Please attach the patch again, *with* license granted. (Hudson seems to miss your 'tick' :) ). Then, submit the patch and run it through Hudson.

, Re-attached patch and ticked the granted option.

C, -1 overall.  Here are the results of testing the latest attachment 
http://issues.apache.org/jira/secure/attachment/12377595/HOD_util_local_fqdn_AL_GRANTED.patch
against trunk revision 619744.

    @author +1.  The patch does not contain any @author tags.

    tests included -1.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    javadoc +1.  The javadoc tool did not generate any warning messages.

    javac +1.  The applied patch does not generate any new javac compiler warnings.

    release audit +1.  The applied patch does not generate any new release audit warnings.

    findbugs +1.  The patch does not introduce any new Findbugs warnings.

    core tests -1.  The patch failed core unit tests.

    contrib tests +1.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1944/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1944/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1944/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1944/console

This message is automatically generated.,  * No tests are included as there is no tests for HOD yet (see HADOOP-2775). Also, this patch is for related to a system configuration issue, not with a particular HOD setting.
 * The core tests failed are related to DFS and not this patch.

The patch is committable.,  * I see HADOOP2775 has landed. I still don't think there is a way to write a test for this patch, as it resolves an issue that is related to the DNS configuration of the machines HOD is running on (i.e. whether the machine knows it's FQDN).

Please consider committing.

C, Hi Chris, yes, this patch is on our list. We will be getting this committed along with some more small bug fixes we are doing. Thanks !, I just committed this. Thanks, Craig!, Integrated in Hadoop-trunk #443 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/443/])]