[The error message that Raghu pointed out is an expected output since one of the testcases tests moving an invalid block. By looking at the output, I am not able to identify what caused the timeout and I am not able reproduce it on my machine. The attached patch fixed a known bug in name node that may cause an infinite loop when removing an excessive replica. I also added some logging message to help pinpoint the cause of the error if the timeout occures again., There is modification to Server.java in the patch. Not sure if it was intended to be part of the patch.
, This adds multiple LOG.debug() in FSNamesystem in the common methods (excuted all the time).. Are these necessary? Note that LOG.debug() incurs quite a bit of overhead (function calls, string constructions, ...)., Yes, Raghu's comments make sense. This patch removed all debug statements. 

The change in Sever.java is done while I was trying to pinpoint a bug in removeExcessiveReplica. This is the only place that can print the stack trace of the error in namenode. It is small but, I think, a good change. Can I leave it in this patch?, This patch removes the change to the rpc server., +1. thanks Hairong.
My understanding around the fix in Namenode is not very good. The fix looks simple enough :)
, -1 overall.  Here are the results of testing the latest attachment 
http://issues.apache.org/jira/secure/attachment/12370491/blockReplacement2.patch
against trunk revision r599389.

    @author +1.  The patch does not contain any @author tags.

    javadoc +1.  The javadoc tool did not generate any warning messages.

    javac +1.  The applied patch does not generate any new compiler warnings.

    findbugs -1.  The patch appears to cause Findbugs to fail.

    core tests -1.  The patch failed core unit tests.

    contrib tests -1.  The patch failed contrib unit tests.

Test results: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/1202/testReport/
Checkstyle results: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/1202/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/1202/console

This message is automatically generated., I just committed this. Thanks Hairong!, Dhruba, both findbugs and coretests also failed. , The trunk was broken for a short period of time today (because of some other patch). HadoopQA happened to run the test for this patch during this window. The build for this patch failed. Hence the failure in "core" and "findbugs" tests. I have run the unit tests and they ran to completion.


, Integrated in Hadoop-Nightly #318 (See [http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Nightly/318/])]