[HADOOP-3854 is committed 0.19.  So the affects version should be 0.19, Note that with HADOOP-4284 now committed, this bug can be caught in junit test by trying to access a non-existent file in either /logs or /static directories. In other words, whether the tested file exists or not doesn't matter., As pointed out in HADOOP-3854, all files under "/logs/" and "/static/" should be filtered.  So the bug can be fixed by correcting the path mapping., 4282_20081103.patch: filter all urls under "/logs/" and "/static/"., Your patch effectively changes the semantics of addFilter to that of addGlobalFilter in the current 0.20 trunk. I thought the reason to have addFilter method in the first place is to make filters added through this method filter some but not all requests (on the other hand, filters added through addGlobalFilter will filter all requests). How do you go about fixing the same bug in the 0.20 trunk? Make addFilter and addGlobalFilter equivalent?, > Your patch effectively changes the semantics of addFilter to that of addGlobalFilter in the current 0.20 trunk...

addFilter only filter user facing urls which are defined in HADOOP-3854.  For example, fsck servlet is not filtered as shown in the unit test.  Could you check the patch again?, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12393277/4282_20081103.patch
  against trunk revision 712344.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    -1 javadoc.  The javadoc tool appears to have generated 1 warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3555/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3555/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3555/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3555/console

This message is automatically generated., {noformat}
-        handler.addFilterPathMapping(ctx.getContextPath() + "/*", name,
-            Dispatcher.__ALL);
+        defineFilter(ctx, name, classname, parameters, ALL_URLS);
         LOG.info("Added filter " + name + " (class=" + classname
             + ") to context path " + ctx.getContextPath() + "/*");
{noformat}

The log message should probably use Arrays.toString(ALL_URLS) instead of "/*"; otherwise +1, 4282_20081110.patch: changed the log message., The javadoc warning was due to HADOOP-4621.  I am not resubmitting the new patch since there is only a log message change., 4282_20081110_0.19.patch: for 0.19, I just committed this.]