[Image files and Apache JSP Taglib 1.1

Instruction:

untar the tarball in trunk, and add files in src/contrib/chukwa/lib/jstl*, src/contrib/chukwa/src/web/hicc/images, src/contrib/chukwa/src/web/hicc/css/images, to SVN., Apply with patch -p0 < HADOOP-4709.patch in trunk., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12394722/HADOOP-4709.patch
  against trunk revision 721415.

    -1 @author.  The patch appears to contain 2 @author tags which the Hadoop community has agreed to not allow in code contributions.

    +1 tests included.  The patch appears to include 80 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3666/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3666/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3666/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3666/console

This message is automatically generated., Same as above patch and removed author tag., Remove author tag, Same patch with author tag removed., Does this drop include the other PA issues for Chukwa (HADOOP-4459, HADOOP-4434, and HADOOP-4529)?, Yes this drop includes patches from HADOOP 4459, 4434, and 4529., The current patch contains user name which should not be part of the patch., Same patch with user name and Yahoo specific partition names removed, Same patch with additional partition name and user name removed., Big code drops like this are a bad practice.  Rather you should be adding patches issue by issue.  Otherwise you're effectively not operating in public, and eliminate the opportunity for others to participate in the process.  Before we can add Chukwa committers, we need its contributors to demonstrate that they understand how to collaborate openly.  This patch is a step backwards., Unfortunately, Yahoo has been using an internal subversion repository for Chukwa. This patch is trying to sync the two repositories. Keeping the hidden repository is destructive to the community and needs to stop. I propose we let this patch in, but put Chukwa on probation and point out (as you have done) that this is *not* acceptable open source development practice., I just committed this. Thanks Jerome, Eric, Andy, and Ari, Integrated in Hadoop-trunk #680 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/680/])
    , Clarification:

I was going through the chukwa/build.xml 's package-hadoop target and found that we are trying to copy jsp-api.jar from the hadoop/lib dir but actually the jsp-api. jar resides in chukwa/lib directory. 

Can someone please clarify on this?

Also, let me know if this is a bug and if you want me to file a different bug?

Thanks,
Giri


, Giri,

Please file this as a different bug.  The original intention was to utilize the same library version when chukwa is built inside hadoop's contrib directory.  In this case, jsp-api.jar should be loaded from hadoop/lib/jsp-2.1/jsp-api-2.1.jar  The copy of jsp-api.jar was supplied for building chukwa in standalone mode.  This means, the build.xml file need to be changed to pick up jsp-api-*.jar from the proper location.

Thanks]