[bq. This is allowing non-secure JobClients to easily request and use DelegationTokens and cause unwanted errors to be printed in the JobTracker when the renewer attempts to run.
What is the error message?  Is it about the renewer being incorrect?  If so, this was resolved in trunk/2/23 via YARN-320.

bq. Ideally such clients ought to get an error if they request a DT in non-secure mode.
No, services are expected to return null to a token request if security isn't enabled.  The client is supposed to interpret this as no token is required.  This pattern is supposed to allow a client to operate against both a secure and insecure cluster., Thanks for taking a look Daryn. Yes the error exactly is:

{code}
ERROR org.apache.hadoop.security.UserGroupInformation: PriviledgedActionException as:mapred (auth:SIMPLE) cause:org.apache.hadoop.security.AccessControlException: Client mapred tries to renew a token with renewer specified as mr token
WARN org.apache.hadoop.security.token.Token: Cannot find class for token kind MAPREDUCE_DELEGATION_TOKEN
{code}

It is non-fatal, but appears at a high level of log, so is annoying/misleading. I'll take a look at YARN-320. Do you think this is also worth fixing for branch-1?

bq. No, services are expected to return null to a token request if security isn't enabled.

Thanks for clarifying this - I'm guessing they're currently receiving back a valid token though (at least on my MRv1 tests)., bq. ERROR org.apache.hadoop.security.UserGroupInformation: PriviledgedActionException as:mapred (auth:SIMPLE) cause:org.apache.hadoop.security.AccessControlException: Client mapred tries to renew a token with renewer specified as mr token

This is the issue I expected to see - which is resolved by YARN-320.  It's only an issue if security is enabled and a job needs to submit a sub-job more than 1d later.  Even though an insecure JT is issuing tokens, an insecure client won't send the token, and even if it does, the insecure JT tells the client to switch back to SIMPLE.

If you want to backport YARN-320, it shouldn't be too hard.  The suboptimal workaround for secure clusters is to increase the MR token's expiration to something like 1w so renewal isn't necessary.

bq. WARN org.apache.hadoop.security.token.Token: Cannot find class for token kind MAPREDUCE_DELEGATION_TOKEN

This is odd because it found the class to get the mismatched renewer error.  Maybe I'm misremembering the token types in 1.x., Not an issue on trunk/branch-2.]