[Here is a patch that adds the FileSystem as an argument to the constructor., Doug,
   This one seems to have dropped off your radar. The fix isn't mandatory any more, because we created a custom config for the junit tests. However, it still seems cleaner to use the provided FileSystem rather than fetching the default one., This looks good, although it makes an incompatible changes to a public APIs used by Nutch.  So we should probably continue to support the old method signatures too, or else make a co-ordinated change to Nutch., This patch also fixes the TextInputFormat and the framework's handling of the output path too. I will file a follow-up but to get deprecate the current FileSystem.get(Configuration) method and replace it like FileSystem.getDefault(Configuration). There are many place still left in the code where the default file system is gotten. However, with this patch, I was able to run map/reduce jobs (including a unit test) with the input and output going to non-default file systems. , +1

http://issues.apache.org/jira/secure/attachment/12359029/non-default-fs-input.patch applied and successfully tested against trunk revision r544740.

Test results:   http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/257/testReport/
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/257/console, Owen, this will break InputFormats and OutputFormats that use the FileSystem passed to getRecordReader() and getRecordWriter(), since null is now passed.  Is that intended?  Is it now an error to touch that parameter?  If so, we should at least provide some warning in the release notes, no?  It'd be nicer to have a new API and then deprecate this one..., *sigh*

I guess it is a bit too aggressive. The point of doing that is that any OutputFormats who use that FileSystem are broken in exactly the way fixed by this patch. Furthermore, the parameter has been named 'ignored' for many releases. (Only OutputFormats were given nulls, because InputFormats don't take a FileSystem. I think I removed the InputFormat FileSystem parameter a long time ago.), This patch no longer applies to trunk, and I still think we need to make it more back-compatible., Updated to trunk and continued passing in the default fs., Realized that one of the changes wasn't needed., Sorry for the lateness on this one. It had fallen off my radar as being bounced. We need this one., +1, I just committed this.]