[" Either the resource does not exist ". Do you think it could be a consistency failure? If the error message should included the path being listed, that could help for the test and for users, Could be a consistency issue.

Digging into why this line of code did not kick in to display the path: https://github.com/Azure/azure-data-lake-store-java/blob/2.1.4/src/main/java/com/microsoft/azure/datalake/store/ADLStoreClient.java#L527

[~ASikaria], could you please take a look? Might need to look thru ADLS backend logs., Sorry for the delay. 

Exception string message that getExceptionFromResponse takes is just a default error message in this case the server had a more specific error message it sent in the response, so the SDK used that string instead.

The good thing is that the trace ID is in the exception, so we can look at the logs to see if we can find anything. The bad thing is that these happened-once-and-cannot-repo-again errors are fiendishly hard to troubleshoot, so not sure how much we will glean from just logs alone.
, For liststatus to pass, user needs:
- X permission throughout the traversal path (in this case on account root)
- R-X on the final destination (in this case bobdir)

I couldn't find the mkdirs request for bobdir even a day ahead from the issue timestamp, and the directory is deleted since the issue too. 

Can you re-try starting from the directory creation with the necessary permissions set and update the JIRA as above with the exception and request timestamp.

(One thing that I observed in the account ACL status is that, the service prinicpal which is attempting this request - ADLSAccessApp@SPI [OID:a0c43012-fd2a-42a3-90e9-0649584176c0] - is given a RWX permission on account root for access acls alone and not on default acls. Hence if any other user creates a directory on account root, this service principal will not have any permission on this new directory.), Thanks [~snehav]!  {{bobdir}} probably didn't have the permission for this test case to pass. This test case expects a clean account.

Filed HADOOP-14304 so that the path will not be swallowed when a remote exception occurs.]