[The main thread holds the lock to UTF8#OBUF, which is a static field, and waits for the reply. The RPC client needs to acquire the lock to UTF8#OBUF in order to receive the response from the NameNode server. Therefore, deadlock occurs.

My first question is why use UTF8, which is a deprecated class in Hadoop? If Text is used instead, we won't get into this deadlock., This problem happens on vanilla cluster with the security off, However, the executed code belongs to the secured Hadoop. Thus, I'm changing the title of the JIRA., I propose that we make the OBUF in UTF8 a thread local variable to remove the locking on it., This file changes the locking structure by replacing the static OBUF field in UTF8 with a thread local., This patch is without the prefix., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12437775/c-6609.patch
  against trunk revision 918624.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/404/console

This message is automatically generated., +1, This is the patch for trunk., I have ran the job which used to timeout because of the deadlock a few times and it is running Ok now. All the data is being written properly and correctly.

Thanks for the fix, Owen.

+1 on the patch., And BTW: I have ran the full test suite to verify the patch - just one specific cluster test., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12437820/c-6609.patch
  against trunk revision 918624.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/407/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/407/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/407/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/407/console

This message is automatically generated., Changing synchronization is impossible to write a unit test for. *smile*

I just committed this., Integrated in Hadoop-Common-trunk-Commit #195 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Common-trunk-Commit/195/])
    . Fixed deadlock in RPC by replacing shared static 
DataOutputBuffer in the UTF8 class with a thread local variable. (omalley)
, Integrated in Hadoop-Common-trunk #266 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Common-trunk/266/])
    . Fixed deadlock in RPC by replacing shared static 
DataOutputBuffer in the UTF8 class with a thread local variable. (omalley)
]