[I plan to allow balancer to throw away blocks that was moved more than one and half hour ago. I will use two windows of moved blocks: current window and old window. When a block is added, it is always added to the current window. Between iterations, balancer tries to cleanup old moved blocks. It checks to see if the blocks in the old window is at least 1.5 hour old. If yes, it purges the old window and moves blocks in the current window to the old window., Here is a patch that implements the old blocks purge strategy., - Need to update lastCleanupTime in cleanup()
- The type of movedBlocks should be List<Map<Block, BalancerBlock>>, The patch incorporates Nicholas' review comments., +1, +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12401428/balancerOME1.patch
  against trunk revision 750237.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-minerva.apache.org/8/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-minerva.apache.org/8/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-minerva.apache.org/8/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-minerva.apache.org/8/console

This message is automatically generated., I've just committed this., Integrated in Hadoop-trunk #778 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/778/])
    ]