[Attaching a patch. This introduces a config parameter hod.log-rollover-count that takes the number of rolled-over logs that HOD client has to keep. It has to be a positive integer, defaults to 5. A zero value disables the roll-over and the log grows indefinitely (current behaviour). Rolled over logs have file-names of the form hod-%user.log.1, hod-%user.log.2 etc., One minor comment. Since the new config option is publicly visible in hod --help, it should be given a fixed small option in the help, like the other options. Currently, we are automatically assigning a free character to it, and it is always coming as -g, but this is not required, for e.g. if we add new options.

Otherwise +1 for the patch., New patch adding a short option -L for --hod.log-rollover-count., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12389551/HOD-LOG-ROTATION.1.txt
  against trunk revision 692335.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3185/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3185/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3185/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3185/console

This message is automatically generated., The core test failures are not related to HOD., I just committed this to trunk. Thanks, Vinod.

Can someone with access please commit this to the 0.18 branch also ? The revision number for trunk is 693705. I verified it merges cleanly., Integrated in Hadoop-trunk #600 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/600/]), Commit merged to branch-0.18., The change is backwards compatible. A value of zero for -L brings back the old behaviour.]