[Ack, I must have forgotten to actually add the client objects.

Instead of just removing this finalizer, how about having a shutdown hook that calls the closeAll method from HADOOP-1131? The DistributedFileSystem also needs a close method that calls the DFSClient.close., As hadoop may be used as a third party library, it shouldn't install shutdown hook by itself. 

Installing those must be the responsiblity of the application code and not the library code. 

Eg: If I write a standalone app with a main method, I will install the shutdown hooks. If I write a web application I will call the closeAll() method from a ContextListener...

Is that really necessary to closeAll() everything when the jvm exits ? (Maybe I'm wrong but the JVM will itself close everything.), Does the need updating in light of Owen's comments (and now HADOOP-1131 is resolved)?, Jira keeps eating my comments on this issue. *sigh*

> As hadoop may be used as a third party library, it shouldn't install shutdown hook by itself.

Actually, I think you have this backwards. Since Hadoop may be used as a third party library, it must use finalizers and shutdown hooks to clean up properly. The problems with have an explicit close method that the user must call are:
  1. Forcing users to remember to cleanup your library is error-prone.
  2. Just because library Foo is done does not mean library Bar is done and Bar will lose when Foo calls close.

That said, I think that with some relatively minor changes, we can get the effect that you want (minimal garbage after the usage of the FileSystem is done):
  1. Fix HADOOP-1160 so that the FileSystem.closeAll actually closes the client.
  2. Have FileSystem.closeAll clear the CACHE map via reset.
  3. Have the DFSClient.close method remove the client from the ClientFinalizer.
  4. Have the constructor add "this" to the ClientFinalizer.

So after the closeAll call, you'll still have the DFSClient class loaded, but not much else. In particular, you'll have no instances of DFSClient left., The closeAll() method should also remove ClientFinalizer from shutdown hooks to avoid the ClassLoader (so all Class(es) loaded by the ClassLoader) that have loaded hadoop being kept in memory., [ edit - removed grossly redundant exposition ]

This patch clears entries from FileSystem.CACHE when there are no authorities for a given scheme and removes the shutdown hook when the cache is empty., +1 overall.  Here are the results of testing the latest attachment 
http://issues.apache.org/jira/secure/attachment/12367666/1130.patch
against trunk revision r584286.

    @author +1.  The patch does not contain any @author tags.

    javadoc +1.  The javadoc tool did not generate any warning messages.

    javac +1.  The applied patch does not generate any new compiler warnings.

    findbugs +1.  The patch does not introduce any new Findbugs warnings.

    core tests +1.  The patch passed core unit tests.

    contrib tests +1.  The patch passed contrib unit tests.

Test results: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/939/testReport/
Findbugs warnings: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/939/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/939/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/939/console

This message is automatically generated., Can Owen, Philippe or Tom please review this patch and indicate whether it is ripe for committing?, Hi Chris, can you pl get this patch reviewed? Thanks. , +1, I just committed this. Thanks Chris!, +1 overall.  Here are the results of testing the latest attachment 
http://issues.apache.org/jira/secure/attachment/12367666/1130.patch
against trunk revision r594274.

    @author +1.  The patch does not contain any @author tags.

    javadoc +1.  The javadoc tool did not generate any warning messages.

    javac +1.  The applied patch does not generate any new compiler warnings.

    findbugs +1.  The patch does not introduce any new Findbugs warnings.

    core tests +1.  The patch passed core unit tests.

    contrib tests +1.  The patch passed contrib unit tests.

Test results: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/1092/testReport/
Findbugs warnings: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/1092/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/1092/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/1092/console

This message is automatically generated., Integrated in Hadoop-Nightly #302 (See [http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Nightly/302/])]