[Unit tests to demo the two issues in the description., Having deprecated properties overwrite non-deprecated properties is intentional -- it's how we support deprecated properties.  The converse is also true -- setting a property will also set all the deprecated forms of that property.  Essentially the deprecated properties are aliases with warnings attached when used.  Failure to set the "true" property when a deprecated property is set will break support of deprecated properties.

bq. In the meanwhile, Configuration#getPropertySources may return wrong source information for a deprecated property.

This is a known issue, tracked by HADOOP-8967., Thanks for the comments Jason!

bq. Having deprecated properties overwrite non-deprecated properties is intentional – it's how we support deprecated properties. The converse is also true – setting a property will also set all the deprecated forms of that property. 

Here is it possible that we can keep different values for a pair of deprecated property and non-deprecated property? E.g., after fs.defaultFS already loaded, when loading fs.default.name, we keep different values for them.

bq. This is a known issue, tracked by HADOOP-8967.

Thanks for pointing out! I will use that jira to track this issue., bq. Here is it possible that we can keep different values for a pair of deprecated property and non-deprecated property? E.g., after fs.defaultFS already loaded, when loading fs.default.name, we keep different values for them.

Not easily, as we'd have to divine the context of the request.  If someone sets fs.default.name then they want that to be the default FS -- they're just using a deprecated name to do so.  I don't think we want to start second-guessing whether to respect a property setting or ignore it.  What happens later when someone comes along, discovers the old property name, then updates it to use the new name?  If we ignored it before then suddenly we won't.  Isn't the real issue here that something is trying to set the wrong default FS, regardless of the name it's choosing to do it with?, Thanks for the explanation Jason! Will resolve the jira as "Not a Problem".]