[Instead of the command 'tar -zxf file.tgz' we can use 'gzip -dc file.tgz | tar -xf -'. I will submit a patch. I may not be able to test it on Solaris. Will make sure it works on Linux and Windows.

, 
suggested patch. passes on Linus and Windows. Please make this patch available if Hudson is still on., -1, build or testing failed

2 attempts failed to build and test the latest attachment http://issues.apache.org/jira/secure/attachment/12363855/HADOOP-1717.patch against trunk revision r565995.

Test results:   http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/559/testReport/
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/559/console

Please note that this message is automatically generated and may represent a problem with the automation system and not the patch., Solaris tar does not support -C.  Someone should probably check the command line on Solaris before we submit the patch again., Two ideas.  We could either:

1. Emit a command line for 'gtar' when running on Solaris, since that's installed there.

2. Use the java code from HADOOP-1622 to implement archive packing and unpacking in Java.

I prefer 2., I prefer 2 as well, but in the interest of time I present 2 additional options:

3. use jar to pack and unpack hadoop-12-dfs-dir

4. use the old standard (thanks Owen!):
/bin/sh -c "gzip -dc '/export/home/hudson/hudson/jobs/Hadoop-Patch/workspace/trunk/build/test/cache/hadoop-12-dfs-dir.tgz' | (cd '/export/home/hudson/hudson/jobs/Hadoop-Patch/workspace/trunk/build/test/data' ; tar -xf -)"

Given we want to get 0.14 out, I suggest we go with 3 or 4 and file a 0.15 Jira for option 2., I'm okay with (4) for 0.14., Implemented option 4.  Tested on Solaris and Linux., > Solaris tar does not support -C. Someone should probably check the command line on Solaris before we submit the patch again.

http://docs.sun.com/app/docs/doc/816-0210/6m6nb7mmp?a=view says it does. May be Solaris is more strict on the order. I did not have access to Solaris even to try the command. Any I will update with that the right command should be. That might look better than option 4. Looks like it should "-C directory file" instead of " file -C directory" I have in the patch. I will confirm.

, I guess -C works only for 'c' or 'r' and not for 'x' on Solaris. Great!. I did check the man page before submitting the patch but did not read it completely., Test Nigel's new version on Solaris..., +1

http://issues.apache.org/jira/secure/attachment/12363870/HADOOP-1717-2.patch applied and successfully tested against trunk revision r566291.

Test results:   http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/560/testReport/
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/560/console, I just committed this.  Thanks, Nigel!]