[This worked yesterday and the changes since then are:

HADOOP-2423.  Code optimization in FSNamesystem.mkdirs.
HADOOP-2908.  A document that describes the DFS Shell command.
HADOOP-2994. Code cleanup for DFSClient: remove redundant conversions from string to string. 
HADOOP-2972. Fix for a NPE in FSDataset.invalidate.
HADOOP-2995. Fixes StreamBaseRecordReader's getProgress to return a floating point number.
HADOOP-2996. Fixes uses of StringBuffer in StreamUtils class.

I suspect the first one is the cause:
HADOOP-2423.  Code optimization in FSNamesystem.mkdirs., alos looks like dfs -mv file /absolutepathtodir does not work.... , I traced it back using the nightly builds and it was a while ago (the new tests I am writing caught it!) and narrowed it down to this set of JIRA's (pls ignore previous list). Seems like HADOOP-2192 is the obvious one?

HADOOP-2769. TestNNThroughputBnechmark should not use a fixed port for the namenode http port.  	
HADOOP-2192. Error messages from "dfs mv" command improved. 	
HADOOP-2178.  Job History on DFS. 
HADOOP-2730. HOD documentation update.
HADOOP-2371. Commit for the html/pdf docs.	
HADOOP-2371. Commit for the html/pdf docs.	
HADOOP-2766. Enables setting of HADOOP_OPTS env variable for the hadoop daemons through HOD.
HADOOP-2840. Fix gridmix scripts to correctly invoke the java sort through the proper jar.
, most likely it is hadoop-2192. Let me take a look and upload a fix ... , this patch fixes the issue and errors out on -mv option. It is consistent with last versiosn of hadoop that -mv does not create the parent directories... , +1 to throw exception as earlier. Looks good, +1 overall.  Here are the results of testing the latest attachment 
http://issues.apache.org/jira/secure/attachment/12378190/HADOOP-3012_1.patch
against trunk revision 619744.

    @author +1.  The patch does not contain any @author tags.

    tests included +1.  The patch appears to include 6 new or modified tests.

    javadoc +1.  The javadoc tool did not generate any warning messages.

    javac +1.  The applied patch does not generate any new javac compiler warnings.

    release audit +1.  The applied patch does not generate any new release audit warnings.

    findbugs +1.  The patch does not introduce any new Findbugs warnings.

    core tests +1.  The patch passed core unit tests.

    contrib tests +1.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2009/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2009/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2009/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2009/console

This message is automatically generated., I just committed this. Thanks Mahadev!, Integrated in Hadoop-trunk #435 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/435/])]