[Duplicate of HADOOP-5749 ?, Be careful with this one as we move to Federation, because the "-fs" command line option is currently the only way to direct the FSClient at a file system other than the default one, if any.  So if you might want your client to target one of several name services (federated namenodes), you have to use the -fs option or provide an alternative.,  minor comments:
   1. The test has a few System.out.println, please use LOG instead.
   2. A commented assertTrue could be removed.

+1 for the patch pending hudson results., addressed comments by Jitendra.

@Matt. This patch doesn't change how -fs is handled. It tries to create FS only when it is needed and based on the path instead of default system. But when nothing else is available a default one will be created. (from conf or from -fs)., +1 overall.  
     [exec] 
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec] 
     [exec]     +1 tests included.  The patch appears to include 3 new or modified tests.
     [exec] 
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec] 
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec] 
     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.7) warnings.
     [exec] 
     [exec]     +1 release audit.  The applied patch does not increase the total number of release audit warnings.
     [exec] 
     [exec]     +1 system test framework.  The patch passed system test framework compile.
     [exec] 
, committed to trunk., Integrated in Hadoop-Common-trunk-Commit #553 (See [https://hudson.apache.org/hudson/job/Hadoop-Common-trunk-Commit/553/])
    HADOOP-7207. fs member of FSShell is not really needed
, Integrated in Hadoop-Hdfs-trunk-Commit #594 (See [https://hudson.apache.org/hudson/job/Hadoop-Hdfs-trunk-Commit/594/])
    HDFS-1824. delay instantiation of file system object until it is needed (linked to HADOOP-7207)
, not for commit. For previous version., Integrated in Hadoop-Common-trunk #662 (See [https://hudson.apache.org/hudson/job/Hadoop-Common-trunk/662/])
    HADOOP-7207. fs member of FSShell is not really needed
, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12476395/HADOOP-7207-22.patch
  against trunk revision 1094750.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    -1 patch.  The patch command could not apply the patch.

Console output: https://hudson.apache.org/hudson/job/PreCommit-HADOOP-Build/355//console

This message is automatically generated., the HDFS part of this fix is HDFS-1824, Integrated in Hadoop-Hdfs-trunk #643 (See [https://builds.apache.org/hudson/job/Hadoop-Hdfs-trunk/643/])
    ]