[Visualizing this as a map-reduce job which actually merge/sort into a single file, shouldn't it be available as  a separate package (like distcp, may be)?
 This feature of merging files would be very useful for users who would like to have only one output file. For now they would want to stick to a single reducer and do not want to submit a job with multiple reducers (even thought that is better machine utilization). A generic merge utility with understands the format and merges would be useful? Something motivated from https://issues.apache.org/jira/browse/HADOOP-2113, Hi Milind,

 It looks to me that, Doc is updated in current code base.

{code}
 /** Copy all files in a directory to one output file (merge). */
  public static boolean copyMerge(FileSystem srcFS, Path srcDir, 
                                  FileSystem dstFS, Path dstFile, 
                                  boolean deleteSource,
                                  Configuration conf, String addString) throws IOException {
    dstFile = checkDest(srcDir.getName(), dstFS, dstFile, false);

{code}


I am closing it as Not A Problem. If you have any concern with it, please reopen.

Thanks
Uma, I believe the sorting earlier referred to the file list sorting?

In that case, although FSNamesystem gives consistent sorting for HDFS's listStatus and such, note that Java's File APIs do not provide the same consistency while using getmerge over any LocalFileSystem. I've opened HADOOP-7659 for this, btw., This is not a merge in commonly used sense (well, squinting a little bit, it is a merge if the comparator always returns -1 :-)

{code}
hadoop fs -get dir/* - > out
{code}

has the same behavior, no ?, > hadoop fs -get dir/* - > out

> has the same behavior, no ?

Not exactly same I think. In this case, out is a file on the local filesystem while -getmerge is supposed to create the merged file on the hdfs.
Of course we can still achieve that doing something like

hadoop fs -get dir/* - | hadoop fs -put - dir/dest, Even if the copyMerge comment is somewhat correct, the documentation for fs -getMerge is still confusing, so I think that this bug should be reopened; from copyCommands.java:
    public static final String DESCRIPTION =
      "Get all the files in the directories that\n" +
      "match the source file pattern and merge and sort them to only\n" +
      "one file on local fs. <src> is kept.";

The command neither sorts nor merges the actual source files according to the traditional definition (e.g. sort and sort -m commands), it merely concatenates them, in order of the filenames. It should look more like this:

Concatenate all the files in the directories that match the pattern in <src> and output to only one file on local fs. <src> is kept.]