[Here's a patch while I continue testing... appreciate any f/b.

This patch ensures that the framework distinguishes between 'failed' tasks and tasks 'killed' because of framework errors (e.g lost task-trackers) and thus does not unfairly abort TIPs and hence jobs due to no fault of their own., Here is a reasonably well tested patch which helps to distinguish between *failed* tasks (i.e. bona-fide task 'error') and *killed* tasks (killed by the framework for no fault of their own e.g. lost task-trackers). With this in place it's then straight-forward to ensure that 'killed' tasks do not count against the job, thus not penalizing it.

Other than that this patch contains some enchancements to jobdetails.jsp/jobfailures.jsp to show the same information on the web-ui...
, -1, build or testing failed

2 attempts failed to build and test the latest attachment http://issues.apache.org/jira/secure/attachment/12355865/HADOOP-1050_20070419_2.patch against trunk revision r530153.

Test results:   http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/63/testReport/
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/63/console

Please note that this message is automatically generated and may represent a problem with the automation system and not the patch., Looking at http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/63/console seems like the tests were killed for crossing the 30min deadline... which isn't happening on my end. Could someone re-run this to ensure this wasn't a transient one-off? Thanks!, Updated to reflect recent changes to trunk..., +1

http://issues.apache.org/jira/secure/attachment/12355915/HADOOP-1050_20070420_3.patch applied and successfully tested against trunk revision r530556.

Test results:   http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/67/testReport/
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/67/console, +1
, although I do note that there are some unrelated blank new lines added..., > although I do note that there are some unrelated blank new lines added...

I've consciously added them to make the code more readable... I admit I was worried about someone catching this! :), I've just committed this.  Thanks Arun!, Integrated in Hadoop-Nightly #68 (See http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Nightly/68/)]