[only catch IOException, print a warning message, let local variable 'done' be false., > DFSClient will retry in read/write methods, but no such mechanism found when seek(long) calling blockReader.skip(diff) (DFSClient.java #1582),

Thats right. seek() should retry just like read().  Your fix seems correct.

> HADOOP-2346 introduced data read/write timeout.
I don't see why it is related to HADOOP-2346.

Could you clean up the patch so that it has the right indentation and does not have the white space changes ...
, More regd patch :

We don't need to print warning.. may be you could make it a debug. Also remove comments with your name., corrected idents, whitspace and comments., Patch looks good. One minor change : could you wrap 'try block' around skip() so that it is clear where we expect the exception and it will also minimize changes in the patch.
, This bug existed in hadoop for a long time. Marking it for 0.18. How do assign it to LN?, I added him as a contributor under hbase with user name LN.  Does that work for you Raghu? (https://issues.apache.org/jira/secure/ViewProfile.jspa?name=ln%40webcate.net), thanks Raghu and Stack, i'm very glad to. what should i do? fixing and commiting patch to svn? how about integration test rule?, Are planning to make any changes to the patch? Once you think it is ready I can commit it, after sending it through hudson etc.

> how about integration test rule?
I haven't seen anyone insisting on a test for this jira., Minor rearrangement of LN's patch. Hopefully its ok., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12386648/HADOOP-3778.patch
  against trunk revision 678845.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2922/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2922/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2922/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2922/console

This message is automatically generated., I just committed this. Thanks LN!, Integrated in Hadoop-trunk #581 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/581/])]