[Attaching a patch which would kind of fix this issue.

* Created a new target called make distribution by moving tasks from current package target.
* Created another target called package-bin which is nothing but same as package but minus javadocs,docs,cndocs. Proably we should remove apireport also as dependency so that javadocs are also not built when doint ant binary.

This patch would see to that docs are not built and depdency on forrest is not required for ant binary builds.
, sreekant, 
Applying the patch creates build.xml.rej/orig; it looks like a conflict.
Could you resubmit the patch?
tnx!, latest patch merged with the trunk., recreated the patch by removing those extra whitespaces.. , -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12400841/HADOOP-5066.patch
  against trunk revision 747318.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3911/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3911/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3911/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3911/console

This message is automatically generated., This is just a change to the build.xml file and doesn't require unit tests.
, The current patch still builds the javadocs and runs/includes jdiff, neither of which are necessary for a binary tarball. Most of the copying to build (src, in particular) in {{makedistribution}} is similarly expensive and unnecessary... would it be difficult to eliminate most or all of this?, This patch addresses Chris's comments 
tnx!
, +1 Tested on my machine; works very well, The binary tarball is up to 21MB. Filed HADOOP-5390 to deal with the duplicate jar issue., On a similar note, where is lib/core-3.1.1.jar coming from? It's currently the largest jar in the tarball, and appears to contain eclipse classes. Surely that shouldn't be there..., {noformat}
     [exec] -1 overall.  
     [exec] 
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec] 
     [exec]     -1 tests included.  The patch doesn't appear to include any new or modified tests.
     [exec]                         Please justify why no tests are needed for this patch.
     [exec] 
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec] 
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec] 
     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs warnings.
     [exec] 
     [exec]     +1 Eclipse classpath. The patch retains Eclipse classpath integrity.
     [exec] 
     [exec]     +1 release audit.  The applied patch does not increase the total number of release audit warnings.
{noformat}

I committed this. Thanks, Giri, Integrated in Hadoop-trunk #778 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/778/])
    , If nobody objects, I'd like to commit this to 0.20, bq. .. I'd like to commit this to 0.20
+1, Committed to 0.20, Integrated in Hadoop-trunk #796 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/796/])
    ]