[Attaching patch. Comprises of forrest xml changes suggested by Corinne. Merged changes from Hemanth., Reattaching patch. Missed changes from user guide., +1 Verified changes are in line with Corinne's comments., I just committed this to trunk. Thanks, Vinod. 

As a side note, the most updated version of changes.html also got committed., I apologize. The patch hasn't run through Hudson yet. I reverted the commit. Will run it through Hudson again and commit it once done., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12385093/HADOOP-3668.1
  against trunk revision 673344.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2781/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2781/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2781/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2781/console

This message is automatically generated., The -1 on tests is expected as this is a documentation patch.
The -1 on contrib tests seems related to HADOOP-3653, as this patch does not touch any code at all., I committed this again to trunk. Thanks, Vinod., Integrated in Hadoop-trunk #536 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/536/]), Integrated in Hadoop-trunk #537 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/537/]), Committed this to branch 0.18., In Hod user guide, term 'DFS'  is being used instead of 'HDFS' under the following sections :

3.9. Capturing HOD exit codes in Torque
4.3. hod Fails With an error code and error message]