[This patch does two things:

1. Moves all the pendingCreates logic into PendingCreates.java. This data structures encapsulates pendingCreates and pendingCreateBlocks from FSNamesystem.

2. The block allocation routine FSNamesystem.allocate() verifies that the new blockid that is generated does not already exists in the blocksMap as well as pendingCreates.
, PendingCreates:
- Redundant import:
import org.apache.hadoop.util.*;
- Redundant member:
private Log LOG = null;
- Member pendingCreates lost the comment explaining the meaning and the mapping type.

FSNamesystem:
- Member pendingCreates comment should be updated.
- FSNamesystem.abandonBlock()
-- First stateChangeLog() report is redundant because it is already reported  by the NameNode.abandonBlock()
-- It would be better to report the result of block removal whether it was successful or not,
rather than reporting just the success and keeping it silent in case of failure.

- FSNamesystem.allocateBlock()
Placing pendingCreates.addBlock() inside the do-while-loop is confusing. Because you add block just once when it is valid.
I'd propose to modify isValidBlock(b) so that it checked pendingCreates.contains(b) in addition to checking whether it is in the blocksMap.
Then pendingCreates.addBlock() will need only to assert that the block is not pending., Implemented all review comments except the one related to "better logging by abandonBlock". The reason i did not change it in this patch because it is not directly related to this issue and could conflict with another patch that I have outstanding.  I am going to fix this logging issue as part of a separate JIRA issue., Dhruba,

This patch no longer cleanly applies to trunk (due to HADOOP-1269?). Could you regenerate it please? , Merged patch with latest trunk., I just committed this.  Thanks, Dhruba!

Note: your patch included some improvements to the descriptions in conf/hadoop-default.xml, but these seemed unrelated to this issue and I assume were intended for some other issue and included only accidentally, so I ignored them.]