[Attaching a first patch to fix the problem., \\
\\
| (/) *{color:green}+1 overall{color}* |
\\
\\
|| Vote || Subsystem || Runtime || Comment ||
| {color:blue}0{color} | pre-patch |   0m  0s | Pre-patch trunk compilation is healthy. |
| {color:green}+1{color} | @author |   0m  0s | The patch does not contain any @author tags. |
| {color:green}+1{color} | release audit |   0m 23s | The applied patch does not increase the total number of release audit warnings. |
| {color:green}+1{color} | whitespace |   0m  0s | The patch has no lines that end in whitespace. |
| | |   0m 26s | |
\\
\\
|| Subsystem || Report/Notes ||
| Patch URL | http://issues.apache.org/jira/secure/attachment/12745426/HADOOP-12236.001.patch |
| Optional Tests |  |
| git revision | trunk / edcaae4 |
| Java | 1.7.0_55 |
| uname | Linux asf903.gq1.ygridcore.net 3.13.0-36-lowlatency #63-Ubuntu SMP PREEMPT Wed Sep 3 21:56:12 UTC 2014 x86_64 x86_64 x86_64 GNU/Linux |
| Console output | https://builds.apache.org/job/PreCommit-HADOOP-Build/7282/console |


This message was automatically generated., releasedocmaker was moved to yetus.  See the HADOOP-12111 branch for the latest version., [~aw] it's okay, but could you review it for a workaround for trunk and branch-2 before releasing Yetus? It prevent us with running command behind proxy. I'll also create a jira for Yetus too., branch-2 doesn't have releasedocmaker., ... and by the time trunk is released, yetus will be out., Hmm, okay. But one problem is that we cannot run mvn site -Preleasedoc behind a proxy before merging HADOOP-12111. , Yup.  -Preleasedocs is *optional*.  The only thing you'll be missing is the changelog that shows up on the web site.  We don't guarantee that every feature works everywhere.  
, {quote}
-Preleasedocs is optional.
{quote}

One problem I faced is that I couldn't create website for confirming that the documentation is generated correctly. Do you know any workaround to do this withougt -Preleasedocs? From BUILDING.txt:
{quote}
Create a local staging version of the website (in /tmp/hadoop-site)

  $ mvn clean site -Preleasedocs; mvn site:stage -DstagingDirectory=/tmp/hadoop-site
{quote}

, bq. mvn clean site; mvn site:stage -DstagingDirectory=/tmp/hadoop-site

... will generate everything but the change log., OIC! Thank you very much, closing this as invalid one.]