[[~ebadger], [~jlowe], what do you think? Is this a valid scenario?, Thanks for the report, Miklos

bq. runCommand()}} can be called while/after Shell.getAllShells() returned all the shells to be cleaned up.  This new thread can avoid the clean up, so that the process held by it can be leaked causing leaked localized files/etc.

Yes, there's a small bug where Shell#runCommand should be synchronizing on CHILD_SHELLS as it starts the subprocess. That way it either won't be started before destroyAllShells is called or it will be part of the list as long as it's been started.  However I would argue it's outside the scope of the getAllShells and destoryAllShells APIs to prevent all future shells from being launched, as there may be a use case where someone wants to cleanup all current shells but still launch future ones. Its job is to kill all active ones which client code outside of Shell cannot do.

In the specific case of localizing, it looks like we need a second destroy pass after awaiting the shutdown of the executor to catch any shell that was trying to launch just as we destroyed the active ones.

{quote}I see another issue as well. [...] the try catch block does not cover all instructions after the process is started, so for example we can exit the thread and leak the process
{quote}
Yes that appears to be an issue as well.

[~ebadger] do you have some cycles to look into this?, bq. Eric Badger do you have some cycles to look into this?
Yes, I will look into this, [~miklos.szegedi@cloudera.com], [~jlowe], uploaded a patch that addresses the issues stated above. I'm not super happy with how I had to fix up the code to get the try block to extend all the way up to right after the starting of the process, but it works. Basically because of the {{final}} variable for {{errReader}} being inside of the {{try}} block but also being needed in the {{finally}} block, I had to make a copy of it outside of the {{try}} block that bridges the gap. , Thank you for the patch [~ebadger].
{code:java}
shell.getProcess().destroy();{code}
I see that you use SIGTERM instead of SIGKILL. This may still leak child processes.
{code:java}
destroyShellProcesses(getAllShells());
if(!exec.awaitTermination(10, TimeUnit.SECONDS)) {
  destroyShellProcesses(getAllShells());
}{code}
This may still leak shells, if the creator thread is waiting itself on something else and it creates the subshell, once the second {{getAllShells()}} is called.

I have a general concern with the original patch that any other users of the Shell class may need to change their code to use the same pattern. There are at least 5 other users of Shell in the codebase.

Have you considered using process groups? Process groups may also solve the case when the node manager signals the container localizer process with SIGKILL. Currently, if this happens the shells will leak.]