[After a long investigation, i finally found why these kind of jobs where retired by the jobtracker. This is because in this case, job finished time is never setted.
So here is a patch to correct this problem.
It could be great if my patch is correct to integrate it in the next 0.9.0 release if possible.
Thanks., If my patch is correct and commited (I have tested it), I think that HADOOP-648 issue can also be resolved in the same time as this one because in fact, it is the same issue., The previous patch is not really good. In fact, the finished time must be setted before the JobStatus in order not to be retire by the job tracker.
Here is new and valid patch. :-), Has somenone looked to this patch ?
I think it is quiet important to fix this issue since some NPEs are regularly thrown by the JobInProgress class.
This patch has been tested on the 0.9.0 version and works perfectly.
Thanks for attention., Can someone have a look at this one-liner? Thanks, When a patch is ready to be looked at you need to push the "submit patch" button to make it's state "patch available." We use the the patch available state to find the patches to look at. This looks like a good change assuming it still applies to head.

+1, Sorry. Didn't know about this practice. Will take care of that next time. ;-)
Thanks for your attention., Patch available ;-), +1, because http://issues.apache.org/jira/secure/attachment/12346228/HADOOP-649.patch applied and successfully tested against trunk revision r506778., This looks good to me.  It would be best to have a unit test, to make sure that it really fixes the issue and that we don't break it again in the future.  Thomas, are you willing to write one?

Also, please don't include the bug number in the patch itself.  We don't want the code to get cluttered with comments documenting its history: we leave history to subversion.

Thanks!, > It would be best to have a unit test

Probably this can be done by simply adding a new test or slightly modifying an existing unit test, rather than constructing an entirely new test for this bug., I will add a unit test and remove my comment from the previous patch., Here is the new patch including the unit test., +1, because http://issues.apache.org/jira/secure/attachment/12351118/HADOOP-649-0.11.2.patch applied and successfully tested against trunk revision r507276., I just committed this.  Thanks, Thomas!]