[I don't think it's worth removing them, although correcting them would be a good idea.  The Doctor is his name, not his title.  , I don't like this proposed change either. The result is easy to google (see http://lmgtfy.com/?q=hadoop+drwho ) and is more interesting that a utilitarian "default.web.user" or some such., Some of our poor users don't have internet access in the buildings/datacenters where their clusters reside. (I don't know how they keep busy while waiting on their MR jobs without twitter... but somehow they manage).

So, a self-documenting "utilitarian" solution is preferable to an "interesting" one that has to be googled., A bit ironically, the first link that google returns has the following:

"Not the most helpful username to pick for that scenario, to say the least.", As an operations person this was horrible the first time it came up.  Seeing a user that is not supposed to be in your system and was not created by anyone can cause a huge panic and waste a lot of time.  The error should be thrown with the correct user and group (not Tardis) for the process on the system (ie. *NIX user and group)

Errors should be clear and concise.  I'm ok with looking at manuals for extra information but, like Todd said, "just google it" is not an option in most data-centers., Cesar, this isn't about changing an error message. Todd is suggesting changing the default name. You would have had *exactly* the same problem with "webuser" except it would be far worse panic., I think if I saw messages in my audit log that "webuser" or "hdfswebui" was accessing files, I'd pretty quickly figure out where they were coming from. Seeing messages from "dr.who" in the audit log would scare me., > ... The result is easy to google (see http://lmgtfy.com/?q=hadoop+drwho ) ...

I had removed "Dr Who" once in HADOOP-2833, which is the second search result.  However, it managed to come back.  Now, people are scared -- it becomes the phantom of the cluster.  Just kidding.  :), bq. However, it managed to come back.
The Doctor can regenerate 13 times (http://bit.ly/kh3sDj).  As such, it'll take 11 more jiras before this effort succeeds., You gave me hope and then took it away.
Basically, Todd...
Run., Todd, your mention of the lack of internet access and their objections to references to Dr Who appearing in their logs tells me that your customers are the Daleks, whose Datacenter-7 is a 150 Exabyte facility on the dark side of the moon. I know this as we had to deal with the hardware issues of heat dissipation in servers deployed in a vacuum, and the logistics of a facility designed to be maintained by three-wheeled lifeforms which lack the ability to handle hot-swap disks or the little clips on CAT-5 cables. 

I propose we meet the needs of these valued customers and also the Cybermen by making the name of the Time Lord configurable. They can set {{hadoop.timelord=The Master}} to their hadoop-site file, and be happy.

Personally, I'd focus on the more pressing issue, namely that the Faster Than Light network backbone really confuses the Job Tracker, as it is getting completion notifications coming before the work has actually been scheduled...

, -1, this change would incompatibly break all productions systems where the cluster admin has nagios scripts monitoring log files for "dr.who".  

Please wait until 1.0 for this change., Does this actually still happen in trunk or is there an edge-case where the username doesn't get resolved?, Allen, it only happens in the web ui when there isn't a better auth module plugged in., Hmm. That's sort of surprising.  I would have expected the user name to get resolved to the user that is running the datanode when the built-in auth was being used.  (Doesn't it default to the username of the user running the Java process everywhere else?  Why would it be different for the HDFS web ui?)  But that's also bad for what are hopefully obvious reasons though.

FWIW, in Apache 0.20.2 and prior, we had dfs.web.ugi which looks like it defaulted to "webuser,webugi".  

I'm inclined to think that we likely need to bring this setting back and default it to either webuser or DrWho.  It sounds like the default changed in 0.21, so this is a tricky one., BTW, since we're playing with 0.20.203 on our test box:

JT UI runs as hadoop.
NN UI appears to use dfs.web.ugi, as we're blowing errors in the NN log for the (unknown our systems) 'webuser' account.

Are we *sure* this isn't already fixed in trunk? , If you're running without security on, it continues to use dfs.web.ugi (default webuser). If you turn security on, it will use the new static user plugin, which defaults to DrWho. Makes sense, right?, Ah ok.  So we have a plug-in that basically ignores an (already existing) config setting that is practically custom built for this purpose.

+1 to honor it in the plug-in.

The JIRA title/description should probably flushed out to specify this is the actual problem.]