[patch to sync up hadoop svn, -1 overall.  Here are the results of testing the latest attachment 
http://issues.apache.org/jira/secure/attachment/12374175/hod-sync-up.patch
against trunk revision 615723.

    @author +1.  The patch does not contain any @author tags.

    javadoc +1.  The javadoc tool did not generate any warning messages.

    javac +1.  The applied patch does not generate any new javac compiler warnings.

    release audit -1.  The applied patch generated 290 release audit warnings (more than the trunk's current 288 warnings).

    findbugs +1.  The patch does not introduce any new Findbugs warnings.

    core tests +1.  The patch passed core unit tests.

    contrib tests +1.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1692/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1692/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1692/artifact/trunk/build/test/checkstyle-errors.html
Release audit warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1692/artifact/trunk/current/releaseAuditDiffWarnings.txt
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1692/console

This message is automatically generated., I ran the rat target and can confirm that all source files have apache license header (including new files I added). Only these files don't have the license:
- build.xml
- documentation files (which will be removed after the first release, as the same info is also there in Forrest)
- a VERSION file
- a config file (similar to hadoop-site.xml)

I guess these do not need the AL ?, I just committed this.  Thanks Hemanth! 

As discussed privately, you will use Apache SVN for all future HOD development., +1 Overall
Successfully executed smoke test for this patch which covered following things -:
Allocate, Deallocate, Info, List operations with/without static dfs and tarball using hadoop - 0.15 and hadoop0.16.
Successfully executed hadoop script using script option.
Checked that multi-valued comma separated and parameters containing special chars such as =,: are properly handled by hod.
Also checked for proper HOD exit codes in case of allocation failures
, Also checked that there were no stale hodrings running after deallocation., Integrated in Hadoop-trunk #383 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/383/])]