[So, thankfully, this just looks like a bug in the log-message. I'll rustle up a patch to fix this one..., Ok, I take my previous comment back. 

It is a tad more involved since we are calling {{JobInProgress.failedTask}} from {{JobInProgress.fetchFailureNotification}} with the wrong {{trackerName}}. However, at worst it leads to a couple of trackers being wrongly blacklisted i.e. penalized for failed tasks.

Attached patch should fix it, I need to test this extensively..., If a task is not found in any of the tasktrackers (getAssignedTracker returns null), then the patch declares the tasktracker as "unknown" in the message. From the readability point of view, it might make sense to declare the tasktracker as "lost" since that is the only case, after an earlier declaration by the JT that the task represented by that taskid was successful, when getAssignedTracker would return null., Thanks for the review Devaraj. In fact, as you pointed out, I've gone ahead and remove the {{hostname}} parameter completely since it wasn't being used anywhere..., -1 overall.  Here are the results of testing the latest attachment 
http://issues.apache.org/jira/secure/attachment/12366521/HADOOP-1930_2_20070925.patch
against trunk revision r579084.

    @author +1.  The patch does not contain any @author tags.

    javadoc +1.  The javadoc tool did not generate any warning messages.

    javac +1.  The applied patch does not generate any new compiler warnings.

    findbugs +1.  The patch does not introduce any new Findbugs warnings.

    core tests +1.  The patch passed core unit tests.

    contrib tests -1.  The patch failed contrib unit tests.

Test results: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/824/testReport/
Findbugs warnings: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/824/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/824/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/824/console

This message is automatically generated., I just committed this. Thanks, Arun!, Integrated in Hadoop-Nightly #252 (See [http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Nightly/252/])]