[+1

This should not affect the default behavior since according to the log4j docs "By default the repository-wide threshold is set to the lowest possible value, namely the level ALL." Unless this value was not overriding the same setting elsewhere, and will after this change, but I don't think that's the case., {noformat}
     [exec] 
     [exec] -1 overall.  
     [exec] 
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec] 
     [exec]     -1 tests included.  The patch doesn't appear to include any new or modified tests.
     [exec]                         Please justify why no new tests are needed for this patch.
     [exec]                         Also please list what manual steps were performed to verify this patch.
     [exec] 
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec] 
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec] 
     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.
     [exec] 
     [exec]     +1 release audit.  The applied patch does not increase the total number of release audit warnings.
     [exec] 
     [exec]     +1 system test framework.  The patch passed system test framework compile.
     [exec] 
{noformat}

Don't think this patch needs to include a test., I've committed this to trunk, and the 21 and 22 branches.  Thanks Jingguo!, Integrated in Hadoop-Common-trunk-Commit #447 (See [https://hudson.apache.org/hudson/job/Hadoop-Common-trunk-Commit/447/])
    HADOOP-7052. misspelling of threshold in conf/log4j.properties. Contributed by Jingguo Yao
, Integrated in Hadoop-Common-trunk #529 (See [https://hudson.apache.org/hudson/job/Hadoop-Common-trunk/529/])
    HADOOP-7052. misspelling of threshold in conf/log4j.properties. Contributed by Jingguo Yao
, Integrated in Hadoop-Common-22-branch #4 (See [https://hudson.apache.org/hudson/job/Hadoop-Common-22-branch/4/])
    ]