[This came up once before too: http://search-hadoop.com/m/gxF7x1OtGET1/http%253A%252F%252Fvimeo.com%252F3584536&subj=Permission+to+view+the+Video+http+vimeo+com+3584536+

I have little clue to whats happened with the video, but there's other material available if you google for simple terms such as 'hadoop video' on google or on other search engines., I appreciate the tremendous amount of other training resources available, including lots of good material from Cloudera. However, that doesn't fix the problem that these two broken links on prominent pages are frustrating new users., We'll get it fixed soon, sorry for the inconvenience. I just wanted to point you (and others who may land here) to alternative resources meanwhile :), Harsh, please ensure the link (if you are retaining it) follows the directions given in HADOOP-5754., BTW my vote is to remove that link altogether, since it is hard to make sure that the video adheres to the guidelines from HADOOP-5754., Ok I did some asking and turns out that video was originally hosted by Cloudera itself. They updated the video with Linden on it so the URL's changed, and the new version of the same is viewable at http://www.cloudera.com/resource/introduction-to-apache-mapreduce-and-hdfs/ (Seems to require registering, hrm).

I think we can rather replace the direct video link to an Apache Hadoop Wiki page that compiles a list of resources folks can go to, rather than a singular one. How does that sound Suresh?, Sounds good. Do we have such a page?, Not yet, creating one. Will update it here and once it looks good, we can make the site changes., Suresh - I started something off on http://wiki.apache.org/hadoop/HadoopTutorialVideos with what free resources of video I could find. Feel free to edit/expand.

If this is good, lets swap the link/text in the site to direct to this page., Suresh - I didn't hear back from you. Are you good with the above link? Can we make the swap?, This does not appear to be a problem after the project re-merge.]