[This won't work if someone has set HADOOP_LOG_DIR, will it?  But perhaps it won't harm things either..., Right, it wont work for that. But in case someone sets HADOOP_LOG_DIR this new folder is properly out side the rsync'ed folders anyhow. 
At least we should not delete all logs by default., Any updates here? Are we  still rsync all logfiles around all nodes? , Updated patch. This excludes the Hadoop logs and the HOD logs from being rsynced., Changed component to scripts., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12387874/hadoop3488.v2.patch
  against trunk revision 685227.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3044/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3044/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3044/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3044/console

This message is automatically generated.,  * No new tests because it's a change to the rsync part in hadoop-daemon
 * Core test failures are unrelated to this patch (actually hdfs)., I just committed this. Thanks, Stefan and Craig!, Integrated in Hadoop-trunk #589 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/589/])]