[Hi xieguiming, TestSecurityUtil#testLocalHostNameForNullOrWild passes for me on my local box. What environment do you see this test failing in?

Also, please attach a patch file containing the diff if you have a fix for this issue, rather than including it in the JIRA description., Here's a patch for xieguiming, Removing code from description since there's now a patch., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12537207/HADOOP-8514.patch
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 1 new or modified test files.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 eclipse:eclipse.  The patch built with eclipse:eclipse.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed these unit tests in hadoop-common-project/hadoop-common:

                  org.apache.hadoop.ha.TestZKFailoverController

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-HADOOP-Build/1237//testReport/
Console output: https://builds.apache.org/job/PreCommit-HADOOP-Build/1237//console

This message is automatically generated., Can a committer look at this for me. The only reason the patch is getting a -1 is because of TestZKFailoverController which is unrelated, and apparently reported as an issue in these jiras: HADOOP-8591, HADOOP-8245., I hit this issue, too, when installing 2.0.5. I would comment that while the patch works for me it's a bit inconsistent with replacePattern which specifies Locale.US on toLowerCase. Should the patch to testLocalHostNameForNullOrWild specify Locale.US? Though maybe replacePattern shouldn't be so ethnocentric and use the default Locale for the site? AFAIK, using Locale.US has little impact on toLowerCase except in Turkey where there are dotted and undotted upper and lower case I's and the dotted upper case I maps to lower case undotted I and the undotted upper case I maps to an undotted lower case I.   , Alex, have you seen HADOOP-9431? It covers the same issue and contains the patch that was actually accepted and applied to 3.0.0 (I don't know why it wasn't applied to any earlier version)., Steven, thanks for that info. I didn't know there was a 3.0.0 release available. I notice that the 3.0.0 patch added the Locale.US to the toLowerCase call. Wonder if there are any Hadoopers in Turkey with host names that contain I's. ;-). In any case, I just applied the patch myself to my 2.0.5 code so I'm OK, just thought I'd let you know there's an issue there. Guess there aren't too many people who have their host names with a mix of upper and lower case.]