[Patch has been attached , which will apply the permission "710" on JobTracker log history directory .

---, Patch looks good +1., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12395402/hadoop-4782.txt
  against trunk revision 724578.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3694/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3694/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3694/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3694/console

This message is automatically generated., Peeyush, few comments:

- We should remove the umask change that we did in HADOOP-4705. Without that, we are still opening up the directories more than required. Please remember to remove the comment we made around the umask call in code.
- The methods createJTHistoryDir and setJTHistoryDirPermission should be private. By convention, rename them as __createJTHistoryDir and __setJTHistoryDirPermission.
- jobtrackerhistorydir does not seem to be needed as a class variable. It is only used in the two new methods you introduced.
- Python documentation comments are usually mentioned with ''' (three single quotes) rather than a double quote.

When testing this patch, can you please make sure that the directory permissions are set to ONLY 710 for the directories upto the history directory, and 700 for everything else (non-JobTracker objects)., Thanks for suggestions . New modified patch is attached .

---, The changes in bin/hodring where umask is set are still not removed. Please make sure that this is addressed in the next patch., Actually, thinking about this... I think we need two patches.

1 for trunk, where we revert the umask patch and leave it at that.
The second one is for the 18 branch alone where we turn on permissions for the history file. For this one, I can use hadoop-4782v1.txt attachment. It looks good.

Please upload a patch for trunk reverting the umask fix alone. Note, that should not have any other changes. , I apologize for not providing the patch for reverting the umask earlier. This patch will remove the umask from hodring .

---

, +1 for both patches., Results of test-patch. The -1 on tests is because the HOD testing framework is outside the unit tests of Hadoop.

     [exec] -1 overall.
     [exec]
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec]
     [exec]     -1 tests included.  The patch doesn't appear to include any new or modified tests.
     [exec]                         Please justify why no tests are needed for this patch.
     [exec]
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec]
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec]
     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs warnings.
     [exec]
     [exec]     +1 Eclipse classpath. The patch retains Eclipse classpath integrity.
, Sorry this is taking long. But I realized that in the 0.18 patch, the history directory alone needs read permissions for group also. This is because the history files created have random timestamps in them and chukwa will not be able to read the files without knowing what the actual names are, and which they don't know. So, instead of 710, the permissions on the history directory should be 750. Can you please provide a new patch for 0.18 ?, Chukwa can figure out the file name because the absolute file name is given by Hadoop to log4j.  Chukwa interfaces with Log4j to obtain the file name.  Therefore, permission 710 would be sufficient., I just committed this to trunk and the Hadoop 0.20 branch. Thanks, Peeyush !

Since the fix for Hadoop 0.18.3 is different in nature, I felt it is best to have it tracked in a separate JIRA. This is HADOOP-4919., Integrated in Hadoop-trunk #698 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/698/])
    ]