[This fixed in HBase, we can do this same for Hadoop., patch for trunk, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12386775/3819.diff
  against trunk revision 679459.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2939/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2939/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2939/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2939/console

This message is automatically generated., No test is needed by this as this only affects
the svn revision # under non english locale.
, This seems reasonable; can someone running a non-English locale confirm this in their environment?

Out of curiosity: is it more appropriate to set LANG and LC_* vars to "C" rather than unsetting them? Do we also need to (un)set LC_MESSAGES?, I'm using zh_TW.UTF-8 and am happy with it.
Well, (un)setting LANG and LC_CTYPE should be enough. 
Either C or any English locale would work.
, Sorry, I meant at least one other environment, but it's OK.

I just committed this. Thanks, Rong-En, Integrated in Hadoop-trunk #581 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/581/])]