[The script, or the agent java code?  The scripts shouldn't be looking at checkpoints, and the agent really shouldn't crash there...can you say mre?, It's the java code.  When the program is doing a directory listing of check point file, and the result is null.  It throws a null pointer exception., I can't reproduce the problem, but this patch at least improves our test coverage. Checks four cases:
no checkpoint dir, empty checkpoint dir, zero-length checkpoint file, valid checkpoint file., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12401269/checkpoint_cleanup.patch
  against trunk revision 749863.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 8 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/42/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/42/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/42/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/42/console

This message is automatically generated., +1 looks good.  This bug was created for checking checkpointNames==null case in ChukwaAgent.  This problem has been resolved earlier.  This patch added more to our test cases, which is good., I just committed this., Integrated in Hadoop-trunk #778 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/778/])
    ]