[This problem is also in 0.18, The test TC7 in HADOOP-2658 will fail due to this problem.
{noformat}
TC7: Corrupted replicas are present.
a.	Create file with replication factor of 2. Write half block of data. Close file.
b.	Log into one datanode that has one replica of this block. Find the block file on this datanode and truncate it to zero size.
c.	Open file in "append mode".  Append a new block worth of data. Close file.
d.	Reopen file and read two blocks worth of data.
{noformat}

It is because when doing c, DFSClient got corrupted  block information from the corrupted Datanode and updated other good block replicators with the corrupted information.

Originally, I thought that Datanode should not return corrupted  block information to DFSClient, as stated in the title of this issue.  However, Raghu pointed out that Datanode is hard to tell the length of a block since Datanode does not know the correct information, only the Namenode does.  So the fix here is using the block information obtained from the Namenode to updated the replicators., 4423_20081016b.patch: use Namenode block length for recovering blocks in the beginning of append., On a second thought, 10.18 does not need this since 0.18 does not have append.  Do you agree, Dhruba?, +1 on the code change. We do not need this fix for 0.18., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12392285/4423_20081016b.patch
  against trunk revision 705552.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3483/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3483/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3483/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3483/console

This message is automatically generated., 4423_20081017.patch: updated with trunk, no code changes., I just committed this., Integrated in Hadoop-trunk #637 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/637/])
    . Keep block length when the block recovery is triggered by append.  (szetszwo)
]