[Added a log entry for rename.

Since this is the first release with this appender, now would be a good time to object to this fix. The audit format assumes a path, but rename requires a source and destination. This patch just separates the two paths with a comma (a reserved character in the URI RFC, but legal in path segments, among other places). It might be better if the source and destination were separate entries, with the latter set to null where not applicable., On similar note, would it be helpful to log return status? One could then easily query for all failed renames or similar operations. , bq. On similar note, would it be helpful to log return status? One could then easily query for all failed renames or similar operations.

For now, only successful operations are logged.

This patch adds rename, uses {{src=<Path>\tdst=<Path>}} instead of {{path=<Path>[,<Path>]}}, and replaces the call to String.format- which allocates a new Formatter and StringBuilder for each call- with a TheadLocal Formatter that reuses its StringBuilder. It also adds types to most of the args, which was missing from the first version., Lohit correctly points out that many of the audit messages ignore the status returned from the \*Internal methods, so the "log iff successful" predicate doesn't hold. This patch observes this policy., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12385915/3752-2.patch
  against trunk revision 676069.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2853/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2853/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2853/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2853/console

This message is automatically generated., +1 Looks good. , I just committed this., Integrated in Hadoop-trunk #581 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/581/])]