[HADOOP-4631 is committed to and supports the old hadoop-site.xml in 0.20, so HOD in 0.20 continues to work. We actually need the fix only for trunk and above, where hadoop-site.xml will no longer be supported., Downgrading the priority. This is backwards compatible, save for a warning message. Fixing this is also complicated., HOD generates hadoop-site.xml on the client, and on the cluster nodes where it brings up the daemons. There are two types of configuration items it writes into the hadoop-site.xml:

- Entries it generates values for. E.g. the jobtracker URL
- Entries it is given via the hod configuration file. These are user specified entries.

It is easy to split the first category. Since the list is a hardcoded set of configuration items, we can hardcode the decision of which file (core, mapred, or dfs) this item belongs to and generate the entries into the appropriate file.

For the user specified entries, the decision cannot be taken by HOD in a maintainable fashion. Further, it causes more of a problem because of interface and usability issues.

Currently, HOD has a very convenient command line syntax to specify the list of configuration items, as follows:

-Cname=value - client params
-Mname=value - Mapred server params
-Fname=value - Final Mapred server params
-Hname=value - HDFS server params
-Sname=value - Final HDFS server params.

One approach to splitting the configuration is to split each of the categories into 3 as core, mapred and hdfs. However, I feel this might be too cumbersome for users to express.

So, a proposal is to introduce this syntax:
{code}
-<Option Letter>[category:]<name>=<value>, where category is 'core' or 'mapred' or 'hdfs'.
{code}

For e.g.
{code}
-Mmapred:mapred.reduce.tasks=4 or -Ccore:dfs.client.buffer.size=1000000
{code}

Based on the category, the configuration item can be generated to the appropriate configuration file.

For backwards compatibility, we can say that if category is not specified, the configuration item would be generated in the hadoop-site.xml file. When hadoop-site.xml is completely removed from hadoop, HOD can also stop supporting options where the category is not specified.

Comments ?, hod contrib was removed]