[Some times after successful hod allocation using dynamic dfs. if we immediately fire dfs -put put. User will get messages like -: file replicated 0 out 3 times and after 4 out of 5 retries dfs -put command starts working. On investigation, it is found that datanodes were still initializing. 
So if we use hdfs command after 10 secs of hod allocation there is no problem
Should we add this hod user guide?
, Seems a reasonable thing to document. We'll take this up., Can you update the HOD documentation to record that PBS env vars can be using the hodrc?

For instance, our cluster automatically allocates local space on each node for a job. This allows us to use the following configuration for HOD, and it works nicely!:
{code}
[ringmaster]
temp-dir                        = /scratch/pbstmp.$PBS_JOBID
work-dirs                       = /scratch/pbstmp.$PBS_JOBID/1,/scratch/pbstmp.$PBS_JOBID/2
[hodring]
temp-dir                        = /scratch/pbstmp.$PBS_JOBID
{code}


If documentation is updated, HADOOP-2862 can be closed as a duplicate.

C, Also add the documentation for HADOOP-3959 as part of this JIRA., Attaching documentation fixes., +1 for the changes relating to Torque., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12390906/HADOOP-3786
  against trunk revision 698721.

    +1 @author.  The patch does not contain any @author tags.

    +0 tests included.  The patch appears to be a documentation patch that doesn't require tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3369/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3369/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3369/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3369/console

This message is automatically generated., Please mark it as a blocker for 0.19 if required, +1 for the patch. Core test failure is not related to this HOD documentation fix., Request to committers. Can you please modify src/contrib/hod/CHANGES.txt when committing this ? It has the same format as the main CHANGES.txt file., I committed this to trunk and branch-0.19, however when I try running 'ant docs' on branch-0.18 it fails with:

{noformat}
    [exec] BUILD FAILED
     [exec] /Users/arunc/Installs/apache-forrest-0.8/main/targets/validate.xml:158: java.lang.NullPointerException
     [exec] 
     [exec] Total time: 5 seconds
{noformat}, Never mind - Nigel pointed out that -Djava5.home doesn't work for branch-0.18 ..., I just committed this. Thanks, Vinod!, Integrated in Hadoop-trunk #636 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/636/])
    . Use HDFS instead of DFS in all docs and hyperlink to Torque. Contributed by Vinod Kumar Vavilapalli.
]