[+1. Manually tested.  No tests, etc as is a configuration-ish change., Submitting patch for completeness., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12415999/HADOOP-6181.patch
  against trunk revision 812740.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 1 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/26/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/26/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/26/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/26/console

This message is automatically generated., Of note, this patch doesn't fix all the eclipse template problems that we have currently. Once this is committed, I'll open a new JIRA to whip it and the ivy.xml file into shape.  We need to make sure both are updated when jars are changed., I have committed this.  Thanks, Carlos!, Integrated in Hadoop-Common-trunk-Commit #24 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Common-trunk-Commit/24/])
    .  Fix .eclipse.templates/.classpath for avro and jets3t jar files.  Contributed by Carlos Valiente
, Integrated in Hadoop-Common-trunk #91 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Common-trunk/91/])
    .  Fix .eclipse.templates/.classpath for avro and jets3t jar files.  Contributed by Carlos Valiente
]