[Marking a blocker for 0.18.0, Attaching the patch.
Since I am just a month old kid in hadoop land :) I have tried to fill in as much details  I could; and will let others to fill in more if required., minor typos fixed., I believe that it will be much more useful with usage examples ala HADOOP-2908., 1) the job option has nothing to do with the libjars and others. It during running the jar that they are useful.  
2)  and it misses archive

bin/hadoop archive


3) sorry to be asking this-- but is this document supposed to serve as the main doucment and points to the others in case of specific information?  The problem I see with this is that it is not a complete documentation. If you make changes to any command interface say dfsadmin then you will have to change this document and also the main document for dfsadmin -- which seems redundant. We could just have minimal information in thos document and point it to the main document for info 

so info just like this --- 

dfsadmin go to the link for dfsadmin 
dfs commands go to link for dfsdommand

that we do not have to update twice -- in this document and the main one.
, I think this is a good start for the shell command manual.
- hdfs_user_guide should contain a link to the manual.
- Could you please replace DFS with HDFS. We were trying to use HDFS instead of DFS at least in new documents.
- A typo: Ctll-C
- I do not understand what is the idea under partitioning the set of commands into Administration and User groups.
All administrator commands are called using dfsadmin so these are "real" administration commands.
May be you want to change the name of section 2 or just remove this level of section hierarchy making each command
a section rather than a sub-section., - Incorporated Konstantin's comments.
- added bin/hadoop archive
{quote}I do not understand what is the idea under partitioning the set of commands into Administration and User groups. {quote}
User commands are supposed to be used by cluster users. Users wont be doing operations like starting a namenode or tasktracker etc, doing rebalancing etc. So these have been grouped into Administration along with dfsadmin.
, {quote}the job option has nothing to do with the libjars and others. It during running the jar that they are useful. {quote}
job -submit does use libjars option. Checked at configureCommandLineOptions in JobClient.

{quote}but is this document supposed to serve as the main doucment and points ... {quote}
I agree there is already some of this information scattered in various other documents in pieces. This is the starting point for this doc. Eventually all command related information in various other documents should get moved to this one. Other documents should talk about the theory behind a feature. For command related info, point to this document.
However, this evolution will take time and for release 18, we should be good with the basic stuff in place. make sense?
, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12384749/3552_3.patch
  against trunk revision 671563.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2748/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2748/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2748/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2748/console

This message is automatically generated., +1, I just committed this. Thanks, Sharad, Integrated in Hadoop-trunk #533 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/533/])]