[The 0.0.0.0 is just the alias for any address/localhost. Can you look in the task tracker logs to see which port it was bound to? It should look like:

{code}
2007-08-16 21:15:02,029 INFO org.apache.hadoop.ipc.Server: IPC Server listener on 50050: starting
{code}

Make sure it is the right start of the Task Tracker., Actually, could you please try it with the mapred.task.tracker.report.port set to 0. It would have the system assign a port number and avoid the port rolling code. 

We should remove the variable and always use 0 for that port, since it absolutely doesn't matter if they are on consistent ports or not., +1 for removing the port-rolling code and just letting the OS pick the port. It's worked well so far with the mini-clusters in test..., Straight-forward patch to remove port-rolling for {{mapred.task.tracker.report.port}} ..., Srikanth, could you give this patch a try and let us know? Thanks!, Updated patch to reflect recent changes to trunk..., -1, build or testing failed

2 attempts failed to build and test the latest attachment http://issues.apache.org/jira/secure/attachment/12364552/HADOOP-1739_2_20070825.patch against trunk revision r569589.

Test results:   http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/620/testReport/
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/620/console

Please note that this message is automatically generated and may represent a problem with the automation system and not the patch., Re-submitting patch, the failure of a hbase test in the previous run is unrelated to this patch; and it passes all tests on my machine. Fingers crossed., +1

http://issues.apache.org/jira/secure/attachment/12364552/HADOOP-1739_2_20070825.patch applied and successfully tested against trunk revision r569589.

Test results:   http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/622/testReport/
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/622/console, I think the current setting mapred.task.tracker.report.port should be removed rather than set to 0.

The value of 0 should be used in the code when setting up the task tracker.

I don't think having the @port@ available to the task command is useful and I'd suggest removing it completely. I think it is more direct to just put it directly on the Task jvm command options., I just committed this.  Thanks, Arun!, Reverted from trunk and 0.14 branch, since this wasn't really a regression, and the patch was incompatible., Since this can be fixed right-away by setting {{mapred.tracker.report.port}} to *zero* (there-by simulating the patch); and given the ambiguity about how to fix (or remove) {{@port@}} which depends on this, I'm marking this as a non-blocker., Here's a new version that:

 1. removes user-specification of the umbilical port, always letting the OS choose
 2. changes the default umbilical address to 127.0.0.1
 3. removes the @port@ option from mapred.child.jvm.opts
 4. puts both the parent address and port on the child command line, so that the child no longer relies on the config file to get the parent's address.

Question: does removing @port@ break anyone?
, +1 on Doug's patch, +1

http://issues.apache.org/jira/secure/attachment/12364719/HADOOP-1739_3.patch applied and successfully tested against trunk revision r570583.

Test results:   http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/636/testReport/
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/636/console, +1

Doug, could you also fix the <description> of mapred.child.java.opts in conf/hadoop-default.xml to remove reference to *@port@* & *mapred.task.tracker.report.port*? Thanks., I just committed this.]