[Trivial patch to add an implementation of the {{run}} method to the {{Count}} class. I manually verified that this fixes the test in HDFS., I'm not sure if this is the right spot, or if FsCommand.java's run method should have this as a body. Daryn, can you comment?, Yes, I think it should be FsCommand along with a few other small tweaks.  I can take over this bug if that's ok. I'm already in the process of testing a fix to retain complete compatibility., bq. I can take over this bug if that's OK.

Please do. Reassigning to you., make a few changes for better backwards compat, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12475845/HADOOP-7216-1.patch
  against trunk revision 1090039.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

    +1 system test framework.  The patch passed system test framework compile.

Test results: https://hudson.apache.org/hudson/job/PreCommit-HADOOP-Build/336//testReport/
Findbugs warnings: https://hudson.apache.org/hudson/job/PreCommit-HADOOP-Build/336//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://hudson.apache.org/hudson/job/PreCommit-HADOOP-Build/336//console

This message is automatically generated., There are no tests, because it's designed to fix tests in hdfs., +1 patch looks good., I have committed this.  Thanks Daryn!, Integrated in Hadoop-Common-trunk-Commit #546 (See [https://hudson.apache.org/hudson/job/Hadoop-Common-trunk-Commit/546/])
    HADOOP-7216. Add FsCommand.runAll() with deprecated annotation for the transition of Command base class improvement.  Contributed by Daryn Sharp
, Integrated in Hadoop-Common-trunk #656 (See [https://hudson.apache.org/hudson/job/Hadoop-Common-trunk/656/])
    HADOOP-7216. Add FsCommand.runAll() with deprecated annotation for the transition of Command base class improvement.  Contributed by Daryn Sharp
]