[4589_20081106.patch:
- added javadoc and comments
- rearranged codes for better readability
- changed map output key type to BooleanWritable
- removed duplicated file src/test/org/apache/hadoop/mapred/PiEstimator.java, 4589_20081107.patch: rewrote some comments and reverted some incorrect changes in TestTaskLimits, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12393548/4589_20081107.patch
  against trunk revision 712344.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 12 new or modified tests.

    -1 javadoc.  The javadoc tool appears to have generated 1 warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3561/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3561/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3561/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3561/console

This message is automatically generated., This looks good. Instead of writing files and using SequenceFileInputFormat, it would be better to get the offset and sample count directly from InputSplits. This could be a separate issue, Thanks, Chris. Let's do the SequenceFileInputFormat thing in a separated issue. I also have something else to improve PiEstimator.

BTW, the javadoc warning was due to HADOOP-4621., I just committed this., Integrated in Hadoop-trunk #660 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/660/])
    . Correct PiEstimator output messages and improve the code readability. (szetszwo)
]