[Deploying the site once again with this patch should work. , I committed this. , Hmm.  I think the intent of HADOOP-1066 was to remove about.html, moving most of its content to index.html, which is linked to from the "Main" tab.  Unless that's wrong, we ought to revert this patch and remove about.html and about.xml.  We should also then add a .htaccess file and put a redirect in it (see http://svn.apache.org/repos/asf/lucene/.htaccess for an example) so that about.html redirects to index.html.  Does that sound reasonable?
, i have checked HADOOP-1066 before committing this patch, but it seems HADOOP-1066 did not intentionally delete about.html links, and about.html contains some info that appears nowhere else. Anyhow i might be wrong in which case we can take the above route as suggested. , > contains some info that appears nowhere else

What information is only in about.html?  To me it looks mostly redundant with index.html, but if there's something important that's only in about.html we should make sure it isn't lost., I cannot see the these two sentences anywhere on the site(except for the wiki) : 
{noformat}
Hadoop has been demonstrated on clusters with 2000 nodes. The current design target is 10,000 node clusters.
{noformat}
and 
{noformat}
Hadoop is a Lucene sub-project that contains the distributed computing platform that was formerly a part of Nutch. This includes the Hadoop Distributed Filesystem (HDFS) and an implementation of map/reduce.
{noformat}

I will add these to index.html  remove about.html and redeploy the site. Is that OK ? Do we need redirection from about.html?, > I will add these to index.html remove about.html and redeploy the site. Is that OK ?

+1

> Do we need redirection from about.html?

Yes.  That page is the second hit when searching for "hadoop" on major search engines.
, The patch to revert the changes, remove about.xml , and add redirection from about.html to index.html. , +1, I committed the patch, redeployed the site and updated http://lucene.apache.org/hadoop. ]