[Though it's unlikely to happen in practice (metrics system initialization usually doesn't overlap with metrics source registration), it's probably worth fixing. The v1 patch make metrics impl in the DefaultMetricsSystem an AtomicReference., Though it's unlikely to happen in practice (metrics system initialization usually doesn't overlap with metrics source registration), it's probably worth fixing for posterity. The v1 patch make metrics impl in the DefaultMetricsSystem an AtomicReference., +1, I verified that with this patch, the jcarder cycle disappears. And the patch looks reasonable, though I don't know this area of the code well., Actually, I take it back. It fixes the first cycle, but there's a second one, attached here., v2 patch fixes the cycle in shutdown as well.

Todd, do you have a wiki page on how to run the jcarder on hadoop?, Yep, the wiki is here: http://wiki.apache.org/hadoop/HowToUseJCarder
Recently I've been using the more experimental "lockclasses" branch from my github, which supports analyzing readwrite locks, but the rest of the instructions should be the same. I'm working on getting access to the new build infrastructure so I can set up hudson jobs to run jcarder on a regular basis, bq. Yep, the wiki is here: http://wiki.apache.org/hadoop/HowToUseJCarder

Thanks. I was hoping for a simpler process/script to reproduce these graphs though :) I agree with you on the wiki that it's important to avoid false positives to reduce noise. These two cycles are already borderline and practically harmless, as unlike start/stop, init/shutdown doesn't overlap registration.

bq. I'm working on getting access to the new build infrastructure so I can set up hudson jobs to run jcarder on a regular basis

This will be a time saver. +1 and Thanks!, +1, patch looks good to me. Thanks Luke!, Committed v2 to trunk. Thanks Todd for reviewing!, Integrated in Hadoop-Common-trunk-Commit #741 (See [https://builds.apache.org/job/Hadoop-Common-trunk-Commit/741/])
    HADOOP-7529. Fix lock cycles in metrics system. (llu)

llu : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1157187
Files : 
* /hadoop/common/trunk/hadoop-common/CHANGES.txt
* /hadoop/common/trunk/hadoop-common/src/main/java/org/apache/hadoop/metrics2/lib/DefaultMetricsSystem.java
]