[Fixing the test for this case seems to make more sense here., Hi Luke. Does this attached patch fix the issue on your OSX box?, Looks like we attach pretty much the same patch at the same time :), +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12443532/hadoop-6747.txt
  against trunk revision 940527.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/496/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/496/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/496/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/496/console

This message is automatically generated., + 0 on this; I think its important for the tests to pass, it just irritates me whenever the underlying OS fails differently from other ones and you have to look for string messages to find the cause -very, very brittle. Might be best to say "this is macos and we see invalid argument" to lock down the platforms looked at, though that is equally painful., +1
I've committed this.  I went with Todd's patch because it included a bit of explanation as to why this case was being handled (and despite ending with .txt, which isn't helpful for large patches).

Thank you Todd.  Resolving as fixed., Integrated in Hadoop-Common-trunk-Commit #271 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Common-trunk-Commit/271/])
    HADOOP-6747. TestNetUtils fails on Mac OS X (Todd Lipcon via jghoman)
, Integrated in Hadoop-Common-trunk #350 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Common-trunk/350/])
    HADOOP-6747. TestNetUtils fails on Mac OS X (Todd Lipcon via jghoman)
]