[The namenode was not cleaning up the last block on lease recovery. 

Also, added a unit test to test this behaviour., I'm guessing this also means, if client fails while writing, it has to delete the stale file before retrying.
If that's the case, I'd like to ask this to be in 0.15.3.
, Dhruba, is this patch ready?  Can we get it reviewed, Hudson'd and committed to trunk and branch-015 by EOD Jan 11., It is being reviewed by Konstatin. It shoudl go into 015.3., > The namenode was not cleaning up the last block on lease recovery.

You mean it was not cleaning up the last block if it is a one block file, right?
This looks right to me.
I only don't like exposing the opportunity of changing lease intervals directly through the NameNode calls.
I'd rather introduce undocumented configuration variables. We used to do this in the past afair.

- FSDataOutputStream stm in TestFileCreation.testFileCreationError2() is not used anywhere.
Could you please also remove other warnings in this file.
- import org.apache.hadoop.fs.FsShell; is redundant
  import org.apache.hadoop.util.StringUtils; is redundant
- TEST_ROOT_DIR is never read locally.
- "this.assertEquals" should be replaced by simply "assertEquals" because assertEquals() is a static method., I incorporated all of Konstantin's comments except the one about "hidden" configuration variables. In this case, I want to change th lease period in the middle of the test and not at cluster startup time. Hence, setting hidden configuration variables do not help.
, +1 overall.  Here are the results of testing the latest attachment 
http://issues.apache.org/jira/secure/attachment/12372952/recoverLastBlock2.patch
against trunk revision r611333.

    @author +1.  The patch does not contain any @author tags.

    javadoc +1.  The javadoc tool did not generate any warning messages.

    javac +1.  The applied patch does not generate any new compiler warnings.

    findbugs +1.  The patch does not introduce any new Findbugs warnings.

    core tests +1.  The patch passed core unit tests.

    contrib tests +1.  The patch passed contrib unit tests.

Test results: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/1551/testReport/
Findbugs warnings: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/1551/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/1551/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/1551/console

This message is automatically generated., I just committed this., Integrated in Hadoop-Nightly #363 (See [http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Nightly/363/])]