[This patch:
  1. Adds a reset method for statistics, so that when the framework switches to a new task, it can clean the counters.
  2. Removes the map from scheme to statistics, since it was only used to iterate through.
  3. Removes a race condition where the map was passed back out of the synchronized method, which could cause ConcurrentModificationException., This looks good. Just two nits:
* The current patch generates a javadoc warning, and has a malformed reference to the non-existent method getFileSystemClasses in the docs for {{FileSystem::getStatistics}}
* This should have a unit test, but that can be part of a separate issue (possibly once HADOOP-5437 is fixed)

+1 for the functional changes, This patch fixes a javadoc warning and the broken javadoc link that Chris commented on. It also extends the testcase from HADOOP-5437 to detect the file system statistics not being cleared between tasks., This patch is updated to current trunk., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12404795/h5585.patch
  against trunk revision 762509.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    -1 Eclipse classpath. The patch causes the Eclipse classpath to differ from the contents of the lib directories.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/158/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/158/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/158/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/158/console

This message is automatically generated., Some of the unit tests were creating LocalFileSystem directly, which wasn't getting them initialized correctly. I changed their setup to call FileSystem.getLocal instead of new LocalFileSystem., +1 TestSequenceFile passes with the latest patch on my machine, I just committed this., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12404867/h5585.patch
  against trunk revision 762987.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 10 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/162/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/162/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/162/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/162/console

This message is automatically generated.]