[I'd like to volunteer for this issue, after my patch for HADOOP-7006, which involves the same part of the codebase.
, Make "source file pattern" work., this patch make "source file pattern" work., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12480923/HADOOP-6387.patch
  against trunk revision 1128789.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    -1 javac.  The patch appears to cause tar ant target to fail.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed these core unit tests:


    -1 system test framework.  The patch failed system test framework compile.

Test results: https://builds.apache.org/hudson/job/PreCommit-HADOOP-Build/541//testReport/
Findbugs warnings: https://builds.apache.org/hudson/job/PreCommit-HADOOP-Build/541//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/hudson/job/PreCommit-HADOOP-Build/541//console

This message is automatically generated., Using checkDest adds new logic that I don't think is warranted:  The dest is supposed to be a file per the usage of copyMerge.  With this change, if the given dest is a directory then the output is the dest + basename of the first source directory. I feel that's unexpected and surprisingly behavior, so I'd like to see that reverted.

There's an easier way to get at the full arg list higher in the call stack: processArguments().  Hooking in there and eliminate processPath(s) since those are intended to process each path individually.  In processArguments, make a call to super (don't copy-n-paste like in the patch), and then call FileUtil's copymerge.  Implement processPathArgument with a null body to short-out the calls to the now removed processPath(s).

(Just an aside: I've been tempted to eliminate the call to FileUtils and just use processPath to append to the dst file), HADOOP-8140 made getmerge handle files, directories, and globs.]