[Need the hdfs side change for the tests to pass., Patch attached., Per HDFS-1088, minor update to report file names in the exceptions., +1 for the patch., The tests in this patch won't pass until the patch to HDFS-1100 is applied, however that patch won't compile until this change is checked in (these tests use unwrapException but require the sub-class override it)., Eli, this patch does not apply to trunk. Can you please resubmit the patch., This jira applies after HADOOP-6563 (which makes a bunch of changes to the test classes)., Patch attached removed the dependency on HADOOP-6563 and merges with trunk. This one just needs to go in with HDFS-1100 which has a +1. , +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12443017/hadoop-6703-3.patch
  against trunk revision 938590.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 6 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/485/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/485/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/485/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/485/console

This message is automatically generated., +1 for the patch., I committed the patch. Thank you Eli.]