[[~jb@nanthrax.net] You closed bunch of bugs as fixed. Is it because the issues you observed no longer happen?, [~jb@nanthrax.net] - seems this issue is not resolved. How did you resolve it. Could you help us.

[~elizabetht] - FYI, Hi, yes, when I tested (on trunk), the bugs worked. I gonna test it again. If it fails again, it means that it's back or it's a random failure.

Let me take a new look on that. I will get back to you soon., [~jb@nanthrax.net] I checked out the source code from the trunk (http://svn.apache.org/repos/asf/hadoop/common/trunk and revision 1514608) which is the latest successful build from the link https://builds.apache.org/job/Hadoop-trunk-Commit/4280/.

On running a "mvn install", the following tests fail, which includes the above three tests.
===================================================================================================================
Results :

Failed tests:   testGracefulFailoverFailBecomingActive(org.apache.hadoop.ha.TestZKFailoverController): Did not fail to graceful failover when target failed to become active!
  testGracefulFailoverFailBecomingStandby(org.apache.hadoop.ha.TestZKFailoverController): expected:<1> but was:<0>
  testGracefulFailoverFailBecomingStandbyAndFailFence(org.apache.hadoop.ha.TestZKFailoverController): Failover should have failed when old node wont fence
  testCachingRelaysResolveQueries(org.apache.hadoop.net.TestStaticMapping): Expected two entries in the map Mapping: cached switch mapping relaying to static mapping with single switch = false(..)
  testCachingCachesNegativeEntries(org.apache.hadoop.net.TestStaticMapping): Expected two entries in the map Mapping: cached switch mapping relaying to static mapping with single switch = false(..)
  testResolve(org.apache.hadoop.net.TestTableMapping): expected:</[rack1]> but was:</[default-rack]>
  testTableCaching(org.apache.hadoop.net.TestTableMapping): expected:</[rack1]> but was:</[default-rack]>
  testClearingCachedMappings(org.apache.hadoop.net.TestTableMapping): expected:</[rack1]> but was:</[default-rack]>
  testNormalizeHostName(org.apache.hadoop.net.TestNetUtils): expected:<[67.215.65.145]> but was:<[UnknownHost123]>

Tests in error: 
  testGracefulFailover(org.apache.hadoop.ha.TestZKFailoverController): test timed out after 25000 milliseconds
  testChown(org.apache.hadoop.fs.TestFsShellReturnCode): test timed out after 30000 milliseconds
  testChgrp(org.apache.hadoop.fs.TestFsShellReturnCode): test timed out after 30000 milliseconds

Tests run: 2128, Failures: 9, Errors: 3, Skipped: 71
=========================================================================================================================
Should I checkout the code from elsewhere so that I could run these unit tests successfully? Or is there a pre-requisite/configuration for these tests (like any Unix service or any other apache services like ZooKeeper to be up) to run successfully on a Unix machine? I believe these unit tests should not have any dependencies. 

Could you pls provide your pointers?, Oops, I included the wrong resolver. Including the correct resolver [~jbonofre]. 

Jean, could you pls provide pointers? I still see these failure in test cases when I do a "mvn install" on the source code., bq. You closed bunch of bugs as fixed. Is it because the issues you observed no longer happen?
Earlier my question was not answered. Now that I understand the reason for closing the issues, the resolution is incorrect. It should be "not a problem". I am updating the resolution.

If this issue, based on discussions that is going on, is found to be a real issue, please re-open the jira again., [~sureshms] and [~jbonofre] 

I am attempting to build the Hadoop source code and run all the unit tests before I get started to work on the trivial hadoop issues.

Could you pls help with pointers on how to get the "mvn test" or "mvn install" to run successfully for the source-code checked out from trunk, ignoring these errors/failures?

Are these failure scenarios to be ignored? , As given in the http://wiki.apache.org/hadoop/HowToContribute section, I would like to run all the unit test cases before constructing my patch. Pls help with your insights.]