[removed sun.management.ConnectorAddressLink;
instead user will have to run jstat to get the JMX connect url (see -help)

also re-formatted the file., ran ant javadoc-dev

0 warnings., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12402401/HADOOP-5507.patch
  against trunk revision 755589.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/101/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/101/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/101/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/101/console

This message is automatically generated., it is using same tests, this change was in argument procession only., Boris, the patch fixes the problem described in this issue.  It also changes many code formatting.  The formatting changes are good but it is unrelated to this issue.  I will commit this for saving work cycles.  Next time, please create new issues for fixing other problems.  Otherwise, it would be hard to track issues., I committed this.  Thanks, Boris!, Integrated in Hadoop-trunk #785 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/785/])
    . Fix JMXGet javadoc warnings.  (Boris Shkolnik via szetszwo)
]