[Can you please attach a patch file for this?  Thanks!

http://wiki.apache.org/lucene-hadoop/HowToContribute

Tom, does this look right to you?  I worry a bit about the manipulation of paths as strings, but haven't yet looked deeply at what this is doing., I too am uncertain whether that code is correct, but surely the "/" should be replaced with File.fileSeparator.

But actually:

Path newDst = new Path(absoluteDst.toString()+File.fileSeparator+absoluteSrc.getName());
 
Should probably be:

Path newDst = new Path(absoluteDst, absoluteSrc.getName());

, I agree the path manipulation looks wrong. I'm currently writing a set of test cases - there's a surprising number of them., There are a couple of things that I would change:

1. There are a number of additional checks that need performing before doing the rename. For example, checking if src exists.
2. It would be simpler and more efficient to use S3's ability to match all paths with a given prefix, rather than using listPathsRaw recursively. This entails adding a listDeepSubPaths method to FileSystemStore.

I'll create a patch to do this., I can committe this patch and it works fine. I have tested several cases to make sure it works fine. But, if you are going to committe a cleaned up version, then I'll wait for that one. , I've attached a patch which does some additional checks and uses a new method listDeepSubPaths to retrieve all subpaths in one S3 operation. It includes unit tests.

Note that, unlike Mike's code, a rename will fail (return false) if the parent directory of the destination does not exist, which I believe is consistent with HDFS. Mike - could you check that this patch works for your use case please?, Thanks Tom. I just tested the patch and it works fine., Thanks Mike!, I just committed this.  Thanks, Tom!, -1, because the patch command could not apply the latest attachment (http://issues.apache.org/jira/secure/attachment/12349348/hadoop-901.patch) as a patch to trunk revision r498829. Please note that this message is automatically generated and may represent a problem with the automation system and not the patch.]