[Patch that fixes the issue is attached., A patch that fixes the issue is attached.  

There is no new test included with this submission.  This is because testing of this code requires a KFS deployment and that is done elsewhere., +1 This looks good. Not sure how TestKosmosFileSystem works, but easy enough to add a check?, You could subclass FileSystemContractBaseTest and get this and lots of other tests for free. See TestHDFSFileSystemContract for an example of what to do., Updated the patch with a test., +1. Toms suggestion is good, may be could track it in another JIRA. , -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12385538/patch.3716
  against trunk revision 675078.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 6 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    -1 findbugs.  The patch appears to cause Findbugs to fail.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2821/testReport/
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2821/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2821/console

This message is automatically generated., Updated patch for inclusion., Updated patch with a testcase for the new code is attached., Updated patch looks good. 
test-patch passes and also the Kosmos related testcase.
[exec] 
[exec] +1 overall.  
[exec] 
[exec]     +1 @author.  The patch does not contain any @author tags.
[exec] 
[exec]     +1 tests included.  The patch appears to include 6 new or modified tests.
[exec] 
[exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
[exec] 
[exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
[exec] 
[exec]     +1 findbugs.  The patch does not introduce any new Findbugs warnings.
[exec] 

test-core:
    [mkdir] Created dir: /home/lohit/tmp/hadoop-core-trunk/build/test/data
    [mkdir] Created dir: /home/lohit/tmp/hadoop-core-trunk/build/test/logs
    [junit] Running org.apache.hadoop.fs.kfs.TestKosmosFileSystem
    [junit] Tests run: 3, Failures: 0, Errors: 0, Time elapsed: 0.481 sec

It should be good to commit not waiting for hudson. , I just committed this. Thanks, Sriram, Integrated in Hadoop-trunk #581 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/581/])]