[I cannot reproduce it.  I guess this one might be nondeterministic., 3. HADOOP-1985. This addresses rack-awareness for Map tasks and for HDFS in a uniform way. Contributed by Devaraj Das. looks like a possible candidate for failures. Devaraj could you take a look at it ?
, The failure is intermittent on Windows. It is consistently failing on Linux, this patch intoduces a method in minidfs which waits for cluster to get out of safemode and uses that in TestFsck. Mukund can you try this patch out? I cannot get hte tests to fail on my machine.. , +1. Code looks good., I tested the patch on Linux and all tests passed, +1 overall.  Here are the results of testing the latest attachment 
http://issues.apache.org/jira/secure/attachment/12376852/HADOOP-2912_1.patch
against trunk revision 619744.

    @author +1.  The patch does not contain any @author tags.

    tests included +1.  The patch appears to include 6 new or modified tests.

    javadoc +1.  The javadoc tool did not generate any warning messages.

    javac +1.  The applied patch does not generate any new javac compiler warnings.

    release audit +1.  The applied patch does not generate any new release audit warnings.

    findbugs +1.  The patch does not introduce any new Findbugs warnings.

    core tests +1.  The patch passed core unit tests.

    contrib tests +1.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1879/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1879/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1879/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1879/console

This message is automatically generated., I just committed this. Thanks Mahadev!, Integrated in Hadoop-trunk #418 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/418/])]