[dfs.blocksize is the new name for dfs.block.size as of HDFS-631. But the old one should still work as well, unless both are set. How were you using the dfs.block.size configuration, and are you sure you didn't have both settings set?, I have first tried to set dfs.block.size in the hdfs-site.xml file and nothing else, cause i didn't known anything about the new name. I have copied the configuration (hdfs-site.xml) to all data nodes (only three in my case) and checked that several times. Completely removed all contents from the HDFS storage and reformatted the namenode (removed also the data directories from the data nodes).  It doesn't change anything. The files in HDFS used 64 MiB block size based on the display in the file system  browser (Web-UI). After that i changed the name from dfs.block.size to dfs.blocksize in the hdfs-site.xml file. And then completely removed things from cluster etc. and from that point it worked. Now the change of the block size via command line option like this: 
{{hadoop fs -Ddfs.blocksize=67108864 -copyFromLocal result.log /user/km/tapelogs/logfile-test-64MB.log}} works.
I tried several time with the following:
{{hadoop fs -Ddfs.block.size=134217728 -copyFromLocal result.log /user/km/tapelogs/logfile-test-64MB.log}} but this didn't work either. So in my opinion this is not only a documentation bug.
, I looked into this a bit on 0.22(ish) while trying to test another feature (in early November, I think?).  At the time, dfs.blocksize was used in:

{noformat}
    hdfs-default.xml
    hdfs/DFSConfigKeys.java
    hdfs/server/namenode/TestHDFSConcat.java
{noformat}

dfs.block.size was used in:

{noformat}
    Hadoop FAQ
    hadoop-hdfs/src/c++/libhdfs/hdfs.c 
    hdfsproxy-default.xml
    documentation/content/xdocs/hdfsproxy.xml
    hdfs/HdfsConfiguration.java
    fs/TestFiRename.java
    hdfs/server/namenode/TestBlockTokenWithDFS.java
    hdfs/TestFileConcurrentReader.java
{noformat}

(I realize the paths are incomplete; so are my notes at this point.)

Perhaps this JIRA should be under HDFS rather than common?, A potential issue here is that the dfs.block.size deprecation is done in HdfsConfiguration, so if somone is using just using the Configuration object the deprecated config won't work.  ]