[We could do something like:

hod script -d cluster-dir -n nodes --hod.cmd "hadoop jar hadoop-examples.jar wordcount input output"

OR

hod cmd -d cluster-dir -n nodes --hod.cmd "hadoop jar hadoop-examples.jar wordcount input output"

Preferences / alternate suggestions ?

One thing to think about is which hadoop we will use. I propose we just pick what's in the path, and let the user set it up correctly. In some setups, admins set up the path for the users, so the above example would just work. If a tarball is being used, the user has to untar the tarball somewhere and set the path correctly.

Alternatively, she can always define: 

hod script -d cluster-dir -n nodes --hod.cmd "/foo/bar/hadoop jar hadoop-examples.jar wordcount input output"

More generically - we don't interpret anything inside hod.cmd, but pass it as such to the shell. 

Another thing to note is the quotes around the hadoop command. I can't think of any better way than this to specify a sub-command, without keeping from getting into positional arguments . So, in the above example, one could also say:

hod script --hod.cmd "/foo/bar/hadoop..." -d cluster-dir -n nodes

Again, alternate suggestions welcome.,    - Interface: The second interface ( hod cmd -d cluster-dir -n nodes --hod.cmd "hadoop jar hadoop-examples.jar wordcount input output" ) looks clearer, piggybacking it into script sub-command doesn't look natural(to me atleast).
   - Hadoop Home: +1 for the suggestion to pick it from path if relative, and use it directly if it is an absolute path. Even while using a simple allocate command, user has to untar his/her tarball and set the path accordingly to run hadoop commands, so this is inline with regular usage.
   - Putting the command in quotes is the way it used to be hod 0.3(internal version) : hod -m 3 -a 'run jar ...' . So this should be ok, just that users have to realise it will be passed, as is, to the shell without any interpretation by HOD. Double quotes are more useful(than single quotes) as shell can expand any parameters present., Thinking more about the interface, and re-reading what is earlier said(Arkady over mail to Hemanth) - "it is more generally assumed that -s option can take command, and not a file name". If that is the case, it makes more sense to have it done through the script sub-command itself. That would also mean adding no extra sub-commands, as well as using the code already in place.

As a aside, if we go with this, can hod.cmd also be a series of commands(separated by a semi-colon), and not just a single command ? Note that this is not an implementation detail, it is about how hod interface will be used; if series of commands is how users use it in general, then there will be redundant ways of doing it - a script file or  via hod.cmd., This is an API addition. Not suitable for a dot-dot version., Revisiting the choice of the interface, I have another alternative (hopefully better than the above two),
bq. {{ echo  "hadoop jar hadoop-examples.jar wordcount input output" | hod script -d cluster-dir -n nodes -s - }}

This way we have the following advantages:
   - As in my previous comment - "it is more generally assumed that -s option can take command, and not a file name". So, makes more sense to have it done through the script sub-command itself - no extra sub-commands, reusing existing code (comparison with interface #2).
   - It avoids having redundant ways of doing the same thing - via hod.cmd and via script file (comparison with interface #1)
   - This is a standard unix way of doing things: when you want to give a string to a utility yet you don't want to create and pass a file yourselves, you can instead pipe into it using the special argument "-". For e.g, echo "sleep" | cat -

Note that HOD might still create a temporary file internally and fill it with the given hadoop commands, before running; this is the case in all the interfaces proposed., +1 for the proposal. I think all advantages you mention are compelling. Comments from others ?, Moving out of the 0.18 queue as these could not make the feature freeze date., hod contrib was removed]