[Attaching a fix that logs task-failed line only if the attempt was successful on the lost tracker. So for an attempt that was successful on the lost tracker the history lines will look like
{code}
Task Reduce Start
Attempt Reduce Start
Attempt Reduce Killed 
Task reduce Killed
{code}
and for the attempt that was running on the lost tracker, the history lines will look like
{code}
Task Reduce Start
Attempt Reduce Start
Attempt Reduce Failed 
{code}, Looked at the patch. This looks fine. One minor comment is to replace the nested conditional statement with a more clear if..else if..else block as it is really hard to read the current code.

Please run test-patch and ant tests and upload the results., Incorporating Hemanth's comments. Result of _test-patch_ is as follows :
{code}
[exec] -1 overall.  
     [exec] 
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec] 
     [exec]     -1 tests included.  The patch doesn't appear to include any new or modified tests.
     [exec]                         Please justify why no tests are needed for this patch.
     [exec] 
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec] 
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec] 
     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs warnings.
     [exec] 
     [exec]     +1 Eclipse classpath. The patch retains Eclipse classpath integrity.
     [exec] 
     [exec]     +1 release audit.  The applied patch does not increase the total number of release audit warnings.
{code}
Tests in HADOOP-4191 should validate this fix., I tested this patch with HADOOP-4191 and I see that the history file lines are in the expected order(as mentioned above by Amar) with this patch.

+1, ant-test passed on my local box., When I tried to apply the patch on Linux, it worked fine, but the same patch did not work on people.apache.org. Hence just regenerated the patch on Linux and uploading it.

As there's no difference at all in the patch, I will commit it., I committed this to trunk and branch-0.20. Thanks, Amar !, Integrated in Hadoop-trunk #763 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/763/])
    ]