[Attaching a proposal for the fix. This is a branch-1 compatible change. Will prepare a trunk patch once everyone is happy with the fix., Have tests been run on both Windows and Linux to verify?, Thanks for reviewing Bikas!

bq. Have tests been run on both Windows and Linux to verify?
Yes, I've the tests on both Windows and Linux.
, lgtm. Looks good to go unless more experienced folks have concerns., Hi Ivan,

Is this still a problem in trunk?  TestingGroups in trunk has underlyingImplementation as a field and uses it when the result is null.

BTW, I tried to add only the new test in TestUserGroupInformation without other changes to branch-1.  The new test still passed., Thanks for bringing this up Nicholas! I have not tested this in trunk, just scanned through the trunk implementation of UserGroupInformation.java (but missed the {{underlyingImplementation}} detail). Let me take a look if the trunk fix addresses the problem completely, and if yes, I guess we can back port the fix to branch-1 if needed. , Additionally, I think Nicholas also mentions that the new test seems to be passing even without the new code changes. Would be worth double checking that., The underlyingImplementation code was introduced by HADOOP-7389., Thanks Nicholas, Bikas!

The patch for HADOOP-7389 works fine, so I would like to propose to port it to branch-1-win (ported patch attached). Please let me know if I can do something to help with the process besides providing the patch.


PS.
bq. I tried to add only the new test in TestUserGroupInformation without other changes to branch-1. The new test still passed.
You are right, my bad. The new test would have to be the first in the list, otherwise the real user groups are already cleaned up.
, Just to add, I still think it would be useful to remove comments from TestQueueManager.java that refer to this Jira, as this is no longer needed. , I attached the patch to HADOOP-7389 so that someone can backport the fix. I guess it should be fine to resolve this Jira as a duplicate of HADOOP-7389., +1 patch looks good., I have committed this.  Thanks, Ivan!, Closed upon release of Hadoop-1.1.0.]