[Here is a patch doing the following:

1. Removes the static configuration variable, commandLineConfig from JobClient.
2. Moves the cli parsing from JobShell to GenericOptionsParser. Thus removes the class org.apache.hadoop.mapred.JobShell .
3. Refactors TestJobShell as TestCommandLineJobSubmission, which tests the command line options -files, -libjars
4. testshell.ExternalMapReduce class is modified to implement org.apache.hadoop.util.Tool, sothat it can be run from ToolRunner., +1 looks good. 
Only one thing -- the test (which is my fault) creates a file files_tmp in the workspace of hadoop (the top level dir of hadoop) -- there is a bug filed to fix that. If you can fix that as a part of this patch, that would be great -- or else i will fix it.
http://issues.apache.org/jira/browse/HADOOP-3240 is the issue for this problem.

, trying to run hudson again, +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12382910/patch-3417.txt
  against trunk revision 661918.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 16 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2533/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2533/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2533/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2533/console

This message is automatically generated., I just committed this. Thanks, Amareshwari!, the commit missed to svn add a new file (a test case) in the patch. That is TestCommandLineJobbSubmission.java.

Can you fix it devaraj?]