[BTW, all other calls to LocalDirAllocator first call AllocatorPerContext.confChanged, that is responsible for initialising the localDirsPath. Inserting that call fixes the NullPointerException., Attached patch removes the ifExists API and AllocatorPerContext.ifExists API as well. Could someone please review ?, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12543815/HADOOP-8765.patch
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 eclipse:eclipse.  The patch built with eclipse:eclipse.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed unit tests in hadoop-common-project/hadoop-common.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-HADOOP-Build/1404//testReport/
Console output: https://builds.apache.org/job/PreCommit-HADOOP-Build/1404//console

This message is automatically generated., bq. -1 tests included. The patch doesn't appear to include any new or modified tests.
bq. Please justify why no new tests are needed for this patch.
bq. Also please list what manual steps were performed to verify this patch.

The patch removes code. Hence, no new tests., Patch for branch 1.x, where the ifExists API is still used by IsolationRunner. 

While writing a test for this, I realized that mostly the usage pattern of LocalDirAllocator is going to first do a write / read that will end up initializing the localDirsPath variable. Hence, the significance of this patch is only to the extent that it got IsolationRunner working for me and no real impact anywhere else., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12544036/HADOOP-8765-for-1-0-x.patch
  against trunk revision .

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-HADOOP-Build/1409//console

This message is automatically generated., \\
\\
| (x) *{color:red}-1 overall{color}* |
\\
\\
|| Vote || Subsystem || Runtime || Comment ||
| {color:red}-1{color} | patch |   0m  0s | The patch command could not apply the patch during dryrun. |
\\
\\
|| Subsystem || Report/Notes ||
| Patch URL | http://issues.apache.org/jira/secure/attachment/12544036/HADOOP-8765-for-1-0-x.patch |
| Optional Tests | javadoc javac unit findbugs checkstyle |
| git revision | trunk / f1a152c |
| Console output | https://builds.apache.org/job/PreCommit-HADOOP-Build/6259/console |


This message was automatically generated., Still unused, still ready for deletion.

Any plans to update this patch to trunk?, | (x) *{color:red}-1 overall{color}* |
\\
\\
|| Vote || Subsystem || Runtime || Comment ||
| {color:blue}0{color} | {color:blue} reexec {color} | {color:blue}  0m  0s{color} | {color:blue} Docker mode activated. {color} |
| {color:red}-1{color} | {color:red} patch {color} | {color:red}  0m  8s{color} | {color:red} HADOOP-8765 does not apply to trunk. Rebase required? Wrong Branch? See https://wiki.apache.org/hadoop/HowToContribute for help. {color} |
\\
\\
|| Subsystem || Report/Notes ||
| JIRA Issue | HADOOP-8765 |
| JIRA Patch URL | https://issues.apache.org/jira/secure/attachment/12544036/HADOOP-8765-for-1-0-x.patch |
| Console output | https://builds.apache.org/job/PreCommit-HADOOP-Build/11759/console |
| Powered by | Apache Yetus 0.5.0-SNAPSHOT   http://yetus.apache.org |


This message was automatically generated.

]