[-1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12484703/HADOOP-7433.patch
  against trunk revision 1140442.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 system test framework.  The patch passed system test framework compile.

Test results: https://builds.apache.org/job/PreCommit-HADOOP-Build/686//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-HADOOP-Build/686//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-HADOOP-Build/686//console

This message is automatically generated., Where does $DIST_LIB_DIR/$BUILD_PLATFORM get created?

testing?  ant -Dbundle.snappy=true compile-native tar blows up for me w this patch., I was working on an unclean branch.

Plus it seems hadoop-common TAR is not setting the hadoop SO files in the correct directory, like not using the $OS_ARC path (need to verify that, will open a new JIRA if that is the case), Turns out this is a generic native issue. The native libs are built in a platform-specific dir but this is not preserved when the files are copied in the tarball.

{noformat}
common (trunk)$ find . -name \*.so./build/hadoop-common-0.23.0-SNAPSHOT/lib/native/libhadoop.so
./build/native/Linux-amd64-64/.libs/libhadoop.so
./build/native/Linux-amd64-64/lib/libhadoop.so
common (trunk)$ tar tfz /home/eli/src/hadoop1/common/build/hadoop-common-0.23.0-SNAPSHOT.tar.gz|grep libhadoop
hadoop-common-0.23.0-SNAPSHOT/lib/native/libhadoop.a
hadoop-common-0.23.0-SNAPSHOT/lib/native/libhadoop.la
{noformat}
, HADOOP-6671 is fixing this., See HADOOP-7807]