[Rearrange build target for jsvc and task-controller to be invoked by "package" and "bin-package" target instead of dependent target., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12501681/HADOOP-7784-branch-20-security.patch
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-HADOOP-Build/345//console

This message is automatically generated., build and deployed a secure and a non secure cluster with the patch applied and all datanodes came up as expected., I see the following error after applying the patch on 0.20 security branch.

{noformat}
ant -Dcompile.c++=true -Dcompile.native=true clean rpm 
      [rpm] error: Installed (but unpackaged) file(s) found:
      [rpm]    /hadoop-0.20.206.0-SNAPSHOT/.eclipse.templates/.launches/AllTests.launch
      [rpm]    /hadoop-0.20.206.0-SNAPSHOT/.eclipse.templates/.launches/DataNode.launch
      [rpm]    /hadoop-0.20.206.0-SNAPSHOT/.eclipse.templates/.launches/JobTracker.launch
      [rpm]    /hadoop-0.20.206.0-SNAPSHOT/.eclipse.templates/.launches/NameNode.launch
      [rpm]    /hadoop-0.20.206.0-SNAPSHOT/.eclipse.templates/.launches/SpecificTestTemplate.launch
      [rpm]    /hadoop-0.20.206.0-SNAPSHOT/.eclipse.templates/.launches/TaskTracker.launch
      [rpm]    /hadoop-0.20.206.0-SNAPSHOT/.eclipse.templates/README.txt
      [rpm]     File listed twice: /usr/libexec
      [rpm]     File listed twice: /usr/libexec/hadoop-config.sh
      [rpm]     File listed twice: /usr/libexec/jsvc.amd64
{noformat}


We should not be packaging eclipse templates as part of the rpm.

Adding eclipse.templates to the hadoop package was introduced by HADOOP-7653 [this patch is committed only to the security branch and not to the 205 branch].

, Update patches to reflect difference in 20 security branch and 20.205 security branch., +1 looks good.

with this patch we no more have to call the task-controller target explicitly while building rpm or deb package., I just committed this to 0.20 security branch and 0.20.205 security branch, thanks Arpit and Giri., I just committed this to 0.20.205.1.  Thanks Arpit for spotting the uncommitted change., Closed upon release of version 1.0.0.]