[I looked at this problem. It stems from the fact that JobClient creates a new JobConf rather than use the Configuration from ToolBase. It would be nice to have a version of the CLI parsing library that wasn't based on ToolBase and OO inheritance, since clearly part of what happened here was too much OO magic not making the required usage clear., > It would be nice to have a version of the CLI parsing library that wasn't based on ToolBase and OO inheritance,

See GenericOptionsParser that Enis added under util. This is the one used by ToolBase., The problem is ındeed in the JobConf initialization. The patch fixes the problem, changes {{LocalJobRunner#getJobStatus}} and {{#getJobProfile}} to return null if job could not be found. Now we have undocumented feature that the methods at {{JobSubmissionProtocol}} expects valid arguments(existing jobid's), but  {{JobSubmissionProtocol#getJobStatus()}} and {{JobSubmissionProtocol#getJobProfile()}} does not. 

lohit could you please try the patch, and report back if it works.  , Previous patch was against trunk, this one is targeted at 0.14.2. , +1 overall.  Here are the results of testing the latest attachment 
http://issues.apache.org/jira/secure/attachment/12366884/NPEinJobClient_v1.hadoop-0.14.patch
against trunk revision r581101.

    @author +1.  The patch does not contain any @author tags.

    javadoc +1.  The javadoc tool did not generate any warning messages.

    javac +1.  The applied patch does not generate any new compiler warnings.

    findbugs +1.  The patch does not introduce any new Findbugs warnings.

    core tests +1.  The patch passed core unit tests.

    contrib tests +1.  The patch passed contrib unit tests.

Test results: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/862/testReport/
Findbugs warnings: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/862/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/862/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/862/console

This message is automatically generated., Hi Enis,

I tried your patch on 0.14.1 and both -status and -kill works. 

Thanks!, I just committed this. Thanks, Enis!, Integrated in Hadoop-Nightly #258 (See [http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Nightly/258/])]