[This jira also introduces a checkTGTAndReloginFromKeytab method, which performs relogin only if TGT is closed to expiry., ant test and test-patch were run manually.
All tests pass.

test-patch results:

     [exec] +1 overall.  
     [exec] 
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec] 
     [exec]     +1 tests included.  The patch appears to include 3 new or modified tests.
     [exec] 
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec] 
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec] 
     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs warnings.
     [exec] 
     [exec]     +1 release audit.  The applied patch does not increase the total number of release audit warnings.
     [exec] 
     [exec]     +1 system tests framework.  The patch passed system tests framework compile.
, Some comments:
1) Seems like you copy-pasted the 0.20 version of getTGT (from your patch on HDFS-1364). The trunk version in the ticket renewal thread is slightly different.
2) Let's bite the bullet and remove the check for hasSufficientTimeElapsed in the reloginFromKeytab method. We may do the same for reloginFromTicketCache in a follow-up jira.
3) The testcase can be removed. I don't think it is adding value. If it can be improved, fine (i understand its hard to write a unit test for this without a Kerberos test infrastructure).. otherwise a note on manual testing should be sufficient., New patch addressing the comments.

The testcase has been removed. The patch been tested manually for 20 branch as pointed by Devraj., I just committed this. Thanks, Jitendra!
(I'll raise a jira for the follow up work on cleaning up reloginFromTicketCache, removing User.lastLogin, etc.), Integrated in Hadoop-Common-trunk-Commit #380 (See [https://hudson.apache.org/hudson/job/Hadoop-Common-trunk-Commit/380/])
    HADOOP-6965. Introduces checks for whether the original tgt is valid in the reloginFromKeytab method. Contributed by Jitendra Pandey.
, Integrated in Hadoop-Common-trunk #465 (See [https://hudson.apache.org/hudson/job/Hadoop-Common-trunk/465/])
    HADOOP-6965. Introduces checks for whether the original tgt is valid in the reloginFromKeytab method. Contributed by Jitendra Pandey.
]