[This patch uses two thread pools, one for moving blocks and another for scheduling block moves., - It is better to use ExecutorService.submit(...) than Executor.execute(...).  A Future object will be returned by submit(...) and it can be used for waiting the task termination.  Then, dispatcherCount is not needed.

- The InterruptedException in dispatchBlockMoves() should not be ignored.  We need to shutdown the ExecutorService and terminate the program., This patch incorporates Nicholas' comments. Thanks, Nicholas!, +1 patch looks good, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12384331/balancerThread1.patch
  against trunk revision 670086.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    -1 findbugs.  The patch appears to introduce 2 new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2713/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2713/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2713/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2713/console

This message is automatically generated., Existing balancer tests are passed that verify the correctness of the patch.

I've just committed this., Integrated in Hadoop-trunk #528 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/528/])]