[
Made the proposed changes in the patch. unit tests all passed., -1, because 3 attempts failed to build and test the latest attachment http://issues.apache.org/jira/secure/attachment/12354957/patch-1204.txt against trunk revision http://svn.apache.org/repos/asf/lucene/hadoop/trunk/525596. Please note that this message is automatically generated and may represent a problem with the automation system and not the patch. Results are at http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch, My bad.
Forgot to include the new file.
, 
Added the new files to the patch, re-submit the corrected patch, +1, because http://issues.apache.org/jira/secure/attachment/12354976/patch-1204.txt applied and successfully tested against trunk revision http://svn.apache.org/repos/asf/lucene/hadoop/trunk/525596. Results are at http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch, This looks good, except you have some spurious whitespace differences., 
a new patch fixing a few places in comments and extra spaces
, one more spurious space fixed, 
a new patch fixing some comments and spurious spaces
, -1

2 attempts failed to build and test the latest attachment http://issues.apache.org/jira/secure/attachment/12355268/patch-1204.txt against trunk revision r527100.

Please note that this message is automatically generated and may represent a problem with the automation system and not the patch.

Results are at http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/23/console, 
I took a look at the log.
It seems to me that the failure has nothing to do with this patch.

The early version version of this patch passed the tests (see above). I fixed a few spurous spaces and resubmitted it yesterday. All the unit tests passed on my dev machine.

Since I have another fairly large patch depending on this patch, can somebody help to verify this patch and, if no problems found, commit it? Thanks a lot.
, +1, I just committed this.  Thanks, Runping!, Integrated in Hadoop-Nightly #55 (See http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Nightly/55/)]