[Good catch Jingguo. Sounds like append needs to check Priority rather than Level? Seems like we shouldn't need to check both given that we've updated the library., Yes. But we need to make sure that no log4j API is used directly for logging. log4j API uses Level instances such as Level.INFO to create LoggingEvent. Otherwise, such kind of logging will not be taken into account by EventCounter. And Level instances such as Priority.INFO are deprecated in log4j.

Another option is to use equals instead of ==. Priority has the following equals method. 

  /**
     Two priorities are equal if their level fields are equal.
     @since 1.2
   */
  public
  boolean equals(Object o) {
    if(o instanceof Priority) {
      Priority r = (Priority) o;
      return (this.level == r.level);
    } else {
      return false;
    }
  }

Level does not define equals method by itself. So it inherits this method. This method will return true if level fields (int type) are equal. It will return true for things like Level.INFO and Priority.INFO. So LoggingEvent created by both commons logging API and log4j API will be taken into account for this option. The downside for this option is that equals check is slow than == check.

And there are some mistakes in my original comment. Let me correct them here.

For 1.0.4, Level instances such as Level.INFO are used to construct LoggingEvent. But for 1.1.1, Level instances such as Priority.INFO are used to construct LoggingEvent. Level.INFO and Priority.INFO are different Level instances. 1.1.1 version's event.getLevel() always returns Level instances from Priority. So EventCounter append method's "==" check always fails between different Level instances from Level and Priority.

public class Priority {
  //...
  final static public Priority INFO  = new Level(INFO_INT, "INFO",  6);
  //...
}

public class Level extends Priority implements Serializable {
  //...
  final static public Level INFO  = new Level(INFO_INT, "INFO",  6);
  //...
}, This looks like a regression in the common log 1.1.1 implementation (passes in Priority.* instances instead of recommended Level.*) to me. Priority.* are deprecated and they should just use Level.* everywhere.

In any case, using equals is a reasonable fix that works with all cases and the performance overhead is negligible compared with actual logging by time the appender is triggered., When EventCounter appender is triggered, it only updates its counts field. So equals overhead is not negligible compared to the actual logging which is counts field updating in this case.

But if we think that the overhead incurred by equals is negligible on the overall performance, we can use equals., bq. When EventCounter appender is triggered, it only updates its counts field. So equals overhead is not negligible compared to the actual logging which is counts field updating in this case.

When the appender is triggered, a new LoggingEvent object is created and at least one synchronization happened which is probably 100x more expensive then the method call. Note, updating the counts field is a *synchronized* call, which is about 30x more expensive then the equals call. If don't believe it, just benchmark it and make sure you have at least two threads doing the update, so jvm doesn't elide the locks.
, Per Luke's suggestion, use equals instead of == for Level check., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12474763/HADOOP-7055.patch
  against trunk revision 1094750.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

    +1 system test framework.  The patch passed system test framework compile.

Test results: https://hudson.apache.org/hudson/job/PreCommit-HADOOP-Build/365//testReport/
Findbugs warnings: https://hudson.apache.org/hudson/job/PreCommit-HADOOP-Build/365//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://hudson.apache.org/hudson/job/PreCommit-HADOOP-Build/365//console

This message is automatically generated.]