[Attaching patch which fixes this issue:

The problem was caused reconfiguring autoconf script for task-controller. 

Task controller is a binary which is to be built only on Linux platform and for the environments which require [HADOOP-4490|https://issues.apache.org/jira/browse/HADOOP-4490], therefore it does not make sense to built it every time in hudson for trunk and test patch.  So removing the autoreconf part from create-c++-configure target.

Users who would require, task-controllers would have to specifically invoke "ant task-controller"., Running thro' Hudson to verify the fix which works locally, This patch is a timely fix which would enable the trunk build to go on.  As mentioned by Sreekanth that, task-controller is required only for some specific environment; I think we can file a separate jira to fix the task-controller issue with autoreconf.

With this I give my +1 
, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12399893/HADOOP-5204-1.patch
  against trunk revision 742827.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3825/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3825/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3825/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3825/console

This message is automatically generated., The patch is related to build, hence no test case., This is ready to go. I've been trying to check out trunk on the apache commit machine for the past 1 hour. It's s..l..o..w. , I just committed this. Thanks, Sreekanth !, Integrated in Hadoop-trunk #756 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/756/])
    ]