[Attaching a patch for Yahoo!'s distribution if Hadoop not to be committed here. This patch adds HADOOP_CLIENT_OPTS to HADOOP_OPTS so that the TLA level env settings gets passed correctly., Attaching a patch for trunk. This patch adds the HADOOP_CLIENT_OPTS to HADOOP_OPTS for the following commands
 - bin/mapred job 
 - bin/mapred queue
 - bin/hadoop jar, Running through Hudson., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12443943/HADOOP-6757-v1.0.patch
  against trunk revision 941662.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h1.grid.sp2.yahoo.net/65/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h1.grid.sp2.yahoo.net/65/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h1.grid.sp2.yahoo.net/65/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h1.grid.sp2.yahoo.net/65/console

This message is automatically generated., Patch looks fine to me., Can we have a testcase for this or the manual steps which were used to verify this ?, Marking as open while Sharad's comment is addressed., I think this may be fixed by MAPREDUCE-2372., I think this is fixed in branch-1, and is not relevant to other releases.]