[Setting this as a part of HADOOP-4171., For tasks' memory management feature, we read proc file system for finding the running processes and reading their stat files. Linux programs access procfs via VFS, but windows programs can access cygwin's procfs only if they work directly under cygwin(i.e. talk to cygwin dll). The current problem arises because of the inability of a windows java application(which, once started, runs outside cygwin environment) to read proc file-system.  My earlier sanity checks for determining procfs availibilty on Windows/cygwin were just limited to the command line and not included external programs, so couldn't catch this problem earlier.

So, for now, I am attaching a patch to disable the feature completely on Windows/Cygwin, and let it run only on Linux. Later, we can try including this feature by changing - how we get list of processes(run a cygwin "ls" on /proc) and how we get each process' information (run a cygwin "cat" on each process, costly?)., Both TestProcfsBasedProcessTree and TestTaskTrackerMemoryManager ran to successful completion with the above patch. Submitting to Hudson., bq. Both TestProcfsBasedProcessTree and TestTaskTrackerMemoryManager ran to successful completion with the above patch.
Ran to successful completion on both Linux and Windows., Vinod, "ProcfsBasedProcfsBasedProcessTree" looks like a spelling mistake in the Log message.  Did you test this patch on Windows?, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12390733/HADOOP-4173-20080923.txt
  against trunk revision 698187.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    -1 core tests.  The patch failed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3353/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3353/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3353/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3353/console

This message is automatically generated., bq. Vinod, "ProcfsBasedProcfsBasedProcessTree" looks like a spelling mistake in the Log message.
Argh... Fixed that. Thanks, Nige.

bq. Did you test this patch on Windows?
Yes, and both the failing tests passed, as I mentioned in my previous comment., Hudson returned a -1 for contrib tests, though I cannot find any failing contrib test from the console output. Is this a case of HADOOP-4037?

The core test failed - org.apache.hadoop.hdfs.TestLeaseRecovery2.testBlockSynchronization is not related to this JIRA. Filed HADOOP-4257., bq. Hudson returned a -1 for contrib tests, though I cannot find any failing contrib test from the console output. Is this a case of HADOOP-4037?
HADOOP-4244, Javadoc needs updation, as Hemanth pointed out. Fixing javadoc., > Hudson returned a -1 for contrib tests, though I cannot find any failing contrib test from the console output. Is this a case of HADOOP-4037? 

The contrib tests -1 problem is addressed in HADOOP-4257., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12390826/HADOOP-4173-20080924.1.txt
  against trunk revision 698385.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    -1 core tests.  The patch failed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3362/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3362/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3362/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3362/console

This message is automatically generated., Can this be committed? Thanks., > The contrib tests -1 problem is addressed in HADOOP-4257.

It should be HADOOP-4249, Not HADOOP-4257., +1 for the patch. There are no tests in it, because it is only fixing broken tests. I think this can be committed., Could someone write a realease note?, The patch is reviewed and I've put up the release notes. Raghu, can you please commit this? Thanks!, I just committed this. Thanks Vinod!, Integrated in Hadoop-trunk #616 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/616/])]