[Patch which fixes the issue. I manually verified that the created directories are cleaned up after a run of this test., Rather than doing that, why not fix the test so that it chdirs into the build directory first? Or sets the conf to point to the build dir?, 
Those test dirs should be written in the build directory, not to pollute the source tree. 

Using the Java Sys prop 'test.build.data' as the base for those dirs would do.

Thxs.
, Patch which uses "test.build.data" as a prefix for the directories., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12482974/hadoop-7402.1.patch
  against trunk revision 1136249.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 system test framework.  The patch passed system test framework compile.

Test results: https://builds.apache.org/job/PreCommit-HADOOP-Build/648//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-HADOOP-Build/648//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-HADOOP-Build/648//console

This message is automatically generated., +1, I've committed this. Thanks atm!, Integrated in Hadoop-Common-trunk-Commit #661 (See [https://builds.apache.org/job/Hadoop-Common-trunk-Commit/661/])
    , Integrated in Hadoop-Common-trunk-maven #43 (See [https://builds.apache.org/job/Hadoop-Common-trunk-maven/43/])
    , Integrated in Hadoop-Common-trunk #732 (See [https://builds.apache.org/job/Hadoop-Common-trunk/732/])
    ]