[This problem exists in 0.19.  Setting this to a 0.19 blocker., I don't see the test failure in the Hudson Hadoop-trunk project. The same issues was reported to me by Amareshwari [HADOOP-4261|http://issues.apache.org/jira/browse/HADOOP-4261] but then she was not able to reproduce the issue locally. I also have not been able to reproduce this issue. , I also have seen the same test-case failure on Linux with the same stack trace. Will see if I can give some more useful information., > I don't see the test failure in the Hudson Hadoop-trunk project.

Hudson was not working for past few days.  The TestJobQueueInformation failed on a recent build (#3438). see http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3438/

BTW, have you done a svn update?  I guess the test failed is due to some recent changes., I can deterministically reproduce this.  4378_20081010TestJobQueueInformation.txt is a test output.  Let me if you need more information., Any update on this? Thanks.
, The issue is related to HADOOP-4409. All tests using {{TestMiniMRWithDFS}} could be potentially affected. However, the way the class is used, none of the other tests are actually failing except {{TestJobQueueInformation}}. I propose we fix this test case to not use {{TestMiniMRWithDFS}}, as it really doesn't need to run any specific type of job, nor check for correctness of job running aspects. Instead, it could use a simple job like the {{SleepJob}}.

The real cause for failure can be tracked in HADOOP-4409. I think the mapred team needs to make a call on whether this is a blocker., Attaching patch with modifying the TestJobQueueInformation not using TestMiniMRWithDFS anymore.

Instead using sleep job and submitting the same to check for scheduling information populated on the job., Minor nit. Please remove the commented line that is submitting the word count job, as we are never going to be using that again. Other than that, +1., BTW, I also verified that the test which failed consistently on my machine, passed now., Attaching patch removing the commented out line., Removing dependency with TestMiniMRWithDFS for TestJobQueueInformation., Attaching the ant test-patch output run locally:


{noformat}
     [exec]
     [exec] +1 overall.
     [exec]
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec]
     [exec]     +1 tests included.  The patch appears to include 4 new or modified tests.
     [exec]
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec]
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec]
     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs warnings.
     [exec]
     [exec]     +1 Eclipse classpath. The patch retains Eclipse classpath integrity.
     [exec]
     [exec]

{noformat}, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12392087/HADOOP-4378-2.patch
  against trunk revision 704599.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3460/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3460/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3460/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3460/console

This message is automatically generated., I just committed this. Thanks, Sreekanth!, Integrated in Hadoop-trunk #634 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/634/])
    . Fix TestJobQueueInformation to use SleepJob rather than WordCount via TestMiniMRWithDFS. Contributed by Sreekanth Ramakrishnan.
]