[attached patch would change the above message to : {noformat}
Metasave: Blocks waiting for replication: 1
blk_6735500019364591152_0 MISSING (replicas: l: 0 d: 0 c: 2 e: 0) 74.6.132.200:50010(corrupt) :  192.168.0.107:50010(corrupt) :
{noformat}, Updated patch for trunk. Earlier one does not apply to current trunk. , "decommisioned" has a typo. It should be "decommissioned".

Also not covered in the description - the patch includes additional useful information that identifies a block on a node as "corrupt" or "decommissioned"., Thanks Suresh. Updated patch fixes the spelling., +1 patch looks good., (Didn't intend to change the issue description in the last comment.  Probably accidentally changed some invisible characters.  Sorry.), +1, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12407573/HADOOP-5780.patch
  against trunk revision 772960.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/309/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/309/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/309/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/309/console

This message is automatically generated., I just committed this., Patch for hadoop-0.20]