[This patch snowballed a bit on me. It does:
  1. It binds the port before clearing the system directory. This is the primary change since it makes sure that it is being run on the right host before wiping the system directory.
  2. The error handling for wrong and unknown host are improved.
  3. The HTTP server comes up before any long blocking operations happen.
  4. Introduces the JobTracker state and provides it as part of ClusterStatus. The JobTracker is INITIALIZING while cleaning up the system directory and local storage. When it is up, the state is RUNNING. The state is visible in the web/ui.
  5. Jobs are rejected before the JobTracker is RUNNING.
  6. Removes static variable that stores the JobTracker.
  7. Only dump the system properties from the JobTracker at debug logging level.
  8. Change the JobSubmissionProtocol to version 4.
  9. Change the jsps to get the JobTracker from an attribute rather than the static variable., -1, build or testing failed

2 attempts failed to build and test the latest attachment http://issues.apache.org/jira/secure/attachment/12365292/jt-init.patch against trunk revision r573413.

Test results:   http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/701/testReport/
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/701/console

Please note that this message is automatically generated and may represent a problem with the automation system and not the patch., *Sigh* I messed up the mini mr cluster in my last change to this patch. I'll fix it tomorrow., This patch has all of the previous stuff and fixes MiniMR to get rid of a race condition on making the directories and pulls offerService out of JobTracker.startTracker() so that you can start the tracker without getting your thread stuck in offerService.

Unit tests all pass now. *smile*, +1

http://issues.apache.org/jira/secure/attachment/12365368/jt-init-2.patch applied and successfully tested against trunk revision r573513.

Test results:   http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/713/testReport/
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/713/console, Owen, this patch doesn't apply to trunk anymore, could you please regenerate it? Thanks!, Updated to reflect trunk changes., -1, build or testing failed

2 attempts failed to build and test the latest attachment http://issues.apache.org/jira/secure/attachment/12365493/jt-init-3.patch against trunk revision r574312.

Test results:   http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/725/testReport/
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/725/console

Please note that this message is automatically generated and may represent a problem with the automation system and not the patch., The test that fails is an hbase test that works on my dev machine. I believe the failure to be independent of my patch., I just committed this.  Thanks, Owen!, Integrated in Hadoop-Nightly #236 (See [http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Nightly/236/]), Integrated in Hadoop-Nightly #366 (See [http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Nightly/366/])]