[+1 looks good, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12486372/no-jdk.patch
  against trunk revision 1146300.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 system test framework.  The patch passed system test framework compile.

Test results: https://builds.apache.org/job/PreCommit-HADOOP-Build/727//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-HADOOP-Build/727//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-HADOOP-Build/727//console

This message is automatically generated., Retracting my +1 on this patch.  It would be nice to preserve Java dependency.  In the future, if hadoop rpm is distributed through yum.  User does not need to worry about manually install Java to get the system running.
, I agree with Owen. We've looked at this in CDH and eventually removed the java package dependency. The reason is that there is no good java package to depend on. Just depending on "jre" or "jdk" will pull in the wrong package (eg the openjdk or the IBM jre on a SLES). Depending on java-1.6-sun package doesn't work for some people because it is only available in the Red Hat supplementary repo, which is a pain to configure (eg requires rhn), and not available on Centos. Therefore it's easier if the user installs java (there may be multiple javas installed) and Hadoop picks the best one when it runs (HADOOP-6605) if one was not explicitly configured using JAVA_HOME., An alternate option is to have a set of RPMs that depend on both hadoop and different JDKs, are marked as exclusive, and user can install them. If I install hadoop-core-sunjdk then I get the sun JDK and hadoop; if I install hadoop-core-openjdk then I get the openjdk one. And if I install neither, I get to sort it out myself. 

If there's one problem with this its that if they are all in the same directory you cant go rpm --install *.rpm, because they will be exclusive. Unless they aren't marked as exclusive and if you install both it picks up the Sun JDK., The patch no longer applies to trunk.  If this is still something we want to do then we need to at least upmerge the patch., Won't fix. We no longer ship RPMs. Closing.]