[Attached patch will name mapred system directories using <username>.<torque-jobid> format. This will prevent a clash from occuring in a multi-user shared cluster scenario. The patch also includes some changes that will help HADOOP-2899 in case the JobTracker implements mechanisms to clean up the mapred system directory at shutdown time., I patched the version 0.4.0 of Hadoop 0.16.0 and it worked flawlessly. Directory names do not clash under /mapredsystem which is a very useful step waiting for HADOOP-2899. 

Thanks,
Luca, This new patch preserves the idea of the earlier patch, but parametrizes the root directory of the mapred system directory. This was earlier hardcoded to /mapredsystem. But it was decided it will be better to make it a config parameter, so administrators have a choice of setting it to the value they want according to security policies.

The current path will be hodring.mapred-system-dir-root/userid/mapredsystem/torque-jobid. Note that setting hodring.mapred-system-dir-root to /user will make these get written to the user's home directory in DFS and thus negate the need for any management in configuring permissions for the system directory.

Another change included in the patch is do a small change to the parameter of the hod logs directory. So, this will now be hodring.log-destination-uri/userid/hod-logs/torque-jobid/.. The change is for the same reason.
, Added documentation for the new config option mapred-system-dir-root and also on some other related options., +1 Looks good., Run through Hudson, I just commited this. Thanks Hemanth!, -1 overall.  Here are the results of testing the latest attachment 
http://issues.apache.org/jira/secure/attachment/12377149/2925.2.patch
against trunk revision 619744.

    @author +1.  The patch does not contain any @author tags.

    tests included -1.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    javadoc +1.  The javadoc tool did not generate any warning messages.

    javac +1.  The applied patch does not generate any new javac compiler warnings.

    release audit +1.  The applied patch does not generate any new release audit warnings.

    findbugs +1.  The patch does not introduce any new Findbugs warnings.

    core tests +1.  The patch passed core unit tests.

    contrib tests +1.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1895/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1895/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1895/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1895/console

This message is automatically generated., Integrated in Hadoop-trunk #421 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/421/])]