[I simply removed () from the class declaration. Patch attached, but as it's not against the svn I'm not sure it works right away. :(, Cancelling, to generate another patch, against trunk., Attaching patch against svn.

Tested the error behavior, with Python 2.4.4. Patch addresses the issue.
For versions still down, like Python 2.3.4, we have many further problems, which we are not interested in fixing.

@Luca : Yes, patches uploaded should be against trunk. Thanks!, Submitting the patch., -1 overall.  Here are the results of testing the latest attachment 
http://issues.apache.org/jira/secure/attachment/12377576/2970.patch.1
against trunk revision 619744.

    @author +1.  The patch does not contain any @author tags.

    tests included -1.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    javadoc +1.  The javadoc tool did not generate any warning messages.

    javac +1.  The applied patch does not generate any new javac compiler warnings.

    release audit +1.  The applied patch does not generate any new release audit warnings.

    findbugs +1.  The patch does not introduce any new Findbugs warnings.

    core tests +1.  The patch passed core unit tests.

    contrib tests +1.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1942/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1942/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1942/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1942/console

This message is automatically generated., I just committed this. Thanks, Vinod!, Luca pointed out the problem and gave the patch. Redirecting the gratuities to him :) Thanks Luca!, Integrated in Hadoop-trunk #431 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/431/])]