[This patch renames the method in ZlibCompressor.c.

But it is not very important as the setDictionary method is not actually used as far as I can tell., Resubmit patch to hudson, trunk test was broken by HADOOP-5409., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12401479/HADOOP-5406.patch
  against trunk revision 751463.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-minerva.apache.org/30/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-minerva.apache.org/30/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-minerva.apache.org/30/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-minerva.apache.org/30/console

This message is automatically generated., No tests included as there is nothing to test really. I just renamed a function to comply to JNI standards but this function is not used anywhere in the Hadoop-Codebase (as far as I can tell).

I have no idea how my patch causes the jobHistoryLocation test to fail. I guess I'll have to investigate., +1 Good catch. The unit test failure is not related.

I committed this. Thanks, Lars, Integrated in Hadoop-trunk #827 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/827/])
    . Fix JNI binding for ZlibCompressor::setDictionary. Contributed by Lars Francke.
]