[The standard public API for such things is JobClient, not JobTracker.  Is that not sufficient?  It may not be, but I think that's the thing to change, rather than exposing stuff through JobTracker directly.  To my thinking, the only reason that JobTracker is a public class is so that one can start and stop the daemon.  Other interaction should be through JobClient.  Could that work for you?, The webapps use the JobTracker, so I assumed I would be able to use its interface as well.  It seems odd that the webapp is privileged.  

JobClient and JobSubmissionProtocol don't provide the actual number of running/completed tasks; they only seem to provide the progress as a float.  I also want ClusterStatus.  ClusterStatus is available from JobSubmissionProtocol as well as JobTracker, but JobSubmissionProtocol is not available from JobClient.
, Sorry, I'm wrong.  I can get ClusterStatus from JobClient.

So the only thing I care about is the actual number of running/completed tasks, which isn't in JobClient.  

I'm also vaguely uncomfortable with the privileged access of the webapp/ to the JobTracker., > So the only thing I care about is the actual number of running/completed tasks, which isn't in JobClient.

Isn't it?  The ClusterStatus includes the number of running map and reduce tasks.  The number of completed tasks can be determined from getMapTaskReports() and getReduceTaskReports(), or incrementally with getJob().getTaskCompletionEvents().  What's missing?

> I'm also vaguely uncomfortable with the privileged access of the webapp/ to the JobTracker.

Me too.  I think the webapp should ideally use only JobClient to access the JobTracker.  Not because I don't trust the webapp, but rather because I think that anything that's visible in the webapp should be accessible to user programs.  Probably we should put the webapp in a separate package.  We should also split JobTracker into a public launcher class and a package-private class that implements various protocols, so that the protocol implementation methods are not publicly visible, tempting folks to call them directly.  But such cleanups are separate issues.  If you feel strongly enough, please file issues and submit patches for this.]