[Perhaps also renaming src/test/core to src/test/common or even src/test/java would be a good idea now too., {{core-site.xml}} and {{core-default.xml}} need to be renamed too, so are other build related directories. This issue will address them all or only the artifacts?, I am not sure if renamed files are correctly included in the patch. If not, how can I do that?, Will you create a /common dist directory (i.e. http://archive.apache.org/dist/hadoop/core/) as well?
, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12439593/HADOOP-6404.patch
  against trunk revision 926421.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 39 new or modified tests.

    -1 patch.  The patch command could not apply the patch.

Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/427/console

This message is automatically generated., The previous patch no longer applies, so I've created a new one. This one only covers renaming the build artifacts (this includes the Ivy and Maven files). I have tested the changes by building a tar and checking the names of the JAR files inside it. Also, I have installed the JARs in a local Maven repo and successfully built HDFS and MapReduce artifacts (see HDFS-1126, MAPREDUCE-1751).

I think renaming core-{default,site}.xml to common-{default,site}.xml should be covered in another issue. Since 0.20 already has core-{default,site}.xml files backwards compatibility needs to be considered. This change isn't absolutely necessary for 0.21, in my opinion.

Also, this patch doesn't change all internal references to "core", these can be fixed in HADOOP-6159 at some point. Similarly, renaming the src/test/core tree can be a separate issue.
, bq. Will you create a /common dist directory (i.e. http://archive.apache.org/dist/hadoop/core/) as well?

I think so. There would be common, hdfs and mapreduce directories containing the tarballs. We might as a convenience also add a combined tarball to the core directory, using the script Owen created in HADOOP-6342., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12443515/HADOOP-6404.patch
  against trunk revision 940527.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/495/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/495/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/495/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/495/console

This message is automatically generated., Could someone review this please?, Unfortunately the patch no longer applies, but it looks good. +1

bq. I think renaming core-{default,site}.xml to common-{default,site}.xml should be covered in another issue.

Agreed. Filed HADOOP-6783 and marked it for 0.21, but I agree that it wouldn't be tragic if it slipped., Thanks for the review, Chris. Here's a new patch that applies against trunk., A new patch updated for trunk., I've just committed this., Integrated in Hadoop-Common-trunk-Commit #270 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Common-trunk-Commit/270/])
    HADOOP-6404. Rename the generated artifacts to common instead of core.
, Integrated in Hadoop-Common-trunk #349 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Common-trunk/349/])
    HADOOP-6404. Rename the generated artifacts to common instead of core.
, Thank Tom - looks like you've fixed HADOOP-6789 in the passing :-) Real nice!]