[Ping, 0.23.9 should also now be deleted, as 0.23.10 has been released.
, Please can someone take a look at this?, [~acmurthy], please take a look., [~sebb@apache.org] - Thanks for the reminder. I've removed stale releases. Please take a look. Thanks., Btw, [~sebb@apache.org], I can't remove hadoop-2.0.6-alpha; permission issues. Can you please help? Tx., The hadoop-2.0.6-alpha files are owned by 'cos', group 'hadoop'.
Unfortunately the files were created without group write, so only 'cos' or someone with root karma can remove them.

Such problems will disappear when Hadoop moves to svnpubsub for releases [1]


[1] http://www.apache.org/dev/release.html#upload-ci, [~cos], could you delete the hadoop-2.0.6-alpha files?, Will do, give me a few minutes., I have removed 2.0.6-alpha. It seems that 2.2.0 and 2.3.0 are still around although the current points to 2.4.0. Worth yanking these two out?, The download page [1] implies that the following are current:

    1.2.X - current stable version, 1.2 release
    2.2.X - current stable 2.x version
    2.3.X - current 2.x version
    0.23.X - similar to 2.X.X but missing NN HA.

If this is no longer true, please also update the download page so it accurately reflects what is currently supported.

[1] http://hadoop.apache.org/releases.html#Download, PING
The following releases don't appear to be current, and should be removed please:

2.2.0
2.3.0
2.4.0, Please can you also now delete 2.4.1 and 2.5.0, And now 2.6.0-3 also 2.7.0-1, Please could someone take care of removing old releases?

i.e. everything apart from 2.7.3, 2.6.4, 2.5.2

The following need to be removed please:

https://dist.apache.org/repos/dist/release/hadoop/common/hadoop-1.2.1/
https://dist.apache.org/repos/dist/release/hadoop/common/hadoop-2.6.0/
https://dist.apache.org/repos/dist/release/hadoop/common/hadoop-2.6.1/
https://dist.apache.org/repos/dist/release/hadoop/common/hadoop-2.6.2/
https://dist.apache.org/repos/dist/release/hadoop/common/hadoop-2.6.3/

https://dist.apache.org/repos/dist/release/hadoop/common/hadoop-2.7.0/
https://dist.apache.org/repos/dist/release/hadoop/common/hadoop-2.7.1/
https://dist.apache.org/repos/dist/release/hadoop/common/hadoop-2.7.2/

Please also update any release manager documentation to include tidying old releases.

It's unfair on the 3rd party mirrors if they have to continue carrying superseded releases., PING, Please now delete:
https://dist.apache.org/repos/dist/release/hadoop/common/hadoop-2.6.5/
https://dist.apache.org/repos/dist/release/hadoop/common/hadoop-2.7.4/
https://dist.apache.org/repos/dist/release/hadoop/common/hadoop-2.8.1/
https://dist.apache.org/repos/dist/release/hadoop/common/hadoop-3.0.0-alpha4/

Also please ensure that deletion of old releases is added to the release process documentation.
It's unfair to burden 3rd party mirrors with carrying old releases.
Some of them (particularly in remote places) don't have huge servers with acres of disk space., PING.
There are still several old releases on the mirrors.
It's not fair on the volunteer mirrors to burden them with files that are not needed.
Please remove all the old releases; only keep the latest version of any version stream if it is still being developed.]