[I think perhaps the bug is that ChecksumFileSystem (on which LocalFileSystem is based) does not implement listStatus().  It has a listPaths() implementation that filters checksum files.  Probably this listPaths() implementation should be replaced with a listStatus() implementation that filters checksum files.  The default implementation of listPaths() is in terms of listStatus(), so that will still be filtered.  Right now, listStatus() is implemented by the FilterFileSystem base class, which just forwards to the RawLocalFileSystem, and thus includes the checksum files., I believe that this is a regression from release 0.14 when eliminating .crc files in dfs. The default path filter in FileSystem was changed from filtering .crc files to be accepting any files. The ChecksumFileSystem's default filter should still filter .crc files., > The ChecksumFileSystem's default filter should still filter .crc files.

Yes, and when another filter is passed, the two must be composed., Composing user-provided filter with the default filter is a good idea. Doug, do you mind if I open a new jira on this idea?, > Doug, do you mind if I open a new jira on this idea?

I think composition is required to fix this issue.  listStatus(Path, PathFilter) when applied to a CheckSumFileSystem should filter both for .crc files and for the user-specified PathFilter.  That means something like:

{noformat}
public FileStatus[] CheckSumFileSystem#listStatus(Path p, final PathFilter filter) throws IOException {
  fs.listStatus(p, new PathFilter() {
      public boolean accept(Path file) {
        return (!isChecksumFile(file) && filter.accept(file));
      }
    };
}
{noformat}
i.e., composing the filters.
, But composing filters is not the current semantics. Currently fs either uses a user-provided filter or the default filter if no filter is provided by the user. Composing filters is an incompatible change., > Currently fs either uses a user-provided filter or the default filter if no filter is provided by the user. 
Sorry that I did not look at this issue very closely. This how globStatus is implemented but not for listStatus.

Here is a patch that fixed the problem., The attached patch fixes listStatus(Path), but not listStatus(Path, PathFilter).

I also think we should remove all the listPaths() implementations from ChecksumFileSystem, since the filtering added there is redundant.  Once listStatus() does the right thing, then the default implementations of listPaths() in FileSystem should work correctly for ChecksumFileSystem.
, I thought listStatus(Path, PathFilter) did not do the composing either. But actually listStatus(Path, PathFilter) works right. It calls listStatus(Path), which already applies the default filter, then applies the user-provided filter., > It calls listStatus(Path), which already applies the default filter [ ... ]

Good point!  I missed that.

And maybe it's not worth removing the listPaths() implementations now.

Okay, I'm +1 on this patch now., Thanks Doug for your quick review., +1 overall.  Here are the results of testing the latest attachment 
http://issues.apache.org/jira/secure/attachment/12374577/crc.patch
against trunk revision 616796.

    @author +1.  The patch does not contain any @author tags.

    javadoc +1.  The javadoc tool did not generate any warning messages.

    javac +1.  The applied patch does not generate any new javac compiler warnings.

    release audit +1.  The applied patch does not generate any new release audit warnings.

    findbugs +1.  The patch does not introduce any new Findbugs warnings.

    core tests +1.  The patch passed core unit tests.

    contrib tests +1.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1724/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1724/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1724/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1724/console

This message is automatically generated., I just committed this. Thank you Hairong., Merged into 0.16.1, Integrated in Hadoop-trunk #398 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/398/])]