[Will there be a patch for 0.17.0?, Yes, I'll post one soon (this week-end)., eclipse build also failed due to HADOOP-2563. For the problem reported in this JIRA RPC.stopClient() has been make private which gets called automatically once reference count reaches zero. I see that the thread already calls FileSystem.closeAll() which should be good., 3018-20080405a.patch adds a couple of other small cleanups: removes a deprecated call to fs.delete, also removes a some duplicated code.

In fact, calling FileSystem.closeAll() seems not to be powerful enough but that's all what we can do for now.
The RPC has not been designed for such a use as the one we have in the Eclipse plug-in, and if someone enters a wrong configuration or has some networking issues (firewall, etc), the UI might appear dead or unresponsive.
, Running thru Hudson now.  Can you commit if it's successful?, -1 overall.  Here are the results of testing the latest attachment 
http://issues.apache.org/jira/secure/attachment/12379473/3018-20080405a.patch
against trunk revision 643282.

    @author +1.  The patch does not contain any @author tags.

    tests included -1.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    javadoc +1.  The javadoc tool did not generate any warning messages.

    javac +1.  The applied patch does not generate any new javac compiler warnings.

    release audit +1.  The applied patch does not generate any new release audit warnings.

    findbugs +1.  The patch does not introduce any new Findbugs warnings.

    core tests +1.  The patch passed core unit tests.

    contrib tests +1.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2178/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2178/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2178/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2178/console

This message is automatically generated., There are no tests for the eclipse plug-in.
I just committed this. Thanks!, Integrated in Hadoop-branch #5 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-branch/5/]), Integrated in Hadoop-trunk #454 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/454/])]