[Attaching patch that creates a Forrest document for the Capacity Scheduler. , The attached patch makes following changes:

- Makes the documentation of the capacity scheduler more complete.
- Links capacity scheduler of the site documentation, so that documentation is actually generated.
- Introduces changes related to setting up queues, ACLs into cluster setup and map/reduce tutorial. These are referenced off the capacity scheduler documentation., Results of test-patch:

     [exec] -1 overall.

     [exec]     +1 @author.  The patch does not contain any @author tags.

     [exec]     -1 tests included.  The patch doesn't appear to include any new or modified tests.
     [exec]                         Please justify why no tests are needed for this patch.

     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.

     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs warnings.

     [exec]     +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

There are no tests as it is a documentation patch., Looks good. Some minor comments: 

* In 'mapred_tutorial.xml', under 'Submitting Jobs to a Queue', you have the following: "Note that administrators may ... to allowed queues." The wording can be changed a bit. It is not _mandatory_ to submit a job to an allowed queue. A user could submit a job to any queue, but if ACLs are enabled and the user is not allowed to submit jobs to the queue, their job is rejected. 

* In 'cluster_setup.xml', under 'mapred.queue.names', you write: "If the scheduler does not support queues, the value of this parameter should be left as _default_." Shouldn't you say something like "the system, and hence any scheduler, always supports at least one queue called _default_, and so this parameter's value should always contain the string 'default'"? , Incorporated review comments.

Results of test patch continue to hold:

     [exec] -1 overall.

     [exec]     +1 @author.  The patch does not contain any @author tags.

     [exec]     -1 tests included.  The patch doesn't appear to include any new or modified tests.
     [exec]                         Please justify why no tests are needed for this patch.

     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.

     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs warnings.

     [exec]     +1 Eclipse classpath. The patch retains Eclipse classpath integrity.
, I just committed this. Thanks, Hemanth!, Integrated in Hadoop-trunk #640 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/640/])
    ]