[-1 overall.  Here are the results of testing the latest attachment 
http://issues.apache.org
against trunk revision r589576.

    @author +1.  The patch does not contain any @author tags.

    patch -1.  The patch command could not apply the patch.

Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/1021/console

This message is automatically generated., If the value field is empty,
Check if the property corresponding to the empty value already exists in the properties list.
If it exists, unset it(remove the property from the list)
, +1 overall.  Here are the results of testing the latest attachment 
http://issues.apache.org/jira/secure/attachment/12369478/unset.patch
against trunk revision r594715.

    @author +1.  The patch does not contain any @author tags.

    javadoc +1.  The javadoc tool did not generate any warning messages.

    javac +1.  The applied patch does not generate any new compiler warnings.

    findbugs +1.  The patch does not introduce any new Findbugs warnings.

    core tests +1.  The patch passed core unit tests.

    contrib tests +1.  The patch passed contrib unit tests.

Test results: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/1097/testReport/
Findbugs warnings: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/1097/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/1097/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/1097/console

This message is automatically generated., Rajagopal, some review comments:

1. Looks like there are some indentation changes, could you please fix them?
2. I'm not sure what the use case for 'unset' is, I'm open to a debate about its merits. At the very least you should check if the property had been marked *final* before the unset.
3. Could you also enhance TestConfiguration and add a test-case for this? 

Thanks!, Hi Arun,
Thanks for the comments.
1. Indentation had been changed.
2. Say, there is an optional parameter that has been set in the default configuration or site configuration, and the user wants to remove that, unset could be useful instead of leaving the property name in properties list and having a null there. By the default conf reading logic used in the program, if either attr or value were null while reading initially, the property isn't added to properties. Similarly, if at a later point, the value would be null, it sounds logical for me to remove the property. Please correct me if I'm wrong.
3. A Test Case has been added., Somehow a TAB had come into the previous patch. corrected in this patch., +1 overall.  Here are the results of testing the latest attachment 
http://issues.apache.org/jira/secure/attachment/12369947/unset_with_tests.patch
against trunk revision r596835.

    @author +1.  The patch does not contain any @author tags.

    javadoc +1.  The javadoc tool did not generate any warning messages.

    javac +1.  The applied patch does not generate any new compiler warnings.

    findbugs +1.  The patch does not introduce any new Findbugs warnings.

    core tests +1.  The patch passed core unit tests.

    contrib tests +1.  The patch passed contrib unit tests.

Test results: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/1133/testReport/
Findbugs warnings: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/1133/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/1133/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/1133/console

This message is automatically generated., The patch looks fine, but as I noted before I'm not very sure about the merits of allowing configurations to be 'unset'... what is the use case for this?, Arun,

Unsetting values is useful when loading several configurations.  After the default configuration is loaded, a user configuration should be able to unset values. I can't remember exactly, but I ran in to this bug when using Nutch and trying to disable all filters for a certain part of the process.

Other than that, I don't think it's semantically correct to ignore explicit empty configuration values., -1

I think this is a really bad plan. I would much prefer a programatic way of clearing a value. In particular, there are values that have semantics for the empty string that are different from being unset. I also think it would be very counter-intuitive. , Closing a very old bug. Please re-open if this still needs to be addressed.]