[3904_20080805.patch: updated the package name, ClusterTestDFSNamespaceLogging and ClusterTestDFS currently are not executed by "ant test" since their names do not begin with "Test".  So these two tests have not be run for a long time.

I ran these two tests manually.  Trunk passed ClusterTestDFSNamespaceLogging but failed on ClusterTestDFS.  I am not sure whether they are still valid tests.  I will create a new issue., Everything works fine except the problem mentioned above.  I only tried to fix the package name here.  Submitting ..., +1 this is a cleaner way of getting a LOG.
ClusterTest(s) should be reviewed and removed if they are redundant or renamed. In a separate issue., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12387607/3904_20080805.patch
  against trunk revision 683392.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 9 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3025/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3025/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3025/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3025/console

This message is automatically generated., Committed, thanks Tsz Wo!, Integrated in Hadoop-trunk #581 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/581/])]