[Good catch. Attached patch removed the variable from hadoop-default.xml., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12386576/HADOOP-3756.patch
  against trunk revision 678593.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2918/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2918/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2918/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2918/console

This message is automatically generated., HOD generates this in the hadoop-site.xml still. I guess this should be removed ? Is there any different configuration item to generate for this or none ?, yes, it needs to be removed and no new config is required in its place. For now I will commit this jira.

, On second thoughts, I will wait for Hemanth to fix this on Hod as well. 

Hemanth, please feel to assign back to me once there is a patch for HOD., Raghu, I filed HADOOP-3814 for addressing this in HOD. Will get to this ASAP (but could be a couple of days). Feel free to commit to JIRA if that's too long. I will make HADOOP-3814 a blocker for 19, so it will get fixed for sure., I just committed this., Integrated in Hadoop-trunk #581 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/581/])]