[Here's the patch for the fix., Here's a test case for this ('svn diff' doesn't include this new file so it's posted separately), -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12389792/TestScriptBasedMapping.java
  against trunk revision 693705.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3226/console

This message is automatically generated., Added the Test file to the patch, As a related comment: 

The patch I've submitted will log a warning-level message when the resolver is actually executed, and return an error value (null). 

There's currently no great way to report these issues at configure()-time. You can throw an unchecked exception if you'd like, but should we maybe think about adding a checked MisconfigurationException so that if configure() tries to load a value that isn't valid, we have a structured way of propagating these results to the client? 
, Aaron - minor nit: could you please make the newly introduced 'static' variables 'package-private' rather than public? Thanks!, Sorry this took so long. Been swamped; here you are., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12393038/HADOOP-4141.patch.3
  against trunk revision 709040.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 2 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3510/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3510/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3510/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3510/console

This message is automatically generated., I've just committed this. Thanks Aaron!]