[The files should be in svn:ignore list., On the second thought, chukwa build.xml should have a clean target., Added clean target for chukwa., I guess, we might better have both svn:ignore and ant clean. , -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12393340/HADOOP-4571.patch
  against trunk revision 711482.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3535/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3535/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3535/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3535/console

This message is automatically generated., It should not clean out the user's configuration files on "ant clean". That seems pretty wrong., The files are created by top level ant build.xml, in the init target.
Nicholas, could you add the above 3 files into svn:ignore list?  Thanks in advance., I am not sure what should be done here.  Could anyone help?, > could you add the above 3 files into svn:ignore list?

The idea is that ant build should not generate any svn:ignore files in svn:controlled directories.
Those 3 files should be generated in hadoop/build/. Then there probably will be no need to have a clean target for chukwa.
In my personal experience this 3 files are very annoying. Eclipse svn plugin, which I use, does not work very well with svn:ignore it stops ignoring them whenever files are modified, which happens with any clean build. So I have to manually exclude them whenever I create a patch., Copying template file to build directory only, would impact the behavior for all contrib directories.  Instead of changing the directory structure, the right thing is to follow the existing structure, put the files in ignore list.

Someone with commit access, please run:

cd trunk/src/contrib/chukwa/conf
svn propedit svn:ignore .

Put these files in the ignore list:

initial_adaptors
alert.conf
chukwa-slaves

Thanks in advance. :), 4571_20081112.patch: add conf to svn:ignore, I just committed this.  Thanks, Eric!, Integrated in Hadoop-trunk #660 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/660/])
    . Add chukwa conf files to svn:ignore list. (Eric Yang via szetszwo)
, Integrated in Hadoop-trunk #661 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/661/])
    . Updating git ignore file also.
]