[Change ServiceAuthorizationManager to have a non-static map, and change Server to include an instance of ServiceAuthorizationManager., Looks pretty good. One small thing - rather than making serviceAuthorizationManager public in Server, can you add a public getter marked only used for tests?, Updated patch to address Todd's comments., This seems like a good approach. +1

You could mark getServiceAuthorizationManager() on Server as {{@InterfaceAudience.LimitedPrivate({"HDFS", "MapReduce"})}} since it is only needed by tests., Thanks for the review, Tom.

Updated patch to address Tom's comments., I just ran the tests, with the following results. The javadoc warning was present before my patch.

-1 overall.  

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    -1 javadoc.  The javadoc tool appears to have generated 1 warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 system tests framework.  The patch passed system tests framework compile., I'd like to commit this in the next day or so unless there are any objections., I've just committed this. Thanks, Aaron!

(I checked that the unit tests passed before committing this.), Integrated in Hadoop-Common-trunk-Commit #378 (See [https://hudson.apache.org/hudson/job/Hadoop-Common-trunk-Commit/378/])
    HADOOP-6951. Distinct minicluster services (e.g. NN and JT) overwrite each other's service policies. Contributed by Aaron T. Myers
, This code in common breaks HDFS. Currently HDFS trunk does not compile! HDFS-1422 has been files for this. Please close it, if it is not necessary., Sorry about this, I overlooked the fact that the HDFS and MR issues needed committing at the same time. We should temporarily revert this (the related issues need unit tests and test-patch running). Unfortunately, Apache svn is not responding for me at the moment., I've now reverted this in trunk., Integrated in Hadoop-Common-trunk-Commit #379 (See [https://hudson.apache.org/hudson/job/Hadoop-Common-trunk-Commit/379/])
    Reverting commit 1001067 while related HDFS and MR JIRAs are tested (HADOOP-6951).
, Integrated in Hadoop-Common-trunk #461 (See [https://hudson.apache.org/hudson/job/Hadoop-Common-trunk/461/])
    Reverting commit 1001067 while related HDFS and MR JIRAs are tested (HADOOP-6951).
HADOOP-6951. Distinct minicluster services (e.g. NN and JT) overwrite each other's service policies. Contributed by Aaron T. Myers
, Hi Tom,

I've now run test-core and test-patch on both HDFS-1399 and MAPREDUCE-2067. Would you mind taking another look at this?

Thanks a lot,
Aaron, I've just committed this (again). Thanks Aaron!

I'll commit the other two JIRAs shortly., Integrated in Hadoop-Common-trunk-Commit #381 (See [https://hudson.apache.org/hudson/job/Hadoop-Common-trunk-Commit/381/])
    HADOOP-6951.  Distinct minicluster services (e.g. NN and JT) overwrite each other's service policies.  Contributed by Aaron T. Myers.
, Integrated in Hadoop-Common-trunk #489 (See [https://hudson.apache.org/hudson/job/Hadoop-Common-trunk/489/])
    ]