[Output of ant test-patch on an empty patch on the current trunk (revision 726981)

{noformat}
     [exec] -1 overall.  
     [exec] 
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec] 
     [exec]     -1 tests included.  The patch doesn't appear to include any new or modified tests.
     [exec]                         Please justify why no tests are needed for this patch.
     [exec] 
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec] 
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec] 
     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs warnings.
     [exec] 
     [exec]     -1 Eclipse classpath. The patch causes the Eclipse classpath to differ from the contents of the lib directories.
     [exec] 
{noformat}

-1 on test is expected but not for Eclipse classpath. , i've disabled patch testing until this is resolved.  Giri is looking at the issue now., created a patch to add path's of ivy resolved lib dir's to .eclipse.templates/.classpath file and 
added the same path to test-patch.sh script.

This patch adds changes to the patch testing script itself. Hence this patch cannot be tested using the test-patch target.

I ve tested is manually and it works just fine.  

     [exec]
     [exec] +1 overall.
     [exec]
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec]
     [exec]     +1 Eclipse classpath. The patch retains Eclipse classpath integrity.
     [exec]
     [exec]
     [exec]
     [exec]
     [exec] ======================================================================
     [exec] ======================================================================
     [exec]     Finished build.
     [exec] ======================================================================
     [exec] ======================================================================
 
Thanks,
Giri, +1.  , I just committed this. Thanks, Giridharan!, Integrated in Hadoop-trunk #698 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/698/])
    ]