[Since the native libraries work regardless of JRE signature, the patches checks for the IBM 32 bit JRE signature and if found sets the JAVA_PLATFORM environment variable to the same signature of the Oracle/Sun JRE, Other than the reported version numbers, isn't this identical to HADOOP-6895?, Identical Problem, *slightly* different resolutions. HADOOP-6895 is for Hadoop 0.21 where the code has been moved out of the bin/hadoop script into the bin/hadoop-config.sh file, so the 6895 patch modifies the hadoop-config.sh file, whereas this patch (for 0.20.3) modifies the bin/hadoop file., Gotcha, thanks.  Might be good to link the two issues, though., Hudson doesn't seem to have kicked off a QA Build. Cancelling Patch and moving it back to Patch Available to see if that will start the Build and Test., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12452966/HADOOP-6923.patch
  against trunk revision 995285.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/679/console

This message is automatically generated., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12452966/HADOOP-6923.patch
  against trunk revision 1031422.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://hudson.apache.org/hudson/job/PreCommit-HADOOP-Build/22//console

This message is automatically generated., +1. Committed to branch-20 for 0.20.4, @Owen (or @Todd) - Why is this going into 0.20.4 and not 0.20.3?, It ended up going into 0.20.3 since I needed to fix another minor glitch in the tests.]