[This issue is not a consistent behavior. We have seen it sometimes.
For example, for a particular job we see following values for map task

Status: Running
Started at: Fri Sep 26 10:28:47 UTC 2008
Running for: 47mins, 48sec
Job Cleanup: Pending
Kind	% Complete	Num Tasks	Pending	Running	Complete	Killed	Failed/Killed Task Attempts
map	49.90%		216		77	59	80	0	0 / 0
reduce	0.00%		1		0	1	0	0	0 / 0

-------------------
Status: Running
Started at: Fri Sep 26 10:28:47 UTC 2008
Running for: 48mins, 56sec
Job Cleanup: Pending
Kind	% Complete	Num Tasks	Pending	Running	Complete	Killed	Failed/Killed Task Attempts
map	49.90%		216		84	59	73	0	0 / 0
reduce	0.00%		1		0	1	0	0	0 / 0

-------------------
Status: Running
Started at: Fri Sep 26 10:28:47 UTC 2008
Running for: 49mins, 30sec
Job Cleanup: Pending
Kind	% Complete	Num Tasks	Pending	Running	Complete	Killed	Failed/Killed Task Attempts
map	49.90%		216		76	59	81	0	0 / 0
reduce	0.00%		1		0	1	0	0	0 / 0
-----------------------
Status: Running
Started at: Fri Sep 26 10:28:47 UTC 2008
Running for: 49mins, 56sec
Job Cleanup: Pending
Kind	% Complete	Num Tasks	Pending	Running	Complete	Killed	Failed/Killed Task Attempts
map	49.90%		216		85	59	72	0	0 / 0
reduce	0.00%		1		0	1	0	0	0 / 0
-----------------------------

Also If taks are failed or killed then in the column Failed/Killed the value is shown 0/0.

Note-:
We have not verified if the same issue exists for reducer task.
, bq. Also If taks are failed or killed then in the column Failed/Killed the value is shown 0/0.
I think this is the cause of the confusion. Ideally tasks move from competed to pending only when the tracker is lost or the task is killed., This issue is dependent on commit of the following issue, the reason why the jobs keeping interchanged is mentioned in [HADOOP-4274|https://issues.apache.org/jira/browse/HADOOP-4274]

The removal of the failed and completed jobs are being addressed in [HADOOP-4256|https://issues.apache.org/jira/browse/HADOOP-4256]. The reason for the jobs not being displayed in those list are the scheduler does not maintain completed and failed jobs list., Changing the issue dependencies, I've found out the actual reason to be HADOOP-4288. Because of HADOOP-4288, a tasktracker that gets a NullPointerException in its heartbeat resends the heartbeat repetitively for ever. And, on each heartbeat, JT finds a completed task reported by the TT to be already marked as completed in its data-structures, so marks it as killed and thus the state toggle happens repetitively. (JobInProgress.java +619).

It wasn't mentioned earlier, but, note that this issue surfaces only after applying HADOOP-4053, which in turn triggers HADOOP-4288., Leaving this issues unresolved just for the sake of verification after HADOOP-4288 goes in., HADOOP-4288 is fixed. Karam, can you please verify if this issue still persists?, Karam reported offline that he is not seeing this issue any longer. HADOOP-4288 duplicates this.]