[Made changes by importing the required class. Modified testing/main.py to include a testCase for this. Made a few changes to the test case testXmlrpc checked in earlier., Earlier patch wasn't against svn. Mistake. Attaching patch again., Minor. The testInterrupt method is probably not hanging because of the sleep in the longRpcCall method, which is clearly intended. It should be failing because you are generating a random port (by mistake) and trying to connect to that, rather than reusing serverport. So it should be timing out. Though the intended effect is still tested, maybe it will be clearer to correct this.

Otherwise +1.

Please make this minor change and make it available., The concerned code path raising HodInterruptedException is traversed when any rpc method returns an exception and by that time hod interrupt is set. To test this method, we need to mimic a user given keyboard interrupt, which doesn't seem possible/straight-forward because of threading issues. So falling back to indirect way of testing the patch - 1) setting interrupt  even before calling rpc method and 2) let calling rpc method return an exception by giving invalid rpc host address. (2) could also have been done by having a rpc method that simply raises an exception., Running it through Hudson., +1 overall.  Here are the results of testing the latest attachment 
http://issues.apache.org/jira/secure/attachment/12378215/HADOOP-2783.2
against trunk revision 619744.

    @author +1.  The patch does not contain any @author tags.

    tests included +1.  The patch appears to include 6 new or modified tests.

    javadoc +1.  The javadoc tool did not generate any warning messages.

    javac +1.  The applied patch does not generate any new javac compiler warnings.

    release audit +1.  The applied patch does not generate any new release audit warnings.

    findbugs +1.  The patch does not introduce any new Findbugs warnings.

    core tests +1.  The patch passed core unit tests.

    contrib tests +1.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2001/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2001/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2001/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2001/console

This message is automatically generated., I just committed this. Thanks, Vinod!, Integrated in Hadoop-trunk #434 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/434/])]