[I am willing to bet that for random reasons Java select() returns 0, irrespective of timeout. So we need to keep track how long we have waited. Oddly, when the test passes, there are no instances of these. But when the test fails, there are lot of instances of this.
, I thought I could avoid calling System.currentTimeMillis() while waiting and depend on select(). Tough luck.

The attached patch polls in a loop until timeout passes. Also removes a large block for setting "channeStr".  we use channel.toString() instead., minor modification to patch., +1 codes look good, Thanks Nicholas. , Still waiting for Hudson blessings. Please apply this patch if you are seeing random unit test failures before investigating further.
, -1 overall.  Here are the results of testing the latest attachment 
http://issues.apache.org/jira/secure/attachment/12377535/HADOOP-2971.patch
against trunk revision 619744.

    @author +1.  The patch does not contain any @author tags.

    tests included -1.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    javadoc +1.  The javadoc tool did not generate any warning messages.

    javac +1.  The applied patch does not generate any new javac compiler warnings.

    release audit +1.  The applied patch does not generate any new release audit warnings.

    findbugs +1.  The patch does not introduce any new Findbugs warnings.

    core tests -1.  The patch failed core unit tests.

    contrib tests +1.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1931/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1931/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1931/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1931/console

This message is automatically generated., The fixes some of the sporadically failing tests.

Regd the core tests failed, I can't trace them to bug here but this might improve anyway., I just committed this., Integrated in Hadoop-trunk #426 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/426/])]