[The patch sets io.sort.mb to 1mb for the 2 failing test cases., Nigel, we are also seeing {{TestReduceFetch}} and {{TestJobControl}} failing because of OOM. We are seeing this consistently. , Why not increase the memory limit used by ant to run these tests (currently 256 MB)? I've had other tests fail on 64-bit Linux before for the same reason., What kind of memory is running out? Can you post the stack trace? 

I've not been seeing this on the JRockit JVM, incidentally., Here's a stacktrace I get on Mac OS X (running against trunk revision 720464):

{code}
java.lang.OutOfMemoryError: Java heap space
        at org.apache.hadoop.mapred.MapTask$MapOutputBuffer.<init>(MapTask.java:488)
        at org.apache.hadoop.mapred.MapTask.run(MapTask.java:295)
        at org.apache.hadoop.mapred.LocalJobRunner$Job.run(LocalJobRunner.java:138)
{code}

Following Matei's suggestion, setting the memory to 512 MB causes the tests (TestMapRed, TestReduceFetch, TestJobControl) to pass. The attached patch changes the default for running ant., Should we also set io.sort.mb to a smaller value than the current 100 mb?  We can override for all tests in src/test/hadoop-site.xml, +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12394646/hadoop-4698.patch
  against trunk revision 720698.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 1 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3652/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3652/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3652/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3652/console

This message is automatically generated., +1 For lowering io.sort.mb to 5-10 in the test configuration.

The discussion about raising the memory limit in HADOOP-3644 seemed to trail off into ambivalence. I agree with Steve's sentiment: it wouldn't be harmful. Most of the memory issues we'd be worried about are more likely to show up at scale than in the unit tests., Patch lowering io.sort.mb to 10 and raising the junit memory limit to 512MB, +1, I just committed this. Thanks, Nigel, Attaching patch committed after HADOOP-4631]