[Currently, I see this problem on Mac OS X due to native code incompatibilities, like HADOOP-7147.

The root cause is that when the script pre-builds the existing trunk code, it does not use -Pnative, but when it builds after applying the patch, it does use -Pnative.  Note that we don't want to remove -Pnative completely, because that was added to fix a bug reported in HADOOP-8488.  Instead, if we provided an additional optional flag for developers to disable the native portion of the build, then it would still catch problems in the native code by default, but developers on non-compatible platforms would still have a way to use test-patch.sh as long as they are not working on the native code.
, The attached patch introduces an optional --no-native flag.  By default, the script still builds native like usual.  With this optional flag, the script will not include -Pnative in the mvn calls.

I tested this on OS X and Ubuntu.  On OS X, test-patch.sh succeeds if I use --no-native.  On Ubuntu, I confirmed that it still builds libhadoop.so by default if you don't specify --no-native.

Jenkins will give this a -1 for lack of new tests.  That's because the patch only changes build scripts.
, {color:green}+1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12549339/HADOOP-8933.patch
  against trunk revision .

    {color:green}+1 @author{color}.  The patch does not contain any @author tags.

    {color:green}+1 tests included{color}.  The patch appears to include 1 new or modified test files.

    {color:green}+1 javac{color}.  The applied patch does not increase the total number of javac compiler warnings.

    {color:green}+1 javadoc{color}.  The javadoc tool did not generate any warning messages.

    {color:green}+1 eclipse:eclipse{color}.  The patch built with eclipse:eclipse.

    {color:green}+1 findbugs{color}.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    {color:green}+1 release audit{color}.  The applied patch does not increase the total number of release audit warnings.

    {color:green}+1 core tests{color}.  The patch passed unit tests in .

    {color:green}+1 contrib tests{color}.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-HADOOP-Build/1634//testReport/
Console output: https://builds.apache.org/job/PreCommit-HADOOP-Build/1634//console

This message is automatically generated., This seems like an exact duplicate of HADOOP-8776.  Have you reviewed the patch there?, Thanks, Colin.  I missed HADOOP-8776.  I'll close this out as duplicate and participate on the original.]