[I plan to fix the problem by changing the datanodeReport protocol to be

public DatanodeInfo[] getDatanodeReport(NodeType type) throws IOException;
The value of type could be ALL: return all data nodes
                                               LIVE: return live data nodes
                                               DEAD: return dea data nodes
, Code look good. Two minor comments:

1. In MiniDFSCluster. waitActive(), we should probably be invoking client.datanodeReport(ALL) rather than client.datanodeReport(LIVE).

2. This patch introduces a new conf variable called heartbeat.recheck.interval.
is this really needed?, >  This patch introduces a new conf variable called heartbeat.recheck.interval.
This conf variable is to make TestDatanodeReport to run quicker. A datanode won't be declared dead after a name node has not received its heartbeat for 2*heartbeat.recheck.interval+10*heartbeat interval. The heartbeat recheck interval was set to be 5 minutes. In the test, I set it to be 0.5s. This config variable is not intended for admin usage so it is not in hadoop-default.xml.
, If it is not in hadoop-default.xml then why have it at all? Better to have a static final instead., > If it is not in hadoop-default.xml then why have it at all? Better to have a static final instead.

It can't be a static final if we still want to change it to make unit tests run faster, right?

I think it's okay to have parameters that are undocumented in hadoop-default.xml.  These are akin to package-private fields: a useful way to share implementation internals without encouraging users to muck with them.  Once something goes into hadoop-default.xml then it's public and we should continue to support it in future releases.

An alternative might be to use a package-private field or method, provided the unit test is in the same package as the parameter in question.
, This patch includes a change to MiniDFSCluster.waitActive(). It uses datanodeReport to get all live datanodes. It waits until all datanodes are alive. It also adds one more testcase to TestDatanodeReport., +1. Looks good., I bumped up the ClientProtocol version.

Thanks Hairong., Integrated in Hadoop-Nightly #234 (See [http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Nightly/234/])]