[bq. 1) Output.collect should not take hit from framework, separate thread to handle spill buffer?

I'm not sure this is very easy to achieve... I'll let Devaraj comment on this one.

bq. 2) InetAddress.getLocalHost result should be cached in a static variable?

+1 
We probably do not need to use this at all... some other statistic could be enough e.g. a numerical trackerid?

bq. 3) Spilling logic should not involve #of partitions, needs redesign?

Here the main idea is that each spill (i.e. to each reduce) is sorted individually; since the reducer only merges the sorted spills form each map. However I guess we could limit the no. of partitions we track in memory at a given point? Again, over to Devaraj...
, Thanks Srikanth for the so-detailed bug report/analysis. Really awesome!

The attached patch should address the concerns. Regarding your questions:

1) Output.collect should not take hit from framework, separate thread to handle spill buffer?
I can't see how this can be done without substantial redesign, and I don't see much gain of doing it this way (if we want to keep memory usage under bounds)

2) InetAddress.getLocalHost result should be cached in a static variable?
Done. The code is modified to always use 127.0.0.1

3) Spilling logic should not involve #of partitions, needs redesign?
Modified this to take into account the number of key/value in a particular partition. If a particular partition has nothing, then the associated arrays (like startOffset) doesn't contribute anything to the memory used. Also, reduced the initial array sizes from 1K to 5. Shouldn't be a problem on performance. 

Also, the patch models the memory usage better. It takes into account the temp space that the mergesort would take for the temp arrays when the spilling logic executes. The patch also reinitializes the arrays to null upon every spill to reflect the used memory better., 1) Output.collect should not take hit from framework, separate thread to handle spill buffer?

I would think we should have a producer consumer architecture where the consumer should have the logic of spill buffers. I do not believe it is much difficult to go there from here. Agreed that there is a need for a bit more analysis, but the overhead is limited to running another thread, mostly waiting for input. I believe the straight benefit out of this would be to keep problems with the application and problems with the framework would be kept separate, which is a big thing. Frankly I assumed this would be the case until I debugged it., bq.2) InetAddress.getLocalHost result should be cached in a static variable?
Done. The code is modified to always use 127.0.0.1

-1

I believe we do a reverse-lookup of the actual IP address of the network interface and use it to generate a statistically strong unique-random number for the *sync marker*, which this patch breaks. 

Rather than the IP address we could use a timestamp which is further randomized by trackerid or some such mechanism... 

Essentially we need a {{UUID}} (http://java.sun.com/j2se/1.5.0/docs/api/java/util/UUID.html); clearly we need to check the performance impact to generate one., This patch addresses Arun's concern about the randomness of the sync bytes. 

Srikanth, your comment
bq. I would think we should have a producer consumer architecture where the consumer should have the logic of spill buffers. I do not believe it is much difficult to go there from here. Agreed that there is a need for a bit more analysis, but the overhead is limited to running another thread, mostly waiting for input. 

The problem here is that the keys/values, that the map method is doing output.collect for, have to be queued up in a queue associated with the consumer thread. And the spilling logic has to consider the sizes of these key/value pairs (imagine large key/value sizes). So we might end up maintaining a separate buffer for these in-flight keys/values. , Is there any proof of the fact that generating a 128 bit random number makes the sync marker any less prone to collisions? I don't think so. The probability of occurrence of the marker is only proportional to the amount of data in the file and is not influenced by the actual value of the marker., It is certainly proportional to the size of the marker. The longer the marker the less likely it is that the sequence will occur in real data., Yeah, that's true. My point was about the fact that changing the value of the marker for every file doesn't make a difference, so we need not generate a UUID per file., This patch has one change to do with sync bytes generation from the previous patch., Minor nit with the latest patch. SequenceFile.java still has the following comment, which no longer applies:
   // use hash of uid + host, Tahir's comment taken care of. Also, reduced the rate of at which the arrays "grow" to 1.1 from 1.5 - basically reducing the amount of extra space we allocate for each call to grow. That will keep a check on the unused memory consumption by the auxiliary arrays for small keys/values (where the keyValBuffer is small but the auxiliary arrays take a lot of space)., -1, build or testing failed

2 attempts failed to build and test the latest attachment http://issues.apache.org/jira/secure/attachment/12363714/1698.patch against trunk revision r565434.

Test results:   http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/546/testReport/
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/546/console

Please note that this message is automatically generated and may represent a problem with the automation system and not the patch., > changing the value of the marker for every file doesn't make a difference, so we need not generate a UUID per file.

The rationale for generating a new sync marker per file is to make it make it difficult for someone to include a sync marker in their data.  If we used a constant marker then it might exist in compiled code files that might end up stored in a sequence file.  Or perhaps someone might wish to nest a sequence file within a sequence file.  Etc.  So, yes, it doesn't make collisions any less likely in theory, but it might in practice.  Bzip uses a binary rendering of pi as its sync marker.  That seems fragile to me, as does any given constant.  Once you've picked a constant, it's no longer random, it's well known., The current patch still generates a random number per a file. It just changes the seed of the number to be the current time rather than the hostname. It is not a preset constant., I just committed this. Thanks, Devaraj!]