[Hey Brandon. Can you please explain the use case you're targeting?, As stated in HADOOP-5357: "Adding support for pluggable components would allow exporting DFS functionallity using arbitrary protocols", to start custom services. , For Hadoop Common, we actually only need to back port the test TestGetInstances. Changed the title accordingly., The original motivation of the issue was to expose DFS protocols via Thrift. But now that we have protobufs in place, it seems less useful. Do you have a particular service or protocol that you're looking to expose?, We want to use this to start some custom services. Since this is already in trunk and seems to be a good way to achieve that. Half of its functionality is already in branch-1. Do you have any concerns with it? The backport seems pretty straightforward to me. 
, Brandon, ServicePlugin is also required with the patch.

May be your development area for branch-1 has it, but the apache branch-1 does not., my bad :-( The change from original patch already in branch-1 is the change in Configuration.java. ServicePlugin is not there yet., I don't have any particular concerns, I just like to understand motivation behind spending time backporting things into 1.0 rather than spending time on forward development. So, consider me curious, not hostile :), No problem. I understand. :-), Brandon, can you post separate jiras/patches for hdfs and common., Uploaded a patch for common only., Linking in HADOOP-5640 since it's related.

@Brandon, out of curiosity, what custom services do you want to run?, bq. out of curiosity, what custom services do you want to run?
Eli this is a generic mechianism to start some services. How does it matter what custom services?, +1 for the patch. , I committed the patch. Thank you Brandon for back porting the patch., bq. Eli this is a generic mechianism to start some services. How does it matter what custom services?

Per above, I'm just curious. In general it's good to understand how something is going to be used. If Brandon doesn't want to explain the motivation for his work that's his prerogative of course., @Eli, a few of our customers want to use this to start some custom services specific to their own setup. , Closed upon release of Hadoop 1.2.0.]