[This will be fixed by HADOOP-9747 – if someone ever reviews it...  Removing the synchronization removed the class static fields that allow this to occur., [~daryn] Excellent!  I've linked HADOOP-9747 to this JIRA., [~jtstorck], How is the second UGI created? The impersonation will happen only if a real user is set into the subject of this UGI. There shouldn't be a real user unless this second UGI was created as a proxy user., [~jnp] Please take a look at the [test code|https://github.com/jtstorck/ugi-test] I have provided.  It shows a simplified scenario (inspired by a use case in NiFi) that causes the impersonation error.  If two instantiations of the UGI class are used to represent two users, the impersonation error will occur on the relogin of the second user, provided that Hadoop is not configured to allow the impersonation. This use case of UGI occurs in NiFi when the Kerberos credentials in a Hadoop processor are changed from one user to another, with no intention of proxying a user., [~jnp] I updated the test code and provided new instructions for reproducing the impersonation issue.  The test code has been updated to provide per-principal task configuration, and now writes files to HDFS rather than just retrieving status.  Please let me know if you have any problems using the updated code.  Thanks!, FYI, will soon be getting back to the UGI patch that incidentally fixes this issue., Thanks, [~daryn].  I appreciate your work on HADOOP-9747!, Thanks [~jtstorck] for creating the issue and Daryn the work on HADOOP-9747.

HADOOP-9747 is in branch-3.0+ now, and seems to be on working towards branch-2. Can we close this one?, [~xiaochen] I think HADOOP-9747 is still not backported to branch-2.

 , I'm not saying it is - feel free to work on it.

But since the fix is HADOOP-9747 why don't we close this and track it there?, [~xiaochen] got it.

I have understood wrongly.

I will leave backporting for [~daryn] as he is the author of the patch., [~xiaochen] Yes, this can be closed with the fixes for HADOOP-9747 in 3.x., This issue will be resolved by HADOOP-9747.]