[Shouldn't this go into the "test" tree rather than the core?, Actually, it isn't for testing at all. It is for debugging a reduce crash in place on the production machines. Michel manually caught the reduce inputs, but in general we also need to add a configuration setting that lets a job request that some reduce task's inputs be kept. Maybe something like:
mapred.keep.reduce.inputs=...
Where the legal values are "all", "none", or a list of integers of which reduce tasks to keep the inputs for. 
, Why not an option to keep inputs for failed reduces?
Also recall HADOOP-91., An option to keep failed reduces would be useful, but I've certainly seen cases before where I wanted to run a particular fragment in the debugger, even if it didn't crash., This patch does a lot more:
   1. It moves the jobId and partition fields from ReduceTask up into Task.
   2. It replaces Michel's stand-alone reduce runner, with a more general map or reduce runner.
   3. It adds new task localizations into the job.xml.
       For all tasks:
          a. map.task.id = the task id
          b. mapred.task.is.map = is this a map
          c. mapred.task.partition = numeric task id
          d. mapred.job.id = job id
      For maps:
          a. map.input.file = the file that we are reading
          b. map.input.start = the offset in the file to start at
          c. map.input.length = the number of bytes in the split
      For reduces:
          a. mapred.map.tasks = correct number of maps
      These new attributes allow me to reconstruct the MapTask or ReduceTask with just the job.xml.
   4. A new configuration variable keep.failed.task.files that tells the system to keep files/directories for tasks that fail. This attribute can be set on a particular JobConf.
     , One more comment, the usage is:

bin/hadoop org.apache.hadoop.mapred.IsolationRunner <local-dir>/taskTracker/<taskid>/job.xml

, This looks good, except I think you forgot to add IsolationRunner.java., Here is the updated patch that includes the IsolationRunner., I just committed this.  Thanks, Owen.]