[Lohit told me that path has to come before the options.

Before version 0.18,  it used to be lenient with order of arguments, however, usage clearly states the correct command.  

Closing as invalid. , But Koji, this is still a bug if a Java stack trace is printed.  No command-line commands should spill stack traces., > But Koji, this is still a bug if a Java stack trace is printed. No command-line commands should spill stack traces. 
>
True. 
Ok, reopening the Jira. 
I'll change the priority to minor next., Yes, this has to be fixed. Nothing seems to be changed in terms of options parsing of fsck. Either it was broken from beginning or something changed in GenericOptionsParser. , This was not happenning in 0.18 becuase GenericOptionsParser did not consider _-files_ to be a generic option. What seems to be happening here is that _-files_ which was used by fsck is being treated as an option for GenericOptionsParser. It might not be good idea to change _fsck's -files_ option now. I think making a check that is not the first argument works. Here is a patch for that. , -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12390048/HADOOP-3911.patch
  against trunk revision 695755.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3270/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3270/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3270/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3270/console

This message is automatically generated., +1 patch looks good.

need release note., Thanks for review Nicolas,
I just committed this., Integrated in Hadoop-trunk #611 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/611/])]