[Adding information about bug in FileContext#checkDest. 

Will upload patch soon with bug fix and Tests for copy., The call to getFileStatus is outside the try block to make sure FileNotFoundException is thrown per the interface no?, Attaching patch for review. , Hey Ravi,  per the previous comment I left the getFileStatus outside the try block so the FileNotFoundException is now swallowed silently and is thrown up to copy (whose API wants FileNotFoundThrown). This deserves a comment.

The patch just has util classes - perhaps you forgot to add the test class in your diff?, 
 FileContext.Util.Copy() operation was failing with file not found exception if destination file does not exits , this was happening due to the fact that  getFileStatus was out of try block.

bq. The patch just has util classes - perhaps you forgot to add the test class in your diff?

I have included test runner with  util base.  Please check that there are two classes added with this patch  - {{TestFcLocalFsUtil.java}} and {{FileContextUtilBase.java}}, +1 Looks good to me., Review of the patch:
* Lines 47-52: These notes aren't necessary since the test writers should know about @Before and @After. Also, the provided methods (setUp() and tearDown()) conflict with the provided names.
* Lines 55 & 56: These values should be all capitalized and final. Alternatively, it may be good to provide these values via functions so that implementing classes may override as needed.
* Line 64: catch should be on the same line as closing brace, per our coding style
* Line 70: fc should not be declared static. It is the responsibility of each implementing class to provide an instance of it. Also, fc should probably be protected
* Line 91: Please provide assert message for assertion failure
* Since this is a test that the copy method worked, we should prove it by comparing the contents of the copied file with the original.
* Lines 135-138: This code: {code}@After
public void tearDown() throws Exception {
  super.tearDown();
}{code} is a no-op and should be removed.

Nits:
* Rather than Assert.assertTrue() you can do a static import of org.junit.Assert.{assertTrue|*}.
* Line 57: Remove extra line
* Line 47: "Since this a junit 4" ->"Since this is a junit 4 test", Thanks for reviewing patch Jakob.
Uploading updated patch. , Updated patch with changes.
1. Removed unnecessary  tearDown method.
2. Changed file read write to bytes from String., Updated patch.
Removed static from fc initialization.
Removed invalid comments.  , Submitting patch for hudson queue., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12443315/HADOOP-6730.4.patch
  against trunk revision 939864.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 9 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/492/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/492/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/492/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/492/console

This message is automatically generated., +1, I have committed this. Thanks, Ravi. Resolving as fixed.]