[-1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12404385/0001-HADOOP-5612-Add-chmod-rules-to-build.xml-to-make.patch
  against trunk revision 761082.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-minerva.apache.org/95/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-minerva.apache.org/95/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-minerva.apache.org/95/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-minerva.apache.org/95/console

This message is automatically generated., I've just committed this. Thanks Todd!, Integrated in Hadoop-trunk #824 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/824/])
    , This should be committed to branch-0.20 as well, since it causes a fail to build from release source on many systems., I required more changes to 0.20 to get this to build on MacOS (chmod install-sh as well). The error.h import in hdfsJniHelper.c also caused problems on MacOS, but doesn't appear to be required (on RHEL, anyway; errno is included in hdfsJniHelper.h, which covered all the defs I found). Todd, would you mind confirming in your environment?, bq. Todd, would you mind confirming in your environment? 

Works great still here (Ubuntu karmic). Thanks for the updated patch.

[P.S. I grant my original patch under the Apache license.], In looking to apply this to 0.21 and 0.22, it looks like the hdfsJniHelper.c change already has {,near-}identical fixes proposed in HDFS-467 and HDFS-829.

Instead of complicating this further, I'm going to commit the original fix to 0.20 and try to get the MacOS changes into the prenominate JIRAs., Committed to the 0.20 branch, Integrated in Hadoop-Common-trunk-Commit #164 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Common-trunk-Commit/164/])
    . Commit to branch 0.20
, Integrated in Hadoop-Common-trunk #248 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Common-trunk/248/])
    . Commit to branch 0.20
]