[FSEditLog.EditLogFileInputStream doesn't overload the read(byte[]) methods in InputStream, which is causing performance to degrade. The patch restores and improves edit log load times., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12392220/4425-0.patch
  against trunk revision 705073.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    +1 core tests.  The patch passed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3471/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3471/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3471/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3471/console

This message is automatically generated., +1. Looks good.

To avoid this problem again, should we make 'read(buf, off, len)' abstract in EditLogOutputStream?, - Implementation of {{read(byte[] b)}} is not required here, since InputStream already has it doing exactly the same.
- Could you please use {{@Override}} for overridden methods.
- Very nice catch btw!, Updated patch to reflect feedback from Raghu and Konstantin.

BTW- we should probably correct the typo'd Ed*l*itLogInputStream.java, either as part of this checkin or in another issue.

On a related note, Konstantin and I looked at EditLogFileOutputStream, which doesn't override {{write(byte[],int,int)}}, but concluded that this method is not called., > BTW- we should probably correct the typo'd Ed*l*itLogInputStream.java, either as part of this checkin or in another issue.

+1 on correcting the typo in this issue., > +1 on correcting the typo in this issue.
+1. , I just committed this., Integrated in Hadoop-trunk #636 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/636/])
    . Fix EditLogInputStream to overload the bulk read method.
]