[>Copying crc files to local should not require the source file system to be ChecksumFileSystem. 

"crc file" applies only to a ChecksumFileSystem. HDFS does not have a checksum file.., This patch gives a warning if a user specifies -crc option when source file system does not have .crc file., When -crc is specified in the command and the fs does not support crc, the patch prints a warning,  turns off -crc automatically and then continues.  I think we should throw an exception in such case.  No?, My solution is consistent with how FsShell handles -crc option now. If the option is specified and stdout is the destination, the code also prints a warning and continue. I think it is no harm to turn off -crc option automatically., Ok, let's make it consistent with the stdout case.

+1, Thanks Nicholas for the review comments. This patch explicitly states that crc option is turned off automatically. Just to make the user to be better informed., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12399284/crcChecksum1.patch
  against trunk revision 740064.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3789/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3789/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3789/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3789/console

This message is automatically generated., I've just committed this., Integrated in Hadoop-trunk #756 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/756/])
    ]