[bq. Devaraj and I were looking at the code yesterday and we found that in ReduceTask.java, we use the user-supplied comparator to merge the output files from the Map tasks (we use the user-supplied comparator when creating a new SequenceFile.Sorter object). This is incorrect as the comparator used to merge Map output files should be the same as that used to create those files in the Map phase.

A small clarification - we use the *map output key comparator* for sorting map outputs and the same comparator must be used for merging them (on the reducer side). Also, we should continue to use the map output key comparator for iterating through the key/value records from the (possibly merged) map outputs; we should use the value-grouping comparator to only decide whether the current key we are looking at is "equal" to the last key that was looked at, while the user's reducer method is iterating through the values for a key. , A related issue: During the Map phase, when we sort key-value pairs, we use the comparator returned by JobConf.getOutputKeyComparator() (in BasicTypeSorterBase::configure()). When we merge files (in MapOutputBuffer::mergeParts()), we use the comparator returned by 'new WritableComparator(keyClass)' (in SequenceFile::Sorter::Sorter()). This is not right, as the exact same comparator should be used both during sort and during merge (as well as during merge in the Reduce phase). There can be situations when JobConf.getOutputKeyComparator()  and WritableComparator(keyClass) return different comparators. , We use the comparator returned by JobConf.getOutputKeyComparator() for the sort/merge phases of Map and Reduce. We use the comparator returned by JobConf.getOutputValueGroupingComparator() for the iterator across values for a given key. See 1535_01.patch. , Pls update the patch to stick to the 80 column boundary for the lines there., The attached patch (1535_02.patch) has the code changes, formatted to the 80-char  column limit. I also added a set of new unit test cases. There is a new test file TestComparators.java, under src/test/org/apache/hadoop/mapred. This file has 4 tests to check various combinations of default and user-supplied comparators. One of the tests is the same as that in TestUserValueGrouping.java. That files needs to be deleted and TestComparators.java needs to be added to the repository. , As per Runping's comments, we don't need this functionality right away. , Sorry, resolved the wrong bug. This one's still open. , +1, I just committed this. Thanks Vivek!, Integrated in Hadoop-Nightly #154 (See [http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Nightly/154/])]