[Simple patch, sets the configuration in ToolBase to the passed in configuration., Don't know why, first one got named as a sql file.  Removed and re-uploaded as patch file., Dennis, we can just change : 
{code}
public final int doMain(Configuration conf, String[] args) throws Exception {
  return ToolRunner.run(conf, this, args);
}
{code}

I will apply the patch, but I think its better if nutch give up using ToolBase in the first place, since it will be removed soon. , Marking this as blocker for 0.15, since for this release we just deprecate ToolBase, there will be classes depending on correct behavior of it. , updated patch. , Ah, I like your change better.  If I had bothered to read ToolRunner I probably would have gone that route.  :)  We are going to stop using ToolBase for Nutch.  Those changes will probably go into our current patch sets for upgrading to 0.15 hadoop.  Just didn't want anything current to break upon upgrade., +1, -1 overall.  Here are the results of testing the latest attachment 
http://issues.apache.org/jira/secure/attachment/12368485/HADOOP-2012-2.patch
against trunk revision r588778.

    @author +1.  The patch does not contain any @author tags.

    javadoc +1.  The javadoc tool did not generate any warning messages.

    javac +1.  The applied patch does not generate any new compiler warnings.

    findbugs +1.  The patch does not introduce any new Findbugs warnings.

    core tests -1.  The patch failed core unit tests.

    contrib tests +1.  The patch passed contrib unit tests.

Test results: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/1014/testReport/
Findbugs warnings: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/1014/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/1014/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/1014/console

This message is automatically generated., The core-tests failed due to HADOOP-2112. I think this patch can be committed ignoring the testcase failure. , So, me Arun and Devaraj agree that this is a blocker. I will commit this one to trunk and 0.15 unless any objections.  , +1, I just committed this. Thanks, Dennis and Enis!, Integrated in Hadoop-Nightly #286 (See [http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Nightly/286/])]