[The problem is due to the constructor of SetQuotaCommand.  There is a int overflow for setting multiplier = 1024 * 1024 * 1024 * 1024, where the type of multiplier is long.  A simple fix is to change 1024 to 1024L.  I suggest to use StringUtils.TraditionalBinaryPrefix for parsing the string., right. we could use {{StringUtils.TraditionalBinaryPrefix}} . Should it be 'suffix' rather? 

It will change documentation for -setSpaceQuota a bit, but that should be fine I think.
, "Prefix" here means prefix to the unit, i.e. B (bytes) in our case.
For references, see http://en.wikipedia.org/wiki/Binary_prefixes and http://physics.nist.gov/cuu/Units/binary.html, Thanks Nicholas. Could you review the attached patch?, +1 patch looks good., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12390976/HADOOP-4254.patch
  against trunk revision 699119.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3377/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3377/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3377/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3377/console

This message is automatically generated., I just committed this., Integrated in Hadoop-trunk #616 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/616/])]