[http://hadoop.apache.org/docs/current/hadoop-yarn/hadoop-yarn-common/yarn-default.xml, The CapacityScheduler is very much supported and is actively being developed.  The setting as the default scheduler is intentional, see YARN-137., Why the Note?
"Cloudera does not support the Capacity Scheduler in YARN."

http://www.cloudera.com/content/cloudera/en/documentation/cdh5/v5-0-0/CDH5-Installation-Guide/cdh5ig_mapreduce_to_yarn_migrate.html?scroll=concept_zzt_smy_xl_unique_2, That's something you'll need to bring up with Cloudera.  They are free to choose not to support the CapacityScheduler.  However that decision does not directly lead to that scheduler being an invalid setting in Apache Hadoop., Thanks Jason., The yarn.resourcemanager.scheduler.class is set to
org.apache.hadoop.yarn.server.resourcemanager.scheduler.fair.FairScheduler
in CDH5 yarn-default.xml.
http://archive.cloudera.com/cdh5/cdh/5/hadoop/hadoop-yarn/hadoop-yarn-common/yarn-default.xml, Though vendor implementations may choose a different default why are some of the most commonly used implementations using a different default than CapacityScheduler?

MapR has FIFO as default.
http://doc.mapr.com/display/MapR/Job+Scheduling
, Different vendors may have different goals for a default scheduler or what schedulers they want to support.  Hortonworks uses the CapacityScheduler, for example.  Again these are vendor decisions and not Apache Hadoop decisions.

If someone wants to propose changing the default scheduler in Apache Hadoop to FairScheduler and has good reasons to do so then that's something we can discuss on a separate JIRA.  I just am pointing out the CapacityScheduler is supported by the Apache Hadoop community and having that scheduler as the default is not invalid., That's a decision made by those organisations, probably by which one they have most experience of working with

ASF cares about the ASF source releases, which have the CapacityScheduler as a default. It is used in production in some of the largest hadoop clusters. Others use the FairScheduler: their choice

http://wiki.apache.org/hadoop/InvalidJiraIssues]