[The problem was that hadoop jars were included before the webapps in the classpath for dev environments. In normal deployments scenarios, the directory structure is different and the order is maintained., Looks good overall. Three minor comments:
1. It seems that you misplaced the comment "for developers, add Hadoop classes to CLASSPATH", it should be left on its original location
2. Can you please remove the "if exist %HADOOP_CORE_HOME%\..." before "for" loops as it is not needed
3. Can you also please break the two if's and place: 
{code}
for %%i in (%HADOOP_CORE_HOME%\build\*.jar) do (
  set CLASSPATH=!CLASSPATH!;%%i
)
{code}
under "for releases, add core hadoop jar & webapps to CLASSPATH", and place:
{code}
for %%i in (%HADOOP_CORE_HOME%\build\ivy\lib\Hadoop\common\*.jar) do (
  set CLASSPATH=!CLASSPATH!;%%i
)
{code}
under: "add libs to CLASSPATH" right after
{code}for %%i in (%HADOOP_CORE_HOME%\lib\*.jar) do (
  set CLASSPATH=!CLASSPATH!;%%i
){code}
This way, we will be more consistent with the script layout from "bin\hadoop" used for non-Windows platforms.

Separately, what do you think about having a tracking Jira on making .sh and .cmd scripts fully consistent, as they aren't at the moment?
, 1) Fixed
2) Not sure thats ok because the same script is used to start stuff from a release directory structure that may not have those build directories
3) that would mix up the dev and release class path additions. I prefer it the way it is with the 2 scenarios separated out.

I would take your argument further and suggest replacing the scripts with a platform independent script., Thanks Bikas, looks good.

For #2, you would have the same result without {{if}}, as the number of iterations in the {{for}} loop would be zero., which for loop? I have a feeling we are looking at different parts of the code :)
since this is a trivial change that unblocks the web ui for devs, would it be ok to commit this and you can make the fixes you are alluding to? 
, +1, Oh, sorry, didn't get used to commenting "+1" :)

What I wanted to say is that the following:
{code}
if exist %HADOOP_CORE_HOME%\build (
  for %%i in (%HADOOP_CORE_HOME%\build\*.jar) do (
    set CLASSPATH=!CLASSPATH!;%%i
  )
  if exist %HADOOP_CORE_HOME%\build\ivy\lib\Hadoop\common (
    for %%i in (%HADOOP_CORE_HOME%\build\ivy\lib\Hadoop\common\*.jar) do (
      set CLASSPATH=!CLASSPATH!;%%i
    )
  )
)
{code}

is equivalent to:

{code}
for %%i in (%HADOOP_CORE_HOME%\build\*.jar) do (
  set CLASSPATH=!CLASSPATH!;%%i
)

for %%i in (%HADOOP_CORE_HOME%\build\ivy\lib\Hadoop\common\*.jar) do (
  set CLASSPATH=!CLASSPATH!;%%i
)
{code}

This does not have any impact on the functionality, so it is fine to commit., Yes, we were looking at different parts!
Attached new patch., Looks good, thanks!, I just committed this. Thanks Bikas!]