[This is a less pressing issue these days, since you can pass a size to the local dir allocator and it'll do the right thing.
Do people think this is still worth fixing?   It should be straightforward to do something roulette-y in LocalDirAllocator.getLocalPathForWrite for unknown-size writes., Patch fixing this issue., downgrading priority, +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12386584/hadoop9.patch
  against trunk revision 678593.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2920/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2920/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2920/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2920/console

This message is automatically generated., I just committed this. Thanks, Ari!, Integrated in Hadoop-trunk #581 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/581/]), You're welcome, Owen!   (I wrote the roulette selection patch.)
, Paul -- I'm confused. Are you sure this is the issue you meant to comment on?  The patch on this Jira wasn't yours. , Ari,

This issue was originally NUTCH-181 before Hadoop was split off.  I wrote a patch Dec. 29 2005 and used it at archive.org Jan-Feb 2006.  Looking at my old notes, I created this issue on Jan. 11 2006, and prepared the patch on Feb. 28 2006, but it was either lost in a Jira transition or the attachment somehow failed.  

When I looked at your patch yesterday, it was similar enough to what I remembered (5 years ago) that I thought it must be a revision of the patch I did.  Today I found my source and 2005-2006 work notes and it is clear that you implemented the change without seeing mine.

Thanks for doing it in same "roulette-y" spirit of my lost patch! 
]