[A patch that attempts to fix the problem., Is it correct that root path has (path.length() == 0) ?, In this patch, the loadFSImage method does the following:

if (path.length() == 0) {
  // assume that this is the root inode.
}

will it be more explicit if we replace the above piece of code with the following:

if (i == 0) {
  // the first entry is always the root inode.
}, if we take Dhruba's suggestion, then we need to bump up the image version number., > is it correct that root path has (path.length() == 0)
This how INode.isRoot() is implemented., This is a patch with a modified unit test that makes sure that the root is saved to the disk., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12382323/rootImage1.patch
  against trunk revision 657903.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2499/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2499/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2499/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2499/console

This message is automatically generated., +1 patch looks good., I just committed this., Integrated in Hadoop-trunk #499 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/499/])]