[This looks good for the part that addresses what's described in the JIRA, but looks like more than that. New error checking for existing partitions and changes to the actual DDL for field schemas and such? could you update the jira description with everything the patch is doing or separate them into different JIRAs?

, There are no interface changes. All the changes are documentation changes.

The checks for existing partitions were not intentional, but now that I think about them. They should be in too since python clients will croak., +1

I see - the interface just got comments and looked like there were changes if one wasn't circumspect.
, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12389769/hadoop-4087-1.patch
  against trunk revision 693587.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3224/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3224/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3224/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3224/console

This message is automatically generated., unless i setup a stand-along server and create Python and PHP clients, there is no other way to test it as part of unit tests., Do you mean a stand alone metastore server?, yes, standalone server., +1., i won't object now, but we will need test coverage for the Java version of the thrift bindings with a stand alone server from a unit test. PHP and Python would I think be impossible.
, thread-safe tests are a coming in a separate JIRA. , https://issues.apache.org/jira/browse/HADOOP-4175 , I just committed this. Thanks Prasad!, There is a conflict between the

{quote}
ThriftHiveMetaStore-remote
ThriftHiveMetastore-remote
{quote}

filenames. This messes up developers on windows or macs., The two files below should have been removed as patch truncates them. There is no ThriftHiveMetaStore* file any more.

-rw-r--r--  1 pchakka users 0 Sep 15 16:12 ThriftHiveMetaStore.py
-rwxr-xr-x  1 pchakka users 0 Sep 15 16:12 ThriftHiveMetaStore-remote

Thanks, I should have mentioned this in the patch comments. sorry about that., Integrated in Hadoop-trunk #605 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/605/]), I re-committed and removed the deleted files from svn. This should help mac and windows developers to not see the original problem.

Thanks Prasad!, Integrated in Hadoop-trunk #611 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/611/])]