[Hi [~ozawa] and [~ajisakaa],

Thanks a lot for your earlier help on HADOOP-11045. I wonder if you could comment on the proposal here? If we agree to push this forward, we might need help from infra folks to get it in. Thanks.



, [~yzhangal], +1 for this change. With this tool, we can reduce time and effort to confirm whether test failures are flaky and comment it on JIRA manually. I thought it's straightforward to call the python script from dev-support/test-patch.sh.

About infra, we need to check the version of python which the servers for Jenkins CI have., Hi Tsuyoshi,

Thanks for your quick feedback and support! For pre-commit test, the result would be not consistent because it involves uncommitted patches. I was thinking about adding it only for committed code, the nightly jobs run on trunk. Developer certainly can run on pre-commit jobs themselves. 

What do you think?
, {code}
For pre-commit test, the result would be not consistent because it involves uncommitted patches. I was thinking about adding it only for committed code, the nightly jobs run on trunk.
{code}

Make sense. One question: if we add it for committed code, where should we print the lists of flaky tests?, HI [~ozawa],

Thanks, very good comment!

I think ideally if we can put a link in the summary page of a job, right below the "Test Result" section ("Test Result" itself is a link).

E.g. https://builds.apache.org/job/Hadoop-Mapreduce-trunk/2047/

{code}
......
Test Result (2 failures / ±0)
org.apache.hadoop.mapred.TestMRTimelineEventHandling.testMapreduceJobTimelineServiceEnabled

Flaky Test Detection Result  (link to flaky test detection result, addition as a result of fixing this jira)
{code}

But I'm not sure how convenient to add it.

A simpler way is to make the result part of the console output, e.g., at the bottom of 
https://builds.apache.org/job/Hadoop-Mapreduce-trunk/2047/console

What do you think?

Thanks.
, I'm also +1 for this change. I'm thinking it's ideal for me to adding the result of the tool to the last part of the output. The output, which are sent to dev@ ML, is now as follows:
# last 60 lines of the console
# failed tests (if any)

It would be nice if the output becomes
# last 60 lines of the console
# failed test (if any)
# flaky tests (if any)

Probably we need to ask Jenkins admin to change the behavior., Thanks [~ajisakaa], nice suggestion! 

, It sounds good to me to output the result to dev@ ml, the console, and "test result"  of Jenkins if the script finds a flaky tests. , HI [~ozawa], Thanks for your input!  Sorry for not getting back, I will look into asap. 

]