[Attaching patch that has the following:

(1) Added a shutdownHook that does syncLogs sothat logs of the current task are flushed and log.index is up to date in cases like System.exit(), or killed using signals(other than SIGKILL).
(2) Changed WriteToIndexFile() to write to a temporary index file first and then rename to log.index sothat updates to log.index file are atomic.

Please review and provide your comments., Attaching new patch removing System.exit from a catch block of shutdownHook., One minor comment:
After removing System.exit call from shutdown hook, I don't think you need 2 catch blocks in shutdown hook. Also log Throwable as String by calling StringUtils.stringifyException(th), Attaching patch with the suggested changes., +1
Patch looks fine., Marking this as Patch Available sothat hudson will run tests., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12403690/HADOOP-4374.v1.1.patch
  against trunk revision 758925.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 6 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    -1 findbugs.  The patch appears to introduce 1 new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/145/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/145/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/145/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/145/console

This message is automatically generated., The findbugs warning it shows is not because of new code. No new warning is generated because of this patch.

The contrib tests failures are also not related to this patch. Those tests are failing with trunk also., Looks good to me. 


One question for Amareshwari: why log the exception with stringifyException instead of log.error("Exception " + e, e) ? That latter one retains the stack trace and the like for longer, and lets you decide what to do with the details in the logging configuration. I know a lot of the code uses stringifyException(), but thought the codebase was moving away from it?, bq. why log the exception with stringifyException instead of log.error("Exception " + e, e) ? 
I don't know much about log.error functionality. If it also retains stacktrace, using any of stringifyException or log.error("Exception " + e,e)  is fine with me.

bq. I know a lot of the code uses stringifyException(), but thought the codebase was moving away from it?
If this is expected, I think it is time to deprecated stringifyException(). , In fact, I'd suggest that we remove the LOG.warn completely from the shutdown hook., Attaching patch removing LOG.warn and LOG.debug from shutdown hook as log manager might already be shutdown by the time shutdown hook is executed. Also removed syncLogs() call from finally bock in Child.java as shutdown hook takes care of that., I just committed this. Thanks, Ravi!, Integrated in Hadoop-trunk #796 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/796/])
    ]