[The exception data written by the Server is lost and the client (test code) receives a generic connection aborted error.

My guess is the Server is triggering a JVM bug when it writes the exception data and then closes the socket. Instead of the data being flushed to the peer the TCP connection is closed abortively. To check this hypothesis I added a small sleep (20ms) after writing the exception data to the SocketChannel and before closing the socket. This makes the error go away.

No good ideas on how to fix it yet., With security disabled, the server immediately rejects connections that do not request SASL via the connection header.  There's an async race with the insecure client that is blindly sending the connection context.  I think the problem occurs if the delay between sending the connection header and the connection context is greater than the time it takes for the server to respond and close the connection.

By sleeping after sending the response, it helped ensure the socket stayed open long enough for the client to send the connection context., Thanks for taking a look. If I understand you this may not be a platform-specific issue.

FWIW I never see the failure on Linux or OS X. However every Windows run yields at least 1 failure., I had found the same async race a while ago, but I saw it while running {{TestRPC}} instead of {{TestSaslRPC}}.  I had filed HADOOP-8980, but I never solved it.  Duplicate?, Hi Chris, thanks for the pointer. I think this is a different failure. The [issue you describe|https://issues.apache.org/jira/browse/HADOOP-8980?focusedCommentId=13488970&page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel#comment-13488970] seems to be a race condition between startup and receiving the request.

This one looks like a race between sending the response and socket close. Not sure if they are related. We can probably keep both around for now., HADOOP-8980 might be in a confusing state at this point.  It contains discussion of multiple problems.  This specific comment is the one that I think relates to the current issue:

https://issues.apache.org/jira/browse/HADOOP-8980?focusedCommentId=13509416&page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel#comment-13509416

If you think HADOOP-10518 is a clearer bug report at this point, then please feel free to close HADOOP-8980 as the duplicate., Okay that does look similar to what I encountered.

I will dup this against HADOOP-8980.]