[If we fix this, 3677 can be demoted., This is the patch that postpones removal of blocks until the safe mode is off.
The main reason for delition was that block report processing was removing blocks that do not belong 
to any file directly ignoring the regular mechanism that first adds invalid blocks into recentInvalidateSets 
and then schedules  them for deletion via heartbeats.
# I changed block report processing to just placing invalid blocks to recentInvalidateSets
and not returning any commands to data-nodes. This optimized processReport() because now it 
does not scan the block report once again looking for invalid blocks.
# I changed heartbeat processing because it never checked the safe mode and would schedule
replications or deletions if there were any in the pending lists. 
During startup the pending lists are empty but in manual safe mode it may not be the case.
So now the only commands that are allowed when safe mode is on are requests for block reports 
and distributed upgrade commands.
It is not clear why some code in handleHeartbeat() is inside the synchronized section and some is not.
Placed everything inside.

, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12385265/DelBlocksInSafeMode.patch
  against trunk revision 674442.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    -1 findbugs.  The patch appears to introduce 1 new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2799/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2799/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2799/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2799/console

This message is automatically generated., Hi Konstantin, I opened HADOOP-3709 to document the lock-hierarchy violation in processing heartbeats. The goal is to not acquire the global FSNamesystem lock to process every heartbeat. Maybe the patch you provide in this patch already fixes HADOOP-3709., I reverted changes that has been committed. The global lock leads to a potential deadlock.

Thanks Dhruba I overlooked the global lock, which we did not have before. It was introduced in 0.18 by HADOOP-1985.
I'll submit another patch., This is a new patch, which does not change heartbeat processing.
The global lock issue will be taken care of by HADOOP-3620., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12385454/DelBlocksInSafeMode.patch
  against trunk revision 674932.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2816/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2816/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2816/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/2816/console

This message is automatically generated., I just committed this., Integrated in Hadoop-trunk #581 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/581/])]