[Proposed change:
   FileContext object should remember the user (UGI) for which it was created, and any AbstractFileSystem object should be created for that user i.e. within a doAs for that user.

, Patch uploaded., New patch against latest trunk., Previous patch missed a place where AbstractFileSystem was created., Comments:
# While creating RunTimeException, do you want to wrap the exception you caught to provide more details in RunTimeException.
# It is a good idea to document in public APIs that RunTimeException may be thrown and the reason for that exception.
# When logging the exception, you are doing LOG.warn(msg + ex) instead of LOG.warn(msg, ex). Is this intentional?
, New patch addressing the comments., +1 for the patch., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12476485/HADOOP-7171.5.patch
  against trunk revision 1092565.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

    +1 system test framework.  The patch passed system test framework compile.

Test results: https://hudson.apache.org/hudson/job/PreCommit-HADOOP-Build/349//testReport/
Findbugs warnings: https://hudson.apache.org/hudson/job/PreCommit-HADOOP-Build/349//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://hudson.apache.org/hudson/job/PreCommit-HADOOP-Build/349//console

This message is automatically generated., I have committed this., Integrated in Hadoop-Common-trunk-Commit #555 (See [https://hudson.apache.org/hudson/job/Hadoop-Common-trunk-Commit/555/])
    HADOOP-7171. Support UGI in FileContext API. Contributed by jitendra.
, Integrated in Hadoop-Common-trunk #663 (See [https://hudson.apache.org/hudson/job/Hadoop-Common-trunk/663/])
    HADOOP-7171. Support UGI in FileContext API. Contributed by jitendra.
]