[This patch makes the unit tests fail instead of hang if a namenode or jobtracker is running on the machine.  , I should mention that if the info port is in conflict, then it'll look for a new one, but it does not do this for the rpc port.  In that case, the test will fail. , I wonder if we should instead either (a) always roll the info port, indicating this in hadoop-default.xml, or (b) simply specify a different info port when testing.  We already specify a different port for rpcs, and should probably use the same solution for selection of both ports.  The test rpc port is currently a constant that's passed to the MiniDFSCluster's constructor.  We could do the same for the info port, or perhaps put both in src/test/hadoop-site.xml.  TestCopyFiles starts multiple namenodes, so that test would still need to either pass explicit port numbers, or pass a parameter N indicating that port default+N should be used., I assume you are suggesting these because then we won't have to change the constructor interfaces for Namenode, FSNamesystem, and JobTracker?

a) I'm fine with this solution, though I don't know what the info port is used for in non-test cases, just the web ui?  We'd have to be able to return the final selected info port.  

b) I prefer putting this in a config file (src/test/hadoop-site.xml) over having it passed into the constructor.   It seems cleaner to allow the user to change the test port without needing to change the code., Yes, I'm suggesting these primarily because it seems like we don't need to add a lot of code to fix this, but rather just change the unit test configuration to not conflict with a running system.  Less code is almost always better.

So I too prefer the (b) solution.  We'll still have to pass something to the ctor in TestCopyFiles, since it starts multiple namenodes., This patch allows you to run unit tests while a cluster is running and while other unit tests are running.   The cause of the hangs in the past were due to port conflicts.  Now, if we can't start up the namenode or jobtracker, we change the configured values (in memory) for the rpc and info ports and try again in MiniMRcluster and MiniDFSCluster.   

Notes:  
1. build/minimr/hadoop-site.xml is eliminated.  MiniMRCluster no longer creates this file.  for this reason, this patch conflicts with the patch for HADOOP-576.  (the conflict is small, so whichever is second, the patch can be regenerated)  
2. I changed some of the job tracker rpc ports from 50050 to 60050 in the unit tests because 50050 is the default value for mapred.task.tracker.report.port, I just committed this.  Thanks, Wendy!]