[This seems to happen when ProcfsBasedProcessTree.getProcessTree() when the root process is no longer alive. Attaching a patch for branch-0.20. This does the following:
 - When the root process is not found, getProcessTree() method returns an empty process-tree.
 - Added another null check in the same method when we cannot read process information from /proc vfs.
 - Surrounded the memory management code of a single task with a try-catch block so that MemoryManager thread continues to function on other tasks even in the event of occurrence of uncaught exceptions on one task.
 - Removed a spurious HashMap.put() inside an iterator on the same map processTreeInfoMap . This was pointed out by Hemanth.
 - Modified test-case to verify that method calls on ProcfsBasedProcessTree are sane even if the process-tree is not alive or is gone., Patch for trunk. In both the patches, the modified test-case should fail without the code changes and pass with them., Changes for 0.20 look good to me., Regarding changes in trunk, some minor nits:

- TaskMemoryManagerThread, there is an indentation problem in one of the comments, which is becoming very misleading. Search for "updated state"
- Same method, the call to pTree.destroy(); was pTree.destroy(true); in trunk. Though this is the default value for the overloaded API, I think it is better to retain the original code in case it changes in future., Attaching patch for trunk incorporating the above comments. This passes `ant test-patch`, Changes look fine. +1., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12402394/HADOOP-5516-trunk-2.txt
  against trunk revision 755426.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/99/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/99/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/99/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/99/console

This message is automatically generated., I just committed this to trunk and branch 0.20. Thanks, Vinod !, Integrated in Hadoop-trunk #783 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/783/])
    . Fix NullPointerException in TaskMemoryManagerThread that comes when monitored processes disappear when the thread is running. Contributed by Vinod Kumar Vavilapalli.
]