[The claim in particular (from IRC) is that random access to a MapFile stored on the LocalFileSystem has become much slower, and that much of the time is taken seeking the CRC file.  Seeks within the current buffer should not require system calls, but perhaps that optimization was lost?

I hacked TestArrayFile to test this, and ArrayFile.get(0) run 100,000 times took around 1 second in 0.13 and now takes over ten.
, This patch brings back the PositionCache from 0.13.1. It appears the position cache previously did not keep track of long skip(long) or int read(). This has been added.

Passes all the tests on 0.14.3 and has been tested on a 35 node cluster., This restores the 0.13 performance for my benchmark.  +1

Hairong, can you please review this, since you removed PositionCache as a part of HADOOP-1470?  Thanks!, +1 overall.  Here are the results of testing the latest attachment 
http://issues.apache.org/jira/secure/attachment/12369183/positioncache-v1.patch
against trunk revision r592860.

    @author +1.  The patch does not contain any @author tags.

    javadoc +1.  The javadoc tool did not generate any warning messages.

    javac +1.  The applied patch does not generate any new compiler warnings.

    findbugs +1.  The patch does not introduce any new Findbugs warnings.

    core tests +1.  The patch passed core unit tests.

    contrib tests +1.  The patch passed contrib unit tests.

Test results: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/1075/testReport/
Findbugs warnings: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/1075/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/1075/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/1075/console

This message is automatically generated., Here's another approach to fixing this.  The specific problem is that getPosition() is slow on the local filesystem (making a system call).  We can fix this for all filesystems, as in the prior patch, since other filesystems might also have slow implementations of getPosition(), or we can fix it specifically for the local filesystem, as in this new patch, since other filesystems should be expected to implement this efficiently.

Johan, does this version work for you too?

What do folks prefer?, I was going to write the following at the same time as above comment :

bq. I am not sure about the class hierarchy. getPos()  is a property of FSInputStream. So when a filesystem needs to return a FSDataInputStream,  LocalFileSystem returns a PositionCache... similar to how returns a BufferedFSInputStream currently.

, Raghu: I take it you're voting for caching in local FS?

Another place we could cache the position is in BufferedFSInputStream.  That's the place where we depend on getPos() being fast.  When someone seeks, in order to check whether the seek is within the buffer, we need to know where the buffer is in the file.  We currently call getPos() on the underlying stream, which is slow on the local filesystem impl, since it makes a system call.  So is this a better place to cache?  I started to code that, but it will take more code, since BufferedFSInputStream doesn't already override all the position-changing methods.  So I'm currently leaning towards pushing the cache down into the local fs impl.
, LocalFileSystem is a ChecksumFileSystem. So the file position is cached in FSInputChecker. I still do not understand why taking off PositionCache causes such a huge performance degragation., > I take it you're voting for caching in local FS?

pretty much. I was thinking of on the lines of having PositionCache class similar to first patch that can be used by LocalFileSystem like this :

{code} return new FSDataInputStream(new BufferedFSInputStream(
        new LocalFSFileInputStream(f), bufferSize)); {code}
would be replaced by :
{code} return new FSDataInputStream(new BufferedFSInputStream(
        new PositionCache(new LocalFSFileInputStream(f)), bufferSize));{code}, > So the file position is cached in FSInputChecker.

The stack traces I'm seeing show it being called as follows:
{noformat}
org.apache.hadoop.fs.RawLocalFileSystem$LocalFSFileInputStream.getPos(RawLocalFileSystem.java:81)
org.apache.hadoop.fs.BufferedFSInputStream.getPos(BufferedFSInputStream.java:48)
org.apache.hadoop.fs.FSDataInputStream.getPos(FSDataInputStream.java:41)
org.apache.hadoop.fs.ChecksumFileSystem$ChecksumFSInputChecker.readChunk(ChecksumFileSystem.java:196)
{noformat}
Each such call now results in a system call, where before it was cached here too.
, Another version of patch that essentially rearranges first patch and is used only by LocalFileSystem.

Btw, FSDataOutputStream also has its own PositionCache similar to first patch. I didn't change that., The patch looks good. But personally I'd like to cache the file position in BufferedFSInputStream. It removes one java file and reduces one layer of input stream., > The patch looks good. But personally I'd like to cache the file position in BufferedFSInputStream. It removes one java file and reduces one layer of input stream.

In that case, Doug's patch is the smallest I guess. Only correction needed there is that return value of 0 from fis.read() is a valid return and position should be incremented., If the cache is moved to local filesystem only I assume the dfs and other filesystems have a similar cache? Or do they not need one?

Performance with either of these three patches are pretty much identical for me so my only concern is what happens with other filesystems., Yes, DFS and any ChecksumFileSystem like LocalFileSystem all already cache file poition somewhere. That's why I took out CachedPoisition in FSDataInputStream. The problem is caused by RawLocalFileSystem not caching its file position.

Doug and I talked over IM and he thinks it is better to put the cached file position in the highest level as possible so it can be shared. I feel it is better cached in BufferedFSInputStream., I took a look at BufferedFSInputStream. It is quite hard to implement file position cache there because its read methods are implement in its parent class java.io.BufferedInputStream. Now I dont have any strong opinion on where we should cache the file position., There was no strong consensus here, so we'll go with the smallest patch.  Re-attaching that version now, so that Hudson will grab it.

> Only correction needed there is that return value of 0 from fis.read() is a valid return and position should be incremented.

Incrementing by zero is a no-op, so I don't see this as a bug., >> Only correction needed there is that return value of 0 from fis.read() is a valid return and position should be incremented.

> Incrementing by zero is a no-op, so I don't see this as a bug.

when {{in.read()}} returns zero, it implies it read one byte whose value is zero. So position should be incremented by one. I think we should cancel the patch., > when in.read() returns zero, it implies it read one byte whose value is zero.

Oops.  Good point.  The fact that this passed unit tests shows that we never actually call read() on this stream, since it's always buffered, but still, it shouldn't have a buggy implementation.  Thanks for catching that., New version that correctly handles the case when read() returns zero., +1 overall.  Here are the results of testing the latest attachment 
http://issues.apache.org/jira/secure/attachment/12369455/HADOOP-2172-4.patch
against trunk revision r594460.

    @author +1.  The patch does not contain any @author tags.

    javadoc +1.  The javadoc tool did not generate any warning messages.

    javac +1.  The applied patch does not generate any new compiler warnings.

    findbugs +1.  The patch does not introduce any new Findbugs warnings.

    core tests +1.  The patch passed core unit tests.

    contrib tests +1.  The patch passed contrib unit tests.

Test results: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/1095/testReport/
Findbugs warnings: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/1095/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/1095/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Patch/1095/console

This message is automatically generated., I just committed this., Integrated in Hadoop-Nightly #303 (See [http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Nightly/303/])]