[changed component affected, changed title, Stuffs jobName between \Q and \E so it is treated as a literal value., All but org.apache.hadoop.fs.TestLocalDirAllocator tests pass. 

Did not include a unit test since most of these methods are private to JobHistory..

 [exec] -1 overall.  
     [exec] 
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec] 
     [exec]     -1 tests included.  The patch doesn't appear to include any new or modified tests.
     [exec]                         Please justify why no tests are needed for this patch.
     [exec] 
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec] 
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec] 
     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs warnings., If I'm not missing something, the following String replaceAll is not useful.
{noformat}  
+    private static String escapeRegexChars( String string ) {
+      return "\\Q"+string.replaceAll("\\\\E", "\\\\E")+"\\E";
+    }
+
{noformat}

If possible can you add unit test with jobNames having metacharacters and \E etc. , Relates to HADOOP-4017, Chris,
Can you help us reproduce this bug? What should be the jobname which can lead to this issue? Plz include a testcase which
{code}
1) Submits a job with the *special* job name
2) Check if the job submission succeeds 
{code}
This test should fail without the fix., I'll add a unit test for this. , good catch on the regex, this works much better

{noformat}
    private static String escapeRegexChars( String string ) {
      return "\\Q"+string.replaceAll("\\\\E", "\\\\E\\\\\\\\E\\\\Q")+"\\E";
    }
{noformat}

via a println of the pattern..

{noformat}
jobName           pattern
------------------------------------------------
[[name] value]    \Q[[name] value]\E
name \Evalue]     \Qname \E\\E\Qvalue]\E
{noformat}

let me know if this doesn't seem right. i'll run the full test suite in the morning., escapes \E properly. includes two unit tests as suggested, all tests pass except TestLocalDirAllocator, which always fails for me (even with a clean tree).

[exec] +1 overall.  
     [exec] 
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec] 
     [exec]     +1 tests included.  The patch appears to include 3 new or modified tests.
     [exec] 
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec] 
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec] 
     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs warnings., I submitted the job with name : [[name] value], without the patch and the job was successful. 
I was able to parse the history of the jobs with complex names too, both from the web ui and history viewer.
Also the Testcase: testComplexName passes without the patch, though the Testcase: testComplexNameWithRegex failed

Can you tell us how to reproduce the issue?

, both tests now properly exercise the bug, Thank for being patient with this issues.

the first test now reflects the issue in the same manner it presented. , +1
Latest patch looks good., anyone willing to commit this so we can get into the 0.19.x release?, The following seems not working well.
{noformat}
jobName           pattern
------------------------------------------------
abc\\Exyz         \Qabc\\E\\E\Qxyz\E
{noformat}, > The following seems not working well...
Oops, I was wrong about that.  The replacement is perfect., great news its working for your test case. thanks for testing this., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12392867/hadoop-4498-v3.patch
  against trunk revision 709040.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3513/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3513/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3513/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3513/console

This message is automatically generated., I just committed this. Thanks, Chris!, Integrated in Hadoop-trunk #648 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/648/])
    . Ensure that JobHistory correctly escapes the job name so that regex patterns work. Contributed by Chris Wensel.
]