[Are you proposing to leave them in their current location and add them to the classpath through hadoop-env.sh, or to move them into common/lib for 0.20 and hadoop-mapreduce/lib for 0.22, 0.23, and beyond?
Should we anticipate any side-effects ( for example to have both schedulers on the CP)?, Owen recommended to put the jar files into $HADOOP_PREFIX/share/hadoop/$project/lib to reduce custom script to construct class path for contrib projects.  For capacity-scheduler and fair scheduler, the package path are clean and independent from each other, there shouldn't be any issue to have both on the class path., Customize thrift, fair scheduler, and capacity scheduler to put their jar files in $PREFIX/share/hadoop/lib for binary layout, or $PREFIX/lib for tar layout., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12494273/HADOOP-7615.patch
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-HADOOP-Build/171//console

This message is automatically generated., +1 lgtm for 20-sec and 205.  Re trunk, Eric says, "This is currently not possible to generate for trunk due to yarn packaging and mapreduce structure layout is not finalized/working."
, Committed this to the branch-0.20-security and branch-0.20-security-205 branches. Keeping the issue open to track the commit on trunk., I see the target version here is pretty old and there is no activity on the Jira since a long time. Does this still need to be in 0.23? We can re-target this if so or else close the issue., {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12494273/HADOOP-7615.patch
  against trunk revision .

    {color:red}-1 patch{color}.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-HADOOP-Build/3782//console

This message is automatically generated., On 0.23 branch, there is no contrib beside fuse in hadoop hdfs project.  Structure has mainly changed due to project layout has been refactored by maven project build of Hadoop. Fuse is the only contrib project in hdfs, and it doesn't need to be on the default class path of Hadoop.  Hence, close this as resolved.]