[a patch for YAHOO 0.20.S branch. not for commit to trunk. , A trivial patch for trunk, which simply moves the version checking ahead of AuthMethod checking in the same block of code. No additional test needed., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12437833/c6613-01.patch
  against trunk revision 918624.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/408/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/408/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/408/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-h4.grid.sp2.yahoo.net/408/console

This message is automatically generated., I just committed this patch (which was manually tested) to trunk. Thanks, Kan!, Integrated in Hadoop-Common-trunk-Commit #300 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Common-trunk-Commit/300/])
    HADOOP-6613. Moves the RPC version check ahead of the AuthMethod check. Contributed by Kan Zhang.
, Integrated in Hadoop-Common-trunk #364 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Common-trunk/364/])
    HADOOP-6613. Moves the RPC version check ahead of the AuthMethod check. Contributed by Kan Zhang.
]