[{{testOsSecureRandomSetConf}} doesn't assert anything, we can remove it., Attach the simple patch., yes. {{testOsSecureRandomSetConf}} doesnt assert anything.
I think, test's intention is to verify the closure of previous streams properly when the {{setConf()}} is called. I think since there is no foolproof assert method available for this (lsof count may change because of some other things also),  no assertion was done after executing lsof.

I wonder, why simple command execution hangs?, Thanks Vinay for the comments.
I have not gone to see the detail reason on those jenkins servers why it failed, and also don't see this failure in my local env.

But whether the previous stream is closed, it can be covered by code review. I believe the code logic of that part is straight and simple. 
And it's not a good way to use {{lsof}}, it's not accurate and can be affected by other processes and there is no assertion too., {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12687963/HADOOP-11424.001.patch
  against trunk revision 1050d42.

    {color:green}+1 @author{color}.  The patch does not contain any @author tags.

    {color:green}+1 tests included{color}.  The patch appears to include 1 new or modified test files.

    {color:green}+1 javac{color}.  The applied patch does not increase the total number of javac compiler warnings.

    {color:green}+1 javadoc{color}.  There were no new javadoc warning messages.

    {color:green}+1 eclipse:eclipse{color}.  The patch built with eclipse:eclipse.

    {color:red}-1 findbugs{color}.  The patch appears to introduce 3 new Findbugs (version 2.0.3) warnings.

    {color:green}+1 release audit{color}.  The applied patch does not increase the total number of release audit warnings.

    {color:green}+1 core tests{color}.  The patch passed unit tests in hadoop-common-project/hadoop-common.

Test results: https://builds.apache.org/job/PreCommit-HADOOP-Build/5299//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-HADOOP-Build/5299//artifact/patchprocess/newPatchFindbugsWarningshadoop-common.html
Console output: https://builds.apache.org/job/PreCommit-HADOOP-Build/5299//console

This message is automatically generated., [~hitliuyi], thanks for the report and the patch. Looks like this issue duplicates HADOOP-11125. May I close this?, Sure, I make it as duplication. I just see I have ever commented in HADOOP-11125 too, I forget that we have that JIRA. So go ahead.]