[This patch is known to fix SortValidator on single-node clusters, but may have not work on multi-node clusters.  See HADOOP-2567 for details., Here is a fix to SortValidator which has been tested on both single-node and fully-distributed clusters. 

I've also supplied a test-case, TestMiniMRDFSSort, which runs {{randomwriter + sort + sort-validator}} to hopefully catch problems like this earlier in the process..., -1 overall.  Here are the results of testing the latest attachment 
http://issues.apache.org/jira/secure/attachment/12373907/HADOOP-2646_1_20080124.patch
against trunk revision 614721.

    @author +1.  The patch does not contain any @author tags.

    javadoc +1.  The javadoc tool did not generate any warning messages.

    javac +1.  The applied patch does not generate any new compiler warnings.

    findbugs +1.  The patch does not introduce any new Findbugs warnings.

    core tests -1.  The patch failed core unit tests.

    contrib tests +1.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1664/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1664/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1664/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/1664/console

This message is automatically generated., Simpler patch suffices here, since mapred.input.file is already fully-qualified... I'll put it up shortly., Updated patch,  with a simpler fix. I'll continue testing..., Does Path.equals(String) do what you want?, Oops.  Nevermind.  The patch looks good.  +1, Seems to work on big clusters too... marking it PA., I ran these tests against http://issues.apache.org/jira/secure/attachment/12373990/HADOOP-2646_2_20080124.patch on my own machine.

    @author +1.  The patch does not contain any @author tags.

    javadoc +1.  The javadoc tool did not generate any warning messages.

    javac +1.  The applied patch does not generate any new compiler warnings.

    findbugs +1.  The patch does not introduce any new Findbugs warnings.

Arun, once you run "ant test" on your own machine with no failures, you can commit this., Nigel pointed out that sorting 10M might not be better than sorting 1M, so minor change to the config for the rw/sort., Uh, I'm flip-flopping on this one and going back to 10M - it doesn't seem to matter much during test runs. 

Unit tests pass (an unrelated HDFS test failed), so I'm committing this., I just committed this.  Thanks Arun!, Integrated in Hadoop-trunk #380 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/380/])]