[Attaching the fix proposal., Can you please elaborate on the cause and the fix? Thanks!, Thanks for reviewing Bikas.

bq.Can you please elaborate on the cause and the fix?
The problem I see is that LocalJobRunner does not work with private distributed cache files. Private DC files are files that are not visible to "others" on the LFS leading to them being marked as private in DC. Check out the fix I did to TestMRWithDistributedCache, this is an E2E use case. Specifically, {{testLocalJobRunner}} now fails without my code fix.

The fix is in the LocalJobRunner to explicitly localize the private cache (I saw this pattern being used for private DC cache localization in some tests).

This is something that is nice to have especially on Windows, as all files are private by default (not visible to "others"). HADOOP-8731 has some info on DC on Windows that might be helpful., bq. Check out the fix I did to TestMRWithDistributedCache, this is an E2E use case.
What fix are you mentioning?, What I mean is that I made a small change to TestMRWithDistributedCache such that the test fails without my fix to the LocalJobRunner. 

{code}
+    // Change permissions on one file to be private (others cannot read
+    // the file) to make sure private distributed cache works fine with
+    // the LocalJobRunner.
+    FileUtil.chmod(fourth.toUri().getPath(), "700");
{code}

Let me know if this clarifies things., So if I understand this right, this fixes a generic deficiency in LocalJobRunner which wasnt showing up because by default files are public to read on Linux FS and so LocalJobRunner would not see issues in accessing private distributed cache from the local FS.
Also, this would make the change to TestMRWithDistributedCache unnecessary?, Thanks Bikas.

bq. So if I understand this right, this fixes a generic deficiency in LocalJobRunner which wasnt showing up because by default files are public to read on Linux FS and so LocalJobRunner would not see issues in accessing private distributed cache from the local FS.
Correct, this is how I see the problem.

bq. Also, this would make the change to TestMRWithDistributedCache unnecessary?
Given that I'm making a bug fix I should also add a test case that catches the bug. In this case, it was enough to slightly modify one test to catch the bug. Make sense?
, Sorry. I got totally confused and misread the test file name in the patch. +1. Thanks!, +1, looks good. Verified that the test fails without the code change and passes with.

Just committed this to branch-1-win. Thanks Ivan!, Awesome, thanks!]