[getTracker was removed, because the static variable holding the job tracker was removed. This is a good thing., It is a good thing in the long run, but shouldn't we have first deprecated getTracker()?, There isn't a way to get the old functionality without leaving the static variable. I think the static variable and the usage of it was causing trouble because the reference was visible before the object was finished being constructed.

I'm also confused how user code is calling this meaningfully, since it would have to be running in the job tracker's process, which doesn't load user code., I think we should close this as "Will Not Fix".  But whatever the outcome, it certainly shouldn't be marked for fixing in 0.16., Does HADOOP-2487 help? The patch there adds an API getAllJobs in JobTracker. You could create a JobSubmissionProtocol proxy and call this method (look at the patch for details).., bq. There isn't a way to get the old functionality without leaving the static variable. I think the static variable and the usage of it was causing trouble because the reference was visible before the object was finished being constructed.

Fair point. Should we just mark HADOOP-1819 as an *incompatible change* for reference?

bq. But whatever the outcome, it certainly shouldn't be marked for fixing in 0.16.

+1

, I agree that we should not hold up 0.15.2 for this and that we should not revive the static for 0.16.  So, perhaps, if we identify some reasonable use of this method and we make a 0.15.3 release then this could be revived there, in the 0.15 branch only., Assigning to 0.15.3 for consideration.  Doug? Owen?, I'd still go with Owen's comment: mark it as "won't fix" and then move HADOOP-1819 to the *INCOMPATIBLE CHANGES* section..., I fixed the issue by moving the HADOOP-1819 comment in the change log to the incompatible section and mentioning the removed method explicitly., Integrated in Hadoop-Nightly #366 (See [http://lucene.zones.apache.org:8080/hudson/job/Hadoop-Nightly/366/])]