[testRPCInterruptedSimple and testRPCInterrupted started a server which they never stopped leaving some of the threads behind.

Attaching the patch to solve the problrm, Mit, Thanks for filing this issue and beginning the work. It really help move the Hadoop project allow. Couple of helpful (I hope) hints. I see the TestRPC test also fails on trunk in the same way, when running with JDK7. Perhaps let's update the summary to reflect the issue. In addition, I have been labeling jdk7 issues with the java7 label to help track all issue that fail as part of the jdk7 migration. Lastly, the patch you have provided applies to branch-2 but not trunk. Here is how contributors navigate that scenario, though there is no rule. In general, work is contributed to trunk and then merged to appropriate branches. If a patch will apply to trunk and all destination branches, then name that patch like you have. If a patch is for a particular branch then the patch name should reflect the branch so as to reflect its destination (suggestion HADOOP-10171-branch-2.patch). A comment can be made describing the destination of each patch files attached to the jira. In the case like we have above please provide two separate patches, one for trunk and one for branch-2. In order not to confuse jenkins, attach the patch for trunk last, since jenkins will use the last attached file and apply that to trunk to produce the Hadoop QA test-patch report. This will allow you to submit your patch, while having patches for multiple branches. Sorry for the lengthy message, but hope that it helps.

Jon, Thanks Jon for the helpful tips.
- I had checked the code for trunk and I saw that the changes that I had for branch2 were already in there. But I will investigate more and find out what is causing the problem.
- For the patch name, I am deleting the old patch re-uploading the patch with the modified name to make it more clear to understand., Attaching the patch for trunk.

Thanks Jon for pointing this out. On further investigation, I found that the server was not being stopped in #testConnectionPing. It is now fixed.

PS: This test was also the issue in branch-2. I just forgot to mention the test name in the comment above, Thanks for addressing the comments so quickly, Mit. I'm +1 on these changes pending +1 from Hadoop QA., {color:green}+1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12619133/HADOOP-10171-trunk.patch
  against trunk revision .

    {color:green}+1 @author{color}.  The patch does not contain any @author tags.

    {color:green}+1 tests included{color}.  The patch appears to include 1 new or modified test files.

    {color:green}+1 javac{color}.  The applied patch does not increase the total number of javac compiler warnings.

    {color:green}+1 javadoc{color}.  The javadoc tool did not generate any warning messages.

    {color:green}+1 eclipse:eclipse{color}.  The patch built with eclipse:eclipse.

    {color:green}+1 findbugs{color}.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    {color:green}+1 release audit{color}.  The applied patch does not increase the total number of release audit warnings.

    {color:green}+1 core tests{color}.  The patch passed unit tests in hadoop-common-project/hadoop-common.

    {color:green}+1 contrib tests{color}.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-HADOOP-Build/3364//testReport/
Console output: https://builds.apache.org/job/PreCommit-HADOOP-Build/3364//console

This message is automatically generated., Thanks, Mit., SUCCESS: Integrated in Hadoop-trunk-Commit #4909 (See [https://builds.apache.org/job/Hadoop-trunk-Commit/4909/])
HADOOP-10171. TestRPC fails intermittently on jkd7 (Mit Desai via jeagles) (jeagles: http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1552024)
* /hadoop/common/trunk/hadoop-common-project/hadoop-common/CHANGES.txt
* /hadoop/common/trunk/hadoop-common-project/hadoop-common/src/test/java/org/apache/hadoop/ipc/TestRPC.java
, FAILURE: Integrated in Hadoop-Yarn-trunk #426 (See [https://builds.apache.org/job/Hadoop-Yarn-trunk/426/])
HADOOP-10171. TestRPC fails intermittently on jkd7 (Mit Desai via jeagles) (jeagles: http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1552024)
* /hadoop/common/trunk/hadoop-common-project/hadoop-common/CHANGES.txt
* /hadoop/common/trunk/hadoop-common-project/hadoop-common/src/test/java/org/apache/hadoop/ipc/TestRPC.java
, FAILURE: Integrated in Hadoop-Mapreduce-trunk #1643 (See [https://builds.apache.org/job/Hadoop-Mapreduce-trunk/1643/])
HADOOP-10171. TestRPC fails intermittently on jkd7 (Mit Desai via jeagles) (jeagles: http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1552024)
* /hadoop/common/trunk/hadoop-common-project/hadoop-common/CHANGES.txt
* /hadoop/common/trunk/hadoop-common-project/hadoop-common/src/test/java/org/apache/hadoop/ipc/TestRPC.java
, FAILURE: Integrated in Hadoop-Hdfs-trunk #1617 (See [https://builds.apache.org/job/Hadoop-Hdfs-trunk/1617/])
HADOOP-10171. TestRPC fails intermittently on jkd7 (Mit Desai via jeagles) (jeagles: http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1552024)
* /hadoop/common/trunk/hadoop-common-project/hadoop-common/CHANGES.txt
* /hadoop/common/trunk/hadoop-common-project/hadoop-common/src/test/java/org/apache/hadoop/ipc/TestRPC.java
]