[[~stevel@apache.org] [~mattf] [~arpitagarwal],
Kindly advise., good catch —and very good for finding the root cause, as it means that if it is the problem, then its only in the not-yet-shipped 2.8+ code.

I think the fallback logic is there for cross volume rename; if I have two volumes mounted on the FS, /mnt/v1 and /mnt/v2, then a {{rename("/mnt/v1/file.txt", "/mnt/v2/")} can only work with copy. Should we support that? I'm not sure now, after all, the raw OS doesn't do this, does it?

At the very least, the fallback code must do that directory existence check, as you suggested., HADOOP-9805 is mostly just a refactoring of a patch I wrote for HADOOP-9507 to provide POSIX-like behavior on Windows by allowing full replacement of a destination directory if it's empty.  I think the only logical difference of HADOOP-9805 is that it added an explicit check for running on Windows.  I'd be surprised if HADOOP-9805 introduced the problem.

I don't think either HADOOP-9507 or HADOOP-9805 are the root cause of the current problem though.  Instead, I think the behavior you see is a result of the final {{FileUtil#copy}} call.  That line of code goes waaaay back.  (I stopped digging through the git log at 2008, but the code even pre-dates that.)

We have to assume that there are wide ecosystem dependencies on this behavior for {{RawLocalFileSystem}}, so I don't think it's realistic to change that behavior right now.  This is different from HDFS semantics, where the rename would fail.  The contract tests are largely derived from HDFS semantics.  The local file system is an unusual one-off in several ways, and clients have different expectations for its semantics compared to HDFS or an alternative Hadoop-compatible file system.

To address this test failure, I think it would be appropriate for the test suite subclass to override {{testRenameFileMoveToNonExistentDirectory}} and annotate it with {{@Ignore}}.  The semantics exercised by the test are not applicable to the local file system, so it makes sense to skip it.  Alternatively, we could introduce another contract flag to control the test's behavior.  I think that would be overkill though, because I'm pretty sure this is going to be a one-off for the local file system., [~stevel@apache.org], [~cnauroth],

Thank you guys for getting back to me.

First of all, yes, fallback logic was added way before HADOOP-9805.

I looked into it a bit deeper and it seems this rename situation is not that simple. We have 9 methods in FileSystemContractBaseTest which is broken and 6 of 9 is broken by fallback logic.
I have a small list about it (it was my notes during the debugging):
{code}testRenameFileMoveToNonExistentDirectory
	Fallback creates the missing directory
testRenameDirectoryAsExistingFile
	Move fails but fallback behavior throws exception. Test expects only a false
testRenameDirectoryMoveToNonExistentDirectory
	Fallback creates the missing directory
testRenameChildDirForbidden
	Fallback will throw an exception (cannot copy x to ist subdirectory y) but contract expects just a false
testMoveDirUnderParent
	renameTo return false (which is good) but fallback throws exception while test does not expect exception
testRenameNonExistentPath
	rename returns with false but fallback throws exception
{code}

bq. I'm not sure now, after all, the raw OS doesn't do this, does it?
Yes, it does. In case of one volume mv command do just a rename. The inode will not change. In case of multi-volume the OS does a copy-delete.

I checked Jakarta IO commons and Guava how do they handle this and they use the same solution as we do in RawLocalFileSystem (if renameTo false, do a copy-delete). It is not good for us because we do not know why the renameTo returned false (so we can't decide whether the false was returned due to cross-volume move or other problem).
From JDK 7 a new method was introduced. [Files.move|https://docs.oracle.com/javase/7/docs/api/java/nio/file/Files.html#move%28java.nio.file.Path,%20java.nio.file.Path,%20java.nio.file.CopyOption...%29] do more or less the same as renameTo and it handles the cross-volume situation.

Now I am confused what to do:
# Skip this one and solve others
# Skip all the rename related contracts
# Solve all the broken contracts with FileUtil#copy
# Solve all the contracts with [Files.move|https://docs.oracle.com/javase/7/docs/api/java/nio/file/Files.html#move%28java.nio.file.Path,%20java.nio.file.Path,%20java.nio.file.CopyOption...%29]
# Other

What do you guys think?, 
Short term, lets skip those tests. As {{FileSystemContractBaseTest}} is a Junit 3 test, it can't be @Ignored; you have to just override those test cases with empty ones...it doesn't show up in the test reporter.

Other things to note

# really FS.rename() should follow the semantics of the posix {{rename()}} command [http://pubs.opengroup.org/onlinepubs/9699919799/functions/rename.html] *not that of {{mv}}*. 
# HDFS doesn't quite get it right
# an other things vary

This is something we allude to in the filesystem.md specification file [http://hadoop.apache.org/docs/current/hadoop-project-dist/hadoop-common/filesystem/filesystem.html].

Looking at it, it actually calls out what HDFS does compared to Local FS, stating "this is what happens". I didn't look into the details of why locafs was doing that when I wrote that doc and the contract tests, just mentioned it happened and added a flag for the contract tests {{"rename-creates-dest-dirs"}}, which should be set to indicate behaviour.


Short term: just set that option in the contract-test-options XML file to get through the tests.

Mid term: we do need to look at this; moving to java 7 IO would be a start ... there's a JIRA there which nobody has every fully addressed. Maybe that'll be something to work on *after* getting all these tests in.

(BTW: thanks for your due diligence in determining the history of this feature and what other code gets up to —your thoroughness is appreciated), Thanks for your reply. I will skip rename related tests now.
bq. just set that option in the contract-test-options XML file to get through the tests
I do not really understand this. "rename-creates-dest-dirs" are set  correctly now in either in localfs.xml or rawlocal.xml. I can't find contract-test-options.

Which do you think the best resolution for this JIRA? "Later" maybe?, bq. I do not really understand this. "rename-creates-dest-dirs" are set correctly now in either in localfs.xml or rawlocal.xml. I can't find contract-test-options.

I think the issue may be that the failure is in {{FileSystemContractBaseTest}}.  This is a "contract" test suite, but it predates the larger contract test framework that Steve wrote, so it doesn't respect the contract options like rename-creates-dest-dirs.

Short-term, I think skipping via a subclass override makes sense.  Longer term, perhaps we need to look at consolidating all test suites named "Contract" back into the larger contract test framework.  There is likely some redundancy between the test cases, and eliminating the redundancy might improve test execution times.

As far as this JIRA, I agree with resolving it as Later.  I don't anticipate being able to change this behavior of {{RawLocalFileSystem}} any time soon because of the downstream ecosystem dependencies.

Echoing Steve's comment, thank you very much for digging into this.  Semantic differences across the different file systems are tricky issues., Thanks for both of your help. I am closing this JIRA with Later resolution.]