[-1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12393414/NeededRepl.patch
  against trunk revision 711734.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3543/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3543/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3543/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3543/console

This message is automatically generated., I did manual testing, which confirms the change works as suspected.
# Create a new file system containing a few files by starting name-node and 2 data-nodes, and loading a couple of files into it. Then stop the cluster.
# Start name-node with {{dfs.safemode.threshold.pct = 1.1}}
# Start one data-node, which contains exactly one copy of each block.
# Call {{dfsadmin -metasave tmp.txt}}. File tmp.txt will show that there is 0 "Blocks waiting for replication:".
# Call {{dfsadmin -safemode leave}}. The name-node will leave safe-mode.
# Call {{dfsadmin -metasave tmp.txt}}. File tmp.txt will show that the number of "Blocks waiting for replication:" > 0, 
and will list all blocks of the file system because they are all under-replicated.

Without the patch the last step would still show "Blocks waiting for replication: 0"., 
Does the call to leaveSafeMode() in checkMode() also need to pass 'true' for second arg?, Yes, we are going to always verify misreplicated blocks then.
I am removing the boolean parameter then, since it always has the same value true., I'll fix Raghu's issue in subsequent issue., I just committed this., Integrated in Hadoop-trunk #654 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/654/])
    . Calculate mis-replicated blocks when safe-mode is turned of manually. Contributed by Konstantin Shvachko.
]