[A simple solution would be to move the test and source JARs into {{share/hadoop/<component>/tests/}} {{share/hadoop/<component>/sources/}}. , did a clean build, verified the test and source JARs are in the proposed directories. Started pseudo cluster and run a few examples to verify nothing got broken., This is basically a dup of HADOOP-8723, or vice-versa.  I think HADOOP-8723 would have gone in quite some time ago, but note that moving the test jars out of the classpath makes running the tests in those jars more cumbersome.  For example, sleep jobs don't "just work" anymore, because they depend upon test code in the common test jar.  I don't think the typical user will care much, but QE setups will have to adapt since sleep jobs are referenced pretty often there.  Maybe we could add a "hadoop test-classpath" or "hadoop classpath tests" command to spit out the classpath for running tests to make this easier., Jason, I've done a quick search before opening this JIRA but I didn't hit HADOOP-8723. Please feel free to close one of them, if closing this one, then HADOOP-8723 should move all sources JARs out of the <component> dir to <component>/sources. I like the idea of the hadoop test-classpath command. , {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12556054/HADOOP-9116.patch
  against trunk revision .

    {color:green}+1 @author{color}.  The patch does not contain any @author tags.

    {color:red}-1 tests included{color}.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    {color:green}+1 javac{color}.  The applied patch does not increase the total number of javac compiler warnings.

    {color:green}+1 javadoc{color}.  The javadoc tool did not generate any warning messages.

    {color:green}+1 eclipse:eclipse{color}.  The patch built with eclipse:eclipse.

    {color:green}+1 findbugs{color}.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    {color:green}+1 release audit{color}.  The applied patch does not increase the total number of release audit warnings.

    {color:green}+1 core tests{color}.  The patch passed unit tests in hadoop-assemblies.

    {color:green}+1 contrib tests{color}.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-HADOOP-Build/1848//testReport/
Console output: https://builds.apache.org/job/PreCommit-HADOOP-Build/1848//console

This message is automatically generated., I dup'd HADOOP-8723 to this JIRA since it looked like the patch's approach was a bit cleaner.

HADOOP-9260 was committed which moves the source jars out of the classpath to fix a bug with picking up the wrong version string sometimes.  So the patch needs to be updated to that change and we still need some way to make running the tests easier, like the hadoop test-classpath command.
, Refreshing patch to trunk's HEAD. did a full build and verified JARs are in the right (new) dirs and Hadoop still works., {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12568644/HADOOP-9116.patch
  against trunk revision .

    {color:green}+1 @author{color}.  The patch does not contain any @author tags.

    {color:red}-1 tests included{color}.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    {color:green}+1 javac{color}.  The applied patch does not increase the total number of javac compiler warnings.

    {color:green}+1 javadoc{color}.  The javadoc tool did not generate any warning messages.

    {color:green}+1 eclipse:eclipse{color}.  The patch built with eclipse:eclipse.

    {color:green}+1 findbugs{color}.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    {color:green}+1 release audit{color}.  The applied patch does not increase the total number of release audit warnings.

    {color:green}+1 core tests{color}.  The patch passed unit tests in hadoop-assemblies.

    {color:green}+1 contrib tests{color}.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-HADOOP-Build/2167//testReport/
Console output: https://builds.apache.org/job/PreCommit-HADOOP-Build/2167//console

This message is automatically generated., The patch looks pretty good to me. Jason, does it look OK by you? +1 from me if so., I think the patch looks fine for moving the test jars out of the normal classpath.  My only remaining concern is that this now makes running the test jars more difficult, as the user needs to construct a custom classpath to get some of the tests to run (e.g.: sleep jobs).  I'm worried this change could break QE setups that run a number of these tests, and it would be nice to make updating to this change relatively painless.

I checked with one of our QE managers, and he also liked the idea of something like "hadoop test-classpath" so it's easy to determine what classpath to use when running the tests., Agree, but shouldn't that be part of another JIRA? Also, all JARs (like junit) currently in lib/ should be move to tests/ as well, thus getting rid ALL stuff that is not require to run the cluter. Or you think all should be done in this JIRA?, I'm OK with deferring the lib/ stuff to another JIRA.

We could also move the "hadoop test-classpath" or whatever tool we come up with to ease running the tests to another JIRA.  However I worry that the JIRA could easily linger for quite a while, leaving us with a build that breaks a lot of QE setups and the tool to assist migration isn't going to be there.  Bottom line is I don't want to make this change unnecessarily painful for QE if we can do something reasonable to make it easier for them to update their tests.  If that weren't the case, HADOOP-8723 would have gone in long ago., \\
\\
| (x) *{color:red}-1 overall{color}* |
\\
\\
|| Vote || Subsystem || Runtime || Comment ||
| {color:red}-1{color} | patch |   0m  0s | The patch command could not apply the patch during dryrun. |
\\
\\
|| Subsystem || Report/Notes ||
| Patch URL | http://issues.apache.org/jira/secure/attachment/12568644/HADOOP-9116.patch |
| Optional Tests | javadoc javac unit |
| git revision | trunk / f1a152c |
| Console output | https://builds.apache.org/job/PreCommit-HADOOP-Build/6329/console |


This message was automatically generated., \\
\\
| (x) *{color:red}-1 overall{color}* |
\\
\\
|| Vote || Subsystem || Runtime || Comment ||
| {color:red}-1{color} | patch |   0m  0s | The patch command could not apply the patch during dryrun. |
\\
\\
|| Subsystem || Report/Notes ||
| Patch URL | http://issues.apache.org/jira/secure/attachment/12568644/HADOOP-9116.patch |
| Optional Tests | javadoc javac unit |
| git revision | trunk / f1a152c |
| Console output | https://builds.apache.org/job/PreCommit-HADOOP-Build/6335/console |


This message was automatically generated.]