[-1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12523932/hadoop-8307.patch
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-HADOOP-Build/882//console

This message is automatically generated., Can we, please, get this trivial change in so I can pull this RC into Bigtop?, This issue is introduced by merge "http://svn.apache.org/viewvc?view=revision&revision=1306744". 
which removed the subant call on task-controller and jsvc ant target. This merge will also affect the rpm and deb packages of hadoop by not having task-controller binary packaged. 
I propose we reverted the above said merge which would solve the issue of not having task-controller binary in rpm, deb and tar ball.
 , this issue is introduced by merge "http://svn.apache.org/viewvc?view=revision&revision=1306744". 
which removed the subant call on task-controller and jsvc ant target. This merge will also affect the rpm and deb packages of hadoop by not having task-controller binary packaged. 
I propose we reverted the above said merge which would solve the issue of not packaging task-controller binary in rpm, deb and tar ball., I have reverted only the build.xml portion of that merge, which was apparently accidentally included.
See https://issues.apache.org/jira/browse/MAPREDUCE-3377?focusedCommentId=13266972&page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel#comment-13266972

Does that mean we don't need HADOOP-8307 any more?, Actually, we do need it because the build works again for accidental reasons. Namely that the restored dependency causes the topological sort to happen to work. We should fix it in 1.1.x so that it doesn't accidentally break again., The issue identified in the title of this bug was resolved by fixing the integration error in [MAPREDUCE-3377 change #1306744|https://issues.apache.org/jira/browse/MAPREDUCE-3377?focusedCommentId=13266972&page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel#comment-13266972].  So this patch isn't required.  

Owen says it should be done anyway, to correctly include task-controller in architecture-specific builds.  But Matt feels the staging directory should in fact start out empty, even for a cumulative build of 64 and 32 bit architecture-specific environments, and that the build process should copy in all required subcomponents.  Suggest resolving this as part of HADOOP-8364., bq. But Matt feels the staging directory should in fact start out empty, even for a cumulative build of 64 and 32 bit architecture-specific environments, and that the build process should copy in all required subcomponents. Suggest resolving this as part of HADOOP-8364.

Matt - Did you mean yourself by that Matt or someone else? ;)

If this is to be resolved as part of HADOOP-8364, can we close it out as a dupe or so?, owen: is this still considered something worth applying?, {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12523932/hadoop-8307.patch
  against trunk revision 6f9fe76.

    {color:red}-1 patch{color}.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-HADOOP-Build/5500//console

This message is automatically generated., At this point it really is a dup of HADOOP-8364 especially given that branch-1 is not the most actively developed branch in hadoop]