[Fails in 0.19 also., It looks like this is broken due to HADOOP-4014 commit. Actually, the test failed even in the hudson build of that patch. But I guess that was overlooked.., HADOOP-4014 changed the api FileUtil.makeShellPath(File) to consider the CanonicalPath for the File passed. TestMiniMRMapredDebugScript passes "./testscript" which should be expanded by the bash later. But the new api resolves the path earlier. 
The same problem can occur in streaming, with -mapper/-reducer commands given as relative path (relative to the working directory), which should be expanded later by the bash. 

One solution is to pass a boolean to the api to consider canonical path or not. And pass false by default. 
Then, the api looks like:
{noformat}
  public static String makeShellPath(File file) throws IOException {
    return makeShellPath(file, false);
  }
  public static String makeShellPath(File file, boolean makeCanonicalPath) throws IOException {
    if (makeCanonicalPath) {
      return makeShellPath(file.getCanonicalPath());
    } else {
      return makeShellPath(file.toString());
    }
  }
{noformat}

Thoughts?, Patch modyfing the api as suggested., test-patch result:
{noformat}
     [exec] -1 overall.
     [exec]
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec]
     [exec]     -1 tests included.  The patch doesn't appear to include any new or modified tests.
     [exec]                         Please justify why no tests are needed for this patch.
     [exec]
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec]
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec]
     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs warnings.
     [exec]
     [exec]     +1 Eclipse classpath. The patch retains Eclipse classpath integrity.
     [exec]
{noformat}

All core and contrib tests passed on machine.

    [junit] Running org.apache.hadoop.mapred.TestMiniMRMapRedDebugScript
    [junit] Tests run: 1, Failures: 0, Errors: 0, Time elapsed: 41.46 sec
, I just committed this. Thanks, Amareshwari!, Integrated in Hadoop-trunk #634 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/634/])
    . Adds an extra arg to the API FileUtil.makeShellPath to determine whether to canonicalize file paths or not. Contributed by Amareshwari Sriramadasu.
]