[Patch against branch-1.0. I wasn't able to run the Jenkins test locally, the instructions in HowToContribute seem to be for Hadoop 2. There isn't anything testable in the patch anyway., Thanks Matthias. 

Is net.sf.kosmosfs actually being used anywhere in branch-1? The only imports are to org.kosmix, and per the following in ivy/hadoop-core.pom I think we can remove it.

{code}
    <!--Kosmos filesystem
    http://kosmosfs.sourceforge.net/
    This is not in the central repository
    -->
    <!--
        <dependency>
          <groupId>org.kosmix</groupId>
          <artifactId>kfs</artifactId>
          <version>0.1</version>
          <scope>optional</scope>
        </dependency>
    -->
{code}

Otherwise the patch looks great!, Thanks for your review! I don't know kfs, but I think there's some confusion because Hadoop's kfs-0.2.2 uses {{org.kosmix}} as the groupId while kfs-0.3 uses {{net.sf.kosmosfs}} as the groupId. It's the same package though, in Java they both use the {{org.kosmix}} package name space. It's commented in the ivy config because kfs-0.2.2 and older aren't available through Maven central. This is why the lib is checked into svn.

The problem with my patch is that we can't downgrade to kfs-0.2.2 without causing problems for Maven users. There are three options: 1) leave it at 0.3, 2) deploy kfs 0.2.2 to Maven central, or 3) upgrade Hadoop to use kfs-0.3. Option 3 sounds like the best but I have no way of testing this (there's no test case and wiki documentation seems to have moved on to Hadoop 2). It compiles with some warnings, but whether it actually works is a different question., How about just removing the kosmosfs section from the pom entirely? If we use 0.2.2 and it's not available then that seems OK. kfs is an optional component anyway., Yeah, I think that's a good idea, thanks! I've updated the patch., +1 lgtm, I've verified the build contains versions as specified., I've committed this to branch-1. Thanks Matthias!, Merged to branch-1.1., Closed upon release of 1.1.1., Could we please commit this fix to branch-1-win too?  Thanks!, I have merged the patch to branch-1-win.]