[I meant "hadoop job -list [all]"., Currently all the columns are tab separated. So the tab separation does not align the column in a proper manner because we are relying on the system tab width and width of the text which is being printed on to the console.

I am attaching the patch by initializing the _schedulingInfo_ in the _JobStatus_ to _NA_. So this should print _schedulingInfo_ column of jobs which have none appear as "NA", bq. initializing the schedulingInfo in the JobStatus to NA
In that case, we can remove the empty string checks for JobStatus.schedulingInfo (JspUtil.java +146).

Irrespective of this, the output will become a lot cleaner if we fix the column alignment issue. Will file a JIRA for that., Attaching patch removing the JspUtil check. , Fixing the column with alignment can break the existing script which might dependent on the tab delimited values which are currently being generated by the script. Making any changes or making it fixed with table would mean rewriting parsing logic which scripts might currently use today. Plus this would mean that we would have to make assumptions on length of the scheduling information on a particular job or other attributes which are currently being displayed., + for the patch. Running it through Hudson., bq. the output will become a lot cleaner if we fix the column alignment issue. Will file a JIRA for that.
The output doesn't look too bad after this patch, fixing columns is less important now; it can wait for later., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12390904/HADOOP-4238-2.patch
  against trunk revision 701273.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3426/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3426/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3426/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3426/console

This message is automatically generated., The core test failing are not related to this patch. The reason why this patch does not contain any test is because it is a trivial change to scheduling info string in Job status., This is a minor UI enhancement, and not a blocker for Hadoop 0.19, IMHO., Just committed this. Thanks, Sreekanth!, Integrated in Hadoop-trunk #640 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/640/])
    ]