[I think the problem is in 
{quote} FileStatus[] org.apache.hadoop.fs.viewfs.ViewFileSystem.InternalDirOfViewFs.listStatus(Path f)  {quote}
even if inode is instance of INodeLink, it can be still a directory
i.e the mount points in viewFS on client, can be treated as symbolic link directories.

Please correct me if i am wrong, *Resolution* : decide if the mount point is a directory or not by querying the target filesystem
Submitting the patch for same. Please review, \\
\\
| (x) *{color:red}-1 overall{color}* |
\\
\\
|| Vote || Subsystem || Runtime || Comment ||
| {color:blue}0{color} | pre-patch |  14m 29s | Pre-patch trunk compilation is healthy. |
| {color:green}+1{color} | @author |   0m  0s | The patch does not contain any @author tags. |
| {color:green}+1{color} | tests included |   0m  0s | The patch appears to include 1 new or modified test files. |
| {color:green}+1{color} | javac |   7m 26s | There were no new javac warning messages. |
| {color:green}+1{color} | javadoc |   9m 36s | There were no new javadoc warning messages. |
| {color:green}+1{color} | release audit |   0m 22s | The applied patch does not increase the total number of release audit warnings. |
| {color:green}+1{color} | checkstyle |   1m  7s | There were no new checkstyle issues. |
| {color:green}+1{color} | whitespace |   0m  0s | The patch has no lines that end in whitespace. |
| {color:green}+1{color} | install |   1m 36s | mvn install still works. |
| {color:green}+1{color} | eclipse:eclipse |   0m 32s | The patch built with eclipse:eclipse. |
| {color:green}+1{color} | findbugs |   1m 40s | The patch does not introduce any new Findbugs (version 3.0.0) warnings. |
| {color:red}-1{color} | common tests |  23m  6s | Tests failed in hadoop-common. |
| | |  59m 58s | |
\\
\\
|| Reason || Tests ||
| Failed unit tests | hadoop.fs.viewfs.TestViewFileSystemLocalFileSystem |
|   | hadoop.fs.viewfs.TestViewFileSystemWithAuthorityLocalFileSystem |
|   | hadoop.security.token.delegation.web.TestWebDelegationToken |
\\
\\
|| Subsystem || Report/Notes ||
| Patch URL | http://issues.apache.org/jira/secure/attachment/12734076/HDFS-8413.patch |
| Optional Tests | javadoc javac unit findbugs checkstyle |
| git revision | trunk / ce53c8e |
| hadoop-common test log | https://builds.apache.org/job/PreCommit-HDFS-Build/11057/artifact/patchprocess/testrun_hadoop-common.txt |
| Test Results | https://builds.apache.org/job/PreCommit-HDFS-Build/11057/testReport/ |
| Java | 1.7.0_55 |
| uname | Linux asf906.gq1.ygridcore.net 3.13.0-36-lowlatency #63-Ubuntu SMP PREEMPT Wed Sep 3 21:56:12 UTC 2014 x86_64 x86_64 x86_64 GNU/Linux |
| Console output | https://builds.apache.org/job/PreCommit-HDFS-Build/11057/console |


This message was automatically generated., I think this unexpected {{ls -r}} behavior is undesirable but those directories _are_ in fact symlinks and FileStatus specifically states that something can't be both a symlink and a directory:
{code}
    // The variables isdir and symlink indicate the type:
    // 1. isdir implies directory, in which case symlink must be null.
    // 2. !isdir implies a file or symlink, symlink != null implies a
    //    symlink, otherwise it's a file.
{code}

It is actually more of the client's responsibility to dereference symlinks. The {{ls}} command specifically avoids dereferencing symlinks.

[~manojg], I know you've been working on ViewFS recently, do you have any thoughts on this behavior?, [~ajithshetty]
bq. {code}
-
-          result[i++] = new FileStatus(0, false, 0, 0,
+          boolean isDir=link.isMergeLink;
+          if (link.targetDirLinkList.length == 1) {
+            try {
+              isDir =
+                  link.targetFileSystem.getFileLinkStatus(link.getTargetLink())
+                      .isDirectory();
{code}
LinkMerge / MergeMounts are not supported yet. But, I see your point of reaching out to the target filesystem to find if the linked item is indeed a directory or not. 

[~xkrogen]
In the context of ViewFileSystem, all the linked entities - be it be Dir or File in target filesystem are of type INodeLink. Only the internal directories in the ViewFileSystem mount tree are of type INodeDir. So, [~ajithshetty] pointed out, ViewFileSystem treats only its internal directories as Dirs and all others as linked files. So, the FileStatus[] returned by ViewFileSystem has the Dir flag turned off for all the linked Directories in the target filesystem making the LS command stop the file tree traversal. 

Given the scale ViewFileSystem could be, returning millions of FileStatus[] across all namenodes could be a problem for Clients as well. So, I was assuming the intention for {{listStatus}} on ViewFileSystem is to only list the mount tree and not the entire world. But, this doesn't go well "ls -R" expectation from Clients. [~andrew.wang], any thoughts on the expectation for "ls -R" on ViewFileSystem root ?, I don't have a fully educated opinion on this topic, but I normally look to Unixy behavior to determine user expectations of HDFS. "ls -R /" lists everything. When I stat a mount point, it's a directory, not a symlink.

Symlinks are currently not enabled in HDFS, so no downstream apps have ever encountered a symlink. Again looking at Unix as a guide, applications still don't handle symlinks correctly from a correctness or security POV after decades of existence. So, if we can roll out VFS without requiring apps to understand symlinks, I'd be happy.

A lot of our apps use HDFS APIs like the shell or {{FileSystem#listFiles}}. We'd want these to work the same way regardless of how the VFS is sharded, for transparency.

Can we dredge up any of the initial motivations from the VFS design docs or JIRA?

Given that existing FSs can already span to 100s of millions of files, clients need to handle high scale no matter what. For the CLI ls command, I'm hoping we're using the iterator-based listing methods, as well as providing a mode that doesn't try to align columns (which requires buffering all the output)., It would be good to have {{-ls -R}} operation on ViewFs to work as it would on Unix. But I do have a concern/ question about recursively listing files/ directories in ViewFs. How are we handling the scenario where one mount target is a parent of another mount target. For example, in the config below, if we recursively list the files/ directories under viewFs root, then the files/ directories under {{/user}} will be listed twice (once for {{/nn1}} and once for {{/user}}). I think this would be a bad experience for users.
{code:java}
fs.defaultFS = viewfs:///

fs.viewfs.mounttable.default.link./nn1 = hdfs://ns1/

fs.viewfs.mounttable.default.link./user = hdfs://ns1/user/

{code}
 

One option is to duplicate the behavior as is for symlinks in Unix. In Unix, {{ls -R}} does not list the contents of a symlink's target. We need to add "*{{-L | --dereference}}*" option to recursively list contents of symlinks along with directories.
 We can copy this behaviour in ViewFs. That is, we recursively list the contents of mount's target filesystem only when {{-ls -R}} is called with the option {{-L}}. This would still list the contents of \{{/user}} twice for the scenario mentioned above, but I think that should be fine. 

Would love to hear thoughts on this.]