[
Simply commented out the line and the problem is fixed.
, Unfortunately this patch removes cppunit entirely from ac, we need cppunit for the tests. Rather this patch should make cppunit an option for configure - ie "on" by default, with a commmand line option to configure to turn off. I think there is a std way to do this in ac., this patch conditionally excludes cppunit

./configure --without-cppunit 

will eliminate the check for cppunit. (check is on by default)

Self documenting - ./configure --help will list the available options - without-cppunit is included there.

I verified that the build works in both cases - and that unit tests pass if option is not used.
, Note to reviewer: ignore patch_zookeeper_273.txt -- that's the old patch. only consider ZOOKEEPER-273.patch, +1 ... changed the readme to reflect the new option for building the c library., I just committed this. Thanks pat and runping., Integrated in ZooKeeper-trunk #211 (See [http://hudson.zones.apache.org/hudson/job/ZooKeeper-trunk/211/])
    . Zookeeper c client build should not depend on CPPUNIT. (pat and runping via mahadev)
, As of 3.1.0 release, this doesn't seem to work as advertised:

./configure --without-cppunit
make

...
aclocal:configure.ac:36: warning: macro `AM_PATH_CPPUNIT' not found in library
...
Makefile.am:68: wildcard tests/*.cc: non-POSIX variable name
Makefile.am:68: (probably a GNU make extension)
Makefile.am:68: wildcard tests/*.h: non-POSIX variable name
Makefile.am:68: (probably a GNU make extension)
Makefile.am:77: shell cat tests/wrappers.opt: non-POSIX variable name
Makefile.am:77: (probably a GNU make extension)
Makefile.am:90: shell cat tests/wrappers-mt.opt: non-POSIX variable name
Makefile.am:90: (probably a GNU make extension)
...
configure.ac:36: error: possibly undefined macro: AM_PATH_CPPUNIT
      If this token and others are legitimate, please use m4_pattern_allow.
      See the Autoconf documentation.
make: *** [configure] Error 1
, thanks for pointing it out chris.
I have created a new jira to fix the problem - ZOOKEEPER-316]