[The culprit this time is the use of {{com.sun.management.UnixOperatingSystemMXBean}}., Patch available for review. It switches to use the {{OSMXBean}} class., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12656866/ZOOKEEPER-1973.patch
  against trunk revision 1612015.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    -1 findbugs.  The patch appears to introduce 83 new Findbugs (version 2.0.3) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2209//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2209//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2209//console

This message is automatically generated., +1, thanks for the quick follow-up [~bhavanki]. , [~phunt]: small & nice to have patch for the upcoming alpha releases. , lgtm. Thanks Bill! Committed to trunk., FAILURE: Integrated in ZooKeeper-trunk #2381 (See [https://builds.apache.org/job/ZooKeeper-trunk/2381/])
ZOOKEEPER-1973. Jetty Server changes broke ibm6 support (Bill Havanki via phunt) (phunt: http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1612359)
* /zookeeper/trunk/CHANGES.txt
* /zookeeper/trunk/src/java/main/org/apache/zookeeper/server/admin/Commands.java
]