[Proving patch to fix above mentioned issue. Pls review and feedback. Thanks, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12826758/zkServer.sh.patch
  against trunk revision 1757584.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3379//console

This message is automatically generated., +1 LGTM, BTW i think the patch is not applying because you didn't do the diff relative to the root of the zookeeper repo, thank you for review, i will upload again., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12826786/zkServer.sh.patch
  against trunk revision 1757584.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 2.0.3) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3382//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3382//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3382//console

This message is automatically generated., committed to 3.5.3 and trunk. Thanks Rakesh!, SUCCESS: Integrated in Jenkins build ZooKeeper-trunk #3068 (See [https://builds.apache.org/job/ZooKeeper-trunk/3068/])
ZOOKEEPER-2536: When provide path for 'dataDir' with trailing space, it is taking correct path (by trucating space) for snapshot but creating temporary file with some junk folder name for zookeeper_server.pid (Rakesh Kumar Singh via phunt) (phunt: [http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1759739])
* (edit) trunk/CHANGES.txt
* (edit) trunk/bin/zkServer.sh
, Thank you for feedback and commit !!!]