[In the latest HTML page (zookeeperStarted.html) I removed the reference to the Programmer's guide because it doesn't have any section with logging output examples., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12561027/ZOOKEEPER-1488.patch
  against trunk revision 1421098.

    +1 @author.  The patch does not contain any @author tags.

    +0 tests included.  The patch appears to be a documentation patch that doesn't require tests.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1295//console

This message is automatically generated., Fixing the links., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12561035/ZOOKEEPER-1488.patch
  against trunk revision 1421098.

    +1 @author.  The patch does not contain any @author tags.

    +0 tests included.  The patch appears to be a documentation patch that doesn't require tests.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1296//console

This message is automatically generated., Hi Edward, those files are generated. In order to fix this you'll need to edit the source documents in src/docs/src/documentation/content/xdocs/..

You'll need to re-generate the docs to verify your changes 
bq. ant -Dforrest.home=~/apache-forrest-0.9 docs
forrest can be downloaded here: http://forrest.apache.org/mirrors.cgi

results are output to the docs subdirectory.

Easiest way to submit the patch is to checkout the trunk using svn, make the edits, "svn diff > ZOOKEEPER-1488.patch", (create the patch from the toplevel directory) then attach the patch here. More detail here:
https://cwiki.apache.org/confluence/display/ZOOKEEPER/HowToContribute
, Oh, thanks Patrick! And sorry for the initial mess up. I will fix that and patch again asap. Your tips are very welcomed, thanks again.

By the way, I have just seen that the PDF generated in the in the docs section still has a 2008 copyright notice ("Copyright © 2008 The Apache Software Foundation. All rights reserved"). Should I open a ticket to update this? Or may I try to include in this patch?, bq. By the way, I have just seen that the PDF generated in the in the docs section still has a 2008 copyright notice ("Copyright © 2008 The Apache Software Foundation. All rights reserved"). Should I open a ticket to update this? Or may I try to include in this patch?


Thanks for pointing that out Edward. Please open a jira for that., Cancelling while the patch is being updated.]