[GitHub user hanm opened a pull request:

    https://github.com/apache/zookeeper/pull/326

    ZOOKEEPER-2862: Incorrect javadoc syntax for web links in StaticHostProvider.java.

    Javadoc does not offer any special tagging for web links - the "@link" etc is for linking with other javadocs of the classes / methods. Use normal html markup instead. 
    
    This fixes warning messages generated when running "ant javadoc". Verified generated javadoc that the web link is functional.

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/hanm/zookeeper ZOOKEEPER-2862

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/zookeeper/pull/326.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #326
    
----
commit d7f662e584729be11e0570121a0bab3cc899639b
Author: Michael Han <hanm@apache.org>
Date:   2017-08-03T18:05:16Z

    ZOOKEEPER-2862: Incorrect javadoc syntax for web links in StatisHostProvider.java.

----
, -1 overall.  GitHub Pull Request  Build
      

    +1 @author.  The patch does not contain any @author tags.

    +0 tests included.  The patch appears to be a documentation patch that doesn't require tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 3.0.1) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-github-pr-build/923//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-github-pr-build/923//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-github-pr-build/923//console

This message is automatically generated., Github user asfgit closed the pull request at:

    https://github.com/apache/zookeeper/pull/326
, Github user hanm commented on the issue:

    https://github.com/apache/zookeeper/pull/326
  
    Merged to master and 3.5 to reduce noise level of precommit jenkins job:
    master: https://github.com/apache/zookeeper/commit/69c8cbea1dcc95bb1b4eb01cbfd667a1bfba1f5d
    3.5: https://github.com/apache/zookeeper/commit/71dbe74065d7139e216981009ad3d62c7a120761
]