[This is a tentative patch to fix the problems pointed out on QuorumPeer and FastLeaderElection.

1- Makes logicalclock volatile;
2- Creates accessor methods for currentVote and state, and enforce their use;
3- Accessor methods are synchronized.

-F, Please check the attached patch., A quick look at the patch looks good to me. However there is a "long logicalclock" in AuthFastLeaderElection.java as well. It looks like it should also be volatile., Have made logicalclock on AuthFastLeaderElection volatile as well., Please review. -F, Mahadev please review this patch., assigning this back to flavio since he is working on the patch and I will review it., I updated flavio's patch for the new directory structure on apache., This patch fails "ant test", specifically I see alot of the following in the log:

Exception in thread "QuorumPeer" java.lang.NullPointerException
	at org.apache.zookeeper.server.quorum.QuorumPeer.run(QuorumPeer.java:397)

(I ran the tests 3 times, failed each time in the same way, mainline test passes fine)
This is ubuntu machine with java 1.6.0_06 (single cpu/core), PS, in future please use the <id>.patch naming scheme, ie. ZOOKEEPER-2.patch, thanks., Variable state on QuorumPeer was not initialized, so the exceptions Pat observed. I fixed it, and generated a patch against the apache repository. QuorumTest still fails, but it fails in my computer even without this patch with the same erros, so I don't think it is a problem with this patch., Submitted a new patch with the problem that Pat pointed out fixed., flavio -  while we are at it ... can we improve the documentation with javadocs in FastLeaderElection? I am happy to open another jira for it but seems a little redundant... In particular Messenger class lacks javadocs, class workersender lacks javadocs, some of the methods in FastLeaderElection class lack javadoc as well. It will help us lesser mortals to understand leader election better with some javadocs :).  , +1 on Mahadev's doc request., Added javadoc comments., +1 the patch looks good... and passes the tests as well... 
, I just committed this. Thanks Flavio., Integrated in ZooKeeper-trunk #67 (See [http://hudson.zones.apache.org/hudson/job/ZooKeeper-trunk/67/])]