[Attaching a patch that overrides the default contrib package target with a REST-specific one that includes all of the required directories. I'm hoping to add a package to Apache Bigtop that provides the REST service (BIGTOP-1267). A release including this patch would be required for that., fwiw, lgtm +1. cc: [~michim], [~phunt], Hi Sean,

The patch looks good to me as well, but it doesn't apply cleanly with svn. Could you generate the patch with "git diff --no-prefix", and click on "Submit Patch" button when it's ready.

Thanks!
--Michi, I'll update the patch and check in., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12641856/ZOOKEEPER-1911.patch
  against trunk revision 1588584.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2062//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2062//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2062//console

This message is automatically generated., Thanks, Michi, I appreciate it. My apologies for getting distracted and not responding to your request., trunk: http://svn.apache.org/viewvc?view=revision&revision=1589949
branch-3.4: http://svn.apache.org/viewvc?view=revision&revision=1589950

Thanks Sean!, FAILURE: Integrated in ZooKeeper-trunk #2301 (See [https://builds.apache.org/job/ZooKeeper-trunk/2301/])
ZOOKEEPER-1911. REST contrib module does not include all required files when packaged (Sean Mackrory via michim) (michim: http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1589949)
* /zookeeper/trunk/CHANGES.txt
* /zookeeper/trunk/src/contrib/rest/build.xml
]