[This patch ups the limit of concurrently active connections to 32768, and allocates these handles dynamically in increasing powers of two.

Handles are re-used when they are correctly closed. This involves an O(n) scan of the handle array, but I think this is preferable to the overhead of managing linked lists with O(1) lookup. 

Tests are included.

, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12421470/ZOOKEEPER-541.patch
  against trunk revision 822065.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    -1 patch.  The patch command could not apply the patch.

Console output: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h7.grid.sp2.yahoo.net/1/console

This message is automatically generated., This patch requires ZOOKEEPER-510 to be committed. , Restarting Hudson now that ZOOKEEPER-510 has gone in., Henry, you want to make this "patch available", not "in progress".  I seem to be locked out of doing that otw I would fix it., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12421470/ZOOKEEPER-541.patch
  against trunk revision 823371.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h7.grid.sp2.yahoo.net/2/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h7.grid.sp2.yahoo.net/2/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h7.grid.sp2.yahoo.net/2/console

This message is automatically generated., +1 Looks good. Tests look good to me as well., Integrated in ZooKeeper-trunk #497 (See [http://hudson.zones.apache.org/hudson/job/ZooKeeper-trunk/497/])
    . zkpython limited to 256 handles
]