[Fix by making zk use the echo executable directly when -n in use., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12439463/zk-722.diff
  against trunk revision 925362.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h1.grid.sp2.yahoo.net/35/console

This message is automatically generated., Hi Ivan - 

Thanks for the patch - it looks good.

Hudson can't apply it because - I think - you used git diff to generate the patch file which doesn't produce patch -p0 compatible patchfiles. Could you regenerate with git diff --no-prefix and resubmit? Hudson will be able to apply the patch then. 

Thanks.
Henry
, Hi Henry,

I had assumed it used -p1, I've resubmitted the patch now without the  
prefixes.

-Ivan



, Assigning back to Ivan after I gave Hudson a kick :), -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12439471/zk-722.diff
  against trunk revision 925362.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h1.grid.sp2.yahoo.net/36/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h1.grid.sp2.yahoo.net/36/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h1.grid.sp2.yahoo.net/36/console

This message is automatically generated., this is a shell script change, no test for those currently.

Please review for commit, prolly should verify on unix/mac/cygwin., Patch looks good, verified for linux/cygwin., +1 Thanks Ivan!]