[Slating for 3.4. This would be a great project for someone interested in both zk and python 3 support. ;-), In py3k PyString_AsString does not exist

see http://www.velocityreviews.com/forums/t674572-where-is-the-pystring_asstring-in-python-3-0-a.html

There is no PyString_AsString. Everything string is unicode now. (PyUnicode API)

example:

PyString_FromString -> PyUnicode_FromString
PyString_Concat -> PyUnicode_Concat
etc...

To get a char * you have to explicitly encode the string with
PyUnicode_AsEncodedString.
, Please find my first attempt to resolve this issue as three attachments
The zookeeper.c file (full code attached + diff file) now supports a compilation with python3.1 and python2.6.
(I used conditional compilation as recommended at
http://docs.python.org/py3k/howto/cporting.html )

I converted the python test to py3k syntax using the '2to3' tool.
So we probably need to add a 2nd directory in the tree (and call it maybe 'tests_py3k'?)

good news:
all the test pass 

bad news:
I could not make logging work (so had to comment the log setup in the tests)

Please let me know what you think, thanks. TuX
, a new version of the C file to also support file streams logs in py3k, the new file streams handling introduced with the above patch should work with both python2.6 and python3.1, so the code could probably be simplified removing the 2.6 conditional compilation preprocessor directive., Adding also a documentation file zookeeper.rst in RST format (standard documentation format for python).
The information has been taken from the ./src/c/pyzk_docstrings.h file.
Attaching the Doc environment in Doc.tgz

To build it just run:

sphinx-build Doc html

It is in theory possible to generate an HTML doc directly from the C docstrings but almost impossible to get a nice HTML ouput.

, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12456008/zookeeper.rst
  against trunk revision 1033155.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://hudson.apache.org/hudson/job/PreCommit-ZOOKEEPER-Build/10//console

This message is automatically generated., Hi TuxRacer, is it possible for you to re-submit this as a single patch file? We generally request all changes in that format, to ensure that it's committed the way you intended (also helps with a bunch of other things like reviewing and hudsonqabot, etc...) here are the basic details: http://wiki.apache.org/hadoop/ZooKeeper/HowToContribute
(basically: svn checkout the code, make changes, "svn diff" and submit the result as ZOOKEEPER-877.patch, you may need to "svn add" if you are adding new files)., I've attached my work on porting {{zkpython}} to Python 3+ (I've tested on 2.6 and 3.2)., I'm assuming this is ready to go? (if not cancel the patch), [~phunt], should we try to get this in?, Committed to 3.4.6 and trunk. Thanks Daniel & TuxRacer., SUCCESS: Integrated in ZooKeeper-trunk #2082 (See [https://builds.apache.org/job/ZooKeeper-trunk/2082/])
ZOOKEEPER-877. zkpython does not work with python3.1 (Daniel Enman via phunt) (phunt: http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1530166)
* /zookeeper/trunk/CHANGES.txt
* /zookeeper/trunk/src/contrib/zkpython/src/c/zookeeper.c
* /zookeeper/trunk/src/contrib/zkpython/src/python/zk.py
* /zookeeper/trunk/src/contrib/zkpython/src/test/connection_test.py
* /zookeeper/trunk/src/contrib/zkpython/src/test/get_set_test.py
* /zookeeper/trunk/src/contrib/zkpython/src/test/zktestbase.py
, Closing issues after releasing 3.4.6.]