[Again the patch looks good but we'll need a patch for branch 3.3 and 3.4., Hi Mahadev,

Here are the patches for 3.3, 3.4, and trunk:

branch-3.3: https://issues.apache.org/jira/secure/attachment/12534134/ZOOKEEPER-1493_3_3.patch
branch-3.4: https://issues.apache.org/jira/secure/attachment/12534135/ZOOKEEPER-1493_3_4.patch
trunk: https://issues.apache.org/jira/secure/attachment/12532779/ZOOKEEPER-1493.patch

I'll update patches for ZOOKEEPER-1494 once these patches are checked in.

Thanks!
--Michi, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12534135/ZOOKEEPER-1493_3_4.patch
  against trunk revision 1355657.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1118//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1118//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1118//console

This message is automatically generated., Michi would it be possible to test this change?, It would be difficult to unit test this without refactoring the code. I did run manual tests to verify the patch fixed the issue, though. 

--Michi, Sure. I looked at the patch it looks fine to me. +1 for committing., Committed, thanks Michi!, Integrated in ZooKeeper-trunk #1628 (See [https://builds.apache.org/job/ZooKeeper-trunk/1628/])
    ZOOKEEPER-1493. C Client: zookeeper_process doesn't invoke completion callback if zookeeper_close has been called (Michi Mutsuzaki via phunt and mahadev) (Revision 1366784)

     Result = SUCCESS
phunt : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1366784
Files : 
* /zookeeper/trunk/CHANGES.txt
* /zookeeper/trunk/src/c/src/zookeeper.c
, this patch also solve a potential hang int zookeeper_close() :-), this patch also solve a potential hang int zookeeper_close() :-), a memory leak for missing free_buffer(bptr)]