[[~nerdyyatrice] Thanks for reporting. Mind to submit a patch? The guideline is https://cwiki.apache.org/confluence/display/ZOOKEEPER/HowToContribute, +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12815510/ZOOKEEPER-2440.patch
  against trunk revision 1750739.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 2.0.3) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3258//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3258//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3258//console

This message is automatically generated., Thanks for the patch Ryan! I am unable to access ZOOKEEPER-2440.patch as an attachment, after a couple of changes you made to this JIRA minutes ago. , Sorry, I accidentally deleted the patch when I thought I was editing another ticket. I've put it back. , -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12815517/ZOOKEEPER-2440.patch
  against trunk revision 1750739.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 2.0.3) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3259//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3259//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3259//console

This message is automatically generated., Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3259//testReport/
does not seem to have any failures. The same patch worked the first time., I wonder what's the next step?, Hi [~nerdyyatrice] Next step is to get your patch reviewed by at least one committer and then committed. Committers are busy (they don't work full time on upstream ZooKeeper) and also we have a pending 3.5.2-alpha release which most of the committers have been focusing on. So expecting some delay on code reviews and ping back if you don't hear any feedback for a while.

, Thanks for the patch, [~nerdyyatrice]. I have a couple of comments and questions:

# I'm wondering if we need the second change in {{FinalRequestprocessor}}. If we get a session moved, doesn't it come in the request exception, do we really need to check the sub-results?
# The test case here isn't entirely reliable. I ran it locally without the processor changes and it passes for me. It it not surprising, though. The issue reported here is basically a race between a follower and the leader. To be able to test it reliability, we will need a way to repro reliably the race.
# Sounds like a good idea to update the comment in the {{catch (SessionMovedException e)}} block in line 421., Canceling patch until we converge., I am moving this out to 3.4.10 for now. Please feel free to discuss the target version, if needed. Thanks!, btw, just cycling back to this issue. I have tried a few times that the test will fail if you just take the test alone. I am happy to discuss in more details.]