[Seems fixed in 3.3.1:

>>> zookeeper.get_children(0, "/", None)
Traceback (most recent call last):
  File "<stdin>", line 1, in ?
zookeeper.ZooKeeperException: zhandle out of range

Issue can be closed., Attached is a patch that fixes issue 732. Can somebody please review?, I've fixed the patch to also include {{ZCLOSING}} and {{ZNOTHING}}. It seems like all the error codes listed in {{zookeeper.h}} {{ZOO_ERRORS}} enum are now handled by {{err_to_exception}}. , Thanks Andrei. Patch looks good to me.
, This issue isn't closed, and indeed 3.3.3-3.3.5, 3.4.* releases do not contain this fix. What has to be done for it to be committed?, Sorry Andrii, I don't know how this got closed without getting checked in. I'm reopening the ticket. , The patch looks good to me, but I like to get +1 from another committer before I check this in since I'm not familiar with zkpython.

Thanks1
--Michi, The fix looks reasonable to me, but I'm also not that familiar to tell., Yeah, patch looks correct as {{ZINVALIDSTATE}} is not handled when converting error num to Exception. Looks like it was simply forgotten because coressponding exception {{InvalidStateException}} is declared., Patch didn't apply cleanly so I have updated and uploaded new patches., +1, trunk Committed revision 1529013. b3.4 Committed revision 1529012., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12606651/ZOOKEEPER-732-trunk.patch
  against trunk revision 1529013.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1635//console

This message is automatically generated., SUCCESS: Integrated in ZooKeeper-trunk #2078 (See [https://builds.apache.org/job/ZooKeeper-trunk/2078/])
ZOOKEEPER-732. Improper translation of error into Python exception (Andrei Savu, Lei Zhang, fpj via fpj) (fpj: http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1529013)
* /zookeeper/trunk/CHANGES.txt
* /zookeeper/trunk/src/contrib/zkpython/src/c/zookeeper.c
, Closing issues after releasing 3.4.6.]