[I thought that during our discussions over 127 we had agreed that outputting an error message would be sufficient given the way we are parsing the configuration file and checking for errors. Without an election port, the default leader election cannot work, and consequently ZooKeeper won't work either. 

I am submitting a patch that makes a server output an error message and exit in the case that election ports are not provided., +1 Looks good Flavio, -1 ... please do not add system.exit in any place except main() methods. All the other places should throw an exception and those exceptions should be caught at main() method and then exit... 

, Good catch Mahadev. 

Flavio, how about a new "InvalidConfigException" with proper message about what caused the issue?
, Whether you guys like it or not, this is the way we currently deal with some configuration errors. Check this piece of code from QuorumPeerConfig.parse():

{code:java}

File myIdFile = new File(dataDir, "myid");
                if (!myIdFile.exists()) {
                    LOG.error(myIdFile.toString() + " file is missing");
                    System.exit(2);
                }
                BufferedReader br = new BufferedReader(new FileReader(myIdFile));
                String myIdString;
                try {
                    myIdString = br.readLine();
                } finally {
                    br.close();
                }
                try {
                    conf.serverId = Long.parseLong(myIdString);
                } catch (NumberFormatException e) {
                    LOG.error(myIdString + " is not a number");
                    System.exit(2);
                }
            }
            instance=conf;
        } catch (Exception e) {
            LOG.error("FIXMSG",e);
            System.exit(2);
        }

{code}


My patch complies with the way we handle critical configuration errors currently. Now we all agree that we should have a better way of dealing with config errors, and for that I have created jira 217. We hence have two options:

# We apply this patch and exit before getting an npe, which again complies with the way we handle config errors currently. Later we fix more generally the problem of handling configuration errors with a patch for 217;
# We make this jira dependent on 217 and work on 217 directly, and we get an npe until then, which is btw fine with me because we currently output an error message pointing out the configuration problem.  

, option 2 is fine with me... there is not point chekc ing in this patch since we will be changing that neway... thanks for creating ZOOKEEPER-217 flavio ... hope you can work on it ... :), cancelling this patch.. since its fixed in ZOOKEEPER-217., fixed with ZOOKEEPER-217.]