[Hi Yunong,

Thank you for the patch. Could you please upload your patch here? This page describes how to submit patches:

http://wiki.apache.org/hadoop/ZooKeeper/HowToContribute

Thanks!
--Michi, [~yunong] this sounds like an important one to fix, can you submit a patch per Michi's comment?, I missed initially that the bug reports the use of the single-thread C client. I have checked the multi-thread one and the transition of states CONNECTED->CONNECTING->CONNECTED in my client code as I stop and restart the server works fine. I'll try to reproduce the problem with the single-thread client., I'm not convinced that this is an issue. I have tested the single-threaded client and I get the state changes correctly via the default watcher. That's the right way to observe the state changes rather than relying on the return value of {{zookeeper_interest}}. A call to {{zookeeper_process}} will make sure to deliver the events. See this for an example:

https://github.com/apache/zookeeper/blob/trunk/src/c/src/cli.c

I could use a second pair of eyes to confirm this, perhaps [~yunong] if still around. , [~fpj] I can confirm that using watcher can get expected connection events. Here is my test case using single thread ZK library [https://goo.gl/hql4B1]. I've tried to start / stop server before / after my tests run and the state changes from watcher are expected. The return code of zookeeper_interest though is not reliable (for example, zookeeper_interest will return OK when the server is dead). Maybe we should add some documentations on the zookeeper_interest to indicate the return code of it should NOT be used for deciding connection status between client and server.
, [~hanm] You're right, unfortunately we don't have good online documentation for the C client, and I'm totally for documenting it. I'm thinking that perhaps we should have a documentation jira for the C client and have one of the tasks be to document the use of the single-thread C client. I'd say that we resolve this issue so that we don't have it as a blocker anymore for 3.5.2. We can alternatively keep it open, link it to the documentation jira, but drop the priority. What do you think?

Btw, I used this code to test the behavior of the single-thread C client:

https://github.com/fpj/zookeeper-book-example/blob/master/src/main/c/master.c  , Link to documentation JIRA sub-task., [~fpj] I think we can resolve this. I also created ZOOKEEPER-2431 and ZOOKEEPER-2432 as a follow up to improve documentation.]