[[~jiangjiafu]
FileTxnSnapLog#save

{code:java}
    /**
     * save the datatree and the sessions into a snapshot
     * @param dataTree the datatree to be serialized onto disk
     * @param sessionsWithTimeouts the session timeouts to be
     * serialized onto disk
     * @param syncSnap sync the snapshot immediately after write
     * @throws IOException
     */
    public void save(DataTree dataTree,
                     ConcurrentHashMap<Long, Integer> sessionsWithTimeouts,
                     boolean syncSnap)
        throws IOException {
        long lastZxid = dataTree.lastProcessedZxid;
        File snapshotFile = new File(snapDir, Util.makeSnapshotName(lastZxid));
        LOG.info("Snapshotting: 0x{} to {}", Long.toHexString(lastZxid),
                snapshotFile);
        try {
            snapLog.serialize(dataTree, sessionsWithTimeouts, snapshotFile, syncSnap);
        } catch (IOException e) {
            if (snapshotFile.length() == 0) {
                /* This may be caused by a full disk. In such a case, the server
                 * will get stuck in a loop where it tries to write a snapshot
                 * out to disk, and ends up creating an empty file instead.
                 * Doing so will eventually result in valid snapshots being
                 * removed during cleanup. */
                if (snapshotFile.delete()) {
                    LOG.info("Deleted empty snapshot file: " +
                             snapshotFile.getAbsolutePath());
                } else {
                    LOG.warn("Could not delete empty snapshot file: " +
                             snapshotFile.getAbsolutePath());
                }
            } else {
                /* Something else went wrong when writing the snapshot out to
                 * disk. If this snapshot file is invalid, when restarting,
                 * ZooKeeper will skip it, and find the last known good snapshot
                 * instead. */
            }
            throw e;
        }
    }
{code}
, In my environment, the save method returned successfully, that means no exception had been thrown. But, the data was not in disk! That's the problem I want to report!

 

And yes, the snapshot with size 0 was invalid, and was skip when ZooKeeper server restarted again., [~jiangjiafu]

1.---->  "*In my environment, the save method returned successfully, that means no exception had been thrown. But, the data was not in disk! That's the problem I want to report!*"

why this situation happend? The disk is full? 
 snapshot does not call *fsync* may be the answer.
 Do you see some logs about *FileTxnSnapLog#save* at that time?
 2.Even if this situation that the size of snapshot is 0 could not cause data inconsistency.
 because when ZooKeeper server restarted again,the invalid snapshots will be skiped,if no any valid snapshot,the leader can do *SNAP* to sync with the follower, I believe ZOOKEEPER-2872 addressed the fsyncing part of this issue and ZOOKEEPER-3082 added some nice cleanup around 0 size snapshot file. Neither of these changes were backported to 3.4 so that suggests one potential path forward. Note that backporting ZOOKEEPER-2872 also requires backporting ZOOKEEPER-2870., [~maoling]

 

why this situation happend? The disk is full? 

No, but the machine restarted.

Do you see some logs about *FileTxnSnapLog#save* at that time?

No any error log, if fact, during the machine reboot, some log of the follower was missing. But from the log of the leader, the follower had received a snapshot and began to received other transaction logs, so the  *FileTxnSnapLog#save of follower must have succeed, but the data is not in disk!*

 

*2.Even if this situation that the size of snapshot is 0 could not cause data inconsistency.*

Yes, I know. Zookeeper recover it's data from both logs and snapshot.

If a ZooKeeper follower believes a snapshot is saved, it believes that the data in the snapshot is all in the disk(but in fact it may be not), it will begin to receive logs that come after the snapshot. If the snapshot is invalid, ZooKeeper server will recover data from logs only, but some data is missing, because the data is only saved in the snapshot.

 , [~nixon] Thanks very much!]