[* Adds a case to leader election to recover from a lost message when one single follower elects a leader, but the leader missed the new vote from the follower. This is not a really critical case because in practice the servers would just move to a new round of leader election, and the likelihood that this keeps happening forever is small;
* It adds a unit test that basically mocks a server to force a particular sequence and interleaving of messages;
* It makes some methods and variables public in QuorumCnxManager to enable the unit test to access them directly.
, +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12414159/ZOOKEEPER-480.patch
  against trunk revision 798038.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-vesta.apache.org/159/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-vesta.apache.org/159/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-vesta.apache.org/159/console

This message is automatically generated., looks great flavio. i think i figured out how the test works. do you mind putting a comment into the test to state your strategy for posterity?
, Added the comment Ben suggested. Thanks, Ben., Uploading the 3.2 version of the patch., Small modification to port assignment in the test, re-running to make sure that still passes all tests., flavio, the patch does not apply any more after ZOOKEEPER-481 commit. can you please update the patch?, Regenerated patch to apply to trunk. Will be posting a new patch for 3.2 trunk shortly., flavio, canm you upload 3.2 patch as well?, Patch for 3.2 branch., I just committed this. thanks flavio., Integrated in ZooKeeper-trunk #405 (See [http://hudson.zones.apache.org/hudson/job/ZooKeeper-trunk/405/])
    . FLE should perform leader check when node is not leading and add vote of follower (flavio via mahadev)
]