[Vishal, I haven't gone through the code to confirm it, but there is one point I don't understand. In your recipe to reproduce the problem, waiting a few seconds should be more than sufficient to make sure that all servers have received the update, no? , I connected the debugger to B and C and paused all threads to make sure B and C don't get a chance to log the request before they crash. I waited a few secs to give A enough time to log the request though., Thanks for taking a look at this Flavio.

I have been thinking of a solution and sharing my thoughts here.
The leader should keep track of the last committed zxid for n epochs previous to the current epoch.
If a follower tries to join and the leader has the last committed zxid of the follower's persisted epoch, the leader first asks the follower to truncate its log to the last committed zxid before starting to send a diff.

If the (current epoch - follower's persisted epoch > n), then the follower cannot get a diff and will have to get a snap instead. 

Looking forward to your comments.
thanks
Vishal, yes, you are correct vishal. i think n=1 is easy to implement and should catch the common cases. the fix should be pretty easy: we just hook into the committedLog processing where the minCommittedLog and maxCommittedLog are maintained (it's just one place in ZKDatabase.java) to track the last zxid for each epoch in the committedLog (or just the prevEpoch if n=1). then we use that in the FollowerHandler to decide when to truncate.

the harder part might be writing the test cases., Thanks Ben,

Yes, n=1 should be easy to implement but I was worried it would lead to more frequent sending of snaps instead of diffs. This could be a problem for ZK installations with large data (some of which are several GB). 

Looking at the code to see the best way to implement this for the general case - I should have an update soon.

thanks!, Good catch Vishal. I agree with Ben. n = 1 should be good enough. It'd be the most common case. , -0, given all the bugs we have been able to find in the protocol implementation recently, I prefer an approach that is perhaps less efficient but easier to read and interpret. Instead of keeping one or more variables and performing more checks, we should simply send a snapshot if the leader has committed anything other than NEWLEADER in the new epoch.   , Flavio, 
Although I agree that code can be made easier to read and interpret, I don't think the bug was there because of poor code readability.

Here is how I hit upon this bug - I started with an academic exercise to compare Paxos and ZooKeeper protocol. My premise was that, if there are any differences, I should 

a. either be able to attribute it to use of TCP and choosing of server with highest zxid as the leader
b. or I should be able to find a bug. This is how I identified this bug.

So my strategy to gaining confidence that the ZK protocol has no bugs, is to review the code (and convince a couple of other folks as well to do the same) and make sure it is equivalent to Paxos modulo above mentioned optimizations :)

We could make the protocol simpler but it would certainly be less efficient. Snapshots, when you have several GB of data are quite expensive. If we don't even fix it for the case of n=1, it would increase the probability of the snapshot transfers.

I have the fix for the general case (n>1) coded and the test written (as Ben said, the test took longer than the fix itself :))

While testing the fix, it looks like I hit another bug in truncate code path. The passed in zxid should be in the truncated log but it isn't. I should be able to send a patch out soon after I have figured that one out.

Thanks!


, Hi Vishal, We've had discussions about Zab not being equivalent to Paxos in the mailing list of ZooKeeper, and we have a paper at DSN 2011 discussing how they differ.

About the code, I didn't mean to imply that the bug was there because of poor readability. Frankly, I have no idea why that bug is there. I thought we were truncating in a certain way, and you've shown that we were not doing what I thought we were doing. Thanks for the observation!

Now one real problem I see is that we were not testing if we were truncating in the scenario is described, which we should, and so I think that tests are indeed an important contribution here. And, I still don't feel comfortable fixing in the way you're proposing, for simplicity., Hi Flavio,

Looking forward to reading your paper. I looked online and found the slide deck but couldn't find a link to the pdf. Could you please forward the link to me?

I agree us not testing all the scenarios is a serious problem - it can let regressions slip through and them not getting caught for several years (as it happened with ZOOKEEPER-1156, which has been there in the code for 2 years).

I fully understand your concern around simplicity. When I submit the patch, please let me know what you think. I found a way to do this without maintaining additional state/variables. The idea is that if the follower has a zxid that the leader doesn't have a matching committed proposal for, the leader asks the follower to truncate to the zxid for which the leader does have a committed proposal and starts sending diffs from that.

My new test is passing with the fix. Interestingly I am seeing JVM crashes in the hammer tests, so I need to investigate that before I can submit the patch.

Thanks!
, The key change is in LearnerHandler.java

If the follower has a zxid that the leader doesn't have a matching committed proposal for, the leader asks the follower to truncate to the highest zxid < peerZxid and starts sending diffs from that., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12491016/ZOOKEEPER-1154.patch
  against trunk revision 1159432.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/469//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/469//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/469//console

This message is automatically generated., I think you have more problems than the failing hammer tests. Look at the logs in FollowerResyncConcurrencyTest, I see a huge number of errors like:

2011-08-19 23:38:42,392 [myid:] - WARN  [QuorumPeer[myid=1]/0:0:0:0:0:0:0:0:11221:DataTree@909] - Failed: Create transaction for /mybar0000004091
     [exec]     [junit] org.apache.zookeeper.KeeperException$NodeExistsException: KeeperErrorCode = NodeExists
     [exec]     [junit] 	at org.apache.zookeeper.server.DataTree.createNode(DataTree.java:483)
     [exec]     [junit] 	at org.apache.zookeeper.server.DataTree.processTxn(DataTree.java:799)
     [exec]     [junit] 	at org.apache.zookeeper.server.persistence.FileTxnSnapLog.processTransaction(FileTxnSnapLog.java:197)
     [exec]     [junit] 	at org.apache.zookeeper.server.persistence.FileTxnSnapLog.restore(FileTxnSnapLog.java:150)
     [exec]     [junit] 	at org.apache.zookeeper.server.ZKDatabase.loadDataBase(ZKDatabase.java:223)
     [exec]     [junit] 	at org.apache.zookeeper.server.quorum.QuorumPeer.loadDataBase(QuorumPeer.java:413)
     [exec]     [junit] 	at org.apache.zookeeper.server.quorum.QuorumPeer.getLastLoggedZxid(QuorumPeer.java:538)
     [exec]     [junit] 	at org.apache.zookeeper.server.quorum.Learner.registerWithLeader(Learner.java:257)
     [exec]     [junit] 	at org.apache.zookeeper.server.quorum.Follower.followLeader(Follower.java:72)
     [exec]     [junit] 	at org.apache.zookeeper.server.quorum.QuorumPeer.run(QuorumPeer.java:716)

, I suspect btw that the random crashes are caused by these lines you added into Learner:
 try {
          sock.close();
        } catch (Exception e) {
          // Ignore any exceptions
        }
        sock = null;, // Committer: This comment is for your review. Please remove this comment before committing.
            // This should not be needed. In case of a SNAP, the snapshot should already have this value.
            // If we set it here, it could end up
            // setting the value back since some changes might get committed on the leader
            // between when the leader reads this value from data tree and when the snap
            // is serialized on the leader. In case of DIFF, the COMMIT messages should set it right.
            // In case of TRUNC, it should correctly get set as part
            // of the truncate call above.
//            zk.getZKDatabase().setlastProcessedZxid(qp.getZxid());


This is incorrect for SNAP. The way we deserialize snapshots from a SNAP request does not set the lastProcessedZXid from the leader, the snapshot does not contain this information at all. It must be sent from the leader to be set correctly., Thanks for reviewing the changes Camille.

Sorry about the test failures - because of the JVM failure, the test log was getting wiped out on my machine, so I couldn't tell what was going on. I regret having ignored the JVM failures.

You are right about your observation about the SNAP (my bad). After seeing the errors in FollowerResyncConcurrencyTest in the jenkins test report, I suspected that and checked the code too. Since the changes in Learner.java are not necessary for the fix for this problem, I'll remove them from my patch. I need to do further investigation of the issue I suspected there and I will file a separate Jira if I find anything. 

With the new patch (without Learner.java changes), I am not seeing the JVM crashes any more, although I see timeouts still. I'll submit the new patch as soon as I've figured out the  solution to the timeout issue and get a completely clean test run.

Thanks! , Submitting an updated patch. 

This patch includes the fix for ZOOKEEPER-1156 as well, since it is necessary for getting the tests to pass.

All tests are passing on this new patch., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12491350/ZOOKEEPER-1154.patch
  against trunk revision 1159929.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/472//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/472//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/472//console

This message is automatically generated., Doing a code review, one general comment: Please don't use assertTrue with equality checks and without a message. If it is an equality check you want to do, use assertEquals, and leave a message telling me what the assert is checking. I would appreciate it if you would upload the patch with this fixed in the tests. Other than that it looks good, I'll apply with that minor fix. Also if we want this to go into the 3.3.3 branch please upload a patch against that branch.., Thanks for reviewing the patch and your feedback Camille. I have made the changes you suggested to the test. Please let me know in case you have any further feedback.

, +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12492776/ZOOKEEPER-1154.patch
  against trunk revision 1164632.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/488//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/488//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/488//console

This message is automatically generated., Looks great Vishal, thanks! Will commit this soon., Committed to trunk r1164758, I want to put this in 3.3.4, and I need to modify the tests to work with the old test stuff. Will close when I fix that and get it checked in., a patch on 3.3.3, If anyone wants to look this over before I check it in, the src tree changes are untouched but I had to modify QuorumPeerTestBase to get the test to run properly. Took some but not all of the changes to this class from trunk., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12492846/ZOOKEEPER-1154.patch
  against trunk revision 1164758.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 6 new or modified tests.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/493//console

This message is automatically generated., Integrated in ZooKeeper-trunk #1293 (See [https://builds.apache.org/job/ZooKeeper-trunk/1293/])
    ZOOKEEPER-1154, ZOOKEEPER-1156: 
Data inconsistency when the node(s) with the highest zxid is not present at the time of leader election
Log truncation truncating log too much - can cause data loss

Vishal Kathuria via camille

camille : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1164758
Files : 
* /zookeeper/trunk/CHANGES.txt
* /zookeeper/trunk/src/java/main/org/apache/zookeeper/server/persistence/FileTxnLog.java
* /zookeeper/trunk/src/java/main/org/apache/zookeeper/server/quorum/LearnerHandler.java
* /zookeeper/trunk/src/java/test/org/apache/zookeeper/server/quorum/QuorumPeerMainTest.java
]