[Attaching a patch for enforcing -Djava.net.preferIPv4Stack=true in unit test environment under windows as well as from cmd scripts for windows. 

This patch also brings the zkEnv.cmd to be more on par with the .sh equivalent. , -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12627041/zookeeper-1848_v1.patch
  against trunk revision 1561672.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1919//console

This message is automatically generated., Here is an updated patch that directly applies to trunk. It would be good if we can get this in. , -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12631632/zookeeper-1848_v2.patch
  against trunk revision 1569590.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1937//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1937//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1937//console

This message is automatically generated., Failed test seems to be flaky. It runs on my node, and the patch only touches .cmd files and build.xml. , +1 for the patch. Rerunning it through jenkins again., The patch doesn't apply anymore.

[~enis], could you rebase the patch and upload it to the reviewboard?

Thanks!, Thanks for looking. I'll rebase the patch after we change the eol style of zkEnv.cmd as well. See ZOOKEEPER-1574., Ok I fixed the line ending in zkEnv.cmd. Thank you for pointing it out!

https://issues.apache.org/jira/browse/ZOOKEEPER-1574]