[-1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12773813/ZOOKEEPER-2330-01.patch
  against trunk revision 1715590.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 2.0.3) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2966//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2966//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2966//console

This message is automatically generated., Merged:

trunk: https://github.com/apache/zookeeper/commit/02c24d21c5f5f6b23f4020f549998ff2cd7f7768
3.5: https://github.com/apache/zookeeper/commit/347b7159ed7e47230f5d4b8e7a707f11c9f3bdcb
, FAILURE: Integrated in ZooKeeper-trunk #2818 (See [https://builds.apache.org/job/ZooKeeper-trunk/2818/])
ZOOKEEPER-2330: ZooKeeper close API does not close Login thread
(Arshad Mohammad via rgs) (rgs: [http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1718121])
* trunk/CHANGES.txt
* trunk/src/java/main/org/apache/zookeeper/ClientCnxn.java
* trunk/src/java/main/org/apache/zookeeper/client/ZooKeeperSaslClient.java
, Thanks [~rgs] for committing the patch.,  After this patch submit, ZOOKEEPER-1371 was committed, which  removed log4j dependency. This patch used log4j MDC API which now resulting in java compilation error. I submitted patch ZOOKEEPER-2335 for the fix, Oops - thanks Arshad. , One Login thread  is shared by many ZooKeeper objects. So it is not appropriate to close the Login thread on ZooKeeper.close() API call.
If there are many ZooKeeper client in one jvm, ZooKeeper.close() call by any client will close the Login thread and TGT will not be refreshed for other client. This will lead to auth fail exceptions
So the change by this patch should be reverted back., If ZOOKEEPER-2396 is fixed then no need to revert the changes in this patch, After ZOOKEEPER-2139 fix, Login object is no more shared among clients. So now it is ok to shutdown the login thread on close() ZooKeeper api call]