[Attached a test case that show the example of corrupted snapshot passed Adler32 check. 

I hard coded a seek value trigger this condition. On other environment, the value may have to change by using the random seek. 

In my case, I only need to do a few run to trigger a case that can bypass checksum.

Also attached a sample log file from this unit test run., Trigger unit test run to see if it repro on build machine, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12602915/TEST-org.apache.zookeeper.server.persistence.FileSnapTest.txt
  against trunk revision 1522079.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 2 new or modified tests.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1575//console

This message is automatically generated., Re-upload the test case, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12602925/ZOOKEEPER.1757.patch
  against trunk revision 1522079.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1576//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1576//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1576//console

This message is automatically generated., Able to repro on build machine, Reducing the severity because it is unlikely the server will load the snapshot cleanly.  It would fail other sanity check while deserializing the snapshot.

However, one thing to note is that we are using just 8-byte Aler32 checksum for the entire snapshot.  For snapshot, i think it would be better to go with md5sum.  In our internal branch, we compress the snapshot before writing, so we get additional checksum through compression   ]