[I am running in to this issue now as well.  It appears to me as though this is only a problem when running more than one zookeeper client per application instance where they have a chroot path that is multiple znodes deep.  Normally that is not a problem since I share the zookeeper client across many threads/services in the application.  However, I do have one use case where there is an administrative task that needs to span multiple zookeeper "clusters" that are partitioned by chroot.

For example I have two clusters of application nodes running under different zookeeper chroots -- say "/blah/version1" and "/blah/version2".  There are many application nodes in the "version1" cluster and many in the "version2" cluster.  These each use chroot to logically partition themselves and it works great.  Each application node holds a single zookeeper client.

I also have an administrative node that is responsible for monitoring both of these clusters.  This node has two zookeeper clients one for each chroot'd cluster.  This works perfectly so long as I am not disconnected from the ensemble.  As soon as I get disconnected I start getting a flood of this StringIndexOutOfBoundsException.

I can easily cause this to happen by having more than one zookeeper client in a single process where both zookeeper clients are using a chroot path that is multiple levels deep.  If I connect to a locally running standalone zookeeper server as soon as I stop and restart the zookeeper server I get this exception.  I have no problems with this test if I run only a single zookeeper client or I run with chroot paths that are only a single znode., This sounds like a duplicate of ZOOKEEPER-961., Ooof been a long day.  The fact that there are multiple znodes in the chroot is inconsequential.  The StringIndexOutOfBounds exception went away because my chroot string got shorter than the full path returned in the event.

In any case I believe the rest of my test is valid.  If there is a single instance that has multiple zookeeper clients connected to the same ensemble if they are completely disconnected then the paths in events can be messed up., Thomas is right. One of the unit tests in the patch to ZOOKEEPER-961 verifies that the StringIndexOutOfBounds no longer occurs. Also, if any path from the server is too short for the current chroot, we no longer throw the exception. Instead a warning is issued and the raw path passed in the event.]