[This looks like a quorum peer was creting a new txn log file and was shutdown in the middle of that. This probably led to corruption of txnlogs in the data directory of one of the quorumpeers. We actually do not have a good story with the corruption with of the transaction logs. Currently we depend on admins manually going to the node and making decisions on how to resolve this.

As a part of this jira we can add documentation in the forrest docs for now, on how to deal with such situations. Also, the logging needs to change to point which file was corrupted., this patch fixes the logging to mention which file is corrupted and then adds forrest docs on handling such kind of failures., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12438038/ZOOKEEPER-663.patch
  against trunk revision 919640.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h8.grid.sp2.yahoo.net/129/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h8.grid.sp2.yahoo.net/129/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h8.grid.sp2.yahoo.net/129/console

This message is automatically generated., no need for a test. it just changes messages and doc., I just committed this. Thanks Mahadev!]