[[~marshall] - Relevant to your patch from ZOOKEEPER-1719, [~CpuID] - Yep, looks like the same problem.  I wasn't aware of the file src/packages/deb/init.d/zookeeper. But it should probably be fixed in the same manner. Do you want to upload a patch? Otherwise I can do so., If you dont mind... :) Theres a src/packages/rpm/ dir as well that probably has the same issue hiding in there., Patch submitted. The one in the rpm directory was actually already using bash, but it didn't follow our convention of using /usr/bin/env so I fixed that one as well to be consistent., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12650106/ZOOKEEPER-1719.patch
  against trunk revision 1601516.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2133//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2133//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2133//console

This message is automatically generated., No new unit tests added as this only changes the shebang at the top of some unused init scripts. The test failure can't possibly be related. But looks very troubling:

     [exec]      [exec] *** glibc detected *** ./zktest-mt: free(): invalid pointer: 0x00002ba1446d0000 ***
, [~marshall]: hmm, too bad the stack trace is incomplete (i.e.: no function names, only addresses). I've seen this before, will build with -g and try a repro. , +1, Committed to trunk. Thanks Marshall., SUCCESS: Integrated in ZooKeeper-trunk #2385 (See [https://builds.apache.org/job/ZooKeeper-trunk/2385/])
ZOOKEEPER-1937. init script needs fixing for ZOOKEEPER-1719 (Marshall McMullen via phunt) (phunt: http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1613326)
* /zookeeper/trunk/CHANGES.txt
* /zookeeper/trunk/src/packages/rpm/init.d/zookeeper
]