[Thanks [~desmondhe] - would you mind submitting a patch? see https://cwiki.apache.org/confluence/display/ZOOKEEPER/HowToContribute for more details., patch for  zookeeper-3.4.6/src/c/src/zookeeper.c, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12657580/ZOOKEEPER-1985.patch
  against trunk revision 1612906.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2227//console

This message is automatically generated., Hi [~desmondhe] - the patch is failing to apply due to the way our qabot works - it applies the patch at (within) the toplevel directory. So you need to create your patch based on this (one level "down"). See the how to contribute wiki page for the easiest ways to do this., I found the instructions on the webpage, but I can't use svn or github in my environment net.  sorry to reply so late due to the weekend.
this is the patch within topsrc path, hope it works.
thks!, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12658053/ZOOKEEPER-1985_v2.patch
  against trunk revision 1613553.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2238//console

This message is automatically generated., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12658097/ZOOKEEPER-1985.patch
  against trunk revision 1613553.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 2.0.3) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2239//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2239//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2239//console

This message is automatically generated., What can I do now?, [~desmondhe], could you please give some more insight on the problem you observed?, Cancelling until we determine whether it is an issue or not., I think this is an important issue to fix.

[~desmondhe] Not sure if you are still working on this since it's been three years since you filed the issue, but just checking - will you be able to update the patch (if needed) and create a pull request to zookeeper git repo? See https://cwiki.apache.org/confluence/display/ZOOKEEPER/HowToContribute for more details on how to create pull request etc.]