[Just to shed some light, HBase folks have been addressing this problem recently, so maybe we can use their code to solve this in Zookeeper too. Below are the JIRAs:

https://issues.apache.org/jira/browse/HBASE-6945
https://issues.apache.org/jira/browse/HBASE-6965, There is on-going discussion in the referenced HBase JIRAs.
Solution in HBase has not been finalized., Thanks Edward and Ted, I also noticed that. , Hello, I got the same problem when using IBM Java. ZOOKEEPER-1474 proposed a new wrapper class to solve this problem (basically it's similar to HBASE solution since we've working together), and was committed to trunk this Wednesday. 

Could you check if this patch solve this issue?, 3.3 branch is pretty much a closed book at this point except for very serious (ie corruption) bugs. Can you check against 3.4 and trunk? afaict it should be a solved issue - I have 3.4 compiling successfully using openjdk on jenkins: https://builds.apache.org//view/S-Z/view/ZooKeeper/, Thanks Patrick, I will check it with IBM JDK and update you., Notice that one of the ibm6 tests is failing consistently here, would be great if someone could address this:
https://builds.apache.org/view/S-Z/view/ZooKeeper/job/ZooKeeper-trunk-ibm6/15/testReport/org.apache.zookeeper.server.util/DynamicConfigBCTest/dynamicConfigBackwardCompatibilityTest/, Patrick, I'm looking this problem. 
The first tests of IBM 6 and trunk was finishing with no problems, but I noticed since last week that this one is failing. Will work in a fix and submit ASAP., Thanks Paulo. Once we have ibm6 in place we'll have nearly every major unix based vm supported. (https://builds.apache.org//view/S-Z/view/ZooKeeper/)

Can you push on builds@apache.org to add ibm7? Then we'll have the majors all in CI., For sure, Patrick. I'll ask to add IBM 7 and let you know to create a new environment on Jenkins., just closed INFRA-6706 add IBM jdk 1.7,  IBM 1.7 64-bit (on Ubuntu only) now available 

/home/jenkins/tools/java/ibm-1.7-64/bin/java -version 
java version "1.7.0" 
Java(TM) SE Runtime Environment (build pxa6470sr5-20130619_01(SR5)) 
IBM J9 VM (build 2.6, JRE 1.7.0 Linux amd64-64 Compressed References 20130617_152572 (JIT enabled, AOT enabled) 
J9VM - R26_Java726_SR5_20130617_1436_B152572 
JIT - r11.b04_20130528_38954ifx1 
GC - R26_Java726_SR5_20130617_1436_B152572_CMPRSS 
J9CL - 20130617_152572) 
JCL - 20130616_01 based on Oracle 7u25-b12]