[Fix the unit test to not catch exceptions
Actually wait for openCallback to be called by using a new control object, +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12415968/ZOOKEEPER-505.1.patch
  against trunk revision 802188.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-vesta.apache.org/181/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-vesta.apache.org/181/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-vesta.apache.org/181/console

This message is automatically generated., Great catch, Utkarsh! I noticed this problem a while ago in the ReadWrite tests and fixed by changing the catch blocks to the following:

{noformat}
catch (BKException e) {
      LOG.error("Test failed", e);
      fail("Test failed due to BookKeeper exception");
}
{noformat}

Clearly we forgot to implement the change in all places. Also, we shouldn't have calls to printStackTrace. Now I wonder if it is best to remove the catch block as you propose or to catch and fail as I propose above. I don't know the exact semantics of junit with respect to exceptions, but recently I've seen a case that a test was throwing an exception and not catching it, and was still passing. 


, Modifications under discussion., committed in ZOOKEEPER-507]