[Please review this change., Hi Jay, the best way to let us know when you want something reviewed is to click "submit patch", that will start the next phase of the workflow.
See also: https://cwiki.apache.org/confluence/display/ZOOKEEPER/HowToContribute, Thanks--I was confused and thought I used "submit patch" after people had approved it., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12512703/ZOOKEEPER-1384.patch
  against trunk revision 1238176.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/934//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/934//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/934//console

This message is automatically generated., This is a change solely to build.xml, so a test isn't appropriate.

I ran ant test using two dev setups, one in which the path pointed to a gcc in /usr/bin and with no LD_LIBRARY_PATH set, and the other using a path pointing to a gcc in /usr/local/bin with LD_LIBRARY_PATH set to /usr/local/lib64:/usr/local/lib. Both compiled and ran the tests fine., Thanks Jay!, Integrated in ZooKeeper-trunk #1500 (See [https://builds.apache.org/job/ZooKeeper-trunk/1500/])
    ZOOKEEPER-1384. test-cppunit overrides LD_LIBRARY_PATH and fails if gcc is in non-standard location (Jay Shrauner via phunt) (Revision 1302281)

     Result = SUCCESS
phunt : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1302281
Files : 
* /zookeeper/trunk/CHANGES.txt
* /zookeeper/trunk/build.xml
]