[updated the docs to reflect the sf issue detail - add comments for zkinit., The documentation states that if the client_id given to zookeeper_init is expired or invalid that a new session will be automatically generated, implying that it will proceed to the CONNECTED state.

In the implementation an expired or invalid client_id leads to the unrecoverable SESSION_EXPIRED_STATE, which requires closing and reopening a new connection with no client_id specified to continue.

Since the server has already assigned a replacement client_id it seems logical to follow the header documentation and proceed with the new value, which appears to be possible by removing the if-block that triggers the expired state in check_events (zookeeper.c).

If the client application needs to know if the session was replaced, it can simply compare the client_id it provided with the client_id upon entering CONNECTED_STATE.

What do you think?, Hrm. I'll withdraw the patch while I look into this further. Thanks for the feedback.
, The documentation is incorrect. An invalid or expired session id will result in a zookeeper_handle that is in the unrecoverable SESSION_EXPIRED_STATE. That comment documented old behavior.

It turns out that processing correctly the situation where the session is expired and a new session is assigned can be tricky. We also wanted the behavior to be consistent with any other case in which an unrecoverable session event is delivered: the zhandle_t becomes invalid.

We need to fix the doc to say that if the session id is expired or invalid the return zhandle_t will also be invalid., I updated the patch based on ben's comments, no change to the semantics of the code, just documentation change.

Does this sufficiently resolve the stated issue?
, +1 Looks great. I'd commit it, but I'm not setup to build the doc..., Committed revision 703595., Integrated in ZooKeeper-trunk #110 (See [http://hudson.zones.apache.org/hudson/job/ZooKeeper-trunk/110/])
    8 FLE Test
. zookeeper_init doc needs clarification
, 3.0.0 has been released, closing issues.]