[This patch:

1- makes a Random object in LeaderElection static to avoid using it only once with every election round;
2- It eliminates a call in QuorumCnxManager that is not necessary anymore (genChallenge);
3- It eliminates unecessary checks for null object in initiateConnection and receiveConnection in QuorumCnxManager. The object checked for null is used before and it will cause an exception to be thrown before reaching the checks. Consequently the checks are unnecessary and findbugs complains about them., +1 for the patch ... ill wait for hudson to run through it before committing., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12404888/ZOOKEEPER-370.patch
  against trunk revision 762602.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    -1 findbugs.  The patch appears to introduce 1 new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-vesta.apache.org/18/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-vesta.apache.org/18/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-vesta.apache.org/18/console

This message is automatically generated., fixing the findbugs warning., There is no hudson report after Mahadev updated the patch, so I'm trying to re-submit it., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12404915/ZOOKEEPER-370.patch
  against trunk revision 762602.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-vesta.apache.org/22/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-vesta.apache.org/22/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-vesta.apache.org/22/console

This message is automatically generated., These are just small fixes to the code following the suggestions of findbugs, and they don't really require new unit tests or changes to existing unit tests., I just committed this. thanks flavio.

, Integrated in ZooKeeper-trunk #276 (See [http://hudson.zones.apache.org/hudson/job/ZooKeeper-trunk/276/])
    . Fix critical problems reported by findbugs. (flavio via mahadev)
]