[Attaching a simple patch which changes the junit 'dir' attribute to be './build/test/' instead of the project source root. This forces the files to dumped at appropriate location., Should the path be set to 'test.data.dir' system property instead? Kindly review and let me know any feedback. Thanks!, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12632003/ZOOKEEPER-1779.patch
  against trunk revision 1569590.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1938//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1938//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1938//console

This message is automatically generated., The test failure (org.apache.zookeeper.server.quorum.StandaloneDisabledTest.startSingleServerTest) seems unrelated and happens with or without the attached patch. More details of the test failure are captured in ZOOKEEPER-1870. 

Also, the fix is in build.xml and does not need any new tests. I tested ReconfigTest and QuorumTest manually with the patch and the files are now generated in './build/test/' directory. , +1 Thanks Abhiraj!, http://svn.apache.org/viewvc?view=revision&revision=1574686, SUCCESS: Integrated in ZooKeeper-trunk #2239 (See [https://builds.apache.org/job/ZooKeeper-trunk/2239/])
ZOOKEEPER-1779. ReconfigTest littering the source root with test files (Abhiraj Butala via michim) (michim: http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1574686)
* /zookeeper/trunk/CHANGES.txt
* /zookeeper/trunk/build.xml
]