[Hi, yeah dynamic file doesn't really make sense in the standalone mode.
Perhaps we could make sure that its unspecified by checking that QuorumPeerConfig.dynamicConfigFileStr wasm't set somewhere in org.apache.zookeeper.server.ServerConfig.readFrom
, Btw I noticed that when in standalone mode the static config file still gets backed up. Probably not an issue though., [~shralex]
Good for sharing the thoughts.

Currently the standalone logic isn't separated out. I think this could be a good chance to refactor standalone code. For example, look at the code:
{code}
    public boolean isDistributed() {
        return quorumVerifier!=null && (!standaloneEnabled || quorumVerifier.getVotingMembers().size() > 1);
    }
{code}
This could be changed to simply returning the boolean.

h2. Regarding standalone mode and dynamic config.

Let me summarize my thoughts and more is welcome to add:

* Pre-assumption: "standaloneEnabled" and "dynamicConfigFile" is *mutually exclusive* in config file.
* Backward-compatibility: A single line -- "server.X=..." in *static* config file is still standalone mode.

h3. TODO
1. check mutual exclusiveness of "standaloneEnabled" and "dynamicConfigFile".
2. Make sure standalone wouldn't create dynamic file.
3. Enforce the minimum number of servers is 2 for any dynamic ensemble. So a server with dynamic file of *one* server wouldn't be able to start.

One question,
what if a user use the new format
{code}
server.1=localhost:X:X:participant; port
{code}
This is a problem because standalone wouldn't get client port from quorum verifier (there isn't one)., In general I don't think improving standalone mode is worth it. The recent introduction of the standaloneEnabled flag and the related support for running the normal non-standalone stack with a single server ensemble makes standalone mode unnecessary. One would probably pretty much always prefer to run with standaloneEnabled = false in a distributed mode. So I expect standalone mode to go away in the future.

> Pre-assumption: "standaloneEnabled" and "dynamicConfigFile" is mutually exclusive in config file.
I don't think this is true. standaloneEnabled may be true or false depending on whether one wants to allow the cluster to shrink to a single server. at the same time dynamicConfigfile can be specified.

> Backward-compatibility: A single line – "server.X=..." in static config file is still standalone mode.
Not sure about that. Standalone mode doesn't understand what a quorum or leader port is, what an observer is, etc. So writing such a line is kindof strange in standalone mode. 
, I think if you take a look at ZOOKEEPER-1691 it can help clarify things., [~shralex]
Okay. Adding a "standaloneEnabled=false" solve all the problems.

My concern is about two scenarios:

1. I set only one server in dynamic config.
dynamic file looks like
{code}
server.X=...participant; 2181
{code}

I wonder if it makes more sense to assume it is equal to "standaloneEnabled=false" if "dynamicConfigFile" is set?

2. same as above. If it is not "standaloneEnabled=false", then the user has made another mistake that client port is added only in dynamic file.

What do you think to deal with this?, Let me give one example and make it clearer:
* static file doesn't set "standaloneEnabled" but has a dynamic config file.
* the dynamic config contains only a single server information.

When it is booted up, the server will be in standalone mode. So there are two potential problems:
* the user might just want to setup a single server and add more servers later.
* the user might not realize that standalone mode requires client port to be in the old way in static file like "clientPort=2818"

I think it would be nice to disable standalone mode if "dynamicConfigFile" is set., I take my suggestion back - everything should work fine now. It doesn't work because of two bugs - see below.

About standaloneEnabled - I think we should have a known default value for standaloneEnabled and that shouldn't change based on other flags. I think it was set to true for backward comaptibility reasons. Michi [~michim] can probably explain better.

But actually, I think there are 2 bugs we should fix.
1) in QuorumPeerConfig the following lines are executed only when its distributed mode. I think this is why the standalone mode doesn't listen on the client port. I think we should move it out of CheckValidity - run it after checkValidity is invoked, wherever that happens. 

QuorumServer qs = quorumVerifier.getAllMembers().get(serverId);
if (qs!=null && qs.clientAddr != null) clientPortAddress = qs.clientAddr; 

2) bin/zkServer.sh doesn't look for for client port in the static file. There is a bunch of code there to find it in the dynamic file but not in the static one if its specified in the new format. Fixing this seems important for backward compatibility. I attach a draft of this fix., Okay. Cool. I will work on fixing the client port thing., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12661917/draft
  against trunk revision 1617921.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 2.0.3) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2280//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2280//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2280//console

This message is automatically generated., Hi [~michim].
Can you help give some insights into standaloneEnabled variable in QuorumPeerConfig? I wonder if this could be improved based on Alex's comments:
{quote}
we should have a known default value for standaloneEnabled and that shouldn't change based on other flags
{quote}, I don't know if I can give you much insight, but the idea was to add an option to disable standalone mode so that you can bootstrap a cluster using the dynamic reconfiguration. The default value for standaloneEnabled is set to true for backward compatibility., Hi Hongchao, thanks for the patch!
Its probably better to take this logic out of CheckValidity. The name of the function implies that its only checking stuff but not modifying state. How about putting it in a separate function and invoking it after CheckValidity ?, {quote}
How about putting it in a separate function and invoking it after CheckValidity ?
{quote}
Sounds good.

I am also waiting for the test result. I expect there would be a few., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12662207/ZOOKEEPER-2006.patch
  against trunk revision 1617921.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 6 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 2.0.3) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2284//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2284//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2284//console

This message is automatically generated., It looks like there is quite a few test failures.

The change I made in QuorumTestBase is that previously a MainThread will write "clientPort" both to static config (zoo.cfg) and dynamic file. Something looks like this, and it's duplicated.
{code}
clientPort=2181
...
server.1=localhost:X:X:participant;2181
{code}

After the change, if a user had written a "dynamicConfigFile" on bootup, it won't have "clientPort" in static config. That's EXPECTED behavior.

I will try to figure out what is hidden in those failures. At the mean time, anyone who has ideas please share., [~shralex]
I have worked out a solution and put code on review board: https://reviews.apache.org/r/24786/
Any feedback is appreciated much!, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12662394/ZOOKEEPER-2006-v2.patch
  against trunk revision 1617921.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 6 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 2.0.3) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2285//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2285//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2285//console

This message is automatically generated., Hi Hongchao,

great work! I really liked your changes. I had a few minor comments in the review board and also changed the description of this JIRA to clarify the problem a bit. 

Alex, Cool. Thanks for the feedback. It also help me find a bug in isDistributed():
1. if quorumVerifier members equals 0 and standaloneEnabled = false, it returns true (quorum), which should be false (standalone)., Hmm... if standaloneEnabled = false the user explicitly asked not to run standalone mode. He probably forgot to specify the server(s). I think instead of changing isDistributed() we should add a check to parseDynamicConfig, after quorumVerified is set: if standaloneEnabled = false then numParticipators should be >= 1., Sounds reasonable. I added a check for that. I keep my change in isDistributed() because that's the expected logic., why is this the expected logic ? isDistributed() determines which stack we're gonna run - standalone or distributed. If standaloneEnabled = false the user expects us to run a distributed stack. Its just that the other settings should be set so that we're indeed able to run it or we should fail the boot. , in other words - in this case I'd prefer to run the distributed stack as the user wanted and let some other code report a failure or just crash rather than to run a standalone stack. Consider for example a bug where your new check that throws the exception doesn't run for some reason - if the system just runs in standalone mode it will be difficult for the user to detect that anything went wrong., Made sense.
Thanks for the comments.
, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12662420/ZOOKEEPER-2006-v5.patch
  against trunk revision 1617921.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 6 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 2.0.3) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2288//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2288//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2288//console

This message is automatically generated., Hi Hongchao, 

I tried to run it and there are still multiple issues with zkServer.sh changes.
I can work on this tonight or if you have time you can take a look.

Currently there's a small parsing error in zkServer.sh, but besides that there are a few issues:
- myid is not checked. Its possible that clientPort wasn't specified, myid wasn't set and yet it finds the port. 
- if there was no ";port" in the server.x line, it will find port2 here "sever.1=host:port1:port2" since it deletes everything before ";" but there's no ";" here. We need to check that there's a ";" and something after it before doing "sed".
- clientPortAddress is not set correctly if I write "server.1=host:port1:port2;host2:port3"

we need to check this more by running with different possible config files.

Maybe this should be a separate JIRA since this is not only related to standalone mode.
, btw the way I debug this is just by running "./bin/zkServer status" and printing stuff - there's no need to start the server even., I didn't have any problem running it..
In three cases:
{code}
clientPort=2181
{code}
or
{code}
server.1=...;2181
{code}
or
{code}
dynamicConfigFile=./dyanmicFile
... (in dynamicFile)...
server.1=...;2181
{code}
it shows
{code}
JMX enabled by default
Using config: ./zoo.cfg
Client port found: 2183
Mode: standalone
{code}, [~shralex]
BTW, I changed one thing:
{code}
   if ! [[ "$clientPort" =~ ^[0-9]+$ ]] ; then
-         then
{code}

There is an additional "then" introduced by the change in zkServer.sh.., The problems I saw where when there was a mistake in the static file. For example there was no client port specified but the script still found it :) And also as I mentioned clientPortAddress is not picked up when specified only in the dynamic way, modified the zkServer.sh part of the patch, +1 as far as I'm concerned. I tried the patch out a bit and everything looks fine so far.

if there are no additional comments from others I'll commit it tomorrow., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12662694/ZOOKEEPER-2006-v6.patch
  against trunk revision 1617921.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 6 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 2.0.3) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2289//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2289//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2289//console

This message is automatically generated., Committed to trunk and 3.5.0.

Thanks a lot, Hongchao!, FAILURE: Integrated in ZooKeeper-trunk #2412 (See [https://builds.apache.org/job/ZooKeeper-trunk/2412/])
ZOOKEEPER-2006. Standalone mode won't take client port from dynamic config. (Hongchao Deng via Alex Shraer) (shralex: http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1618977)
* /zookeeper/trunk/CHANGES.txt
* /zookeeper/trunk/bin/zkServer.sh
* /zookeeper/trunk/src/java/main/org/apache/zookeeper/server/quorum/QuorumPeerConfig.java
* /zookeeper/trunk/src/java/test/org/apache/zookeeper/server/quorum/QuorumPeerTestBase.java
* /zookeeper/trunk/src/java/test/org/apache/zookeeper/test/StandaloneTest.java
]