[Hi, saw this with a 'newbie' tag, I was wondering if I could look into this? Any guidelines for this issue?, It's a very simple/obvious issue if you are aware of how the ZK client API works. That sufficient "hint" or would you like more? :-), And yes, if you'd like to address please have at it. Guidelines here: 
https://cwiki.apache.org/confluence/display/ZOOKEEPER/HowToContribute, Thanks, I'll look into it then :), I tried to run the test on my machine, the test seem to work most of the time. There's one or two times, the test failed as ephemeral node not deleted... At the moment, I don't see it appearing the Flaky Dashboard anymore. I also tried to use zk client api to delete the ephemeral node and run the test, but it said session expired. I'm not quite sure how to delete an ephemeral node... Please advise on how should I proceed., this issue is duplicated with [ZOOKEEPER-3040|https://issues.apache.org/jira/projects/ZOOKEEPER/issues/ZOOKEEPER-3040] 
 , +1 overall.  GitHub Pull Request  Build
      

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 3.0.1) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-github-pr-build/2091//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-github-pr-build/2091//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-github-pr-build/2091//console

This message is automatically generated.]