[GitHub user edwardoliveira opened a pull request:

    https://github.com/apache/zookeeper/pull/493

    ZOOKEEPER-3006: Potential NPE in ZKDatabase#calculateTxnLogSizeLimit

    

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/eribeiro/zookeeper zk-3006-potential-npe

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/zookeeper/pull/493.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #493
    
----
commit c0a9763c5a0fc63d2cad99ea9d219c08fd454d2e
Author: Edward Ribeiro <edward.ribeiro@...>
Date:   2018-03-24T15:35:27Z

    ZOOKEEPER-3006: Potential NPE in ZKDatabase#calculateTxnLogSizeLimit

----
, Github user LJ1043041006 commented on the issue:

    https://github.com/apache/zookeeper/pull/493
  
    +1 lgtm,  but "All checks have failed" makes me wonder and i think the error is not cause by this patch, am i right.
, Github user eribeiro commented on the issue:

    https://github.com/apache/zookeeper/pull/493
  
    @anmoldar thanks for the feedback! Gonna update the description and add a test case asap. Btw, I am not the one who found this potential npe, but I am glad to help. :) Last but not least, I opened the PR for master, but should we address this issue on previous branches too? 
    
    @LJ1043041006 yup, I don't think the failed tests are related to this patch at all. Gonna take a closer look really soon. ZK has some flaky tests, but looks like there was an exception that prevented any test from running.
, Github user LJ1043041006 commented on the issue:

    https://github.com/apache/zookeeper/pull/493
  
    @eribeiro , I found this  potential npe  and open issue [zk-3006](https://issues.apache.org/jira/browse/ZOOKEEPER-3006), but i am not  very familiar with zookeeper code, so could you please add a unit test? thinks!
, Github user maoling commented on the issue:

    https://github.com/apache/zookeeper/pull/493
  
    +1,LGTM
, Github user edwardoliveira commented on the issue:

    https://github.com/apache/zookeeper/pull/493
  
    Hey, @LJ1043041006, I have just added a unit test. Cheers!
, Github user hanm commented on the issue:

    https://github.com/apache/zookeeper/pull/493
  
    @edwardoliveira : could you please share your email so I can put it in commit message when merge this? 
    Also, could you please create a JIRA account if you don't have one on https://issues.apache.org/jira/projects/ZOOKEEPER so I can assign ZOOKEEPER-3006 to you? This is to make sure we distribute commit credits to contributors.
, Github user eribeiro commented on the issue:

    https://github.com/apache/zookeeper/pull/493
  
    Hi @hanm,
    
    Excuse me for the mess up and subsequent confusion. @edwardoliveira is me, @eribeiro (on GH and JIRA), but I inadvertedly opened the PR using my second GH account. :(
    
    My e-mail is edward.ribeiro@gmail.com
    
    If you prefer, I may close this PR and open a new PR from my main account. The referenced branch comes from the right account, already.
    
    I have already assigned the issue to myself, btw. 
    
    Cheers!
, Github user LJ1043041006 commented on the issue:

    https://github.com/apache/zookeeper/pull/493
  
    Hi guys, **one more thing**
    I have developed a very simple tool to find Potential NPE in Zookeeper(based on  [WALA](https://github.com/wala/WALA)), I list the result in ZK-3007~3010
    , so anyone can help me confirm them and  improve this tool (hopefully it can be open source  ) 
, Issue resolved by pull request 493
[https://github.com/apache/zookeeper/pull/493], Github user asfgit closed the pull request at:

    https://github.com/apache/zookeeper/pull/493
, Github user hanm commented on the issue:

    https://github.com/apache/zookeeper/pull/493
  
    @edwardoliveira that's fine, I did not know that's you :-). Patch committed.
, SUCCESS: Integrated in Jenkins build ZooKeeper-trunk #3790 (See [https://builds.apache.org/job/ZooKeeper-trunk/3790/])
ZOOKEEPER-3006: Potential NPE in ZKDatabase#calculateTxnLogSizeLimit (hanm: rev fbd21329d32f185d198344f2d394175c92a82f9e)
* (edit) src/java/main/org/apache/zookeeper/server/ZKDatabase.java
* (edit) src/java/test/org/apache/zookeeper/test/ZkDatabaseCorruptionTest.java
]