[GitHub user rakeshadr opened a pull request:

    https://github.com/apache/zookeeper/pull/145

    ZOOKEEPER-2651: Missing src/pom.template in release

    

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/rakeshadr/zookeeper-1 ZOOKEEPER-2651

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/zookeeper/pull/145.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #145
    
----

----
, +1 overall.  GitHub Pull Request  Build
      

    +1 @author.  The patch does not contain any @author tags.

    +0 tests included.  The patch appears to be a documentation patch that doesn't require tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 3.0.1) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-github-pr-build/198//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-github-pr-build/198//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-github-pr-build/198//console

This message is automatically generated., Github user eribeiro commented on the issue:

    https://github.com/apache/zookeeper/pull/145
  
    Oh, thanks for this patch @rakeshadr, very much appreciated. :smiley: 
    
    **to committers: we need to apply this to branch-3.4 and branch-3.5 too, besides master, please** :+1: 
, Github user ctubbsii commented on the issue:

    https://github.com/apache/zookeeper/pull/145
  
    Happy to see this fixed. Would be great to incorporate something into ZK release testing/voting procedures to ensure project can actually be built from the official release artifact so this doesn't happen in future.
, Github user rakeshadr commented on the issue:

    https://github.com/apache/zookeeper/pull/145
  
    Thanks @eribeiro, @ctubbsii for the feedback. Sure, we will port this to 3.4, 3.5 and master as well. I think, will ensure this during release candidate verification.
    
    @hanm could you please take a look at the changes and help to merge it. Thanks!
, Github user asfgit closed the pull request at:

    https://github.com/apache/zookeeper/pull/145
, Issue resolved by pull request 145
[https://github.com/apache/zookeeper/pull/145], Github user hanm commented on the issue:

    https://github.com/apache/zookeeper/pull/145
  
    lgtm, merged.
, Thank you [~hanm] for commits., FAILURE: Integrated in Jenkins build ZooKeeper-trunk #3233 (See [https://builds.apache.org/job/ZooKeeper-trunk/3233/])
ZOOKEEPER-2651: Missing src/pom.template in release (hanm: rev 5f60374d060c18ccad322c7f18883284dbac0fed)
* (edit) build.xml
]