[C multi tests consistently passed for me locally. Did not spot any failures in recent apache build too. Anyone can reproduce this test failure?, [~hanm] they are failing silently, I'm not sure why, so if you just look at the final result, you won't see it., Hi Flavio, I've run test multi test multiple test against master branch commit ec20c5434cc8a334b3fd25e27d26dccf4793c8f3, here is what I got:
{noformat}
     [exec]  ZooKeeper server started
     [exec] Running 
     [exec] Zookeeper_multi::testCreate : elapsed 1022 : OK
     [exec] Zookeeper_multi::testCreateDelete : elapsed 1006 : OK
     [exec] Zookeeper_multi::testInvalidVersion : elapsed 1006 : OK
     [exec] Zookeeper_multi::testNestedCreate : elapsed 1006 : OK
     [exec] Zookeeper_multi::testSetData : elapsed 6012 : OK
     [exec] Zookeeper_multi::testUpdateConflict : elapsed 1006 : OK
     [exec] Zookeeper_multi::testDeleteUpdateConflict : elapsed 1004 : OK
     [exec] Zookeeper_multi::testAsyncMulti : elapsed 2001 : OK
     [exec] Zookeeper_multi::testMultiFail : elapsed 1005 : OK
     [exec] Zookeeper_multi::testCheck : elapsed 1011 : OK
     [exec] Zookeeper_multi::testWatch : elapsed 2007 : OK
     [exec] Zookeeper_multi::testSequentialNodeCreateInAsyncMulti : elapsed 2001 : OK
     [exec] OK (12)
{noformat}

There is no assertions and all passed, I think.

bq. they are failing silently

How to tell if a test is failing silently? Here the console log looks all good. I don't see any on disk logs generated for C test. 
, [~hanm] if you're getting OK, then they are passing for you. In the output I posted in the description, if you notice we don't have the OK for the test cases, and when I inspected the logs, I remember seeing that they were not completing. In any case, I'll give it a try on my end to double-check, but it looks like the problem might have gone away or it is intermittent, not sure., Verified again and can't reproduce this. We could resolve this as not reproducible. cc [~phunt]., I have run it again and seems ok, let's resolve it as not reproducible for now as you suggest.]