[GitHub user dolphy17 opened a pull request:

    https://github.com/apache/zookeeper/pull/401

    ZOOKEEPER-2769: Compiled documentation should not be under source control

    

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/dolphy17/zookeeper ZOOKEEPER-2769

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/zookeeper/pull/401.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #401
    
----
commit 64817e0657a44087ada9820f66f2d0dcdffc166f
Author: Andor Molnar <andor@cloudera.com>
Date:   2017-10-13T12:52:48Z

    ZOOKEEPER-2769: Removed HTMLs and PDFs from docs/ folder which are generated by ant docs

commit d986548865b436be85aed7e2759e6325dc7bc551
Author: Andor Molnar <andor@cloudera.com>
Date:   2017-10-13T13:02:04Z

    ZOOKEEPER-2769: Added generated docs files to gitignore

----
, +1 overall.  GitHub Pull Request  Build
      

    +1 @author.  The patch does not contain any @author tags.

    +0 tests included.  The patch appears to be a documentation patch that doesn't require tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 3.0.1) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-github-pr-build/1104//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-github-pr-build/1104//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-github-pr-build/1104//console

This message is automatically generated., Historically our docs have always been committed. Mostly to simplify for new users (they have direct access to the docs rather than having to generate) given our use of forrest. We could consider moving to something else, but that's a big change that would need to be discussed on the list (and has been a number of times in the past)., Github user phunt commented on the issue:

    https://github.com/apache/zookeeper/pull/401
  
    Please close this - see comments on ZOOKEEPER-2769.
, Github user dolphy17 closed the pull request at:

    https://github.com/apache/zookeeper/pull/401
]