[Server log, The logs says the session timed out after 30 secs (which is exactly the negotiated timeout). I wonder if you can post the client log to show when was the first request sent after it connected?, Client + server log files, The sever looks fine, the problem is on the client
I am not sure where is the following log coming from (can't see any print out from the code you posted)

2016-10-17 16:49:26 ERROR TestZooKeerpReadOnly:25 - CONNECTEDREADONLY

it looked like the client side hit some error and didn't do anything for a long time and then the server timed out
, The extra log comes from my code, I added a logger.error(zk.getState()); after the while loop., Can you add a lot more logs in the processing path on the server side instead then? There is just not much logs to show anything on the server side to show when (or whether) does it get the request., This is not easy, not sure where to start. Would you have specific classes / methods in mind?, Yes,  can you add some logs in processPacket function in the ZookeeperServer class

and in the  processRequest function in the  ReadOnlyRequestProcessor class?
, zookeeper logs with extra debug info, I attached the server output. We can only see the logs from ReadOnlyRequestProcessor.processRequest.
ZookeeperServer.processPacket doesn't seem to be involved here., Can you please also paste the logs you added? I am not sure how logs in  ZookeeperServer.processPacket not being called. That's the entry point., {code:title=ZookeeperServer.java}     public void processPacket(ServerCnxn cnxn, ByteBuffer incomingBuffer) throws IOException {
    	Log.warn("ZooKeeperServer.processPacket for session "+Long.toHexString(cnxn.getSessionId()));
(...){code}

{code:title=ReadOnlyRequestProcessor.java}     @Override
     public void processRequest(Request request) {
+    	LOG.warn("ReadOnlyRequestProcessor.processRequest for session "+Long.toHexString(request.sessionId));
         if (!finished) {
+        	LOG.warn("ReadOnlyRequestProcessor.processRequest for session "+Long.toHexString(request.sessionId)+": adding request to queue.");
             queuedRequests.add(request);
+        }else{
+        	LOG.warn("ReadOnlyRequestProcessor.processRequest for session "+Long.toHexString(request.sessionId)+": NOT adding request to queue (finished=true).");
         }
     }{code}
, Hi [~benjamin.jaton], 

I am having trouble trying to repro this bug as a ZK unit test. Are you still facing this issue? If you have time I would like to see if you could take a look at the unit test I am attaching here and see what I can be doing wrong.

Thanks!]