[-1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12554131/ZOOKEEPER-1586.patch
  against trunk revision 1410731.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1267//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1267//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1267//console

This message is automatically generated., I have liblog4cxx10 installed (Version: 0.10.0-1.2ubuntu2) on ubuntu 12.10, when I try compiling I see every reference to a log4cxx method as an "undefined reference". Just me (something with a new version in ubuntu? there are no other packages that I see available) or is something broken? (this was with this patch installed on trunk), Still an issue? Should we close this? (see my recent comment), Yes, I believe it is. Actually there are two issues: a) the tarball is created with missing source files and b) (more importantly) the BUILD path for the C libs is wrong.

Should be:

{noformat}
-AC_CHECK_LIB(zookeeper_mt, main, [ZOOKEEPER_LD="-L${ZOOKEEPER_PATH}/.libs -lzookeeper_mt"],,["-L${ZOOKEEPER_PATH}/.libs"])
+ZOOKEEPER_BUILD_PATH=${BUILD_PATH}/../../../build/c
+AC_CHECK_LIB(zookeeper_mt, main, [ZOOKEEPER_LD="-L${ZOOKEEPER_BUILD_PATH}/.libs -lzookeeper_mt"],,["-L${ZOOKEEPER_BUILD_PATH}/.libs"])
{noformat}

And the third thing would be the configure.ac doesn't state that boost is needed.

I'll update the patch. , Is this an issue in 3.4 branch as well? (affects field says just trunk, please update the jira appropriately (if necessary)) thx., I will update this on top of ZOOKEEPER-1019. ]