[GitHub user hanm opened a pull request:

    https://github.com/apache/zookeeper/pull/207

    ZOOKEEPER-2737: close netty connection when exceptions occur during w…

    …rite to channel to prevent resource leak.
    
    I am OK to add some contrived test case to test this but I'd like to do that later if needed, so this fix can get in upcoming releases..

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/hanm/zookeeper ZOOKEEPER-2737

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/zookeeper/pull/207.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #207
    
----
commit ad3b98418b6739d14003753f913a894dc0868fc1
Author: Michael Han <hanm@apache.org>
Date:   2017-03-24T17:49:09Z

    ZOOKEEPER-2737: close netty connection when exceptions occur during write to channel.
    To prevent resource leak.

----
, +1 overall.  GitHub Pull Request  Build
      

    +1 @author.  The patch does not contain any @author tags.

    +0 tests included.  The patch appears to be a documentation patch that doesn't require tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 3.0.1) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-github-pr-build/478//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-github-pr-build/478//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-github-pr-build/478//console

This message is automatically generated., Github user enixon commented on the issue:

    https://github.com/apache/zookeeper/pull/207
  
    good catch!
, Github user afine commented on the issue:

    https://github.com/apache/zookeeper/pull/207
  
    +1
, Github user phunt commented on the issue:

    https://github.com/apache/zookeeper/pull/207
  
    Ugh, sorry about that. ;-)
    
    +1
, Github user rakeshadr commented on the issue:

    https://github.com/apache/zookeeper/pull/207
  
    Thanks @hanm, +1 LGTM
, Issue resolved by pull request 207
[https://github.com/apache/zookeeper/pull/207], Github user asfgit closed the pull request at:

    https://github.com/apache/zookeeper/pull/207
, Committed.
Master: https://github.com/apache/zookeeper/commit/d8adc547f9856747905b7d46450f13fa98df147f
3.5:
https://github.com/apache/zookeeper/commit/5c356f5a47402c000b5e206a536273afc75de883, FAILURE: Integrated in Jenkins build ZooKeeper-trunk #3334 (See [https://builds.apache.org/job/ZooKeeper-trunk/3334/])
ZOOKEEPER-2737: close netty connection when exceptions occur during w… (hanm: rev d8adc547f9856747905b7d46450f13fa98df147f)
* (edit) src/java/main/org/apache/zookeeper/server/NettyServerCnxnFactory.java
]