[I would suggest changing the shebang to:

{code}
#!/usr/bin/env bash
{code}

to match what we do in zkServer.sh, This same problem also exists in zkCli.sh. For consistency, I would suggest we change all the scripts to use bash to guard against this regression in the future. Specifically, zkCleanup.sh, zkCli.sh and zkEnv.sh are the three that are using "/bin/sh" instead of "/usr/bin/env bash"., Change "/bin/sh" to "/usr/bin/env bash" to ensure bash-isms being used in these scripts will work correctly., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12589768/ZOOKEEPER-1719.patch
  against trunk revision 1495522.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1506//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1506//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1506//console

This message is automatically generated., No tests were provided because this is only an init script..., Verified that this fixes the issue in Ubuntu. +1., Integrated in ZooKeeper-trunk #1975 (See [https://builds.apache.org/job/ZooKeeper-trunk/1975/])
    ZOOKEEPER-1719. zkCli.sh, zkServer.sh and zkEnv.sh regression caused by ZOOKEEPER-1663
  (Marshall McMullen via camille) (Revision 1497830)

     Result = FAILURE
camille : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1497830
Files : 
* /zookeeper/trunk/CHANGES.txt
* /zookeeper/trunk/bin/zkCleanup.sh
* /zookeeper/trunk/bin/zkCli.sh
* /zookeeper/trunk/bin/zkEnv.sh
, Closing issues after releasing 3.4.6., SUCCESS: Integrated in ZooKeeper-trunk #2385 (See [https://builds.apache.org/job/ZooKeeper-trunk/2385/])
ZOOKEEPER-1937. init script needs fixing for ZOOKEEPER-1719 (Marshall McMullen via phunt) (phunt: http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1613326)
* /zookeeper/trunk/CHANGES.txt
* /zookeeper/trunk/src/packages/rpm/init.d/zookeeper
]