[Good find. We'd like to consider this patch for 3.1.0 but I'm afraid we need an explicit grand of license to ASF. See the "contributing your work" section of the HowToContribute ZooKeeper wiki page:
http://wiki.apache.org/hadoop/ZooKeeper/HowToContribute

Specifically you should "Attach" your patch file to this issue (see link on left hand side of this JIRA), specify the file and select the "grand license to asf ..." radio button. After attaching the file you can select the "submit patch" link (again, left hand side of this jira) to submit your patch for review by committers, if everything looks good we'll commit the change to svn. Thanks!

---------
Contributing your work

Finally, patches should be attached to an issue report in [WWW] Jira via the Attach File link on the issue's Jira. Please add a comment that asks for a code review following our code review checklist. Please note that the attachment should be granted license to ASF for inclusion in ASF works (as per the [WWW] Apache License ยง5). 
---------
, I've reformatted the original submitter's normal patch as a unified diff file to use against 3.0.0 and SVN trunk (at the moment).

I won't grant a license for it, though, since I didn't do the original work.

Hopefully this saves the submitter a little work.  If they can just sign off on this file, they shouldn't need to deal with any other details., Arg, jira won't allow me to wipe this.

I've also messaged the author directly through email. Let's see if that helps.
, Reattaching patch with license granted., Chris, thanks for modifying my patch to comply with the project. I reattached it granting the license, let me know if I can help with anything else., Great. Thanks much Austin!

I'm marking this as "patch available" on behalf of the author for consideration in 3.1.0.

, +1 great work. We should include this in 3.0.1, Cancelling the patch: the c unit tests are failing (ubuntu) with this patch applied:

Zookeeper_init::testAddressResolution : assertion
(more)

Also, I just realized - the configure.ac file should be updated for the new functions used (notice gethostbyname is there in .ac file, need to add strtok_r, getaddrinfo, etc... ).

Might also be a good idea to verify this build on window/linux/freebsd. It built fine on ubuntu., Updated the tests to not look for usage of gethostbyname., committed ben's patch to revision 719063 in trunk 
and revision 719064 in 3.0 branch.

thanks ben, austin and chris., Integrated in ZooKeeper-trunk #149 (See [http://hudson.zones.apache.org/hudson/job/ZooKeeper-trunk/149/])
    . Zookeeper C client uses API that are not thread safe, causing crashes when multiple instances are active. (austin shoemaker, chris daroch and ben reed via mahadev)
]