[[~nijel], do you want to propose a patch?, Attaching patch, Thanks Flavio for taking a look in the issue

Attached patch with the changes. 

Had to change zkCli and server scripts for adding the log file name since there is no unified script.
Changed the default logger to Rolling file.
, Updated the patch, Thanks [~nijel]. Just one comment. Please use 'ZOO_LOGFILE' instead of 'ZOOKEEPER_LOGFILE', so that it will be in sync with other variable names.

Also, patch not applying in trunk, could you use rebase the patch., I got the patch to apply against current trunk and made the below further changes:
- Renamed ZOOKEEPER_LOGFILE to ZOO_LOG_FILE to be consistent with the rest
- There was a typo in the original patch where ZOOKEEPR_LOGFILE was used in 3 different places, I changed these also to ZOO_LOG_FILE.
- I reverted the change to log4j.properties. The current defaults are actually consistent with the other related projects such as hadoop and hbase.

I can submit the new patch after some more testing, is that fine?, Other than regenerating the original patch against latest trunk, I made the following additional changes:
- Renamed ZOOKEEPER_LOGFILE to ZOO_LOG_FILE to be consistent with the rest
- There was a typo in the original patch where ZOOKEEPR_LOGFILE was used in 3 different places, I changed these also to ZOO_LOG_FILE.
- I reverted the change to logger configuration. The current default logger is actually consistent with the other related projects such as hadoop and hbase.
- Changed the log and out filenames to be more consistent with other sister projects, basically to "zookeeper-$USER-$COMP-$HOST" from "zookeeper-$COMP-$USER-$HOST" which was the case in the original patch., [~rakeshr] Could you take a look at the latest patch?, Thanks [~haridsv] for fixing the review comments. Just few more:
# default logger is not consistent in zkEnv.sh and zkEnv.cmd
{code}
zkEnv.sh
   ZOO_LOG4J_PROP="INFO,ROLLINGFILE"

zkEnv.cmd
   set ZOO_LOG4J_PROP=INFO,CONSOLE
{code}
# Missing "zookeeper.tracelog.dir" in log4j.properties. Otw it would go to current directory, right?
{code}
zookeeper.tracelog.dir=${zookeeper.log.dir}
{code}
, Thanks [~rakeshr] for catching the mistakes. Uploaded a new patch., Reattaching the previous patch to get the QA report., [PreCommit build-2519|https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2519/] is getting timed out and aborting. I tried comparing with previous build report, I could see {{call-test-cppunit:}} task was not executing previously. The last two run this task has been triggered and does this cause the delay?. Appreciate any help in resolving this and make the pre-commit work.
{code}
Build timed out (after 75 minutes). Marking the build as aborted.
Build was aborted
Archiving artifacts
Sending artifact delta relative to PreCommit-ZOOKEEPER-Build #2489
Archived 18 artifacts
Archive block size is 32768
Received 0 blocks and 33357213 bytes
Compression is 0.0%
Took 8.3 sec
Recording test results
Description set: ZOOKEEPER-1952
No emails were triggered.
Finished: ABORTED
{code}, I don't know much about this, but it looks like the unit tests took almost the same amount of time (about 42min) compared to the last good build, so not sure where it is taking more time in the latest steps, any possibility to log a few timestamps during these later phases?, [~rakeshr] Is there anything I can help with here? Do you think it is an intermediate problem? I have seen it a couple of times in the older builds and it recovered back. Could you give trigger another build and see how it goes?, bq.Could you give trigger another build and see how it goes?
Thanks [~haridsv] for the reminder. FYI: usually for triggering the pre-commit build, just reattach the patch again, then press {{Submit Patch}} button. I've reattached the patch again and lets see how it goes., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12699806/ZOOKEEPER-1952-5.patch
  against trunk revision 1658888.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 2.0.3) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2522//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2522//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2522//console

This message is automatically generated., +1 looks good to me. Test failures are unrelated., [~rakeshr] Thank you! , [~rakeshr] Is there anything pending from my side to get this issue resolved?, Thanks Hari for the patch

Patch Looks good to me, Thanks [~nijel]! How do we go about getting the patch applied so it will be part of next release?, Thanks [~haridsv], [~nijel] for the contribution. If there is no more comments from others will commit it tomorrow., 
Committed to trunk : http://svn.apache.org/viewvc?view=revision&revision=1663127
Committed to br3.5 : http://svn.apache.org/viewvc?view=revision&revision=1663128, FAILURE: Integrated in ZooKeeper-trunk #2612 (See [https://builds.apache.org/job/ZooKeeper-trunk/2612/])
ZOOKEEPER-1952 Default log directory and file name can be changed(nijel, Hari Krishna Dara via rakeshr) (rakeshr: http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1663127)
* /zookeeper/trunk/CHANGES.txt
* /zookeeper/trunk/bin/zkCleanup.sh
* /zookeeper/trunk/bin/zkCli.cmd
* /zookeeper/trunk/bin/zkCli.sh
* /zookeeper/trunk/bin/zkEnv.cmd
* /zookeeper/trunk/bin/zkEnv.sh
* /zookeeper/trunk/bin/zkServer.cmd
* /zookeeper/trunk/bin/zkServer.sh
* /zookeeper/trunk/conf/log4j.properties
]