[Does this change have any impact on ZOOKEEPER-22?, No, ZOOKEEPER-22 is about client-to-server communication, and this one is affects server-to-server communication in particular during leade election. , Adding unit test., looks great flavio. i think i figured out how the test works. do you mind putting a comment into the test to state your strategy for posterity?, Adding comment to the test as requested. Thanks, Ben., ZOOKEEPER-481.patch fails to build when applied to branch-3.2 due to a missing file, PortAssignment.java. PortAssignment.java was added in ZOOKEEPER-473.patch. I have not investigated further dependencies, so I do not know if 481 depends on other files in 473. Patrick suggested that we may need separate patches for branch-3.2 and trunk., Uploading a patch that applies to 3.2. Unit tests pass for me., flavio,
 I just ran ant test-patch since hudson wastn willing to run it for us.

I fopt a -1 with 

3 new findbugs warnings generated. Can you please try running findbugs and see where the issues are? , Fixed findbugs issues, will upload a 3.2 version once +1., 3.2 version of the same patch (only the test should be different)., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12415199/ZOOKEEPER-481-branch3.2.patch
  against trunk revision 799741.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-vesta.apache.org/165/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-vesta.apache.org/165/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-vesta.apache.org/165/console

This message is automatically generated., I have made a small modification to the port assignment in the test, so I'm resubmitting just to make sure that hudson likes it. , I just committed this. thanks flavio!, Integrated in ZooKeeper-trunk #404 (See [http://hudson.zones.apache.org/hudson/job/ZooKeeper-trunk/404/])
    . Add lastMessageSent to QuorumCnxManager. (flavio via mahadev)
]