[Patch that only calls free_completions in zookeeper_close() instead of cleanup_bufs()., Updated patch format and spelling., jared,
  The patch that you provided leaks memory for the zookeeper client. We have to clean up the tosend and to process buffers on close and free them. Did you observe the problem with which release?

I had tried to fix all the issues with zookeeper_close() in ZOOKEEPER-591. Also, michi has fixed a couple other issues in ZOOKEEPER-804. 

what version of code are you running? Also, can you provide some test case which causes this issue? (I know its hard to reproduce but even a test that reproduces it once in 10-20 times is good enough).
, we are using the 3.3.2 release.  i don't think the patch leaks memory because destroy() will eventually get called (by the reentrant call to zookeeper_close()), which calls cleanup_bufs() and frees those buffers, right?  Also, i had a test that reproduced this error, but it was easiest to reproduce if i injected artificial sleeps into the zookeeper.c file.  If that's ok, then I can submit that.  Otherwise, i'll see if i can devise a test that can reproduce it otherwise., You are right Jared. The patch looks good to me. I am trying to rerun the cpp unit tests a couple of times to reverify that the client close doesnt create any problems. It would be great if you could rerun the cppunit tests couple of times to endorse the fix.
, I wasn't able to figure out how to write a test for this scenario without injecting some helper code into zookeeper.c.  I ran the cpp unittests ~20 times locally and no issues.  Also, I've temporarily been using this in our test environment for ~2 weeks and no issues there either., perhaps we should rely on existing testing for this one, but enter a new jira to refactor the client, specifically to allow testing? (ie a way to inject the helper code w/o needing to edit zookeeper.c directly), jared, pat,
 I am ok without a test case for this one, because its a quite hard to create one. I just wanted someone else to run the tests on there machines just to verify (since I rarely see any problems in c tests on my machine). I will go ahead and commit this patch for now.
, I just committed this. thanks jared!, Integrated in ZooKeeper-trunk #983 (See [https://hudson.apache.org/hudson/job/ZooKeeper-trunk/983/])
    ZOOKEEPER-897. C Client seg faults during close (jared cantwell via mahadev)
]