[[~rakesh_r] can you take a look at this?, oops, attached a patch to fix it. Thanks a lot [~phunt] for pointing out this., No worries [~rakesh_r].

[~rgs] can you review this asap given you have context, having reviewed ZOOKEEPER-2375, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12791202/ZOOKEEPER-2379.patch
  against trunk revision 1733489.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 2.0.3) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3080//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3080//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3080//console

This message is automatically generated., Hi [~rakesh_r].  Thank you for the patch.  +1 from me, but please also wait for feedback from [~rgs] before committing., Thanks [~cnauroth] for the reviews. [~rgs], would be great to see your feedback, thanks!, [~rakeshr]: [~cnauroth]: looking! thanks for the heads-up!, [~rakeshr], [~cnauroth]: would marking:

{code}
 private static Login login = null;
{code}

as volatile be enough to make findbugs happy?, Tested locally, that doesn't work (errors with DC_PARTIALLY_CONSTRUCTED). So lets go with this patch, +1. Thanks [~rakeshr]!

[~cnauroth]: can you merge it? Otherwise I'll get to it later today, thanks Chris!, [~rgs], yes, that would do it.  That's a great point.  Thanks!

Since that's the simpler change, let's do it that way.  [~rakeshr], would you mind posting a new patch?  Thanks!, I retract my last comment, since [~rgs] confirmed it isn't sufficient.  (Odd... I would have expected it to work.)

Since we have +1's on the current patch, I'll commit later today.  Thank you., I have committed this to trunk, branch-3.5 and branch-3.4.  [~rakeshr], thank you for fixing this.  [~rgs], thank you for code reviewing., FAILURE: Integrated in ZooKeeper-trunk #2841 (See [https://builds.apache.org/job/ZooKeeper-trunk/2841/])
ZOOKEEPER-2379: recent commit broke findbugs qabot check (rakeshr via cnauroth) (cnauroth: [http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1733679])
* trunk/CHANGES.txt
* trunk/src/java/main/org/apache/zookeeper/client/ZooKeeperSaslClient.java
]