[Here's a failed job as an example:
https://builds.apache.org/view/S-Z/view/ZooKeeper/job/ZooKeeper_branch35_solaris/24, Thanks for the heads-up [~phunt] - looking!

, [~arshad.mohammad]: FYI, the first failure comes from ZOOKEEPER-2299 and the second one from ZOOKEEPER-2301. I _think_ it might be related to binding 127.0.0.2, but I need to get hold of a solaris box to check this out. , The failure is specific to Solaris OS. I am not using Solaris os, will try to install and fix the test case failure soon., Fixed and verified on Solaris 11, Thanks for the quick fix [~arshad.mohammad]! +1

cc: [~cnauroth], [~phunt] in case any of you don't get to merge this, i'll do so later tonight. Thanks!, +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12793843/ZOOKEEPER-2388-01.patch
  against trunk revision 1735116.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 6 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 2.0.3) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3102//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3102//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3102//console

This message is automatically generated., LGTM too. Thanks Arshad! Tests continue to pass on my laptop (mac).

Committed to 3.5.2 and trunk., SUCCESS: Integrated in ZooKeeper-trunk #2853 (See [https://builds.apache.org/job/ZooKeeper-trunk/2853/])
ZOOKEEPER-2388 Unit tests failing on Solaris (Arshad Mohammad via phunt) (phunt: [http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1735369])
* trunk/CHANGES.txt
* trunk/src/java/test/org/apache/zookeeper/server/quorum/LocalPeerBeanTest.java
* trunk/src/java/test/org/apache/zookeeper/server/quorum/QuorumPeerTest.java
]