[the issue is that the leaderelection test uses 0.0.0.0 as the default ipaddress for binding and sending. I will change the test to use one of the ip addresses (localhost) so that there is no issue in sending UDP packets with 0.0.0.0 ipv4 header., this patch fixes the issue in test and changes it to use localhost rather than 0.0.0.0.
, I ran the tests on hudson machines with the patch and it passes. So we can go ahead and commit (of course after having reviewed) if we want without waiting for hudson.

, used 127.0.0.1 instead of localhost. thanks pat for the suggestion. Also replaced other occurences of localhost with 127.0.0.1.

, +1 looks good to me., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12437936/ZOOKEEPER-687.patch
  against trunk revision 919149.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h8.grid.sp2.yahoo.net/127/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h8.grid.sp2.yahoo.net/127/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h8.grid.sp2.yahoo.net/127/console

This message is automatically generated., I just committed this., Integrated in ZooKeeper-trunk #715 (See [http://hudson.zones.apache.org/hudson/job/ZooKeeper-trunk/715/])
    . LENonterminatetest fails on some machines. (mahadev)
]