[The patch looks like malformatted, can't be applied to branch-3.4. [Reference on generating patch|https://cwiki.apache.org/confluence/display/ZOOKEEPER/HowToContribute]

{code}
      zh->fd = -1;
      zh->connect_index++;
      if (!is_unrecoverable(zh)) {
 -|        zh->state = 0;
+|        zh->state = ZOO_CONNECTING_STATE;
      }
      if (process_async(zh->outstanding_sync)) {
          process_completions(zh);
      }
{code}

Instead of using {{ZOO_CONNECTING_STATE}}, why not using {{ZOO_NOTCONNECTED_STATE}}, given the reconnect attempt hasn't been made at this point yet? Later, in zookeeper_interest when reconnecting attempt being made the state will be set to {{ZOO_CONNECTING_STATE}}.
, Thanks for the feedback Michael. The new patch should apply cleanly to 3.4.6.

I had chosen ZOO_CONNECTING_STATE because I misunderstood what ZOO_NOTCONNECTED_STATE means. I thought we had used it to replace 0, and that both meant we had not begun connecting. I now think that 0 was used to mean either that we had not begun connecting or that we had closed permanently. So the ZOOKEEPER-800 fix had initially returned invalid state in either case, but I believe as of 3.4.6 it was behaving correctly. Given that, I now agree that ZOO_NOTCONNECTED_STATE makes more sense here, and I've dropped the change to zoo_add_auth, Thanks for the update Andrew. Latest patch LGTM., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12825998/ZOOKEEPER-2519.patch
  against trunk revision ec20c5434cc8a334b3fd25e27d26dccf4793c8f3.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3448//console

This message is automatically generated.]