[Hi Mike, I took a quick look at the log file. What time did node 2 get removed from the cluster? I see that node 3 and 5 keep trying to connect to node 2:

{noformat}
Apr 14 00:09:49.579516 10.20.0.20 warning zookeeper: Cannot open channel to 2 at election address /10.20.0.18:3888 java.net.SocketTimeoutException: connect timed out
Apr 14 00:09:49.644749 10.20.0.22 warning zookeeper: Cannot open channel to 2 at election address /10.20.0.18:3888 java.net.SocketTimeoutException: connect timed out
{noformat}

Would it be possible that the configuration didn't get updated on these 2 nodes? You might be hitting the same issue as ZOOKEEPER-2164., I can't check the full log for 10-12 hours from now (I unfortunately snipped that part of the log out of what I posted here, but I still have the original logs) but it's possible/probable that they haven't been updated yet; this is during a rolling restart of the cluster to permanently remove node 2 from the ensemble. (This cluster is smaller than we usually use, since it's kind of sketchy to resize it with so few nodes since there's no margin for error; as I said above, we've seen this on larger ensembles, too, it's just easier to repro the problem with the smaller cluster).

It's hard to tell just from the description, but yeah, it's possible that this is the same as https://issues.apache.org/jira/browse/ZOOKEEPER-2164; if my problem is the same, that means that it's not the restart but the stop that causes the problem... hm. It usually takes a few hours to repro the problem, but we do currently have a pretty reliable repro; I plan to run some more experiments tomorrow and hopefully learn something (but if anyone who understands zk better than I do has any insights, they'd be appreciated)., I've attached my more complete log, this goes back much further and shows the previous (annotated) node add process as well (we go 3->4->5->4, in each case applying the change in a rolling fashion before moving on)

This is the same log as before, just more complete and better annotated (again, using XXX to indicate where starts and stops happened, also showing the configured ensemble at the time) so everything I said previous still applies (ZID/IP mapping is the same, etc).]