[This is happening because ivy version in {{build.xml}} and {{src\contrib\build-contrib.xml}} are different.
Ivy jar downloaded at {{src\java\lib}} is being deleted while it is in use. It is like a build race condition., changed ivy version in build-contrib.xml to 2.4.0, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12792329/ZOOKEEPER-2385-01.patch
  against trunk revision 1733679.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 2.0.3) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3095//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3095//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3095//console

This message is automatically generated., Does it break only on windows or have you tried {{ant tar}} only on windows?, # It breaks only on windows, 
# I have tried on both windows 7 and Ubuntu 15.10
# On Ubuntu, ivy-2.4.0.jar is getting successfully deleted and  ivy-2.2.0.jar is downloaded successfully from build-contrib.xml. At the end of the build only ivy-2.2.0.jar is present at {{src\java\lib}}, Arg, I missed that with my recent change.

Thanks Arshad! Committed to 3.4.9/3.5.2/trunk., FAILURE: Integrated in ZooKeeper-trunk #2850 (See [https://builds.apache.org/job/ZooKeeper-trunk/2850/])
ZOOKEEPER-2385 Zookeeper trunk build is failing on windows (Arshad Mohammad via phunt) (phunt: [http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1735116])
* trunk/CHANGES.txt
* trunk/src/contrib/build-contrib.xml
, It looks like this failed because of ZOOKEEPER-2342 and not this change.]