[the build has been failing for the past 6 days, this is very bad -- in effect no CI

Henry, can you look at this or should I?
, I'll take a look., I need a little help getting to the bottom of this (I might be misreading Hudson's logs).

The code in question is, I think, 'ok' (although a bit dodgy). The idea is to test the ability of a client - that is waiting because the max cnxns limit has been reached - to reconnect once a slot becomes free on the server. So ideally for this test close(1) should happen after createclient(2) has connected. As you say, this is a false assumption as the close might happen before the createClient(2) succeeds so there is no contention, but this should only be giving false positives - the second assert should eventually succeed. What I need to do to improve this is to replace createClient with a call that blocks until we at least know the connection attempt has been made, if that's possible.

However the most recent Hudson failures don't seem to be related. From build 375:

[exec] Zookeeper_simpleSystem::testAsyncWatcherAutoReset : assertion
     [exec] Zookeeper_watchers::testDefaultSessionWatcher1 : OK
     [exec] Zookeeper_watchers::testDefaultSessionWatcher2 : OK
     [exec] Zookeeper_watchers::testObjectSessionWatcher1 : OK
     [exec] Zookeeper_watchers::testObjectSessionWatcher2 : OK
     [exec] Zookeeper_watchers::testNodeWatcher1 : OK
     [exec] Zookeeper_watchers::testChildWatcher1 : OK
     [exec] Zookeeper_watchers::testChildWatcher2 : OK
     [exec] 
     [exec] /home/hudson/hudson-slave/workspace/ZooKeeper-trunk/trunk/src/c/tests/TestClient.cc:289: Assertion: equality assertion failed [Expected: -101, Actual  : -4]
     [exec] Failures !!!
     [exec] Run: 32   Failure total: 1   Failures: 1   Errors: 0
     [exec] make: *** [run-check] Error 1

and the same from 376 (yesterday's build). These are failing in TestClient (specifically testAsyncWatcherAutoReset). The error here is that a stat completion callback is getting called with ZCONNECTIONLOSS, but is expecting to see ZNONODE, and the assert is failing.

This test runs fine for me locally, so is the problem a heavily loaded Hudson, causing the connection loss?

Similarly the failed build you point to, 371, fails TestClientRetry with a broken pipe error which to my novice eye sounds a bit like something falling over under load.

It looks to me right now like the TestClientRetry code needs improving, but is benign as it should only cause false positives, and we need to understand the reasons why TestClient is failing. Does that sound right?, Henry, I'm also working on ZOOKEEPER-473 which will fix a number of the 
intermittent failures on hudson. however 473 is separate from this issue.
Let's nail down these, then see what's left and address those in subsequent
jiras. thanks., Hm, I don't have access to run code on hudson, Mahadev does though, I'll check with him., i just ran on the tests on vesta manually and it passes on the machine. It seems to pass for me on the machine :

I see this on bulild 371 -
{code}
 [exec] make: *** [run-check] Broken pipe
 [exec] Running Zookeeper_clientretry::testRetry
{code}

this looks more like the c api generating SIGPIPE and the c tests crashing on that. All we will need to do is ignore the SIGPIPE. Let me check the others for what kind of error they have., each time it seems we have a different reason for tests failing. This is bad. 
On 377 build 
http://hudson.zones.apache.org/hudson/view/ZooKeeper/job/ZooKeeper-trunk/377/

the tests fail because of failure in FLENewEpochTest, other times its mostly the c tests.
, ZOOKEEPER-473 should fix a lot of this, esp the *LE tests (socket reuse)
, the reason the tests are failing is because the servers are not able to start for cppunit tests.  the following is the exception on servers run via ccppunit tests - 

{code}
CLOVER] FATAL ERROR: Clover could not be initialised. Are you sure you have Clover in the runtime classpath? (class java.lang.NoClassDefFoundError:com_cenqua_clover/CloverVersionInfo)
Exception in thread "main" java.lang.NoClassDefFoundError: com_cenqua_clover/CoverageRecorder
    at org.apache.zookeeper.server.ZooKeeperServerMain.main(ZooKeeperServerMain.java:48)
Caused by: java.lang.ClassNotFoundException: com_cenqua_clover.CoverageRecorder
    at java.net.URLClassLoader$1.run(URLClassLoader.java:200)
    at java.security.AccessController.doPrivileged(Native Method)
    at java.net.URLClassLoader.findClass(URLClassLoader.java:188)
    at java.lang.ClassLoader.loadClass(ClassLoader.java:307)
    at sun.misc.Launcher$AppClassLoader.loadClass(Launcher.java:301)
    at java.lang.ClassLoader.loadClass(ClassLoader
{code}
, this should fix the clover classpath issue, this patch fixed the problem on hudson, thanks Giri!
]