[I guess the simplest approach is to extend the existing 4-letter commands by indicating which watches are for children with a trailing slash.

I.e.:

$ echo wchs | nc localhost 2181
Data watches
1 connections watching 1 paths
Total watches:1
Children watches
1 connections watching 1 paths
Total watches:1

$ echo wchp | nc localhost 2181
/something
        0x404164a6e40000
/something/
        0x404164a6e40000

$ echo wchc | nc localhost 2181
0x404164a6e40000
        /something
0x404164a6e40000
        /something/
, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12595705/0001-ZOOKEEPER-1274.-Display-child-watches-info-in-watch-.patch
  against trunk revision 1503101.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1526//console

This message is automatically generated., Thanks [~rgs]. Patch is not applying properly, could you rebase it in trunk. Also, to differentiate child watches with trailing slash may be difficult to convey. Do we have any other similar pattern used in ZooKeeper. I feel, if we can print DataWatches and ChildWatches it would be more clear. What do you say?, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12595705/0001-ZOOKEEPER-1274.-Display-child-watches-info-in-watch-.patch
  against trunk revision 1600481.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2124//console

This message is automatically generated., Seems like a useful addition. Raul can you update the patch, what do you think of Rakesh's comments?, Here's an updated version, [~phunt]. I also documented the change plus updated the Admin guide noting the trailing slash to differentiate data vs child watches.

[~rakeshr]: I rather use the trailing slash to differentiate child watches instead of making the 4 letter commands more verbose, since these commands are usually parsed by scripts, etc. Do you think with the updated docs, things would be clear enough?, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12652542/ZOOKEEPER-1274.patch
  against trunk revision 1605517.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2153//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2153//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2153//console

This message is automatically generated., OK, similar to POSIX convention - If ends with a slash, it's a directory. If not, it's a file.

Usually 'CHANGES.txt' will not be included in the patch. When committing the patch will update it by adding (contributor's name via committer's name)., Ah fair, do you still want me to update it or is good that way? One way or the other, I created a reviewboard for it:

https://reviews.apache.org/r/23085/

In retrospect, in-line reviews in jira are a bit hard to follow-up :-), Hmm, there is something ugly about this patch though. Child watches on / read as:

{noformat}
//
  0x546da45818b0000  
{noformat}

I should have listen to Rakesh in the first place :-), [~rgs] how do you want to handle the new jetty server support being added? Commit this regardless, or would you like to update the patch to include support for exposing in the jetty server as well?, [~rgs], have you had a chance to consider the last set of comments?, Hello [~rgs].  Thanks for your work on this.  I'd find the enhancement very useful.

Is there anything I can do to help with the work?  The patch would need to be refreshed for current trunk, which is now using different {{DataTree}} methods for these commands.  I can volunteer to make an attempt at a new patch, or I can volunteer to help with testing if you prefer to do all the coding work.

Thanks again!, Hi [~cnauroth] - it would be great if you could rebase the patch on trunk. Also, as Patrick mentioned, it would be nice to also extend that command expose through the Jetty server to have it have the same functionality. Thanks!, Thanks, Raul!  I'll pick this up, including the Jetty piece.]