[Proposed patch attached, Blocker for 3.3.0, we should ensure that the c client doesn't have similar issues., We need to add a test for this case. We should add it to both the c and java., Java test case related to this problem is added to the patch attached.

The code provides the similar functionality in the c client is investigated:

The sub_string function checks if server_path and chroot path are the same and returns "/" if they are the same, so it seems that this problem does not occur on the c client.

However, I don't know how to add the test case of this problem to the test cases in c. Anyone can help?, Thanks Scott. I looked at the c tests and it looks to me like we are testing this case (reviewer please verify).

Submitting, let's see how hudson does with this.
, +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12437463/ZOOKEEPER-682.patch
  against trunk revision 915956.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h8.grid.sp2.yahoo.net/124/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h8.grid.sp2.yahoo.net/124/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h8.grid.sp2.yahoo.net/124/console

This message is automatically generated., +1 the patch looks good. Pat you are right that the c api already takes care of it and also has a test included for it.

, I just committed this. thanks scott!]