[A second user reported this issue to me. 

When we fix this we should also address the event thread naming. Where the user creates a new session from within the event thread context we end up with a very long thread name (we keep appending the thread name to the parent thread... so main-event-event-event-event, etc...), Here is a test class that illustrates the problem using Thread#suspend and Thread#resume to simulate long GC times or other halted JVM problems.  There is a simple wrapper around a ZooKeeper client handle that will connect another client in the event that its managed client receives an Expired event.  The longer that the test program runs the more runaway EventThreads will be created and displayed.

The only dependencies are on the ZooKeeper libraries., This simple patch fixes both issues.
No tests included, verified with Daniel's class. Not sure if we need yet another 20-seconds test for this., ben, can you take a look at this?, Has anybody had a chance to look at the patch?, i've added a test. (added to the existing session expiration test, so it shouldn't add any running time to the tests), +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12450795/ZOOKEEPER-795.patch
  against trunk revision 980576.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h7.grid.sp2.yahoo.net/101/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h7.grid.sp2.yahoo.net/101/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h7.grid.sp2.yahoo.net/101/console

This message is automatically generated., I have committed this to trunk. but the patch does not apply 3.3.2.

ben can you provide a patch for 3.3.2? 

thanks, ben, pinging again, can you provide a patch for 3.3.2?, This is blocking a release candidate for 3.3.2, if we can get this in soon I'll start running through the release process., Committed revision 986470. in branch 3.3
]