[Nice catch [~abrahamfine]! Do you think you can provide a patch for this? I wrote that code, so more than happy to review it., Hi [~rgs]! I will provide a patch. Thanks for the offer to review., [~rgs] 

While working on this issue [~phunt] and I noticed that the behavior of the C client exhibits when removing a watch in "local" mode is different than the way the java client behaves ([~Hadriel] mentioned this in the description).

Currently, when local mode is set, the C client simply removes the watches locally (then makes the {{notify_sync_completion}} call that is causing the crash) and does not try to connect to the server. The java client will attempt to remove the watches from the server as well but it will always remove the watches locally. The java client's behavior is more in line with my interpretation of the documentation of the C client and I tried to make the C client's behavior match the documentation/java client here.

Now, when the {{local}} flag is set, the C client will remove the watches locally (this behavior is always done synchronously) and then it will try to remove them from the server.

In addition, the {{zk_hashtable.h}} file has been moved to the {{include}} directory so that we can check for local watches in the tests.

, +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12812650/ZOOKEEPER-2320.patch
  against trunk revision 1748630.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 2.0.3) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3239//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3239//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3239//console

This message is automatically generated., bq. In addition, the zk_hashtable.h file has been moved to the include directory so that we can check for local watches in the tests.

Not sure if we should do this, or simply replicate the 'pathHasWatcher' logic in test code. My concern moving this header in include directory exposes the header to end users as well, so we will have the obligation to support this file moving forward (less flexibility to change the file as backwards compatibility should be considered as well.). , I understand your point about exposing the header to end users but I would also like to avoid duplicating code. Perhaps we can add a proxy method to zookeeper.c. I also cannot find usages of the {{pathHasWatcher}} or the {{containsWatcher}} function anywhere outside of the tests so maybe I can just move them. Is there another way to add a function that is accessible to the unit test code and application logic without exposing it?, Take a step back I am curious to know why pathHasWatcher is added into this patch as part of the test. My guess is the return code of zoo_remove_watchers is not enough to decide if a watch is removed or not? If we can solely rely on the return code in the tests to decide watch remove success/fail, then we would not need make pathHasWatcher visible outside; if we can't rely on return code, we probably should also think expose pathHasWatcher as an API otherwise ZK users would face similar issue (can't rely on return code, has to use an api call.).

BTW just for some context info, looks like pathHasWatcher was introduced as part of ZOOKEEPER-1887., It makes me uncomfortable to rely on the return code in unit testing, as a unit test should do the work of making sure that the side-effects of a method match expectations.

I think return could should be fine has a mechanism for users to verify behavior, so I do not think that the mechanism of checking the contents of the watcher hash table needs to be exposed to users., That sounds reasonable - though I am not sure how to make it accessible for C unit tests w/o exposing it as an API for C client. I guess [~rgs] probably have some ideas around this. If we do then the Java client is probably needs a parity API as well. , I agree that we shouldn't expose this API out to clients. Unfortunately the tests operate as a client and as such shouldn't have access to this method, or the other methods in that file, and I don't see any way around this the way we currently have the code/build structured.

I'm -1 on the patch currently (because of the api change), +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12814621/ZOOKEEPER-2320.patch
  against trunk revision 1750025.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 4 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 2.0.3) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3254//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3254//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3254//console

This message is automatically generated., I made changes to the build that should allow us to access the {{zk_hashtable}} code without making it available to end users.

[~rgs] would you mind taking a look?, LGTM. 
Another approach is to just export the symbol of the function that tests requires without providing a header file (so average user would not access them)., [~rgs] sorry to bother again, i was hoping to get a review from you on this patch.]