[the patch detects the bug and fixes it. i'm not completely sure about the fix. it's simple and works, but there is a little non deterministic corner case: a client issues a close, but the connection drops after the request is received by the server, and the client moves to a new server and continues to use the session, the stray close will come in and close the session. this corner case is not possible with our current client implementation., updated the patch to comment on why the checkSession is not needed for the benefit of future maintainers., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12412080/ZOOKEEPER-450.patch
  against trunk revision 788872.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 6 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-vesta.apache.org/144/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-vesta.apache.org/144/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-vesta.apache.org/144/console

This message is automatically generated., +1 for the patch... good catch ben.... I just committed this. thanks!, forgot to mention that the -1 was due to address in use issue in LETest (not related to the patch)... , Integrated in ZooKeeper-trunk #363 (See [http://hudson.zones.apache.org/hudson/job/ZooKeeper-trunk/363/])
    ]