[FAILURE: Integrated in ZooKeeper-trunk #2707 (See [https://builds.apache.org/job/ZooKeeper-trunk/2707/])
ZOOKEEPER-2189: QuorumCnxManager: use BufferedOutputStream for initial msg
(Raul Gutierrez Segales via hdeng) (hdeng: http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1682558)
* /zookeeper/trunk/CHANGES.txt
* /zookeeper/trunk/src/java/main/org/apache/zookeeper/server/quorum/QuorumCnxManager.java
, this message is bogus, the commit message meant to reference ZOOKEEPER-2098, Hi [~suda].

I committed ZOOKEEPER-2098 but mistakenly wrote the commit message to be ZOOKEEPER-2189. Would you mind to open another JIRA and grant this JIRA number to me. Thanks!
, Verifying acks as proposed in this JIRA will not solve this issue. Acks from observers are not required to elect a leader. If standaloneenabled=false server 3 can be elected without seeing any other messages. 

Also, suppose you wrote the wrong ports for the other servers ? 

It seems that to fix such errors one needs some kind of config registry. 
, ABORTED: Integrated in ZooKeeper-trunk #2708 (See [https://builds.apache.org/job/ZooKeeper-trunk/2708/])
ZOOKEEPER-2189: QuorumCnxManager: use BufferedOutputStream for initial msg
(Raul Gutierrez Segales via hdeng) (hdeng: http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1682623)
* /zookeeper/trunk/CHANGES.txt
, Hi Hongchao Deng,

Thank you for the offer.
But as this JIRA has been still kept open, I think we can still continue with this JIRA.
I will open another JIRA if there is a problem., Hi Alexander Shraer,

Thank you for the feedback.

I understood we cannot solve the issue by verifying acks, 
but could you tell me what config registry stands for?
(something like "discovery.etcd.io" or Consul's Atlas integration?), I didn't offer anything... You might misunderstand..

What I meant is I committed "2098", but I wrote the message to be "2198" (not committed "2198").
I wonder if you can give this JIRA to me, I will replicate "2098" to this JIRA and mark it duplicated. You can create a new JIRA and move discussion there.

I would really appreciate it if you can help me. :), Hi [~suda],

On second thought, although its not going to solve the specific scenario you describe, it may still be a good idea to add some check(s). For example, if a server receives a configuration from another server (in FastLeaderElection.java) with the same configuration version,  the configuration itself must be identical.  The check should only be for non-initial configs (see ZOOKEEPER-1783), so probably (rqv.getVersion() > 0x100000000 and rqv.getVersion() == curQV.getVersion()). 
If you still think its a good idea, would you like to propose a patch ?

Regarding the config registry, I didn't have any specific system in mind, perhaps others can advise. [~phunt][~rgs]

Thanks,
Alex, Hi [~hdeng],

Sorry for the misunderstanding,

I'm OK to assign the JIRA to you, but I don't seem to have the permission to do so.
Could you list me as a contributor so that I can assign JIRAs?


, Hi,

Thanks for your understanding. I really appreciate your help.

All you have to do is to click "More" -> "Clone" and clone this JIRA to a new one.

Then I can take it myself and add a comment to tell people that discussion here belongs to that JIRA :)
Thanks for reporting the issue and contributing to the project too!, Hi [~hdeng], 

Thank you for the advice.

I made the clone: [ZOOKEEPER-2203]

, Hi [~hdeng], 

Thank you for the advice.

I made the clone: [ZOOKEEPER-2203]

, Not sure re config registry. What would that entail? Git? :-) , I think they are talking about a central registry to contain server list. Just like "discovery.etcd.io" or DMV...

However, this is like asking the root of root. ZK is the root of knowledge for most distributed systems. Are we expecting a root for ZK too?

Anyway, JIRA is moved to ZOOKEEPER-2203. Let's move discussion there. Do me a favor and let me clean up the mess caused by my mistake...]