[+1 overall.  GitHub Pull Request  Build
      

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 2 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 3.0.1) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-github-pr-build/1896//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-github-pr-build/1896//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-github-pr-build/1896//console

This message is automatically generated., Committed to 3.6. Merge conflicts with branch-3.5, need a separate pull request to get this in 3.5., SUCCESS: Integrated in Jenkins build ZooKeeper-trunk #128 (See [https://builds.apache.org/job/ZooKeeper-trunk/128/])
ZOOKEEPER-3082: Fix server snapshot behavior when out of disk space (hanm: rev 78e4a1047c701006dd4ec8d09065eda0e7adedb5)
* (edit) src/java/main/org/apache/zookeeper/server/persistence/FileTxnSnapLog.java
* (add) src/java/test/org/apache/zookeeper/server/persistence/EmptySnapshotTest.java
, [~nixon] [~hanm]

Thanks for sorting this out. Do you think it fixes ZOOKEEPER-1621?, [~andorm] my (possibly incorrect) read on ZOOKEEPER-1621 is that the issue is related to this one but not strictly a subset. Here we've removed the possibility of the snapshot side of recovery being lost during a disk-full event. There, the issue seems to be in ensuring the transaction log side of recovery is not corrupted by writing empty/incomplete log files. That issue will continue to be present even with the patch from this file applied., Thanks [~nixon]]