[send_ping is calling wake_io_thread itself, so this is a particularly bad situation (forces a tight loop)

solution is to update last_send as last_send_attempt when attempting to send, whether successful or not.
, Assigning to Ben. 

We should verify that something like this can't happen in the java either. From my looking
it seems not, but would be good to have addl verification.
, this patch fixes the problem by only sending a ping if there isn't something already queued. the test checks for clients sending gratuitous pings., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12423282/ZOOKEEPER-562.patch
  against trunk revision 828216.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h8.grid.sp2.yahoo.net/40/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h8.grid.sp2.yahoo.net/40/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h8.grid.sp2.yahoo.net/40/console

This message is automatically generated., +1, looks good to me - if we are waiting for a result we don't need to send a ping. great!

Mahadev, can you take a look at this and commit if no issues found? (both 3.2 branch and trunk), +1 this looks good., I just committed this to 3.2 branch and trunk., Integrated in ZooKeeper-trunk #513 (See [http://hudson.zones.apache.org/hudson/job/ZooKeeper-trunk/513/])
    . c client can flood server with pings if tcp send queue filled. (ben reed via mahadev)
]