[Hi [~BourneHan], It isn't entirely clear to me what your program is doing. Do you execute steps 1-5 upon every connected event? Can you make sure that 192.168.25.222 is actually watching the correct znode? You can use the zkCli to check the status of znodes., Hi Flavio,

 Do you execute steps 1-5 upon every connected event? 
 Yes. I used  zookeeper_init  to set watcher,  then when got a ZOO_SESSION_EVENT-ZOO_CONNECTED_STATE notification, my program will execute steps 1-5.

Can you make sure that 192.168.25.222 is actually watching the correct znode?
Yes, from the log of my program I can see 192.168.25.222 is actually watching the lowest sequence number znode created by 192.168.25.221.
Actually, I use the steps 1-5 to obtain a distributed lock somewhere else, and everything is ok.

You can use the zkCli to check the status of znodes.
From the zkCli, I can see: the lowest sequence number znode created by 192.168.25.221 have disappeared and the znode created by 192.168.25.222 exists.
, From http://www.ngdata.com/so-you-want-to-be-a-zookeeper/, I got:
Each ZooKeeper handle (= ZooKeeper object instance) has one thread for dispatching the events to all the watchers.
One case to watch out for is not to do something which in itself might again wait for a ZooKeeper event. 

so this issue is not a bug, I close it., [~BourneHan] Thanks for reporting back. I understand that if you block the dispatcher thread, then you won't receive other events, but just to make sure I understand precisely what you're doing, you're blocking the default watcher upon receiving a sync connected event after the ensemble recovers from the leader crash?, Hi Flavio,

you're blocking the default watcher upon receiving a sync connected event after the ensemble recovers from the leader crash?
yes. now I use a different thread to do the work upon receiving a sync connected event, and everything is ok.

I wonder why all the zookeeper Clients will receive a sync connected event after the ensemble recovers from the leader crash and just some zookeeper Clients will receive a sync connected event after the follower crash?

thank you.




, bq. I wonder why all the zookeeper Clients will receive a sync connected event after the ensemble recovers from the leader crash and just some zookeeper Clients will receive a sync connected event after the follower crash?

When the leader crashes, the remaining followers will go into leader election and will drop the existing connections to clients. The idea there is that clients have a chance to go look for another server that is either leading or following rather than being stuck with a server that is looking for a leader. Consequently, a leader crash affects all clients. It is different when a follower crashes, since it only affects the clients that were connected to it. , OK, I got it, thank you very much!]