[[~thawan]: would you like me to rebase the patch I proposed in ZOOKEEPER-1147 (with the comments you suggested) or do you have a better/different approach?, Your original patch is to add 4lw comment to disable session validation on the leader right? If you could try my approach, I think the patch should be much smaller. , With this patch you can use -Dzookeeper.skipSessionValidation=yes to enable local sessions with a rolling upgrade. We should probably add some documentation as well - but lets agree on this patch first. , -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12614784/ZOOKEEPER-1787.patch
  against trunk revision 1543281.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    -1 javac.  The patch appears to cause tar ant target to fail.

    -1 findbugs.  The patch appears to cause Findbugs (version 1.3.9) to fail.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1793//testReport/
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1793//console

This message is automatically generated., [~thawan], [~phunt], [~fpj], [~michim]: if you guys have some cycles, review would be welcomed. I'd like to have this so we can get testing for upgrades from 3.4 early on in the 3.5.0 release cycle. , -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12614784/ZOOKEEPER-1787.patch
  against trunk revision 1605517.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    -1 javac.  The patch appears to cause tar ant target to fail.

    -1 findbugs.  The patch appears to cause Findbugs (version 1.3.9) to fail.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2152//testReport/
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2152//console

This message is automatically generated., should this be a blocker for 3.5.0 ? , Not sure. Local sessions are not enabled by default though:

{noformat}
    /**
     * Whether learners in this quorum should create new sessions as local.
     * False by default to preserve existing behavior.
     */
    protected boolean localSessionsEnabled = false;
{noformat}

so it won't actually break out of the box rolling upgrades. ]