[this patch logs and error if only a single server is specified and starts in "standalone" mode.

This is similar to what happened pre-3.3 (we ignored the server line but didn't log it). In 3.3 having a single server line would cause the server to fail (infinite loop if server.0 for example), +1 i think we should log the message as a warning rather than error since we completely recover from the situation. we may also want to log a warning for 2 servers to indicate that failures will not be tolerated. (feel free to ignore both comments and commit the patch :), imo ERROR is correct for the 1 server case as there's no way that could be right and we want to bring to operator attention - they need to fix it.
, I'll implement Ben's suggestion re 2->warn., I've added the warning message as Benjamin suggested. The patch also applies cleanly on the 3.3 branch. , committed to trunk and 3.3 branch. thanx you guys!

Committed revision 995845.
Committed revision 995844.
, This patch has broken the hudson build, I'll be submitting a patch to fix this shortly.
, ZOOKEEPER_785_2_br33.patch fixes this problem on branch 3.3, also adds some tests., ZOOKEEPER_785_2.patch fixes this problem on trunk, also adds some tests., This patch looks good - a couple of comments:

1. Can you expand the comment " // Not a quorum configuration so return immediately" to be clear that this isn't a problem, and that the server will default to standalone mode?
2. Can you actually move the 'bit out of place' test to somewhere more sensible? :) Let's make a QuorumConfigurationTest class if we have to.

, Updated patches based on review feedback., resubmitting for review - addressed reviewer fb (thanks!),

note to committer: be sure to svn add the new file., +1, this looks good (although I'd remove the 'out of place in this class' comment now that you've moved it). , fixed comment., committed to trunk/branch33, Integrated in ZooKeeper-trunk #936 (See [https://hudson.apache.org/hudson/job/ZooKeeper-trunk/936/])
    ]