[-1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12828330/ZOOKEEPER-2579.patch
  against trunk revision b2a484cfe743116d2531fe5d1e1d78b3960c511e.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 2.0.3) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3424//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3424//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3424//console

This message is automatically generated., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12828332/ZOOKEEPER-2579_3.4.patch
  against trunk revision b2a484cfe743116d2531fe5d1e1d78b3960c511e.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3425//console

This message is automatically generated., Hey [~abrahamfine], 

Nice patch. We badly deserve to exercise as much of the {{FileTxnSnapLog}} as possible. It has been in the root of some annoying bugs that impact its reliability. Thanks! :)

By the way, are you really sure you want to incur the burden of starting up a ZK instance to test an exception, using a brittle test assertion (if I understood correctly the test will pass if the server doesn't start up on time, right?), when you can just write a simpler unit test to exercise this specific part? See my attachment for ideas of how you can test your patch.

Cheers!, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12828447/FileTxnSnapLogTest.java
  against trunk revision b2a484cfe743116d2531fe5d1e1d78b3960c511e.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3429//console

This message is automatically generated., [~eribeiro] Thanks for the feedback. 

The reason that I went with the more brittle test that involves checking to see if the server starts up is because I felt that type of test better verifies the behavior that I wanted to achieve with this jira. The tests that I wrote verify that incorrect permissioning prevents the server from starting, as opposed to just verifying the behavior of the FileTxnLog (we do something similar with testWithoutAutoCreateDataLogDir).

I guess it would be reasonable to say that the tests that I wrote are more like integration tests while the tests that you attached are true unit tests. I guess it could be argued that most of the tests in ZooKeeperServerMainTest are really integration tests.

It would be possible to include both types of test instead of needing to choose. What do you think?

, {quote}
I guess it would be reasonable to say that the tests that I wrote are more like integration tests while the tests that you attached are true unit tests. I guess it could be argued that most of the tests in ZooKeeperServerMainTest are really integration tests.
{quote}

Yup, I agree.

{quote}
It would be possible to include both types of test instead of needing to choose. What do you think?
{quote}

Sounds good to me. In fact, it's up to you leave the {{FileTxnSnapLogTest.java}} or not. :) Let's see what the committers say, but I am okay with either approach, at first. 

*By the way, thanks for pointing out {{testWithoutAutoCreateDataLogDir}} because it reminded me that it would be nice to include the timeout (i.e., {{@Test(timeout = 30000)}}) in those kind of tests. Please, update your patch accordingly. ;)* 

Best regards,, [~eribeiro] updated :), -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12828868/ZOOKEEPER-2579_3.4.patch
  against trunk revision b2a484cfe743116d2531fe5d1e1d78b3960c511e.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3435//console

This message is automatically generated., committed to 3.4.10, 3.5.3, and trunk. Thanks Abe! Thanks for the reviews Edward!, SUCCESS: Integrated in Jenkins build ZooKeeper-trunk #3089 (See [https://builds.apache.org/job/ZooKeeper-trunk/3089/])
ZOOKEEPER-2579: ZooKeeper server should verify that dataDir and snapDir (phunt: rev ec20c5434cc8a334b3fd25e27d26dccf4793c8f3)
* (edit) src/java/main/org/apache/zookeeper/server/persistence/FileTxnSnapLog.java
* (edit) src/java/test/org/apache/zookeeper/server/ZooKeeperServerMainTest.java
* (edit) CHANGES.txt
]