[Any feedback on the patch proposed?, This overall looks good to me. I'm not convinced a separate UnimplementedRequestProcessor is necessary since you could just do the work inline in ZooKeeperServer.submitRequest, but it doesn't make a big difference either way.  The chroot business in your test seems unnecessary -- you're not creating a client with a chroot, and the request shouldn't be processed anyway. You're also creating an ExistsRequest and then a SetDataResponse (although the net result is the same). Maybe clean up the test and resubmit?

One thing to note is that if ZOOKEEPER-1599 is fixed, it will still be possible for 3.4 leaders to send multis to 3.3 followers. We can consider a solution for that problem depending on how ZOOKEEPER-1599 is resolved., It looks like we don't need to worry about ZOOKEEPER-1599 for now. I took nkeywal's patch and cleaned up the test a little bit., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12566025/ZOOKEEPER-1495.patch
  against trunk revision 1434978.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 6 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1353//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1353//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1353//console

This message is automatically generated., Cool. FYI, you can simplify the test even more if you get rid of try-catch boilerplate inside the method when testing things that are supposed to throw exceptions (this works only for JUnit 4). You can replace "@Test" by "@Test(expected=SomeException.class)". It removes the boilerplate code and makes the test method even more simple.

Best regards,
E., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12566097/ZOOKEEPER-1495.2.patch
  against trunk revision 1437257.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 6 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    -1 javac.  The patch appears to cause tar ant target to fail.

    -1 findbugs.  The patch appears to cause Findbugs (version 1.3.9) to fail.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1354//testReport/
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1354//console

This message is automatically generated., Sorry, forgot to "svn add"., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12566099/ZOOKEEPER-1495.2.patch
  against trunk revision 1437257.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 6 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1355//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1355//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1355//console

This message is automatically generated., Patch that can be applied to the 3.4 branch (only difference is imports in ClientTest)., A true team effort, thanks all! Committed to trunk and 3.4.6., What about 1495.br33.v3.patch ?
It would really useful for clients to see whether certain operation is supported., Closing issues after releasing 3.4.6.]