[This is certainly a bug in the C multi code I wrote, so i'm taking this bug..., Hi Marshall,

Thanks for taking this up!
Just curious has this memory leak been fixed in 3.4.5 stable release.
Or it will be included in future releases.
Also please let know if I can assist you in fixing this.

Thanks & Regards,
Deepak, Hi,

zoo_multi API used to leak memory while deserializing the response from zookeeper server.
Completion entries for individual operation in zoo_multi transaction weren't getting cleaned causing memory leak. This patch resolves this memory leak by destroying completion entries in deserialize_multi function.

Please find attached patch for the same.
Could you please review it and let me know if you have any comments?

Thanks & Regards,
Deepak, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12566893/ZOOKEEPER-1562.patch
  against trunk revision 1438375.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1366//console

This message is automatically generated., Deepak, Thanks for the patch. Have been meaning to get to this but way too much on my plate.

I reviewed the patch and it looks good to me. Pretty simple fix. I assume with this fix all the unit tests still pass and there is no longer a memory leak ?

If you verify those two things then +1 for me., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12567032/ZOOKEEPER-1562.patch
  against trunk revision 1438375.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    -1 release audit.  The applied patch generated 26 release audit warnings (more than the trunk's current 24 warnings).

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1368//testReport/
Release audit warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1368//artifact/trunk/patchprocess/patchReleaseAuditProblems.txt
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1368//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1368//console

This message is automatically generated., Thanks for reviewing this Marshall!
I have verified that valgrind doesn't report any memory leak with my application.
But somehow I am not managed to successfully run unit tests provided in the trunk though Hadoop QA reported success for all unit tests. It looks like I am missing some steps in compile and build.

I am using following steps for compiling, building and running test:
1. svn checkout https://svn.apache.org/repos/asf/zookeeper/tags/release-3.4.5/ zookeeper-3.4.5
2. patch -p0 < ZOOKEEPER-1562.patch
2. cd zookeeper-3.4.5
3. ant compile_jute
4. cd zookeeper-3.4.5/src/c
5. autoreconf -if
6. ./configure
7. make
8. cd ../../../zookeeper-3.4.5
9. ant test
On the console I could see many tests failed.
I tried same thing without my patch and still same test are failing.
Am I missing any steps in the build and patch testing?

Thanks & Regards,
Deepak

, Don't do steps 8 and 9. After step 7, do this:

8. make zktest-st
9. ./zktest-st
10. make zktest-mt
11. ./zktest-mt



, Great all tests succeed now.Thanks!, Awesome!! +1 from me., Committed to 3.4.6 and trunk. Thanks Deepak! (and Marshall for the review/help), Integrated in ZooKeeper-trunk #1822 (See [https://builds.apache.org/job/ZooKeeper-trunk/1822/])
    ZOOKEEPER-1562. Memory leaks in zoo_multi API (Deepak Jagtap via phunt) (Revision 1441862)

     Result = SUCCESS
phunt : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1441862
Files : 
* /zookeeper/trunk/CHANGES.txt
* /zookeeper/trunk/src/c/src/zookeeper.c
, Closing issues after releasing 3.4.6.]