[Thomas can you look into this and address it?, 
-----------------------------------------------------------
This is an automatically generated e-mail. To reply, visit:
https://reviews.apache.org/r/1916/
-----------------------------------------------------------

Review request for zookeeper.


Summary
-------

, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12494584/ZOOKEEPER-1184.patch
  against trunk revision 1170886.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    -1 javac.  The patch appears to cause tar ant target to fail.

    -1 findbugs.  The patch appears to cause Findbugs (version 1.3.9) to fail.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/544//testReport/
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/544//console

This message is automatically generated., I believe the hudson failure is caused by the old jute files still being in the workspace at their old position in trunk/src/java/main/org/apache/jute/compiler/generated/ although they have been deleted in SVN. Now when compiling the jute files javac finds the old classes and the new ones under build/

Did I mention that this issue would not happen with Gerrit+Jenkins? :-) I'd really love to help getting Gerrit into the ASF but would need some Apache people to recommend it., committed to trunk (3.5.0) thanks Thomas., Integrated in ZooKeeper-trunk #1306 (See [https://builds.apache.org/job/ZooKeeper-trunk/1306/])
    ZOOKEEPER-1184. jute generated files are not being cleaned up via 'ant clean' (Thomas Koch via phunt)

phunt : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1171876
Files : 
* /zookeeper/trunk/CHANGES.txt
* /zookeeper/trunk/build.xml
]