[Hi Michael,

Would you like to submit a patch for this?

Thanks!
--Michi, By the way, we recently changed extern inline to static inline (ZOOKEEPER-1339). Will this still be an issue?

--Michi, Complete fix for both 1463 and 1339., Thanks Michi. I have attached patches. Also the fix to change external inline to static inline could be a better solution as long as we delete same definition in hashtable_itr.c, otherwise we get these
---
src/c/src/hashtable/hashtable_itr.c:45: error: redefinition of 'hashtable_iterator_key'
src/c/src/hashtable/hashtable_itr.h:36: note: previous definition of 'hashtable_iterator_key' was here
src/c/src/hashtable/hashtable_itr.c:49: error: redefinition of 'hashtable_iterator_value'
src/c/src/hashtable/hashtable_itr.h:45: note: previous definition of 'hashtable_iterator_value' was here
---, Thanks Michael. Could you attach at a single patch? Otherwise the automated testing won't pick it up. Attach as a single patch including all the changes, then click "submit patch" button above., Done. Thanks., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12525970/zookeeper-1463_1339.patch
  against trunk revision 1336467.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1067//console

This message is automatically generated., Looks like the patch is failing to apply against trunk. Is the code different btw 3.4 branch and trunk? If so you might need to provide two patches (if so attach the br3.4 first, then attach trunk, the patch tester only looks for the most recent patch file attached)., This is a duplicate of ZOOKEEPER-1339, which has been applied to 3.3/3.4/trunk. 

--Michi]