[Simple patch (to trunk) demonstrating a fix that works at my site (which is currently running 3.3.5), Hi [~shyamal] - I'm assuming the patch is ready? Click the "submit patch" button if so, that way the workflow will move forward. Thanks! 

Also see https://cwiki.apache.org/confluence/display/ZOOKEEPER/HowToContribute, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12657189/ZK1983.patch
  against trunk revision 1612906.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2220//console

This message is automatically generated., Hi Shyamal, when using git you need to use the "--no-prefix" option when generating the patch (see the how to contribute page for more details), otherwise std "patch" will fail to apply. Please attach an updated patch and re-submit. Thanks!, git diff --no-prefix from a git svn clone of subversion trunk, Thanks for the link - I'm guilty of not reading the documents regarding contributions. I've uploaded a properly formatted patch., Patch formatted per contribution guidelines., Re-uploaded properly formatted patch., No problem. You want to use the "submit" button though, not the progress one..., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12657421/ZOOKEEPER-1983.patch
  against trunk revision 1612906.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 2.0.3) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2221//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2221//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2221//console

This message is automatically generated., Patrick, apologies for the newbie issues, and thanks for the pointers.

The reported build failure (for NioNettySuiteHammerTest) seems to be unrelated and afaict it's been failing for two weeks or so, (r1609730).

Regarding the missing updates for a test case: it's not obvious that it is valuable to add one. I did find src/java/test/bin/test-scripts.sh which might allow me to add a (somewhat convoluted) test to verify that we do not clobber an existing file on startup. I'm not sure if that is the policy for script updates; advice appreciated., testHammer is failing because of an environmental issue, I'm working with infra to resolve it. No need for a test case I would think., Thanks [~shyamal], patch looks fine. Just one thought, with append support the out file will keep grow. One way is to provide an option of {{MaxFileSize}} threshold and then rollover based on that, right ? Also, welcome better ideas., [~rakeshr], my opinion is to leave the file size management to OS specific tools (like logrotate) which can apply the policy a sysadmin desired. I don't believe that any attempt to manage log rotation of stdout redirected from this script will add much value (even if it can coded in a useful manner). , ok. I got your point. It looks simple, but I'd like to see +1 or comments from others as well. Based on that will push this in., hi
Can we think of out file rotation ? say we will keep last 5 or 10 out files.
The rolling will happen on each restart.]