[Thanks for reporting this issue, [~ABchmn]. Do you want to give it a shot at patching the script?, Sorry, I have no idea where the problem is coming from, that's why I seek help here.. What character is ^M in Linux? Why does the script not write into data/ instead? The script looks fine syntactically, although I have the feeling that many environment variables are not defined that it relies on., I found the issue. As I suspected, the reason for data? is actually a data^M which translates into a \r character.

The following code executed in the bin/ folder resolved the issue:
perl -p -i -e "s/\r//g" *.sh

This converts line endings from Windows mode into Linux mode, which one would expect to find in the zk.tar.gz anyway.
I'm not sure if I should create a pull request or patch, as this seems to be more of a problem with the developer's build chain, rather a simple code fix.

If anybody is interested, I can zip my Vagrant code that sets up distributed zookeeper instances inside Virtualbox containers (which may be a bad practice, as there is only ephemeral disk storage)., GitHub user ArneBachmann opened a pull request:

    https://github.com/apache/zookeeper/pull/105

    Fix ZOOKEEPER-2625: Introduce explicit end-of-line setting for shell scripts

    I added a .gitattributes file into the bin/ folder with the startup scripts.
    It seems the official build servers build the ZK packages on a Windows machine (?), because even the Bash Shell scripts have CRLF line endings (extracted from the downloaded archive, not from a git checkout), which caused bug ZK-2625, as reported by me.
    Since I don't have a build server myself and would build under Linux, I cannot check if this PR fixes the bug, please advise.

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/ArneBachmann/zookeeper master

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/zookeeper/pull/105.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #105
    
----
commit 6b58447a5da859736cb019ff1c4e41d9dcb5bbe1
Author: Arne Bachmann <arne.bachmann@gmx.de>
Date:   2016-11-12T20:32:27Z

    Introduce explicit end-of-line setting for shell scripts.

----
]