[Duplicating the data wouldn't help in circumstances where the data is a structure contain malloc'd memory, i.e.:

struct Foo {
  const char* bar;
};
, Then perhaps the solution is to document a contract between aysnc calls and library consumers that the data pointer needs to be alive until after the async call has complete (or been submitted, or whatever).  

Or maybe async calls need another argument for a cleanup function that frees the data pointer., well, I don't think zookeeper would handle such a struct correctly anyway, because zookeeper treats whatever you throw into that argument like a byte array.  So zookeeper will persist the memory location of the inner-malloc()'d memory, but not the memory itself. , I think the issue is the add completion, which passes 'data' to it. The Request is already serialized (copied).

The 'data' needs to be copied for the completion.  The completion holds a reference to the 'data' after this function returns, so it needs to own the memory. With the current API, the only way to own it, is to copy it, because we're only using malloc/free, not a more advanced memory management API where you can pass ownership of memory, or increase reference counts on memory.

So I am submitting a patch where the create_completion_entry function copies the data, and the destroy_completion_entry function frees the copied data.

In the completion_list_t structure, have to remove const from the 'data' member, so that one can call free on it. Now it's a copy, not referring back to the caller's copy., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12570822/zookeeper-1519.patch
  against trunk revision 1448007.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1409//console

This message is automatically generated., Does sizeof *(void *) work?, Don't think so: http://fpaste.org/iwjf/, You're correct. I didn't have time to test the patch, but I wanted to get it out there for discussion.

I looked further, and the callers get void* data from the public API with no length parameter.  So, the public API does not allow us to copy the data.

In order to fix it, it looks like a public API change is required.  Either:

 1. Document in the API that the caller cannot free that memory until the zookeeper library is done with it (which also means it can't be a pointer to memory on the stack).  I assume that the library is done with it once it calls the completion callback? So the program can free it once it gets the same pointer back in a callback (or when the zookeeper connection is closed). I think this would make it hard to integrate with scripting languages like Python, because the scripting language C interface would have to copy the memory, account for it in some global structure, and free it once it sees that pointer again in a callback or when the zookeeper connection is closed.

 2. Document in the API that the void * must be malloc'ed memory, and the ownership is passed to the library (which means the caller copies it, and the library frees it). That's also a difficult API.

 3. Add a data length parameter to the API, so the library can copy it.

 4. Don't use a void * for the 'data' parameter, use something else.
, Never mind my comments about 'data'. I was confusing 'value' with 'data.'  'value' is copied when it is serialized. So, I don't see where the submitter's original problem can occur.

'data' is all right, because it should be passed by reference.  In the zkpython bindings, it's used to hold a reference to the Python callable object that should be called on the callback.  That's a python object, so it's refcounted.  'completion' is the zkpython C function that is called, and calls the python callable object that is cast to a Python object and called with the Python API.
, Hi there, I believe the contract with the C client is that the application manages the memory allocation of the data it passes to async calls, so I'm not really happy about copying the data. I'm fine with improving documentation, though.

A different issue seems to be with the python client. I don't know enough about it to determine if this could be fixed on its side instead of applying the fix proposed here., [~henryr] any insight here?, I agree with Flavio... All the work I did in the C client made the same contract that the caller owns the memory not the C client. This is typical of all async interfaces I've used (e.g. asio, etc). , What should we do with this issue? It sounds like we haven't converged., I don't think this is a problem. The caller should hold the json.dumps(value), and free it in callback if needed., From an implementation point of view I think it's fine to not handle this case (I can't think of any way to fix it in zkpython that wouldn't be brittle and/or weird) but the documentation should clearly indicate that it is the callers responsibility to keep a handle on the string.  From the caller's point of view in Python it is not expected that the underlying function is not incrementing/decrementing reference counts., [~markgius], would you be able to propose a patch for the documentation?]