[Hi Nikita,

Would you like to submit a patch with a testcase?

Thanks!
--Michi, Submitting a patch is no big deal. I just can't think of a test case... We could test that with non-zero initialized buffer we get right result - but there's no way to control buffer contents from outside {{pyzoo_get}}. Could you help with the script for a test case?, Hi Nikita,

I was thinking we could have a simple test case in python (if there isn't one already) that calls {{zookeeper.get}} on an empty znode and makes sure that it's empty. You don't need to explicitly modify the malloc'ed buffer in {{pyzoo_get}}., I don't think it's possible to create an empty node (i.e. buff = null, size = -1) from python, we only can create node with empty string as valud (i.e. buff = '', size = 0)., Ok maybe I misunderstood the bug description. I thought doing a get on empty znode on FreeBSD sometimes returns random data. What I meant to ask was to write a python test case that reproduces the issue. It's ok if it doesn't happen on Linux, or it's not 100% reproducible on FreeBSD. , Yep, you're right. Just checked that empty node even created from python (i.e. when we pass empty string with size 0) returns with size -1.

I'll attach patch in a moment..., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12638109/ZOOKEEPER-1906.patch
  against trunk revision 1583513.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2017//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2017//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2017//console

This message is automatically generated., +1 Thanks Nikita!, trunk: http://svn.apache.org/viewvc?view=revision&revision=1583783
branch-3.4: http://svn.apache.org/viewvc?view=revision&revision=1583784, SUCCESS: Integrated in ZooKeeper-trunk #2277 (See [https://builds.apache.org/job/ZooKeeper-trunk/2277/])
ZOOKEEPER-1906. zkpython: invalid data in GetData for empty node (Nikita Vetoshkin via michim) (michim: http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1583783)
* /zookeeper/trunk/CHANGES.txt
* /zookeeper/trunk/src/contrib/zkpython/src/c/zookeeper.c
* /zookeeper/trunk/src/contrib/zkpython/src/test/get_set_test.py
]