[-1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12448246/foo.patch
  against trunk revision 958096.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h7.grid.sp2.yahoo.net/87/console

This message is automatically generated., This patch is created using svn diff hopefully that works better., Alex would you mind creating the patch with \-\-no-prefix (otw patch application fails on hudson) and naming it per our naming scheme- ie the name of the jira.patch so ZOOKEEPER-796.patch. Then re-submit, thanks!
, Ok lets see if i convince hudson to like the patch this time., replaced tab with space, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12448726/ZOOKEEPER-796.patch
  against trunk revision 960686.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h1.grid.sp2.yahoo.net/133/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h1.grid.sp2.yahoo.net/133/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h1.grid.sp2.yahoo.net/133/console

This message is automatically generated., Hizzah, unless their is a way to do tests with shell script changes?, +1 thanks Alex!, Integrated in ZooKeeper-trunk #870 (See [http://hudson.zones.apache.org/hudson/job/ZooKeeper-trunk/870/])
    ZOOKEEPER-796. zkServer.sh should support an external PIDFILE variable
]