[Yes, that was what I intended for this to do. Nice catch. 

Would be great if you could submit a patch. If you can't I'll look at this later this week., Quick fix to an obvious code defect - unit test seems unnecessary to me., +1 Thanks Dutch!, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12644670/ZOOKEEPER-1836.patch
  against trunk revision 1594755.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2089//console

This message is automatically generated., Removed the prefix from the patch., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12645072/ZOOKEEPER-1836.patch
  against trunk revision 1594755.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2091//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2091//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2091//console

This message is automatically generated., The test failure is tracked in ZOOKEEPER-1914. I'm checking this in., trunk: http://svn.apache.org/viewvc?view=revision&revision=1595038, FAILURE: Integrated in ZooKeeper-trunk #2311 (See [https://builds.apache.org/job/ZooKeeper-trunk/2311/])
ZOOKEEPER-1836. addrvec_next() fails to set next parameter if addrvec_hasnext() returns false (Dutch T. Meyer via michim) (michim: http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1595038)
* /zookeeper/trunk/CHANGES.txt
* /zookeeper/trunk/src/c/src/addrvec.c
]