[Suggested patch.  Fixes the regression while maintaining the ZOOKEEPER-1535 'fix'.  No test for reasons already cited around zkcli testing., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12638512/ZOOKEEPER-1897.txt
  against trunk revision 1583783.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2026//console

This message is automatically generated., The last patch run claims success on the end of the javac so not sure why it failed.  Here is a patch that applies cleanly., The patch LGTM - sorry for the mess up.

Could any committer test it and apply, please?, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12638517/ZOOKEEPER-1897v2.txt
  against trunk revision 1583783.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2027//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2027//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2027//console

This message is automatically generated., bq. The patch LGTM - sorry for the mess up.

No worries.  Was able to hack a workaround over in hbase.  Go easy., Do we need to check the return value of processCmd() and call System.exit? Isn't the command going to exit regardless of whether the -w option was given?, bq. Isn't the command going to exit regardless of whether the -w option was given?

Ain't that what we want to happen when we pass args on command line?  Maybe I misunderstand.  What does the '-w' do?, The -w option sets a watch on the znode. I think it's mainly used in the interactive mode., If I pass -w on command line I get this:

Command failed: java.lang.IllegalArgumentException: Path must start with / character

I get it when I do interactive mode (w/o jline supplied).

, That's probably a separate bug, though it works on my setup. Please open a new jira and provide the command that's failing on your setup., To set a watch, I believe we need to use the [watch] flag, like here:

{noformat}
./zkCli.sh -server localhost:2181 get /blah watch
{noformat}

no?, [~fpj] That works boss.

[~michim] This is what fails:

[stack@c2022 hbase-0.99.0-SNAPSHOT]$ ~/bin/java/bin/java -cp ./lib/zookeeper-3.4.6v2.jar:lib/slf4j-log4j12-1.6.4.jar:lib/slf4j-api-1.6.4.jar:lib/log4j-1.2.17.jar  org.apache.zookeeper.ZooKeeperMain -server c2020:2181 get -w  "/hbase/rs"

Connecting to c2020:2181
log4j:WARN No appenders could be found for logger (org.apache.zookeeper.ZooKeeper).
log4j:WARN Please initialize the log4j system properly.
log4j:WARN See http://logging.apache.org/log4j/1.2/faq.html#noconfig for more info.
Command failed: java.lang.IllegalArgumentException: Path must start with / character


This is a zk with the patch that I attached here applied.

A clean 3.4.6 gives no indication that it worked (in fact I'm pretty sure it does not work given that is what this issue is about -- that command-line args are just by-passed):

{code}
[stack@c2022 hbase-0.99.0-SNAPSHOT]$ ~/bin/java/bin/java -cp /tmp/zookeeper-3.4.6.jar:lib/slf4j-log4j12-1.6.4.jar:lib/slf4j-api-1.6.4.jar:lib/log4j-1.2.17.jar  org.apache.zookeeper.ZooKeeperMain -server c2020:2181 get -w  "/hbase/rs"
Connecting to c2020:2181
log4j:WARN No appenders could be found for logger (org.apache.zookeeper.ZooKeeper).
log4j:WARN Please initialize the log4j system properly.
log4j:WARN See http://logging.apache.org/log4j/1.2/faq.html#noconfig for more info.
{code}


, Forgot to add that -w is in trunk., Oh yeah right Flavio, the -w option is not in the 3.4 branch.

Anyways, the return value of processCmd is irrelevant in non-interactive mode, it just indicates whether the watch option (-w or watch) was provided. [~stack], could you update the patch?

Sorry for the confusion., Oh, and please, update the assignee to [~stack] because he provided the patch. Thanks, man. And sorry again for this issue., bq.  could you update the patch?

You mean exit regardless of what the result of processCmd?, Yes., Or rather, just call processCmd(cl). I don't think we need to call System.exit explicitly., The system.exit is not needed as you speculate [~michim], +1 Thank you [~stack]!, trunk: http://svn.apache.org/viewvc?view=revision&revision=1584438
branch-3.4: http://svn.apache.org/viewvc?view=revision&revision=1584440, SUCCESS: Integrated in ZooKeeper-trunk #2279 (See [https://builds.apache.org/job/ZooKeeper-trunk/2279/])
ZOOKEEPER-1897. ZK Shell/Cli not processing commands (stack via michim) (michim: http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1584438)
* /zookeeper/trunk/CHANGES.txt
* /zookeeper/trunk/src/java/main/org/apache/zookeeper/ZooKeeperMain.java
]