[Patch for the problems described. Includes a unit test for the first case. The second case is difficult and I still don't have a good idea of how to write a unit test for it. In particular, I haven't been able to crash and restart a peer in a unit test because when I kill the listener of QuorumCnxManager and try to create another instance, it complains that the port is in use. I tried using setReuseAddress(true) before binding, but it still doesn't work. , What do you mean by "kill qcnxmanager"? During the "kill" is the code explicitly closing the port? It might be that the socket isn't being closed explicitly? (relies on gc?)

Ensure that the code will explicitly close the port if "killed".

If you're done on this issue you might consider submitting the patch for review.
, "kills" means calling the shutdown method of QuorumCnxManager.Listener. I referred to "kill" because this is how I reproduce the problem out of unit tests, by just killing the server (ctrl-c). Now, we do close the socket there, but from I found on the net, calling close and having it returning doesn't mean that the port is released.

This patch is good for me, but it doesn't include the unit test for the case we are discussing. Although I think it is trivial the correction to the problem pointed out, having a unit tests would prevent us from making the same mistake in the future. So, I'd like to submit the current patch for review and perhaps open another JIRA for the unit test if you think it is worth having it.   , the patch does not apply any mroe. I tried creating a new patch but its a little tricky so I didnt want to mess up the patch. Can you regenerate the patch Flavio?, the patch looks good. Here are my comments - 
- it adds a lot of LOG.info messages to FastLeaderElection and QuorumCnxn. Do we really need that? It introduces a lot of noise in the logs. I probably think we should mark them as debug messages
- also 
{noformat}
  408.               LOG.info("My election bind port: " + port);
  409.             LOG.warn("My election bind port: " + port);
{noformat}

should be fixed., fixed some log.info to be log.debug and fixed the duplicated log messages as well., the last patches fail with compile-test since one of the test uses an old api., I just committed this. Thanks flavio., Integrated in ZooKeeper-trunk #217 (See [http://hudson.zones.apache.org/hudson/job/ZooKeeper-trunk/217/])
    ]