[-1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12600907/zookeeper-1751.patch
  against trunk revision 1516126.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1549//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1549//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1549//console

This message is automatically generated., +1 for the patch. This is good to have since it can cause some race conditions during the  client pings., Committed to both trunk and 3.4.6. Thanks Jeffrey., SUCCESS: Integrated in ZooKeeper-trunk #2059 (See [https://builds.apache.org/job/ZooKeeper-trunk/2059/])
ZOOKEEPER-1751. ClientCnxn#run could miss the second ping or connection get dropped before a ping. (Jeffrey Zhong via mahadev) (mahadev: http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1524275)
* /zookeeper/trunk/CHANGES.txt
* /zookeeper/trunk/src/java/main/org/apache/zookeeper/ClientCnxn.java
, Added 3.5.0 as fix version. This has been committed to trunk as well. , We're currently using version 3.3.5 and are seeing this bug.  

Would it be possible to get a patch for the 3.3.x version for this fix?, Closing issues after releasing 3.4.6.]