[I have looked into this issue and it's related to the lines 347-348 of the run() method in file ZooKeeperMain.java:

{noformat}
   boolean watch = processCmd(cl);
   if (!watch) {
      System.exit(0);
   }
{noformat}

The REPL is executed in a "while ((line = (...)) != null)" loop. Therefore when the user issue <ctrl+d> the flow jumps out of loop, but before ending execution it runs the code above, that seems redundant, imo. 

The issue shows up because the "cl" object still points to the last executed command even though the "line" variable (that  populates the "cl" object) is already null. Looking at svn logs and studying the control flow, it looks like the this snippet  lost its usefulness during successive code modifications (last one that affected it: ZOOKEEPER-82), because its job is already done by executeLine() calls in the loop.

My suggestion would be to get rid of this code block, but I would like to hear what you think about it. There's any situation where this snippet would be relevant?, I am submitting two mutually exclusive patches for your consideration:

1. The first one just removes the snippet of code I cited previously, but I would be really glad if you could analyse it and see if it's safe to remove or not. I didn't see  any counterexample for not getting rid of it.

2. The second one is a 'hack' that populates  the 'dirty' cl object by a "quit" command when leaving the loop, so that it can at least close the connection on ctrl+d. My favorite is the first one, but I left it up to you to decide if any of them is worth committing. , -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12562681/ZOOKEEPER-1535-2.patch
  against trunk revision 1425215.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1318//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1318//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1318//console

This message is automatically generated., I didn't provide any tests because it requires the use of zkCli.sh and I didn't find any test using it. I simulated and checked my fix iteratively. How do I justify this? Remember, I am the n00b here. :) 

The steps I followed to simulate and fix the bug were:
1. start zkCli.sh
2. Type one or more commands (ls, history, etc) and then press CTRL+D. It should reexecute the last command I issued;
3. After applying the patch, I re-execute steps 1-2, but it closes the connection and leaves the CLI without executing the latest command a second time. 

Besides, the two patches I've uploaded are different fixes of the same problem. I think the first version is the better, but I would like to hear what you think about it.

Thanks,
Ed, OK patch #1 looks ok to me. It looks like this is leftover from some really old code refactorings that should have been removed when Henry put in ZOOKEEPER-386. I've tested the command line and it all looks good without this so I'm going to put it onto trunk and 3.4 for good measure., Integrated in ZooKeeper-trunk #1789 (See [https://builds.apache.org/job/ZooKeeper-trunk/1789/])
    ZOOKEEPER-1535. ZK Shell/Cli re-executes last command on exit (Edward Ribeiro via camille) (Revision 1427034)

     Result = SUCCESS
camille : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1427034
Files : 
* /zookeeper/trunk/CHANGES.txt
* /zookeeper/trunk/src/java/main/org/apache/zookeeper/ZooKeeperMain.java
, Cool. Thanks for the support and readiness, Camille.:-), Cool. Thanks for the support and readiness, Camille.:-), Cool. Thanks for the support and readiness, Camille.:-), Closing issues after releasing 3.4.6.]