[GitHub user xoiss opened a pull request:

    https://github.com/apache/zookeeper/pull/363

    branch-3.4 -- bugfix -- ZOOKEEPER-2894

    Fixes https://issues.apache.org/jira/browse/ZOOKEEPER-2894

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/xoiss/zookeeper branch-3.4-bugfix-zookeeper-2894

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/zookeeper/pull/363.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #363
    
----
commit ba56555b39edacd3be75ad0b07cc7ce86861be16
Author: xoiss <xoiss@ubuntu>
Date:   2017-09-08T12:49:06Z

    ZOOKEEPER-2894 - fix memory and completion leak on zookeeper_close.

----
, -1 overall.  GitHub Pull Request  Build
      

    +1 @author.  The patch does not contain any @author tags.

    +0 tests included.  The patch appears to be a documentation patch that doesn't require tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 3.0.1) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-github-pr-build/1004//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-github-pr-build/1004//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-github-pr-build/1004//console

This message is automatically generated., Github user phunt commented on the issue:

    https://github.com/apache/zookeeper/pull/363
  
    Hi @xoiss please update this PR to follow the guidelines in "generate a pull request" here: https://cwiki.apache.org/confluence/display/ZOOKEEPER/HowToContribute - in particular wrt the summary and description text which really helps folks identifying which PRs to prioritize. Thanks!
]