[PING, I was/am hesitant to move forward with this given that many of our previous releases are missing from the archive site. We have been removing things from dist in the past due to this policy, however now those releases are missing., It's not possible for releases to go "missing" from the archive server - it is effectively write-only.

Which releases do you think have gone missing?

If there were a problem please raise this urgently with Infra as it is vital that all past releases are preserved.
, Hm. Ah, I see what happened, the previous releases are here:
http://archive.apache.org/dist/hadoop/zookeeper/
We were a sub of Hadoop for those releases, I guess they didn't move over when we went TLP (makes sense).

Thanks for helping to clear this up Sebb! I'll look into removing the stragglers., It's time to clear up the download area again please.

Looks like 3.4.5 and 3.3.6 can be deleted, I just removed 3.4.5. (still quite a few folks on 3.3, not yet moved to 3.4 codeline - minors for us are like majors for others)., The criterion is whether the release is still being maintained, rather than whether it is still being used.

If there are not going to be any more releases in the 3.3.x codeline, then it is not current, and should be deleted from the ASF mirror servers.

The download page can still include links to the version, but they need to point to the archive server., Please can you remove 3.3.6 from the ASF mirror servers.

It will continue to be available from the archives, I looked into this based on your previous comment - I ended up leaving 3.3 available given the criteria you specified "The criterion is whether the release is still being maintained". There are issues targeting 3.3.7 in JIRA, some also list that as the fixVersion., I see, I was not aware of that.

In which case, assuming that the PMC intend to make a 3.3.7 release, 3.3.6 could be left there for now.
After 3.3.7 had been released, then 3.3.6 should be deleted., The following releases appear to be old:

zookeeper-3.4.10/ 
zookeeper-3.5.0-alpha/
zookeeper-3.5.1-alpha/, It looks like zookeeper-3.4.11 was removed instead of 3.4.10?, 3.4.11 has a very serious regression which is fixed in 3.4.12. Also 3.4.10 is currently the "current" and "stable" link targets., Ok. It's still linked to as the single 3.4.x release on the main page under documentation., The release is being finalized currently and likely all the steps have not yet been completed. [~abrahamfine] is RM for 3.4.12 and driving that. I just jumped in to cleanup the downloads as I wasn't sure Abe knew about this Jira or this aspect of Apache requirements., Gotcha. No worries. Was a little confusing during the transition period. We've grabbed 3.4.12 instead. Thanks for your help.]