[Allows use of the 'zookeeper.clusterName' system property to specify the instance portion (the part after the slash character) of the Zookeeper server principal name., Hi Laxman, can you take a look at this patch and see if it's what you had in mind? 

Thanks, 
-Eugene, Improved patch with tests and comments., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12527881/ZOOKEEPER-1467.patch
  against trunk revision 1337029.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1079//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1079//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1079//console

This message is automatically generated., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12527907/ZOOKEEPER-1467.patch
  against trunk revision 1337029.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1080//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1080//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1080//console

This message is automatically generated., Thanks for the patch Eugene. I think "zookeeper.server.principal" configuration would be better instead of "zookeeper.clusterName".

At the same time we may need to consider to avoid using system properties. Consider a case where my application needs to talk to multiple zk clusters whose principals might be different.

Hope I didn't confuse you. :(
, Agree with Laxman here. I think we need to get rid of our system properties and should not be using it for configuration. Can we use the ZK config file? ,  Eugene would you be able to add this as a config property in ZK config files?, I come across this case recently. Let me try to take this JIRA ahead:).

bq.Can we use the ZK config file?
AFAIK there is no configuration file in the client side. In that case, we should either introduce the ZooKeeper client initialization by taking Configuration object or introduce client side configuration file. Will it be backward compatible ?, bq.Agree with Laxman here. I think we need to get rid of our system properties and should not be using it for configuration. Can we use the ZK config file?

Thanks [~surendrasingh] for introducing client side configuration object ZOOKEEPER-2139, which will allow to set multiple principals. I think once that is done, will come help to move ahead., This patch will be required even after ZOOKEEPER-2139. ZOOKEEPER-2139 is not introducing any new property and as per this jira expectation {{zookeeper.server.principal}} is to be added. , Is this really a blocker?, Not sure why we have it marked as a blocker, it doesn't look like a blocker to me., [~ekoontz] can you submit the patch, please. Just modify {{org.apache.zookeeper.ClientCnxn.SendThread.getServerPrincipal(InetSocketAddress)}}. Take server principal from {{zookeeper.server.principal}} property if it is set., Hi Arshad,
Sure, thanks for the reminder. Should be able to submit tomorrow.
-Eugene, ping [~ekoontz], I had issue with zk client while using custom zookeeper principal name, after looking at apache source code I found it was fixed in Feb/2014. See this PR: https://github.com/apache/zookeeper/commit/843baf56d4d8e120fd516aeb9c04718193bccbe7

All you need to do is to add property below to your java app that uses zookeeper client:
-Dzookeeper.sasl.client.username=YOUR-CUSTOM-PRINCIPAL-NAME-FOR-ZK
, Hi [~gbraccialli],
server principal can have three parts {{serviceName/hostName@realm}}
serviceName can be configured with {{zookeeper.sasl.client.username}}
realm can be configured with {{zookeeper.server.realm}}
only hostName is not configurable. It is taken same as the server IP.
zookeeper.server.principal is being introduced to give the complete principal like  {{-Dzookeeper.server.principal=zookeeper/hadoop.hadoop.com@HADOOP.COM}}
where hadoop.hadoop.com is the hostName, In case of Hiverserver2 , Where do we specify zookeeper.sasl.client.username=hadoop ?

I tried updating in hive-site.xml it doesn't seem to respecting that.  
Workaround was updating zookeeperservers jaas.cfg but that doesn't look optimum in prod env.
so Adding jaas.cfg in hiveserver2 home will help ?, ++++
We used zookeeper-3.4.6 
and hiveserver2 uses zookeeper's src/java/main/org/apache/zookeeper/ClientCnxn.java

So we set in hive env to have -Dzookeeper.sasl.client.username=username to solve this.

Thanks, Mark]