[-1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12768006/ZOOKEEPER-2299-01.patch
  against trunk revision 1709293.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 2 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 2.0.3) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2922//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2922//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2922//console

This message is automatically generated., Thanks [~arshad.mohammad] for reporting this. I could see the unit test case is written to simulate the scenario. Could you tell me the way {{qp.myClientAddr}} would become null value in the real cluster. 

Also, just one quick comment about the patch. Say, if someone use secureClientPort, server will use {{peer.secureCnxnFactory}} to handle the connections. {{peer.cnxnFactory}} will be null, again this patch will throw NPE, right?, Thanks [~rakeshr] for looking into the issue.
# {quote}
Could you tell me the way qp.myClientAddr would become null value in the real cluster.
{quote}
scenario is as follows
1) in zoo.cfg clientPort is configured but clientPortAddress is not configured(which is valid configuration).
2) in zoo.cfg servers have following configuration, not added client information
{code}server.1=localhost:2888:3888:participant
server.2=localhost:2889:3889:participant
server.3=localhost:2890:3890:participant{code}
Remark:{{qp.myClientAddr}}  is not null only when   client ip is specified in dynamic configuration
like  server.1=localhost:2888:3888:participant;localhost:2181
# yes, if only secureClientPort is configured {{peer.cnxnFactory}} will be null.
I am returning blank string in this case.
{color:blue}I don't think we should show secure client address in ClientAddress property.
There should be different jmx property  SecureClientAddress. What you say? Can I raise septate ticket to add SecureClientAddress and SecureClientPort jmx property?{color}, bq. Can I raise separate ticket to add SecureClientAddress and SecureClientPort jmx property?
Yeah, Agreed for {{SecureClientPort}} jmx property. I think address is not required as it will be same, right?, Hi [~arshad.mohammad], very nice patch, again. :) My only suggestion would be to use a more meaningful name for unit tests. 

, Oops, hit enter before finishing the text. So, {{testClientAddress}} is a very generic name, probably very similar to other similar/equal names around. I think a more appropriate test name would be {{testClientAddressShouldNotBeNull}} or something alike, up to you. :) I am fond of Uncle Bob Martin recommendation that test methods should be named the more clearly as possible and the places I worked enforced this too. ;) You can see some traditional recommendations here: https://dzone.com/articles/7-popular-unit-test-naming , SecureClientAddress also required as it is configurable and can be different from ClientAddress.  Created Jira ZOOKEEPER-2300, Thanks [~eribeiro] for your review comments.
#  In the test case I am testing the complete ClientAddress feature, all three scenarios are tested. If I go for the naming convention you are suggesting I have to split the test case into three which will take more when executed.
#  In my previous patch [~rgs] suggested to have smaller test case name.  [Comment | https://issues.apache.org/jira/browse/ZOOKEEPER-2269?focusedCommentId=14738160&page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel#comment-14738160]

So not changing the test case name., Some test cases were failed because there is another problem in the code. Created another jira ZOOKEEPER-2301, If ZOOKEEPER-2299 is commited before ZOOKEEPER-2301, two test cases in {{org.apache.zookeeper.test.ReconfigTest}} will fail, lgtm, +1. Please resubmit so CI can run once ZOOKEEPER-2301 is applied. Thanks!, Applied:

https://github.com/apache/zookeeper/commit/8df65c700673cff3e78b58b27efe1a618a6e8732
https://github.com/apache/zookeeper/commit/addbf268630e48a1f29816eebe3e4adee813f225

Thanks [~arshad.mohammad]!, SUCCESS: Integrated in ZooKeeper-trunk #2822 (See [https://builds.apache.org/job/ZooKeeper-trunk/2822/])
ZOOKEEPER-2299: NullPointerException in LocalPeerBean for ClientAddress
(Arshad Mohammad via rgs) (rgs: [http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1718253])
* trunk/CHANGES.txt
* trunk/src/java/main/org/apache/zookeeper/server/quorum/LocalPeerBean.java
* trunk/src/java/test/org/apache/zookeeper/server/quorum/LocalPeerBeanTest.java
]