[Mahadev suggested this for item 2 from the description:

>   I think we could some more standard tools like netstat to getthe process
> using that port and try killing it. This would be less error prone nd more
> reliable than other tools.
, What's the 'correct' way to stop zookeeper server process? Right now the c unit test does kill -9. Is there a way to do clean shutdown?

--Michi, This patch is for branch-3.3.

I changed 2 things.

1. Instead of using a file to keep track of pid, use lsof to check if a process is using port 22181.
2. Fixed invalid return code checking. This was causing the unit test to go into a loop for 2 minutes in certain cases. 

--Michi, One more change. I like to change the sleep time to from 5 seconds 1 second. Most of the time, 1 second is enough for the server to start up (at least on my box). 

--Michi, The only comment I have is  that these scripts might not work on cygwin.  Let me try and check how lsof works on cygwin windows., +1 this looks good to me. did you try it on cygwin?, Cygwin doesn't have lsof. 

Most of the time, 'zombie' process is caused by the invalid return code checking (it keeps starting the server process in a loop for 2 minutes). I think it's ok to use pid file to keep track of the server process. 

I'll submit a new patch.

--Michi, Reverted back to use pid file instead of lsof. , thsi does fix the if problem in the script (which took me sometime to realise was backwards :) ). Michi, can you also add the lsof check as follows:

{code}
if which lsof > /dev/null 2>&1; then "run the command to kill the process using lsof"; else "we dont do anything"; fi
{code}

Note that this is in addition to using pid checks. We can do the following -

on stop server:

- kill using pid file first
- kill using lsof, if any such process if present.
, Cancelling patch - needs to be updated for Mahadev's most recent comment., Uses which to check if lsof command is present. If it is, use it to see if there is a process listening on port 22181 and kill it. 

--Michi, +1, committed to trunk/branch33. Thanks Michi!, Integrated in ZooKeeper-trunk #973 (See [https://hudson.apache.org/hudson/job/ZooKeeper-trunk/973/])
    ZOOKEEPER-820. update c unit tests to ensure "zombie" java server processes dont cause failure
]