[trivial fix, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12598448/zk-symlinked-scripts.patch
  against trunk revision 1503101.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1541//console

This message is automatically generated., patch aganst trunk, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12598480/zk-symlinked-scripts-trunk.patch
  against trunk revision 1503101.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1542//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1542//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1542//console

This message is automatically generated., Is this a dup (or vice versa) of ZOOKEEPER-1737 ?, Yes, it's the same issue., Given ZOOKEEPER-1737 was created/patched prior to this issue, Max would you mind reviewing 1737 and see if it meets your needs? If not I'd suggest updating that patch (on 1737). If you're fine with 1737 I'll close this as a dup. LMK., ZOOKEEPER-1737 is ok for me. It's also more general, handling chain of symlinks correctly. So, it's ok to close this issue., closing as dup of ZOOKEEPER-1737]