[Seems like a reasonable thing to fix if it is causing you issues, please submit a patch!, Hi [~fournc] and [~karold], I am submitting a trivial patch to address this issue. I wish I had some embed unit tests, but it doesn't have one. :( See if this solves the issue, please. I tested it here on latest trunk and it worked., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12752757/ZOOKEEPER-2142
  against trunk revision 1698058.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 2.0.3) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2846//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2846//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2846//console

This message is automatically generated., Hi [~fournc], this patch doesn't have a test because the change was trivial. Do you think it is worth to add one? Please, let me know if it needs some change to be committed.

Cheers!, I don't think this patch is right, you need to implement a getName call just like in FollowerBean and LeaderBean. Check those classes and just follow what is in there., Got it, thanks! Gonna do that., Hey, [~fpj], I am uploading a new version of the patch. **Please, let me know if it is okay.** I didn't include any test because the patch is trivial (even more so after my undo my cumbersome changes). Thanks., Sorry I'm jumping in late. The original patch ZOOKEEPER-2142 looks fine to me because it adds a new constructor to pass the name as the parameter, so classes that extend from ZooKeeperServerBean shouldn't need to implement getName() method. I'd refactor other classes (LeaderBean, FollowerBean) to use the new constructor and pass their names as well ("Leader" and "Follower") and get rid of getName() method from these classes., I'd rather do the refactoring in a different jira, this issue is only about the object name for observers., Ok fair enough. Then I'm +1 on ZOOKEEPER-2142.2.patch. I'll check this in if you are ok with this patch as well., +1 for the latest patch... but I just realized that there is another issue, ObserverBean seems to be in the wrong package, it should be under server.quorum rather than just server, right?

[~eribeiro] feel free to create another jira for the refactoring if you are interested in doing it. And if you do, please make sure to move the bean to the right package., trunk: http://svn.apache.org/viewvc?view=revision&revision=1711694
branch-3.5: http://svn.apache.org/viewvc?view=revision&revision=1711695
branch-3.4: http://svn.apache.org/viewvc?view=revision&revision=1711696, FAILURE: Integrated in ZooKeeper-trunk #2805 (See [https://builds.apache.org/job/ZooKeeper-trunk/2805/])
ZOOKEEPER-2142: JMX ObjectName is incorrect for observers (Edward Ribeiro via michim) (michim: [http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1711694])
* trunk/CHANGES.txt
* trunk/src/java/main/org/apache/zookeeper/server/ObserverBean.java
, Hi [~michim] and [~fpj], thanks a lot for the feedback, highly appreciated. I have just created ZOOKEEPER-2313 and assigned myself to it so that I can address your refactoring recommendations, that I promptly agree with.]