[Hi

Is anyone looking into this issue?
In our env, we do not want to depend on dns.  So it is better if we have an official fix for it.  Thanks.

Liping, We should use a typical IPv6 address/port configuration like 

server.1=[1234::f4b5:3fff:fe0f:e96e]:2888:3888 

in the case of literal IPv6 addresses. I think this would be more handy than splitting the configuration in several different properties (host/port) like in the client case.

From my point of view this issue is not a IPv6 show stopper, because especially in the IPv6 case there are hostnames defined in DNS of /etc/hosts. If we use the hostnames the configuration is no problem., I've attached a patch to accept that syntax. Before splitting by {{:}} it attempts to extract a square-bracket-delimited component at the start of the string, and then splits the remainder as before.

Tests for parsing are included., Can we fix it in ZK 3.5.0?, [~boying]: sure, mind rebasing the patch on top of master?, lgtm, though I did wish we had Guava so we didnt' have to write our own validators :-)

[~cnauroth], [~hdeng]: can I get an extra +1 and then I'll merge (once it's rebased). Thanks!, +1
Thanks Raul for raising it up. I did remember there is some IPV6 issues., The logic looks good, but the rebase will be significant, because ZOOKEEPER-2171 removed the {{HostNameUtils}} class.

I suggest that we wait for ZOOKEEPER-1506 to get finalized and committed before we rebase and commit this.  I think that will minimize churn on resolving merge conflicts.  That will also give us a chance to make sure this patch remains consistent with the final version of the ZOOKEEPER-1506 patch.

I'd be happy to help with a review on the final rebased patch.  Thawan, thank you for contributing!, You are right [~cnauroth], thanks!, Thanks a lot !
Can we get it fixed in 3.5.0 release? , I can help to test the patch., bq. Can we get it fixed in 3.5.0 release?

Yes, I think so.  We just need the patch rebased against the current version of the codebase.

I just realized the original patch was contributed by Joseph Walton, so I've updated the assignee.  [~joe@kafsemo.org], are you able to create another version of this patch that applies to the current trunk branch?

bq. I can help to test the patch.

[~boying], thank you for the offer to help test!, Please let me know when the patch is ready for test. I can test it on ZK 3.5.0, I've attached the previous patch rebased against r1702378., Thank you, [~joe@kafsemo.org]!  I'm submitting this for our pre-commit test run.  FYI, in the future, you can do this by clicking the Submit Patch button., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12756254/ZOOKEEPER-1460-accept-square-bracket-delimited-IPv6-literals.2.diff
  against trunk revision 1702378.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2879//console

This message is automatically generated., I'm attaching the same patch, reformatted with {{git diff --no-prefix}} to satisfy pre-commit., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12756346/ZOOKEEPER-1460.003.patch
  against trunk revision 1702378.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 2.0.3) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2880//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2880//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2880//console

This message is automatically generated., The patch 1460.003 can't be applied to the 3.5.0-alpha codebase directly.
So I made a patch for 3.5.0-alpha with some minor changes.

I've tested the patch in my IPv6 environment and it works well., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12756423/ZOOKEEPER-1460-for-3.5.0.patch
  against trunk revision 1702378.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2881//console

This message is automatically generated., Is there anything else I can do to get it fixed in ZK 3.5.0 ?, bq. Is there anything else I can do to get it fixed in ZK 3.5.0 ?

[~boying], you've been very helpful already, and thank you!

At this point, the plan is to wait for ZOOKEEPER-1506 to finish and get committed first.  Depending on the final outcome of the ZOOKEEPER-1506 patch, we might need to rebase this once again and do another pre-commit test run.

After that, if you want to help more, then I suggest watching the dev@zookeeper.apache.org list for an announcement of the next 3.5.x release candidate.  When that's published, you could download it, repeat your testing with the release candidate, and then reply to dev@zookeeper.apache.org with a +1 (or -1 if you found something wrong).  That would give us confidence that the fix made it into the release candidate correctly., OK, got it. I want ot get this fixed in ZK 3.5.0, so can we add the '3.5.0' to the 'Fix Version' list of ZOOKEEPER-1506?, bq. I want to get this fixed in ZK 3.5.0, so can we add the '3.5.0' to the 'Fix Version' list of ZOOKEEPER-1506?

Just to clarify, the next release in the 3.5 line will be 3.5.2.  I don't recall if the plan is for that one to still be labeled alpha or beta, but the number is going to be 3.5.2.

I've updated fix version on this issue to show 3.5.2 and 3.6.0 (trunk)., I don't think we have agreed on removing the alpha label for the next release, but it sounds reasonable if the community feels it is stable enough for regular production use.
, Since the ZOOKEEPER-1506 has been checked in, can we check in the patch now?, I am +1 for patch v003.  I plan to commit this to trunk and branch-3.5.  I'll wait until Friday, 10/16, before committing, just in case any other committers want to give it one last look., I have committed this to trunk and branch-3.5.

[~joe@kafsemo.org], thank you for contributing the patch.

Thank you also to everyone who helped with code review and testing: [~boying], [~rgs] and [~hdeng]., FAILURE: Integrated in ZooKeeper-trunk #2803 (See [https://builds.apache.org/job/ZooKeeper-trunk/2803/])
ZOOKEEPER-1460: IPv6 literal address not supported for quorum members (Joseph Walton via cnauroth) (cnauroth: [http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1709293])
* trunk/CHANGES.txt
* trunk/src/java/main/org/apache/zookeeper/server/quorum/QuorumPeer.java
* trunk/src/java/test/org/apache/zookeeper/server/quorum/QuorumServerTest.java
, Thanks all for taking care this. I think we could consider this fix to branch-3.4 as well.
cc: [~cnauroth], [~joe@kafsemo.org]

Please see branch-3.4 logic:
[QuorumPeerConfig.java#L182|https://github.com/apache/zookeeper/blob/branch-3.4/src/java/main/org/apache/zookeeper/server/quorum/QuorumPeerConfig.java#L182], [QuorumPeerConfig.java#L215|https://github.com/apache/zookeeper/blob/branch-3.4/src/java/main/org/apache/zookeeper/server/quorum/QuorumPeerConfig.java#L215]
{code}
value.split(":");
{code}, Hi [~rakeshr].  Were you interested in getting this into the soon-to-come 3.4.7 release?  I believe [~rgs] plans to get rolling on that soon.  I'm not sure I'll have time myself to rebase this patch for branch-3.4 soon enough.  If someone else would like to do so, then I'd be happy to squeeze in a code review though., OK, it need not be in 3.4.7 release until someone wants this urgently. I'm just reopening this issue to back port the changes to branch-3.4, otw we may forget about this task (tracking purpose)., Why did [~cnauroth] comment out those following code in line 821?
```java
       // if (!getView().containsKey(myid)) {
      //      throw new RuntimeException("My id " + myid + " not in the peer list");
        //}
```
https://github.com/apache/zookeeper/blob/trunk/src/java/main/org/apache/zookeeper/server/quorum/QuorumPeer.java, Hello [~benedict jin].  That code was not commented out as part of this patch.  Instead, {{git blame}} traces that to ZOOKEEPER-107 (dynamic reconfiguration)., I see, [ZOOKEEPER-107] changed that for adding/removing hosts to/from the server cluster dynamically. Thank you, my fault., [~rgs] and [~rakeshr], since we've shipped 3.4.7, do you mind if I commit this to branch-3.4 now?, [~cnauroth]: please go ahead - thanks!, I just realized that we don't actually have a patch applicable to branch-3.4 ready to go, so I can't proceed with the commit immediately.  If someone wants to rebase to branch-3.4, then I'll review and commit it.  Otherwise, I'll put this into my queue and rebase later when I get some free time., [~cnauroth]: lets target this in 3.4.9 - thanks!, Super naive port of the other IPv6 patch to branch-3.4, Very naive. Didn't update tests, since I was afraid of breaking anything on folks that didn't have v6 loopbacks. Though, I did push it to a test cluster that happily ate the config and joined the ensemble.

Also happy to go back and help with updating tests, etc (provided somebody is willing to hold my hand - I'm new to the zookeeper game), -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12796945/ZOOKEEPER-1460-branch3.4.patch
  against trunk revision 1736259.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3136//console

This message is automatically generated., Updated the patch so that it will apply cleanly against branch 3.4., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12802534/ZOOKEEPER-1460-branch3.4.patch
  against trunk revision 1742472.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3158//console

This message is automatically generated., So, when I did this it broke InitialMessages in QuorumCnxManager (line 196ish)

I have a bigger patch that uses formatted/bracketed IPv6 in the identifiers being sent around, happy to post that if that's a reasonable way to solve the issue., If we don't finalize the patch for branch-3.4 by Thursday, 6/23, 12 noon PST, then I'm going to resolve this issue as fixed for the impending 3.5.2 release.  Then, I'll file a separate issue to track a backport targeted to release 3.4.9., I am resolving this issue as fixed for the 3.5.2 release.  I filed ZOOKEEPER-2452 as a separate issue to track back-porting to branch-3.4.  If anyone is interested in watching progress or possibly contributing a branch-3.4 patch, then please watch that issue.

[~joe@kafsemo.org], thank you for contributing the patch.  Thank you also to all of the contributors who helped with code review and testing.]