[Interesting. I can't think of why this would happen.
Notice that the packets have the same zxid. It looks like a retransmission., Taking a closer look, it only happens when there are observers. , For observers there is the INFORMANDACTIVATE message.
But neither message should be send unless you're actually doing reconfigurations... (or did previously and now its send during sync perhaps)
, Confirmed, messages are only going to observers:

{noformat}
$ for host in $(grep commitandactivate log -B 4  | grep dst | cut -d= -f2 | cut -d: -f1 | sort | uniq) ; do echo mntr | nc $host 2181 | grep state ; done
zk_server_state observer
zk_server_state observer
..
zk_server_state observer
zk_server_state observer
zk_server_state observer
{noformat}

Oh wait, isn't this because of https://issues.apache.org/jira/browse/ZOOKEEPER-1784 [~shralex]?

, wow, we didn't commit that patch yet ??? need to do this ASAP. I'll try to find time.

the problem may indeed be in the sync phase, otherwise unclear why commit and activate is sent to observers at all - 
its being sent by the leader using this logic:

        synchronized (forwardingFollowers) {
            for (LearnerHandler f : forwardingFollowers) {
                f.queuePacket(qp);
            }
        }

so shouldn't get to observers


can you  try it with the patch and see if it solves the issue ?
, I take that back, ZOOKEEPER-1784 wouldn't cause this. We still need to fix it tho ;-), yup, i'll give a try! and yes, we should merge that! Thanks Alex! :D, Oops, this bug isn't so — I had an error in zab-dump which was printing the wrong message types! So all is good, sorry for the false alarm [~shralex]!

Here's a snippet of traffic with the bug fixed in zab-dump:

{noformat}
$ grep type log  | sort | uniq -c                                                                                                     
   2793      type=ack,
   3860      type=commit,
  27087      type=inform,
   3584      type=ping,
   3648      type=proposal,
    769      type=request,
   2826      type=revalidate,
{noformat}

Which is more or less what we'd expect — no non-expected messages!]