[Authentication is for establishing identity for the purpose of testing access to znodes protected by 'SASL:*' ACLs. Connections and requests are still allowed if authentication fails, the effect will be access to those ACLs will be denied to the unauthenticated or anonymous user., [~apurtell], I'm curious about if there is now a way to prevent anonymous users to connect to zk. Seems like a serious security issue to me., [~thms.hmm] It is possible to enforce the security such that anonymous users are rejected from their connection requests. I have a pull request for this https://github.com/apache/zookeeper/pull/118. There are actually quite a few JIRA that's related to your concern: ZOOKEEPER-1634, ZOOKEEPER-2462, ZOOKEEPER-2526, ZOOKEEPER-2346, Because ZK authentication is pluggable (therefore, SASL is only one possible option out of several) and auth method is specified per ACL, it is strictly speaking incorrect to reject connections that don't auth with SASL, because they might be able to auth with another method to access znodes that do not have "sasl" auth specified as auth method. This was the thinking when SASL integration for ZK was developed. Otherwise we would have wrapped the whole connection with SASL, not tunneled SASL auth inside the ZK protocol. 

So this not a "security issue" as such - it is a deliberate design choice. 

On the other hand, providing some additional configuration toggle to enforce SASL authentication exclusively can be done. If the ZK devs want to commit it. TLS authentication doesn't work this way. When you use TLS if you can't auth at connection setup it doesn't matter what auth methods are specified by ACLs. In this sense, security design in ZK is inconsistent. , Thanks for pointing this out to me. I'll watch the tickets., I am also curious to know why this is not an issue /defect. I am trying to protect zookeeper in kubernetes cluster from other users to access zookeeper. I tried to set up SASL  in zookeeper and set a user in /broker node in zookeeper so that Kafka reject the connections to zookeeper if they dont specify the right user. However I observed, Kafka still makes connection successfully if they dont have "client" configuration set up. This means anonymous connection is still allowed to connect and use the zookeeper. did I miss some thing to learn why this is not a bug?]