[Niraj, do you want to generate a patch file so that we can review?, Patch for documentation attached., Thanks, Niraj. A couple of things:

# Please name the patch file "ZOOKEEPER-1786.patch".
# Please base it on the project root, not on trunk. The source file paths should start with src/....
# I think that with your patch we are covering:

{noformat}
c >= '\ud800' && c <= ''
                    || c >= '￰' && c <= '￿'
{noformat}

but not:

{noformat}
c > '\u0000' && c <= '\u001f'
                    || c >= '\u007f' && c <= '\u009F'
{noformat}

Don't we need to cover those too? Am I missing anything?, {quote}
Please name the patch file "ZOOKEEPER-1786.patch".
{quote}

Will do.

{quote}
Please base it on the project root, not on trunk. The source file paths should start with src/....
{quote}

Assuming you meant the inverse but yes, sure.

{quote}
I think that with your patch we are covering:
...
{quote}

The other exceptions you mentioned are already covered in the documentation but just don't show up in the diff. Please see  https://zookeeper.apache.org/doc/trunk/zookeeperProgrammers.html#ch_zkDataModel for the exceptions you referred to. , bq. Assuming you meant the inverse but yes, sure.

We are probably not using the same terminology here. For me, if the project root is "/", then "/src" is the source folder. I think you got it, but if you didn't, either ask or check other patches in different jiras.

bq. The other exceptions you mentioned are already covered in the documentation but just don't show up in the diff.

Ok, thanks., +1, thanks, [~ntolia]., Trunk Committed revision 1542355., B3.4 Committed revision 1542356., SUCCESS: Integrated in ZooKeeper-trunk #2121 (See [https://builds.apache.org/job/ZooKeeper-trunk/2121/])
ZOOKEEPER-1786. ZooKeeper data model documentation is incorrect (Niraj Tolia via fpj) (fpj: http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1542355)
* /zookeeper/trunk/CHANGES.txt
* /zookeeper/trunk/src/docs/src/documentation/content/xdocs/zookeeperProgrammers.xml
, Closing issues after releasing 3.4.6.]