[rep2 is another repository with the same issue, Seeing similar failure, this time in InvalidSnapshotTest
invalid1.tar.gz for log/datadir, thanks for uploading the logs pat.. i think the problem is the following - 

- the snapshot is not valid (which is be possible since we use a different thread and we might shutdown the server before we finish snapshotting)
- the snapshot is thought to be valid since it ends with "/" (which is accidental). the current method only checks for a "/" at the end of the snapshot to think this is valid.
- the read method throws since it is actually invalid snapshot 

All we need to do is read the last snapshot and keep doing it until we can successfulyl read the last snapshot (catching IOException in deserializing snapshots and trying reading the older snapshot until we succeed, if we run out of snapshots we can declare error). I iwll post a patch for this as soon as I can. We can check in the data files as a part of the test for testing purpose., this patch should fix the issue. 

- the patch keeps trying (only 100 retries - that should be enough) to read a snapshot unless it fines a valid one that has right crc's and a / at the end

 I will add a test with the logs pat provided to me in rec.tar.gz. 
Pat, can you verify that the patch works with the other logs as well that you uploaded? you can test it by just trying to bring up a server with those logs. It should come up with this patch and fail to come up without the patch., this patch adds a test.
also for the test we have to check in the data files that pat posted so that we can run the test with the data file. I am uploading the datafiles as tar.gz. 
You will need to untar the tar.gz in src/java/test/data and then svn add src/java/test/data/invalidsnap. the patch will fail the automated testing just becasue the patch cannot have the binary files., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12405473/invalidsnap.tar.gz
  against trunk revision 764673.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-vesta.apache.org/31/console

This message is automatically generated., You need try/finally around the operations that might throw exceptions while processing the stream(s). The finally needs to close the stream. This will handle the case where an exception is thrown while processing the stream - otw resources may be leaked.

You might want to run with something like Coverity prevent - it's good at flagging this sort of thing.

(I realize the old code didn't handle this properly either, but as you're updating the code you should fix it)

, good catch pat... thanks for the review.. here's an updated patch., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12405715/ZOOKEEPER-367.patch
  against trunk revision 765797.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 10 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-vesta.apache.org/38/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-vesta.apache.org/38/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-vesta.apache.org/38/console

This message is automatically generated., +1, looks good
Committed revision 766107, Integrated in ZooKeeper-trunk #284 (See [http://hudson.zones.apache.org/hudson/job/ZooKeeper-trunk/284/])
    . RecoveryTest failure - 'unreasonable length' IOException
]