[Reassigning versions to 3.4.0 , since a workaround is available, which is basically to paste another dependency of the log4j exclusion in the pom along with zookeeper. Not pleasant, but not urgent for the next minor release. 

It seems an ivy-mvn conversion is happening in zk. Need to work on the same to provide a patch to incorporate this later. , Moving this out to 3.5.0. 

Kay,
 Will you be working on a patch?, updating the log4j dependency to 1.2.16 will fix this,

https://issues.apache.org/bugzilla/show_bug.cgi?id=43304, Thanks, Sean. True - That works. 

Mahadev,

  This is basically changing the version of log4j alone, to 1.2.16 . Let me know if you want me to create a patch though. , Kay,
 That would be great. Even a log4j upgrade needs a patch. :), Patch against the current 3.4 branch that updates the log4j version to 1.2.16.

Let me know if you'd like this as an additional attachement to ZOOKEEPER-721 instead., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12547293/ZOOKEEPER-753.patch
  against trunk revision 1391526.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1203//console

This message is automatically generated., Updated patch. I missed a part of the change to build.xml made for ZOOKEEPER-899 that altered how ivy handled dependency retrievals.

I'm not sure why, but removing the hardcoded type=jar made the difference in log4j getting included in the build/lib dir.

No new tests, since this is purely a library dependency change.

I'm not sure how to let the QA bot know that this should be against the 3.4 branch, advice welcome., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12547391/ZOOKEEPER-753.patch
  against trunk revision 1391526.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1204//console

This message is automatically generated., Just an additional note why this patch would be nice: Having log4j 1.2.15 as a dependency causes failures on Maven 3 because log4j has a {{legacy}} repository in its pom which isn't supported anymore in Maven 3., Committed to 3.4.6 (trunk is already on 1.2.16), thanks Sean., Closing issues after releasing 3.4.6.]