[[~oded@coralogix.com] did you get this resolved? We ran into this issue too, and there was a zookeeper IP in our ensemble that was down. We removed the downed zookeeper IP from the ensemble, did a rolling restart of the zookeeper cluster, and it seems to have fixed it so far... 

 

Additionally, see https://issues.apache.org/jira/browse/KAFKA-5642 as this was related in our case., Hi,

We did the same but the issue returned again. It happens to us from time to
time, and we handle it manually.
The main problem is that it caused kafka for "split brain" where the
cluster believes it has more then one controller.



, [~oded@coralogix.com] yes multiple brokers think they are the controller.

What version of Kafka are you using? We found this issue in 0.10.2.0, and upgrading to 1.1.1 seems to have fixed the problem. It is stable now, but not sure if it will happen again., We are running with kafka 1.1.0


, What is the issue related to ZooKeeper in this case? When a learner thread dies the leader should be able to start another learner thread once the follower / observer corresponding to the died learner thread comes back. , can you give a bit more detail as to what happened? there were 3 servers. it sounds like one of the followers failed right? the leader should keep working with the other follower alive. did the leader actually shutdown as well?, Hope it will help , before we were getting the split brain, we saw this log:

kafka-cluster-zookeeper-1 zookeeper 2018-08-22 20:04:46,623 [myid:2] - INFO  [ProcessThread(sid:2 cport:-1)::PrepRequestProcessor@648] - Got user-level KeeperException when processing sessionid:0x26561ad5c49000f type:ping cxid:0xfffffffffffffffe zxid:0xfffffffffffffffe txntype:unknown reqpath:n/a Error Path:null Error:KeeperErrorCode = Session moved
kafka-cluster-zookeeper-1 zookeeper 2018-08-22 20:05:50,885 [myid:2] - INFO  [ProcessThread(sid:2 cport:-1)::PrepRequestProcessor@648] - Got user-level KeeperException when processing sessionid:0x16561ad5c490007 type:delete cxid:0xabc zxid:0x100000cbe txntype:-1 reqpath:n/a Error Path:/config/changes/config_change_0000000001 Error:KeeperErrorCode = NoNode for /config/changes/config_change_0000000001

 

 ]