[Looks to me like the issue is in the while loop:

            goToNextLog();
            if (!next())
                return;
            while (hdr.getZxid() < zxid) {
                next();  // ISSUE IS HERE
            }

we aren't checking the next return value, we will call next again, which will fail if next previously returned false (ia will not be null but inputstream might be)

The question in my mind is what Thomas asked - why is hdr zxid < zxid and next returning false? Is this ok, or signalling a problem elsewhere?
, i found the problem. The problem occurs when the snapshots are well ahead of the logs. That would be the case when the server is brought up and down and there are not trasactions on it. So there are no new logs to be applied to the snapshot. This is due to the bug that
{noformat}
while (hdr.getZxid() < zxid) {
               next()) 
{noformat}
does not check the value of next() 

and also 

next() itself does not keep ia and inputstream syncrhonous.

{noformat}
  } catch (EOFException e) {
                LOG.info("EOF exception ", e);
                inputStream.close();
                inputStream = null;
                // thsi means that the file has ended 
                // we shoud go to the next file
{noformat}

should be 

{noformat}
  } catch (EOFException e) {
                LOG.info("EOF exception ", e);
                inputStream.close();
                inputStream = null;
                ia = null;
                // thsi means that the file has ended 
                // we shoud go to the next file
{noformat}

, ill file a patch shortly with a testcase.... thanks thomas, also  this does not seem to happen in a quorum... i think i know the reason why ... but will update the jira with my findings... , can you try this patch out thomas?
adding a test might be a little hard since the situation arises after switching from quorum to standalone. let me try and see if I can reproduce this as a junit test... , Thank you. Post patch, I don't see the exceptions. To clear up confusion on my part, when you say "the situation arises after switching from quorum to standalone", you are referring to the single server that is stopped and started, and not the ensemble as a whole? I believe that throughout the test, I was maintaining quorum by having at least 2 out of 3 servers running and communicating to each other., sorry i must have been confused. I though the servers were started as quorum and then one of them pulled out of quorum and started as a standalone server. This will actually create the problem quote easily. The 3 quorum servers and killing one at a time is another way to do it (now that i realize it)., this patch adds a test. IT was difficult to create a test that can recreate the problem. The attaches test sometimes fails without the patch but passes the tests with the patch., +1 - looks good, tests pass.

Committed revision 725454.
, Integrated in ZooKeeper-trunk #169 (See [http://hudson.zones.apache.org/hudson/job/ZooKeeper-trunk/169/])
    . NullPointerException stopping and starting Zookeeper servers
]