[Should I file a patch for src/c/tests/TestZookeeperInit.cc?
I would like to introduce tests like testEmptyAddressString(), testOneSpaceAddressString(), ..., Yes, please feel free to submit patches! 
http://wiki.apache.org/hadoop/ZooKeeper/HowToContribute

In general if you are proposing new features it's a good idea to open a JIRA with a proposal to see if there is any feedback/suggestions. Otw, if it's fixing an obvious bug, doc changes, new tests, etc... feel free to submit a patch., Attachment ZOOKEEPER-182-UnitTests-Init-AddressString.patch contains new tests for zookeeper_init() function:
testNullAddressString, testEmptyAddressString, testOneSpaceAddressString, testTwoSpacesAddressString
, Attachment ZOOKEEPER-182.patch: if we check the input string for "", we may check for NULL first - there is no any drawback.
I think it's good idea to check for NULL and exit with an appropriate error than do a coredump.
But in any case we have to check the input string before pass it to strdup()., Looks good, tests and everything. ;-)

Just wanted to point out that when you believe that your patch is ready to be committed, select the "Submit Patch" link on the issue's Jira. This lets the committers know that you feel your patch is ready, should get a final review and be committed to svn.

See more detail in the "contributing your work" section of the following:
http://wiki.apache.org/hadoop/ZooKeeper/HowToContribute, Excuse me. Next time I'll pay attention., No worries. Looked like you were ready but we have that extra step in case ppl want to have review of preliminary/draft work before actually ready for commit. Also makes it easier for us committers to know what patches are pending.

Thanks for the submission(s)!, Committed revision 704657., Integrated in ZooKeeper-trunk #114 (See [http://hudson.zones.apache.org/hudson/job/ZooKeeper-trunk/114/])
    .  zookeeper_init accepts empty host-port string and returns valid pointer to zhandle_t
, Thanks for your constructive suggestions about the workflow as well.
I find your patient way of explanations logical and very useful. I mean it., 3.0.0 has been released, closing issues.]