[I'm guessing it's the recent pkging changes - Eric would you mind triaging?, System related script has moved to sbin.  In ZOOKEEPER-999, we make separation between system scripts and user scripts.  zkServer.sh is one of the script that moved to sbin.  zkEnv.sh is moved to lib exec.  See HADOOP-6255 on the directory layout change proposal., The original intent was to have those scripts for developers and for users of the tar archive, that's why they are in bin. Using them used for other things, like packaging, is fine, but now things are a bit confused. For example the docs say bin/zkServer.sh, not sbin. It's nice that the original docs and file locations matched regardless of checking out the source or using the release tarball. Really bin vs sbin vs libexec is a packaging specific detail (one that may be different depending on the packaging type), one I would not like to enforce on the release artifact. Also, we really need to fix how releases are packaged (I've done this as part of the maven changes). We currently have a single tar release archive which contains both the source and the generated binaries. Really we should have a source artifact and separate binary artifacts (for example the way avro does things), where the binary artifacts could be tar/jars/rpm/deb/etc.., Does maven change come as part of 3.4.0 or 3.5.0?  If maven comes in 3.4.0, then I would recommend to close this as "later".  If maven comes in 3.5.0, then I would recommend to have multiple build targets in build.xml for separation of source tarball and binary artifacts and change the summary of this jira to "separation of source tarball layout and binary artifacts"., Regardless of maven, IMO we should not be mixing "release artifact" semantics with "packaging" semantics. I'd like to see our release artifact be pkging agnostic, and have the pkging code (regardless if it's our own or someone elses (ie Thomas's Debian, CDH, Bigtop, etc...) pull from the source (release artifact) locations.

Can you create a patch for this in 3.4.0?, bq. Can you create a patch for this in 3.4.0?

if not perhaps we should back the packaging changes out of 3.4.0 and re-introduce in 3.4.1 or 3.5.0., bq. Can you create a patch for this in 3.4.0?

I will target for 3.4.0., * Restore "package" to release tarball
* Added "bin-package" target for making binary package layout.
* Modified zkEnv.sh to detect the running layout., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12497053/ZOOKEEPER-1190.patch
  against trunk revision 1177432.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/597//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/597//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/597//console

This message is automatically generated., I committed this to 3.4 and then while testing trunk I noticed that the "share" directory is still being created in the release artifact (I committed to trunk as well).

Otherwise things look good, thanks Eric!

Please add an additional patch to this JIRA to remove the generated "share" directory. Thanks.
, Updated directory structures for contrib and recipes., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12497917/ZOOKEEPER-1190-1.patch
  against trunk revision 1179371.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 10 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/606//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/606//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/606//console

This message is automatically generated., Integrated in ZooKeeper-trunk #1325 (See [https://builds.apache.org/job/ZooKeeper-trunk/1325/])
    ZOOKEEPER-1190. ant package is not including many of the bin scripts in the package (zkServer.sh for example) (Eric Yang via phunt)

phunt : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1179371
Files : 
* /zookeeper/trunk/CHANGES.txt
* /zookeeper/trunk/bin/zkEnv.sh
* /zookeeper/trunk/build.xml
, I applied and tested the patch to both 3.4 and trunk - looks good to me. Thanks Eric., Integrated in ZooKeeper-trunk #1327 (See [https://builds.apache.org/job/ZooKeeper-trunk/1327/])
    ZOOKEEPER-1190. ant package is not including many of the bin scripts in the package (zkServer.sh for example) (Eric Yang via phunt). Part 2.

phunt : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1180217
Files : 
* /zookeeper/trunk/build.xml
* /zookeeper/trunk/src/contrib/build-contrib.xml
* /zookeeper/trunk/src/recipes/build-recipes.xml
* /zookeeper/trunk/src/recipes/lock/build.xml
* /zookeeper/trunk/src/recipes/queue/build.xml
]