[Hi [~rakeshr], I have written a *quick-n-dirty* Python script to see the current status of the JIRA issues. See if it can be of any help (it requires requests and BeautifulSoup libraries). I am using Python3, but I guess it works on python2 too., I added a {{sleep}} time between url fetches so that I *hopefully* don't flood/DoS the JIRA server.

*UPDATE:* running my naive script, these are the issues it identified (had to restart at least three times because connection was reset by peer, probably some anti-DoS feature so I included a snippet to bypass the URLs already visited). 

Patch Available  https://issues.apache.org/jira/browse/ZOOKEEPER-2391
Patch Available  https://issues.apache.org/jira/browse/ZOOKEEPER-2468
Open  https://issues.apache.org/jira/browse/ZOOKEEPER-2512
Open  https://issues.apache.org/jira/browse/ZOOKEEPER-2236
Open  https://issues.apache.org/jira/browse/ZOOKEEPER-2327
Open  https://issues.apache.org/jira/browse/ZOOKEEPER-2313

*UPDATE 2:* pushed my issues (ZOOKEEPER-2512 & ZOOKEEPER-2313) to 3.5.3. ;)
, Thanks again [~eribeiro] for identifying all these. Would you be interested in preparing a patch? if yes, please assign the the issue to yourself and I will help in reviews.

Also, just a suggestion. While creating the jira, probably contributor can mark the affected version(s) and later the reviewer will mark the fix version(s). I feel that would avoid similar problems in future., Thanks for suggestion [~rakeshr]. It's highly appreciated, I will take note. Maybe we can add this piece of info to the docs at https://cwiki.apache.org/confluence/display/ZOOKEEPER/HowToContribute ?

Excuse me for the dumb question, but I thought it would be just a matter of --alter-- (removing) the fix version of the affected JIRAs. What files would this patch touch? I am okay with preparing a patch for it, btw., bq. What files would this patch touch? I am okay with preparing a patch for it, btw.

https://github.com/apache/zookeeper/blob/branch-3.4/docs/releasenotes.html, The patch is up, thanks.

*UPDATE:* Hi [~rakeshr], I have double checked the issues reported last week and my patch removed the 'Open' and 'Patch Available' ones. Feel free to apply it to branch-4.5 when you find appropriate. Cheers!, Ping [~rakeshr]. :), GitHub user eribeiro opened a pull request:

    https://github.com/apache/zookeeper/pull/124

    ZOOKEEPER-2552: Revisit release doc and remove the issues not covered by release

    

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/eribeiro/zookeeper ZOOKEEPER-2552

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/zookeeper/pull/124.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #124
    
----
commit 0fd4ca143499cafc8a7090f2dea32f733ccd08d8
Author: Edward Ribeiro <edward.ribeiro@gmail.com>
Date:   2016-12-14T19:09:52Z

    ZOOKEEPER-2552: Revisit release note doc and remove the items which are not related to the released version

----
, +1, thank you [~eribeiro], Github user eribeiro closed the pull request at:

    https://github.com/apache/zookeeper/pull/124
]