[I've updated the cppunit build.xml based on my following understanding
of how autotools works:

       1. If we have a Makefile it will handle up-to-date check and also
          regenerate the configure script if missing. (done)
       2. If we don't have a Makefile use the configure script to 
          regenerate it. (done)
       3. If we don't have a Makefile nor a configure script then it's
          last resort and run autoreconf, then configure (done)
, submitting patch - expect it to fail due to build change, no tests were modified.
, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12406976/ZOOKEEPER-376.patch
  against trunk revision 769885.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-vesta.apache.org/57/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-vesta.apache.org/57/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-vesta.apache.org/57/console

This message is automatically generated., what will happen if I change Makefile.am and the old Makefile still exist? Will it just run the old makefile or regenrate the Makefile again? Also, what happens if I change the configure.ac and the old Makefile still exists? 

These are valid concerns since the patch process will just apply the patch (incase we make a change to just Makefile.am) and since the Makefile will already exist (because of the last build process) we have to make sure that makefile is regenerated... 
, the makefile has targets/dependencies to handle changes to any of those files. if it notices a change it will
run the appropriate script to update. See the Makefile - look for makefile.am/makefile/configure.ac/etc... I tried
a number of things (like touching those files and retrying the build) and it seemed to handle it appropriately.
Give it a try yourself.

It shouldn't be an issue but I don't think you are correct re the patch process. afaik the build/patch process 
always starts "from scratch" - ie with a clean checkout into an empty directory.
, thats good.. I just committed this. thanks pat., Integrated in ZooKeeper-trunk #303 (See [http://hudson.zones.apache.org/hudson/job/ZooKeeper-trunk/303/])
    . ant test target re-compiles cppunit code every time (phunt via mahadev)
]