[jstack for Region Server, We should fix this in 3.3.2 if this still exists., might be related to HBASE-2966, upping priority, I believe I found the issue. Both this specific jira and HBASE-2966.

During session close we set the "closing" flag, then later set the ZK state to CLOSED. zk client operations track outstanding
requests to the server on the "outstandingqueue". There's a timing window where we can clear the outstanding
queue (caused by the "closing" flag being set AND an error occurs on the socket) and exit the sendthread.  Subsequent 
to this if an operation runs before the ZK state is set to CLOSED it will queue additional packets to the outstandingqueue. 
These packets will never be processed, and as a result the original operation will never complete.

in queuepacket we need to check if closing is set before queueing a packet (we currently check the state only)

I'm working on a test/fix., ZOOKEEPER-126 and ZOOKEEPER-846 both have the same cause., This patch fixes the problem by adding a check for close in queuepacket.

Note that this also moves the close=true into queuepacket (otw the closeSession would never be queued during a close.

I spend > 1 day trying to craft a test for this, unfortunately due to the small size of the timing window I wasn't able to get a test that failed with this case. However by inspection it seems to address a clear bug. All tests are passing., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12454491/ZOOKEEPER-846.patch
  against trunk revision 997192.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h7.grid.sp2.yahoo.net/111/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h7.grid.sp2.yahoo.net/111/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h7.grid.sp2.yahoo.net/111/console

This message is automatically generated., +1 looks good pat! it's nice that the checking and setting of closing is in the same routine. i agreed about skipping the test case., committed to trunk and branch33, Integrated in ZooKeeper-trunk #944 (See [https://hudson.apache.org/hudson/job/ZooKeeper-trunk/944/])
    ZOOKEEPER-846. zookeeper client doesn't shut down cleanly on the close call
]