[Here are the changes I mentioned on the dev list. It'd be great if [~phunt] could have a look here., One question I have about this is if we really need to bundle the servlet jar. Can we go without it?, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12745840/ZOOKEEPER-2235.patch
  against trunk revision 1690207.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 2.0.3) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2811//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2811//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2811//console

This message is automatically generated., Thanks for the patch Flavio. I'll review the patch this weekend., The jackson jars are not ASF, even though it's ASL (See the notice file in the jar).
javacc.jar is under the BSD 2 clause license. (http://opensource.org/licenses/bsd-license.php) so you need to include their copyright info in the notice.
Jetty is ASL but not ASF, so you need to include the copyright.
Jline is BSD. I can see the license is included, but not the copyright notice from jline.
Netty is ASL but not ASF. Their notice is in the jar (it's quite long). I'm not sure if in jar notice's count.
Slf4j is MIT license, http://www.slf4j.org/license.html

Licensing is a mess :/., Thanks, [~ikelly]. According to this page:

http://www.apache.org/dev/licensing-howto.html

I don't think we need to add anything to ASL dependencies unless there is something in the NOTICE file that we need to bubble up. Here is the relevant quote from the page: 

{quote}
BUNDLING AN APACHE-2.0-LICENSED DEPENDENCY
Assuming once again that that the bundled dependency itself contains no bundled subcomponents under other licenses and thus the ALv2 applies uniformly to all files, there is no need to modify LICENSE.

If the dependency supplies a NOTICE file, its contents must be analyzed and the relevant portions bubbled up into the top-level NOTICE file.
{quote}, My understanding of that is that the copyright notice for the main dependency, even if that is ASL, should be propogated up. Clause 4d of the ASL seems to state that also., bq. The jackson jars are not ASF, even though it's ASL (See the notice file in the jar).

All files under META-INF are there as the LICENSE text specifies, so I don't think we have to do anything for the jackson jars.

bq. javacc.jar is under the BSD 2 clause license. (http://opensource.org/licenses/bsd-license.php) so you need to include their copyright info in the notice.

According to the ASF licensing HOWTO (http://www.apache.org/dev/licensing-howto.html#permissive-deps), it is sufficient to add a pointer to to the LICENSE file, and under normal circumstances, there is no need to modify NOTICE. It also refers to the BSD without the advertising clause, and I'm not sure what this is referring to. 

bq. Jetty is ASL but not ASF, so you need to include the copyright.

By the argument above, I would think we don't need to, but the jar does not seem to include a LICENSE file, so I'd say that it is safer to include the license file. We are also covering the servlet-api transitive dependency.

Actually, the way I know that it is ALv2 is through this:

http://grepcode.com/snapshot/repo1.maven.org/maven2/org.mortbay.jetty/jetty/6.1.26

bq. Jline is BSD. I can see the license is included, but not the copyright notice from jline.

We need to add a pointer to the LICENSE file, not to the NOTICE file, assuming we understand what the advertising clause is.

bq. Netty is ASL but not ASF. Their notice is in the jar (it's quite long). I'm not sure if in jar notice's count.

The NOTICE file contains ponters to the licenses of dependencies. According to the ASF HOWTO (http://www.apache.org/dev/licensing-howto.html#deps-of-deps):

{quote}
Dependencies of dependencies (including so-called "transitive dependencies") are no different from first-order dependencies for the purposes of assembling LICENSE and NOTICE: LICENSE and NOTICE need only be modified to accommodate them if and only if their bits are bundled.
{quote}

which I believe we are either doing already or will after the changes discussed here.

bq. Slf4j is MIT license, http://www.slf4j.org/license.html

We need to add a pointer to the LICENSE file., bq. Clause 4d of the ASL seems to state that also.

I think clause 4d is just saying that you need to preserve the NOTICE file of a dependency, not that it needs to appear in the NOTICE file of the derivate work, in this case ZK., {quote}All files under META-INF are there as the LICENSE text specifies, so I don't think we have to do anything for the jackson jars. {quote}

I think we should add a pointer that the license/notice is contained in the jar.

 {quote}
[regarding javacc] According to the ASF licensing HOWTO (http://www.apache.org/dev/licensing-howto.html#permissive-deps), it is sufficient to add a pointer to to the LICENSE file, and under normal circumstances, there is no need to modify NOTICE. It also refers to the BSD without the advertising clause, and I'm not sure what this is referring to. 
{quote}
Advertising clause is in the 3 clause BSD, which basically says something like we can't use the fact that we're using javacc to advertise the project. This isn't even the cause though since it's 2 clause BSD. If we add a pointer to the license for this is should be enough. I don't think it's in the jar though.

{quote}
[re jetty] By the argument above, I would think we don't need to, but the jar does not seem to include a LICENSE file, so I'd say that it is safer to include the license file. We are also covering the servlet-api transitive dependency.

Actually, the way I know that it is ALv2 is through this:

http://grepcode.com/snapshot/repo1.maven.org/maven2/org.mortbay.jetty/jetty/6.1.26{quote}
All the jetty licensing info is at http://www.eclipse.org/jetty/licenses.php. They include a whole bunch of other stuff, which may need to be percolated up (but maybe not, jetty has a bunch of submodules, so zk may only use a pure jetty subset).

{quote}
[re jline] We need to add a pointer to the LICENSE file, not to the NOTICE file, assuming we understand what the advertising clause is. {quote}
We need to include the copyright. Clause 2 of the BSD "2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution."

{quote}
[re netty] 

The NOTICE file contains ponters to the licenses of dependencies. According to the ASF HOWTO (http://www.apache.org/dev/licensing-howto.html#deps-of-deps):
{quote}
We should point to the notice in the jar from our notice though.

{quote}
I think clause 4d is just saying that you need to preserve the NOTICE file of a dependency, not that it needs to appear in the NOTICE file of the derivate work, in this case ZK.{quote}
Should be ok, but not all the jars include the notice and license files. Also, the clause states, "Derivative Works that You distribute must include a readable copy of the attribution notices contained within such NOTICE file". I'm not sure in-jar is considered "readable".

The easiest, safest solution would be for each jar in lib/*, just add the relevant license and notice file, and then add a pointer from our notice saying that each jar has an accompanying license and notice. At least this way, all bases should be covered., bq. The easiest, safest solution would be for each jar in lib/*, just add the relevant license and notice file, and then add a pointer from our notice

I'm not comfortable doing it, the howto which I've referenced a few times says explicitly:

{quote}
Do not add anything to NOTICE which is not legally required.
{quote}

It does suggest in a few places to add a pointer to the LICENSE file, not the NOTICE file., I've attached a patch that reflects my understanding of the Apache HOWTO for assembling LICENSE and NOTICE files:

http://www.apache.org/dev/licensing-howto.html

According to this page, there is no need to change NOTICE or LICENSE for dependencies under ALv2, unless there are transitive dependencies that need to be bubbled up. The relevant quote is:

{quote}
Assuming once again that that the bundled dependency itself contains no bundled subcomponents under other licenses and thus the ALv2 applies uniformly to all files, there is no need to modify LICENSE.

If the dependency supplies a NOTICE file, its contents must be analyzed and the relevant portions bubbled up into the top-level NOTICE file.
{quote}

The latest patch does not reflect an analysis of the bundled dependencies, that's the main reason why I haven't submitted the patch to kick off the workflow.

There are 4 dependencies, which are not under ALv2, and I've included license files for them and added notes to the LICENSE file. The relevant quote from the HOWTO page is this:

{quote}
Bundling a dependency which is issued under one of the following licenses is straightforward, assuming that said license applies uniformly to all files within the dependency:

    BSD (without advertising clause)
    MIT/X11

In LICENSE, add a pointer to the dependency's license within the source tree and a short note summarizing its licensing:

This product bundles SuperWidget 1.2.3, which is available under a
"3-clause BSD" license.  For details, see deps/superwidget/.

Under normal circumstances, there is no need to modify NOTICE.
{quote}

As far as I can tell, none of the BSD dependencies has the advertising clause.

Finally, servlet-api is under the CDDL license, and according to LUCENE-4431, we need an entry added to NOTICE, which I did.

What's missing?

# It'd be great to have another pair of eyes validating my analysis.
# We need to go over NOTICE files in the dependencies and determine if there is anything that needs to bubble up to our main LICENSE/NOTICE. 

I'd really appreciate some help with these., I've copied the notice files of the dependencies in the release candidate to the text file I'm attaching. Many dependencies have no NOTICE file, is there any other file I should be looking at?

The only NOTICE that needs some investigation is the jboss one, but my sense from a first look is that there was nothing that needed to we need to propagate to the primary NOTICE file., I'll take a look tomorrow., For the missing notices, I found the following.

* javacc-5.0
https://java.net/projects/javacc/sources/svn/content/trunk/LICENSE?rev=699
Seems to be a 3 clause (i.e. it has the advertising clause). License states we need to retain the copyright notice.

* jetty-6.1.26
This version of jetty is so old the source can't even be found for it anymore. 
There's a notice for a recent version here.
http://git.eclipse.org/c/jetty/org.eclipse.jetty.project.git/tree/NOTICE.txt

* jline-2.11
https://github.com/jline/jline2/blob/jline-2.11/LICENSE.txt
Straight forward. I don't think we need to include anything for it except pointing to the license.

* slf4j-1.7.5
https://github.com/qos-ch/slf4j/blob/v_1.7.5/LICENSE.txt (no notice file)

Regarding the netty license, there's a lot of "This product optionally depends on". These can be left out, because they're unnecessary unless you are bundling binaries for these dependencies which we are not., The 3-clause BSD license doesn't actually include the advertising clause, check this out:

{quote}
Historical Background: The original license used on BSD Unix had four clauses. The advertising clause (the third of four clauses) required you to acknowledge use of U.C. Berkeley code in your advertising of any product using that code. It was officially rescinded by the Director of the Office of Technology Licensing of the University of California on July 22nd, 1999. He states that clause 3 is "hereby deleted in its entirety." The four clause license has not been approved by OSI. The license below does not contain the advertising clause.
{quote}

This is from here: http://opensource.org/licenses/BSD-3-Clause

I think you can get a source jar for this version of jetty from grepcode, but granted that it isn't authoritative. I just inspected the jar because that's what we are including.

We have a jline license file, are you suggesting any modification?

On netty, agreed about the optional dependencies. There are still three that we need to decide: Java Collections Framework (Public Domain), Base64 Encoder and Decoder (Public Domain), JZLib (BSD style license). 

, For jline, I don't think anything new is needed.

For netty, only JZLib needed I think, since the others are public domain., OK, here is an updated version, and I believe this is good to go. any concern?, This patch covers the 3.5 branch, we still need patches for trunk and the 3.4 branch, but I'm prioritizing the 3.5 branch because of the release candidate., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12747001/ZOOKEEPER-2235.patch
  against trunk revision 1690207.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 2.0.3) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2815//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2815//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2815//console

This message is automatically generated., As the patch is, the LICENSE and NOTICE talk about bundled binaries, even when the binaries aren't there (like in the maven jars). I suggest you create a separate top-level NOTICE and LICENCE that only gets included in the tar.gz  (around line 790 in build.xml)., Is this what you're talking about, ivan?, lgtm +1, Thank you Flavio and Ivan. I'll check this in and create another release candidate., I believe this patch is applicable to trunk as well, but not to the 3.4 branch. The 3.4 releases have a subset of the dependencies, I think. I'll provide a patch soon., Submitting an updated patch for the 3.5 branch and one for the 3.4 branch. For the 3.4 patch, I just removed the stuff that isn't present in the 3.4.6 release and updated versions., we haven´t been releasing binary artifacts, but I've updated the bin-package target in build.xml just in case., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12747246/ZOOKEEPER-2235-3.5.patch
  against trunk revision 1690207.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 2.0.3) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2816//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2816//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2816//console

This message is automatically generated., trunk: http://svn.apache.org/viewvc?view=revision&revision=1692989
branch-3.5: http://svn.apache.org/viewvc?view=revision&revision=1692990
branch-3.4: http://svn.apache.org/viewvc?view=revision&revision=1692991, SUCCESS: Integrated in ZooKeeper-trunk #2767 (See [https://builds.apache.org/job/ZooKeeper-trunk/2767/])
ZOOKEEPER-2235 License update (fpj via michim) (michim: http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1692989)
* /zookeeper/trunk/CHANGES.txt
* /zookeeper/trunk/build.xml
* /zookeeper/trunk/src/LICENSE.txt
* /zookeeper/trunk/src/NOTICE.txt
* /zookeeper/trunk/src/java/lib/javacc.LICENSE.txt
* /zookeeper/trunk/src/java/lib/servlet-api-2.5.LICENSE.txt
* /zookeeper/trunk/src/java/lib/slf4j-1.7.5.LICENSE.txt
, It sounds like we got the license of servlet-api wrong, and we need to fix it. It turns out that it is ALv2 rather than CDDL. The fix needs to be for 3.5 and trunk, not 3.4. Branch 3.4 is good., This is in the MANIFEST.MF file: {{Bundle-License: http://www.apache.org/licenses/LICENSE-2.0}}, I removed the corresponding line from {{src/LICENSE.txt}}. , Thanks [~fpj]. I've committed the most recent fix to trunk and 3.5.

In future I'd recommend just opening a new jira for new issues. Makes the history a bit cleaner (you can reference the original jira as part of the fix jira... etc...), FAILURE: Integrated in ZooKeeper-trunk #2910 (See [https://builds.apache.org/job/ZooKeeper-trunk/2910/])
ZOOKEEPER-2235 License update - fix servlet-api license (fpj via phunt) (phunt: [http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1742171])
* trunk/src/LICENSE.txt
]