[Dear all,
I believe I've hit this bug while running 3.4.8. I'd be willing to work on this bug, but we would need to agree on the right behavior first. Should the problematic node fail fast? If it is the leader, should it give up leadership?

Regards., Thanks [~rakeshsingh] for reporting this. I've few doubts,

bq. 4. After sometime creating further znode will not happened as complete memory is occupied
From the shared server logs, I could see a shutting down message but didn't get much details. If you can reproduce this issue then please enable DEBUG log priority and test the scenario. Also, please take thread dumps after hitting the problem. I hope these details would help us in quick debugging.
{code}
2016-09-19 22016-09-19 22:43:47,733 [myid:] - INFO  [SyncThread:0:ZooKeeperServer@498] - shutting down
{code}

bq.  Should the problematic node fail fast? If it is the leader, should it give up leadership?
Thanks [~lasaro] for the interests. Did you face this issue in quorum deployment as well. If Leader shutdown due to an error then the entire quorum will be reformed and new Leader will be elected. I'd suggest you to use latest 3.4.9 version and try re-produce the scenario as there are many bug fixes happened after 3.4.8 version., Thanks for the quick Response, Rakesh.
I had seen the problem on a quorum deployment, not standalone. Following your advice I identified bug ZOOKEEPER-2247, fixed for 3.4.9, which may in fact be what I was experiencing (disk problems, not memory). After switching to this version, I no longer see the issue, so I guess I will be updating my project now.
Best regards., [~lasaro], Good to hear that the problem is resolved.

[~rakeshsingh], ZOOKEEPER-2247 is resolved in 3.5.3 version, which is not yet released. Could you please merge this patch into your 3.5.2 code and please let me know the behavior in your env. Thanks!, it sounds like we should close this as a duplicate. right?, Sure, can close this. I'd like to see response from reporter as well. Ping [~rakeshsingh]., Please wait for the reporter to say it is ok, as my issue may have been
slightly different from his.
Regards.

Lásaro


, This issue is found in 3.5.1 version. As Rakesh R suggested, i will put the patch provided as part of ZOOKEEPER-2247 issue and can try again. But this issue is there in standalone mode., bq. But this issue is there in standalone mode.
[~rakeshsingh], mostly not an issue in standalone mode as ZK server registers [ZooKeeperServerShutdownHandler_L130|https://github.com/apache/zookeeper/blob/master/src/java/main/org/apache/zookeeper/server/ZooKeeperServerMain.java#L130] to watch server errors and take necessary actions similar to QP. Please let me know if you see any corner cases where it misses server error and not shutdown., Zookeeper is not recoverable once running system( machine on which zookeeper is running) is out of space 

---------------> after 3.5.3  zookeeper will monitor its space, if disk space usage is bigger than 95%. it will shutdown auto.]