[Logs for all the servers have been uploaded to following dropbox link:
https://dl.dropboxusercontent.com/u/36429721/zklog.tgz, In the log of server 2, something happens here:
{noformat}
2014-01-05 20:04:37,651 [myid:2] - ERROR [/169.254.1.2:3888:QuorumCnxManager$Listener@567] - As I'm leaving the listener thread, I won't be able to participate in leader election any longer: /169.254.1.2:3888
2014-01-05 20:04:37,675 [myid:2] - WARN  [WorkerSender[myid=2]:QuorumCnxManager@390] - Cannot open channel to 1 at election address /169.254.1.1:3888
java.net.NoRouteToHostException: No route to host
{noformat}
The first log message seems to indicate that server 2 won't be listening to FLE connections any more. Anybody knows if there is an automatic way to recover from this?
The "No route to host" message occurs a lot. Was there any problem with the network hardware?
, Servers are in virtual machines hence they are using vswitch for network connectivity. 
Hardware looks fine, since other network utilities scp and ssh are going fine. 
But we could not telnet zookeeper leader election port 2888 and 3888.
Quorum works fine after restarting server2, hence assuming network should not be the problem.

Please note that problem started from "2014-01-07 10:34:01,114" time on node 2.
, Hi German,

Did you get a chance to look at the log? Any idea is this a zokeeper bug or
any other configuration issue?

Thanks & Regards,
Deepak, Hello Deepak,

yes, I looked at the logs.
It could be a zookeeper bug, caused by network instability. As indicated in my previous post (see the second post in this JIRA), the code reaches a point that I haven´t seen until now in other logs, and the log indicates that the server will not be listening on FLE ports any longer. If we can verify that your problem happens when that log is produced, then we have located the bug. Maybe you could try to reproduce the situation of when the problem happened or maybe we could generate a zookeeper jar that jumps to that part of the code under some condition. If you then reach the same state as in your initial problem, we know what we have to fix. Do you think you could please do that?
As said, the root cause of the problem seems to be network instability. By looking at the logs, I can see a lot of indications of something that is not going nicely with connections, I can't tell if that is something that you can solve or not in your environment. But that doesn't change the fact that there might be something to correct in ZooKeeper.

Regards,

German., Hi German,

Unfortunately this issue occurred at customer site and hence difficult to reproduce it.
If we managed to reproduce this in the lab will update you with new set of logs.

Thanks & Regards,
Deepak
, Hi German,

I observed another instance where zookeeper cluster is falling apart.
But in this case leader election was happening in loop every couple of minutes.
While in the previous case leader election never completed for almost 3-4 days.
I am using bit older revision of zookeeper 3.5.0 (released some time in March),
any idea if there any fixes related to these bugs.

Please find more description this issue:
I have 3 node zookeeper 3.5.0.1458648 quorum on my setup.
We came across a situation where one of the zk server in the cluster went down due to bad disk.
We observed that leader election keeps running in loop (starts, completes and again starts). The loop repeats every couple of minutes. Even restarting zookeeper server on both nodes doesn't help recovering from this loop.
Network connection looks fine though, as I could telnet leader election port and ssh from one node to other.
zookeeper client on each node is using "127.0.0.1:2181" as quorum string for connecting to server, therefore if local zookeeper server is down client app is dead.

I have uploaded zookeeper.log for both nodes at following link:
https://dl.dropboxusercontent.com/u/36429721/zkSupportLog.tar.gz 

Any idea what might be wrong with the quorum? Please note that restarting  zookeeper server on both nodes doesn't help to recover from this situations.

Thanks & Regards,
Deepak, These are some crazy logs. Unfortunately for the second case I think you're too far behind master for us to do much with it.
As far as I can tell, the two remaining servers attempt to form a quorum, but every time the follower gets UPTODATE, it fails to send the ACK packet so that the leader can read it (we see a broken pipe on the follower in writePacket, and a read time out on the leader when trying to deserialize the type of the packet). Is it possible that you were running with 2 different generated protocol definitions?, All servers have identical zookeeper version running,  so most likely there shouldn't be mismatch in protocol definitions. Leader election goes though fine till sync stage so network connectivity is fine. Also verified that ssh and ping are fine among the nodes., any updates on this issue?, Hi. We, too, probably hit this issue yesterday. Suddenly, our entire Zookeeper ensemble was unresponsive and logs tells us a very similar scenario as described by Deepak. Restart of all servers did not bring the ensemble back. We had to stop all nodes, clean the data directory (we only use znodes for locks) and start them all again. Since our logs contains some keys that could be a little sensitive, I'm willing to e-mail logs by request.

We are running version 3.3.5.

While I don't have any logs, I suspect this has happened to us once a couple of weeks back, too., The description of this jira is too general and when I've seen issues like this they are typically related to network issues. My read of the discussion here is that it has been inconclusive, so there is no progress to be made. Unless more information is provided, I suggest we close this jira.

[~ztyx], I strongly suggest you upgrade to the 3.4 branch., Thank you for your reply, Flavio. FYI, we've now upgraded to the 3.4. I'll post here if we can recreate the issue., Note the original report was against 3.5.0..., A few things were fixed around the FLE , I'd definitely give release 3.5.1 a try:

http://zookeeper.apache.org/doc/r3.5.1-alpha/releasenotes.html
, Also, 3.5.1 (though alpha, but being used by many) is now available as well:

http://zookeeper.apache.org/doc/r3.5.1-alpha/releasenotes.html, Closing based on most recent comments/discussion. Please reopen/recreate if necessary. Thanks.]