[I've discovered the existing org.apache.zookeeper.common.AtomicFileOutputStream class that precisely does this job (writing a temp file, then rename it, if failure on windows then delete and rename, delete the temp file...).
There is a kind of idiomatic usage described in org.apache.zookeeper.server.quorum.QuorumPeer.writeLongToFile(...), so I've created a org.apache.zookeeper.common.AtomicFileWritingIdiom class (using AtomicFileOutputStream) in order not to miss anything from the idiom, and used it org.apache.zookeeper.server.quorum.QuorumPeerConfig.
You will find attached a patch containing this new AtomicFileWritingIdiom class, a unit test for it, and the existing modified QuorumPeerConfig class.
I've run the ZK junit test suite that did not show any induced problem.
I've also tested the ZOOKEEPER-1691 patch in addition to this one, and I got my dynamic reconfig scenario working like described in https://issues.apache.org/jira/browse/ZOOKEEPER-1691
And I finally tested the configBackwardCompatibilityMode scenario where the dynamic config file gets created and the zoo.cfg file rewritten. It works too.
There is a small bug in the current implementation of the configBackwardCompatibilityMode though: even if the clientPort= line is mentioned the the zoo.cfg file, the port is not appended at the end of the line of the dynamic config. Don't know if it "deserves" a bug though. 

Bruno., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12618808/ZOOKEEPER-1835.patch
  against trunk revision 1550213.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 4 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1837//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1837//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1837//console

This message is automatically generated., Thanks for the patch, it looks nice. I have few comments, please see. 

# It would be nice to use IOUtils.closeStream(out); instead of following in the patch
{code}
if (out != null)
	out.close();
{code}
# Apache license is missing in the files AtomicFileWritingIdiom.java, AtomicFileWritingIdiomTest.java
# Please correct the code format. Please see http://wiki.apache.org/hadoop/ZooKeeper/HowToContribute section for more info.
There are  spaces in empty lines and also in java comments like "//   and the caller will be notified (IOException)"
# I couldn't see the following constructor is used anywhere. Is it required?
{code}
    public AtomicFileWritingIdiom(File targetFile, WriterStatement wStmt, String encoding)  throws IOException {
        this(targetFile, null, wStmt, encoding);
    }
{code}
# This is a suggestion only. There are many null checks in the constructor logic like, if not null do the operation. I think, you have done this to reduce the code duplication. But I feel, this will create confusions in debugging or maintainability. Say, by mistake if the passed object is null, this will just skip the logic and return. Caller will be thinking the operation is successfully completed. IMHO, its ok to duplicate the constructor logics rather than null checks and skipping. Whats your opinion?

-Rakesh, Hi Rakesh,

Thank you for the review! 
My answers:
* 1, 2, 3: Sure! I will do it. 
* You are right, it is not required. I am just reluctant providing a Writer-based API without the possibility to provide an encoding. But I understand that dead code should be avoided. I will remove it.
* You are right: there are null check because I didn't want to duplicate the idiom (I felt the complexity was more in the idiom - try catch abort finally close...- than in the initialization of the objets). That is why this constructor is private (it handles the null check, and the public constructors cannot accept null parameters, excepted the encoding parameter that I will remove). I you prefer code duplication (for maintenability reasons) I am fine with that as well. Just tell me! 
Regards,
Bruno., Hi Bruno,

Can we refactor 'BufferedWriter bw = null' logic as follows:
{code}
          } else {
                // prepare writer
                BufferedWriter bw = new BufferedWriter(new OutputStreamWriter(out));
                //......
                // execute writer operation
                wStmt.write(bw);
                bw.flush();
{code}

Also, I just noticed the exception blocks in the patch. Both 'IOException' and 'RuntimeException' handles the exception in the same way, aborting and throw back exception to the caller. Instead of having multiple blocks, I think we can simplify this by catching 'Exception or Throwable' and handle it.
, Hi Ralesh,

Yes I will refactor the writer logic following your suggestion.
However I am not fond of the global "catch Exception": since it is re-thrown, either this will modify the signature of all caller methods (throws Exception), or caller methods will have to catch the Exception and rethrow an IOException (or any other one) embedding the Exception (that was an IOException anyway). This is odd.
Either the exception is checked and enforced by the compiler (here IOException), or it is unchecked and it will be a subclass of RuntimeException.
That's why, as catching a Throwable is never a good idea, we are sure that the double catch (IOException and RuntimeException) is necessary and sufficient. It induces a bit of code duplication, but it sanitizes the throws clause of the method. Would you agree if I left it like as is?

Bruno.
, bq.However I am not fond of the global "catch Exception": since it is re-thrown, either this will modify the signature of all caller methods (throws Exception), or caller methods will have to catch the Exception and rethrow an IOException (or any other one) embedding the Exception (that was an IOException anyway). This is odd.

yeah, it makes sense and separate exception block is ok., Taking account latest remarks, Hi Rakesh,

First of all, I apologize for mispelling your name in my last comment.
Please find attached the new patch including all your remarks (well, I hope so). The only one that puzzled me was the "// and the caller will be notified (IOException)", I didn't find anything special in it, except the extra spaces after the // that I removed.
As you will see I have modified the try/catch/finally in a way that should satisfy both of us: it does not duplicate code, it is simpler, and it now resists to any kind of throwable (RuntimeException, Exception, Error) like demonstrated into the new unit tests. I also modified the unit tests to test that the tmp file is removed in any case.

I've tested the ZOOKEEPER-1691 patch in addition to this new one, and I still got my dynamic reconfig scenario working like described in https://issues.apache.org/jira/browse/ZOOKEEPER-1691
And I finally tested the configBackwardCompatibilityMode scenario where the dynamic config file gets created and the zoo.cfg file rewritten. It still works too.

I hope I have not forgotten anything!

Bruno., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12619178/ZOOKEEPER-1835.patch
  against trunk revision 1551624.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 4 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1845//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1845//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1845//console

This message is automatically generated., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12620103/ZOOKEEPER-1835.patch
  against trunk revision 1552946.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 4 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1858//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1858//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1858//console

This message is automatically generated., I'm out of the office till Jan 5th (included), having limited access to my emails.
In case of urgency, please contact support@temis.com
Best regards,

, I don't know why my out of office reply got here as a comment, but if an admin could delete it (since it is containing an email), it would be great! Thanks in advance,
Bruno., Before explaining the latest patch, let me summarize its content:
- I created a new AtomicFileWritingIdiom...
 - reusing the existing AtomicFileOutputStream class,
 - inspired by the way the  writeLongToFile method of QuorumPeer is using it,
- ... and used this new AtomicFileWritingIdiom class in the writeDynamicConfig method of QuorumPeerConfig

It took me some time to understand what was going wrong in QuorumPeerMainTest and ObserverHierarchicalQuorumTest unit tests with my second patch.
During my investigations I discovered strange stack traces in the junit reports of the (unpatched) trunk, related to AtomicFileOutputStream :
{code}
java.nio.channels.ClosedByInterruptException
        at java.nio.channels.spi.AbstractInterruptibleChannel.end(AbstractInterruptibleChannel.java:202)
        at sun.nio.ch.FileChannelImpl.force(FileChannelImpl.java:380)
        at org.apache.zookeeper.common.AtomicFileOutputStream.close(AtomicFileOutputStream.java:71)
        at org.apache.zookeeper.server.quorum.QuorumPeer.writeLongToFile(QuorumPeer.java:1499)
        at org.apache.zookeeper.server.quorum.QuorumPeer.setCurrentEpoch(QuorumPeer.java:1520)
        at org.apache.zookeeper.server.quorum.Leader.lead(Leader.java:523)
        at org.apache.zookeeper.server.quorum.QuorumPeer.run(QuorumPeer.java:980)
{code}
They occur in:
{code}
TEST-org.apache.zookeeper.server.quorum.Zab1_0Test.txt
TEST-org.apache.zookeeper.test.ObserverHierarchicalQuorumTest.txt
TEST-org.apache.zookeeper.test.ReadOnlyModeTest.txt
{code}
There seems to be a problem with the "force(true)" call on the FileChannel. I don't know why to be honnest (maybe related to the threading model of zookeeper).
If I simply remove this line (on the unpatched trunk), ClosedByInterruptExceptions disappeared but I observed the same unit test regressions in QuorumPeerMainTest as with my second patch.
However when I replaced:
{code:java}
((FileOutputStream) out).getChannel().force(true);
{code}
with:
{code:java}
((FileOutputStream) out).getFD().sync();
{code}
then there was no ClosedByInterruptException in the report, and no unit test regression.
And if I apply my patch (the third one, including this modification), there is no unit test regression neither (latest Hadoop QA result).

It seems that both fc.force() and fd.sync() have the same effect of flushing data on the device:
http://stackoverflow.com/questions/5650327/are-filechannel-force-and-filedescriptor-sync-both-needed

I've tested the ZOOKEEPER-1691 patch in addition to this new one and the configBackwardCompatibilityMode scenario. Both are still working.
, Hi,

I've tested the patch against the latest sources of the trunk and it is still ok: dynamic reconfiguration is working on Windows.
By the way: I've run the unit tests on the unpatched trunk on Ubuntu 12.04 64-bit and there was still one ClosedByInterruptException (see above) in TEST-org.apache.zookeeper.test.ObserverHierarchicalQuorumTest.txt. 
With the patch this exception does not occur.
I would 100% understand if you decided that letting me modify the existing AtomicFileOutputStream class is not a good idea. If this is the case, please tell me and I'll submit a patch that does not touch this class.
Regards, +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12626481/ZOOKEEPER-1835.patch
  against trunk revision 1561672.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 4 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1909//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1909//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1909//console

This message is automatically generated., Thanks Bruno! 

Should we use this new class for writing out epoch numbers instead of having a separate QuorumPeer.writeLongToFile ? 
[~phunt] can you please take a look ? (I see that you originally wrote that function for ZOOKEEPER-1427)
also re Bruno's question about modifying the existing AtomicFileOutputStream.

> There is a small bug in the current implementation of the configBackwardCompatibilityMode though: even if the clientPort= line is 
> mentioned the the zoo.cfg file, the port is not appended at the end of the line of the dynamic config. Don't know if it "deserves" a 
> bug though.

I'm not sure we want to do this automatically - the user still needs to specify the server specs according to the new format
for this and the other servers, in all of the config files. Appending just the client port for one of the server in each config file is not enough unless we fix the rest automatically too, which we don't do.
, moreover, when the leader is established, if I remember correctly, the leader's config will be written in everyone's config files. So unless the leader also somehow knows the client port of this server, the port will disappear from the config file even if you initially append it.
, AtomicFileWritingIdiomTest passes for me on windows, but ReconfigTest fails. When you say:

bq. I've tested the patch against the latest sources of the trunk and it is still ok: dynamic reconfiguration is working on Windows.

Do you mean unit tests or tests you've written yourself, [~bfreuden]?, Hi Alexander,
{quote}Should we use this new class for writing out epoch numbers instead of having a separate QuorumPeer.writeLongToFile ? {quote}
This is almost the same code (writeLongToFile is actually where I got the "idiom"), except this modification in the AtomicFileOutputStream. However I preferred leaving it as-is for the sake of "not touching something that is working for aesthetics reasons". But if you or Patrick Hunt feel ok about it, I can certainly do it. I am just puzzled by this difference between fc.force() and fd.sync().
Concerning the backward compatibitity mode behavior, I entirely trust you since I don't know much about ZK (to say the least).

, Hi Flavio,
{quote}AtomicFileWritingIdiomTest passes for me on windows, but ReconfigTest fails. When you say: [...] Do you mean unit tests or tests you've written yourself{quote}
I mean a test scenario that I am playing manually on Windows (and that did not work without the patch). This manual test is described here: 
https://issues.apache.org/jira/browse/ZOOKEEPER-1691?focusedCommentId=13846779&page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel#comment-13846779
Concerning the ReconfigTest unit test (trunk+patch), on Linux and Windows the result is:
Tests run: 9, Failures: 0, Errors: 0, Skipped: 0
, Flavio/Bruno, could you guys find out if this patch is causing the test failure?, I'm out of the office till April 6th (included), having no access to my emails.
In case of urgency, please contact support@temis.com
Best regards,

, I'll try asap (probably this week-end) to get the latest version of the trunk, run the test suite, apply the patch, run the test suite once again, and compare test results.
I hope I'll reproduce the test failure Flavio is talking about.
, Ok, here are the results. 
The short version: 
- on Linux, tests results are the same with and without the patch (so I can't reproduce Flavio's test failure), 
- on Windows, tests results are better with the patch (even though results are very strange : timeouts, 3 times longer to run on Windows than on Linux despite a far better CPU - maybe an effect of the SSD?).

The long version:
Test plateforms:
- Ubuntu 13.04 x64 / Oracle Java 1.7 x64 / Celeron G530 / SSD
- Windows 7 x64 / Oracle Java 1.7 x64 / Core i7 860 / HDD
Test suite runs in 45 minutes on Linux, and in 165 minutes on Windows.

Linux trunk-only (failures and errors) and Linux trunk+patch are the same:
    Running org.apache.zookeeper.server.quorum.StandaloneDisabledTest
    Tests run: 2, Failures: 1, Errors: 0, Skipped: 0, Time elapsed: 107,875 sec
    Running org.apache.zookeeper.test.StaticHostProviderTest
    Tests run: 1, Failures: 0, Errors: 1, Skipped: 0, Time elapsed: 0 sec

Windows trunk+patch (failures and errors):
    Test org.apache.zookeeper.server.ZxidRolloverTest FAILED (timeout)
    Test org.apache.zookeeper.server.quorum.ReconfigRecoveryTest FAILED
    Test org.apache.zookeeper.test.FollowerResyncConcurrencyTest FAILED (timeout)
    Test org.apache.zookeeper.test.LeaderSessionTrackerTest FAILED (timeout)
    Test org.apache.zookeeper.test.QuorumTest FAILED (timeout)
    Test org.apache.zookeeper.test.ReadOnlyModeTest FAILED (timeout)
    Test org.apache.zookeeper.test.ReconfigTest FAILED (timeout)
    Test org.apache.zookeeper.test.StaticHostProviderTest FAILED (timeout)

Windows trunk-only (failures and errors) has the same than above, plus these:
    Test org.apache.zookeeper.ZooKeeperTest FAILED
    Test org.apache.zookeeper.ZooKeeperTestableTest FAILED
    Test org.apache.zookeeper.server.CRCTest FAILED
    Test org.apache.zookeeper.server.InvalidSnapCountTest FAILED
    Test org.apache.zookeeper.server.util.DynamicConfigBCTest FAILED
    Test org.apache.zookeeper.test.AsyncHammerTest FAILED (crashed)

I'll try another run on Windows with the SSD to see if results are reproducible., Hi Bruno, You seem to get more errors/failures with the patch on windows, no?  Do you have a windows 8 box to run it?, Hi Flavio, Actually not. My explanation was not clear (sorry for that): the trunk-only has more test failures but it shares some of them with the trunk+patch. So my first Windows-related list contains the failures found both in trunk-only and trunk+patch (common failures), and my second list contains only the additional failures found in the trunk-only only., Yes I have access to a Windows 8 box. I'll give it a try and keep you posted., First I'd like to say I'm sorry for previous alarming test results.
After encouraging test results on the Windows 8 box, I finally realized that, besides the OS, the other difference was the Java version: Oracle Java 1.6 x64 on my Windows 8 box, and Oracle Java 1.7 x64 on my Windows 7 box.
I switched to Oracle Java 1.6 x64 on my Windows 7 box as well and... much better!

Windows 8 trunk-only:
     Test org.apache.zookeeper.server.util.DynamicConfigBCTest FAILED
     Test org.apache.zookeeper.test.ClientPortBindTest FAILED
     Test org.apache.zookeeper.test.QuorumTest FAILED
     Test org.apache.zookeeper.test.StaticHostProviderTest FAILED (timeout)

Windows 8 trunk+patch:
     Test org.apache.zookeeper.server.quorum.ReconfigRecoveryTest FAILED
     Test org.apache.zookeeper.test.ClientPortBindTest FAILED
     Test org.apache.zookeeper.test.QuorumTest FAILED
     Test org.apache.zookeeper.test.StaticHostProviderTest FAILED (timeout)

Windows 7 trunk-only:
     Test org.apache.zookeeper.server.quorum.ReconfigRecoveryTest FAILED
     Test org.apache.zookeeper.server.util.DynamicConfigBCTest FAILED
     Test org.apache.zookeeper.test.ClientPortBindTest FAILED
     Test org.apache.zookeeper.test.QuorumTest FAILED
     Test org.apache.zookeeper.test.StaticHostProviderTest FAILED (timeout)

Windows 7 trunk+patch:
     Test org.apache.zookeeper.server.quorum.ReconfigRecoveryTest FAILED
     Test org.apache.zookeeper.test.ClientPortBindTest FAILED
     Test org.apache.zookeeper.test.QuorumTest FAILED
     Test org.apache.zookeeper.test.StaticHostProviderTest FAILED (timeout)

Quite honestly, I don't know what to conclude; on Windows test results seem to be so unpredictable.
The invariant seems to be that org.apache.zookeeper.server.util.DynamicConfigBCTest failure neved showed up with the patch.
Maybe I'll try to loop on ReconfigRecoveryTest and DynamicConfigBCTest tests to see if there is a statistical "evidence".

, This week-end I looped on DynamicConfigBCTest, ReconfigRecoveryTest and FLETest (tests failures not observed on Linux). Tests are done using a shell script performing a loop of "ant test -Dtestcase=...".

DynamicConfigBCTest (more than 6500 loops each): 
-  trunk: 100% failures (0 success)
-  patch: 0% failures (0 failure)

ReconfigRecoveryTest (more than 200 loops each): 
-  trunk: 99% failures
-  patch: 94% failures

FLETest (more than 500 loops each): 
-  trunk: 20% failures
-  patch: 2% failures

ReconfigRecoveryTest and FLETest do exhibit a random behavior on my Windows 7 box.
, Thank you for running these tests Bruno! Flavio/Alex, should we check this patch in? It looks good to me., It looks good, thanks a lot Bruno! 

I'd still suggest to change the implementation of writeLongToFile to use the new Ideom class, to make things consistent. Is there any downside to this ? Could this reduce failures on Windows ? This seems nice to have, but up to you, Bruno.

, I'm Sorry Alex, I totally missed the notification of your message.
Hard to say if there is a downside but I'll do it, run the tests, and we'll see! Probably next week-end though., Here is the new patch including the writeLongToFile implementation based on the idiom.
I ran junit tests on linux and windows, with and without the patch.
There is a litle improvement on Linux with org.apache.zookeeper.test.ReconfigTest not failing with the patch.
On Windows results are still variable, thus not comparable on a single run. During the week, I'll do another round of test loops.
, re-upload the latest patch in order to try to trigger Hadoop QA report, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12650866/ZOOKEEPER-1835.patch
  against trunk revision 1605517.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 4 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2156//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2156//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2156//console

This message is automatically generated., +1. The failure seems unrelated to the JIRA, It seems like this patch is good to go. I'll check this in tomorrow unless somebody complains.


Hi [~bfreuden],

Just one comment. IMHO the test class AtomicFileWritingIdiomTest could extend ZKTestCase, it would be helpful later when debugging test case failures.
If possible please include this minor change and update new patch, otw I'll do the changes when committing the patch., Thanks [~bfreuden] for the fix. Thanks for the reviews guys.

Committed to trunk : http://svn.apache.org/viewvc?view=revision&revision=1607774, FAILURE: Integrated in ZooKeeper-trunk #2355 (See [https://builds.apache.org/job/ZooKeeper-trunk/2355/])
ZOOKEEPER-1835. dynamic configuration file renaming fails on Windows(Bruno Freudensprung via rakeshr) (rakeshr: http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1607774)
* /zookeeper/trunk/CHANGES.txt
* /zookeeper/trunk/src/java/main/org/apache/zookeeper/common/AtomicFileOutputStream.java
* /zookeeper/trunk/src/java/main/org/apache/zookeeper/common/AtomicFileWritingIdiom.java
* /zookeeper/trunk/src/java/main/org/apache/zookeeper/server/quorum/QuorumPeer.java
* /zookeeper/trunk/src/java/main/org/apache/zookeeper/server/quorum/QuorumPeerConfig.java
* /zookeeper/trunk/src/java/test/org/apache/zookeeper/common/AtomicFileWritingIdiomTest.java
]