[btw, ran valgrind like:

 valgrind --malloc-fill=aa --free-fill=bb --log-file=valgrind_mt.out --leak-check=yes ./zktest-mt
, These look OK to me, on a first glance.  There's a call to freeaddrinfo() in getaddrs() to match getaddrinfo().  There's also a free(zh) in zookeeper_close() to match the allocation in zookeeper_init().  I think these are just spurious reports from valgrind, but I'm not absolutely 100% on that., I agree with chris. also for the create_completion_entry( zookeeper.c:1830 in zktest-st) ( the line number is different in the latest code after a few checkins)... has a matcing free() in process_completions. I think we can close this jira for now., I did do a quick eyeball of the results before entering the jira - I guess the "goto fail" in getaddrs caught my eye - that skips the freeaddrinfo call, but now looking again it seems thats an unlikely case (oom).

Feel free to close, it might be good to document this somewhere, perhaps a src/c/valgrind.txt file that details the exceptions in case someone else runs valgrind? Isn't there some way to pass known exceptions to valgrind? Perhaps that's a better way (commit the exceptions to svn).

anyway - looks like we are good for 3.1.1, feel free to close.
, perhaps a new jira to update the makefile to include valgrind/helgrind support? it can load the exceptions that we know about explicitly... just a thought.
, i dont think their is anything like passing known exceptions to valgrind. Also, the exceptions are line number based, which would be difficult to track with code changes in the c code. I would just close this jira for now and revisit it again if someone opens another jira for this. On the other hand, it would be good to have hudson scream if the number of excpetions increase... , I am resolving this for now. , FYI:

       --suppressions=<filename> [default: $PREFIX/lib/valgrind/default.supp]
              Specifies an extra file from which to read descriptions of
              errors to suppress. You may use up to 100 extra suppression
              files.

also:

 --gen-suppressions=<yes|no|all> [default: no]
]