[What version is this being run against? client and server (if diff), Would also be useful to see logs (client/server). Any chance you could create a test case that reproduces?, version is 
Zookeeper version: 3.5.1-alpha--1, built on 05/17/2016 14:16 GMT

sorry i dont have any test.
when we get ZRUNTIMEINCONSISTENCY return code, does that mean connection is closed and there is need to reestablish connection to server?, bq. Zookeeper Client connected to Zookeeper server S1 and a new server S2 gets added

what does this mean? You are doing dynamic reconfig from 1 to 2 servers? Can you provide the operations you're running as well as the before/after configuration files?, Comment from the list http://markmail.org/message/7jjbev3nxvg6bit2

{noformat}
I can't help you with a solution, but we are also seeing this.  We had not
made the connection to a reconfig causing this, but a quick look at some
logs indicates it may be happening to us during a reconfig as well.  That
gives us a thread to dig more-- we'll update if we find anything.
{noformat}
, Yes, I am doing dynamic reconfig of 1 to 2 servers.
at addition of s2, client calls zoo_set_server.then  zoo_get .
I wanted to know if I get  error code ZRUNTIMEINCONSISTENCY on calling zoo_get(), then connection to server is also closed ?
, I'm confused. I didn't think you could do a dynamic reconfig from 1 server. 1 server is what is called "standalone" mode whereas 3 or more puts you into "quorum" mode. And you cannot cross between these two stacks. Perhaps there was a change made in the reconfig code that I'm not aware of that let's you do this but I don't think so. [~shralex] would be able to say for certain.  Are you calling zoo_set_servers and giving it a new server that's not part of the ensemble? That would certainly cause this problem. Come to think of it, I don't think that there's any protection against that sort of misuse., There was a change added by Helen and Michi in ZOOKEEPER-1691, where you can disable standalone stack, and use a replicated stack even with 1 server.
, Thanks All,
Could you please comment on my below queries for which I logged this bug,
- when do we get ZRUNTIMEINCONSISTENCY and what does that mean
- when we get ZRUNTIMEINCONSISTENCY, does  that also means server connection is closed ? I see from C bindings src that socket is closed. i wanted to confirm.
appreciate your comments on these., Oh, neat! I was not aware of that. Thanks for filling in the gaps for me Alex., bq. when do we get ZRUNTIMEINCONSISTENCY and what does that mean

ZRUNTIMEINCONSISTENCY means that the client received a response with an xid that it didn't expect. This shouldn't happen and indicates a bug somewhere. "unexpected server response: expected 0x570b82fa, but received 0x570b82f9" indicates that time went backward from this client's perspective.

bq. when we get ZRUNTIMEINCONSISTENCY, does that also means server connection is closed

yes, It looks like we are stuck with this issue. There is no repro and we haven't really spotted the problem, is that right?]