[Here is a first stab at recreating our internal tool with nice upgrades like real-time updates for file and directory contents.  I have never built any swing UI's before so there are bound to be infelicities galore.  Please help.

There are some warts,  

1) you can't open a file that has children.

2) opening non-text files is bad juju

3) There seems to be a problem with the way the watchers are glued in place.  If you create a file, it appears, but if you create children for it, it doesn't turn into a folder.  Work-around is to simply restart the browser.

, Here is a simple example on a live ZK., Ted, thanks for the submission, looks interesting.

We'd be happy to include in contrib if you'd like. In particular take a look at src/contrib, the rest/zkpython, etc... are good examples
of how to structure the code (you're already pretty close). Please submit as a patch if possible.

We don't currently support maven, so you'd have to create a build.xml - take a look at the example in the other
 contribs (like rest), you probably just need to copy/tweak one of those.

I'd suggest that you change the package to org.apache.zookeeper.gui.swing.tree (something like that) rather than just org.apache.zookeeper.tree

Regards., forgot to mention:

add apache license to the top of all files.

add a README.txt to the contrib directory giving some basic information on what/why/how type information.
, This pom creates a stand-alone jar (and also forces a more modern jdk version ... the pom in the .tar.gz file wouldn't build for me.), Anyone willing to create a patch and some minimal docs (README.txt) for this? Put it into src/contrib, would love to include it.

FYI: http://github.com/phunt/zookeeper_dashboard, Hi all,

FYI, I am working on creating a ZooKeeper Eclipse Plug-in.  I have documented the goal, progress (with screen shots), and future plans in the attached file (ZooKeeper Eclipse Plug-in.pdf). Feedback is welcome. 

, Hi,

I have developed an Eclipse plug-in for Zookeeper.  You can find out all about it and download it from my website here:  

http://www.massedynamic.org/eclipse/zookeeper/
 , Pushing to 3.4.0, also see ZOOKEEPER-678 which is making good progress., This has  long since been superseded, I think by other contributions.]