[Patch to fix RPM building issues on newer distributions, Hello [~Ormod].  Thank you for contributing the patch.

This is similar to an addendum patch I had posted on ZOOKEEPER-2124 a while back.  However, that patch was not accepted at the time.  There is another open issue at ZOOKEEPER-1604 that actually proposes removal of the rpm and deb packaging.  Instead of maintaining it within the ZooKeeper project, we'd defer to external packaging providers like Apache Bigtop.

There hasn't been a final decision on the matter AFAIK.  I'll comment on ZOOKEEPER-1604 again now.  You might want to consider watching that issue., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12755818/pkg_fixes.patch
  against trunk revision 1702378.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2874//console

This message is automatically generated., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12755818/pkg_fixes.patch
  against trunk revision 1733348.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3064//console

This message is automatically generated., Given the packaging has been removed as of ZOOKEEPER-1604 I'm closing this. Please use Bigtop for ZK packaging.]