[This patch doesn't fix the bug.
It includes a unit test only., In the callback of asynchronous multi, there is no way to get the path of the exception.
Is it also a bug?, Hey [~kazuakibanzai], could you please confirm if this issue is not a duplicate of https://issues.apache.org/jira/browse/ZOOKEEPER-2276 ?

Thanks

update: /cc [~arshad.mohammad], Looks like the same bug to me., [~eribeiro] Thank you for replying.
It is the same bug.
I applied the patch (https://issues.apache.org/jira/browse/ZOOKEEPER-2276) on zookeeper-3.5.0, and it passed the TransactionExceptionTest.
However, it didn't pass the MultiTransactionTest., Dear Banzai-san,
Thank you for commenting on that issue.

Is the following correct?

* Issue 2276 reports and fixes one variant of the bug.

* Our issue (2496) covers both variants and includes a test for them, but 
no fix.

Key: ZOOKEEPER-2496

-- 
Regards,
Cyrille Artho - http://artho.com/
Youth -- not a time of life but a state of mind... a predominance of
courage over timidity, of the appetite for adventure over the love of ease.
		-- Robert F. Kennedy
, Dear Mr.Artho,
> Is the following correct?
>  Issue 2276 reports and fixes one variant of the bug.
>  Our issue (2496) covers both variants and includes a test for them, but
>  no fix.
Yes it is.
(Issue 2276 fixes the sync multi bug only.
The async version is not fixed.), Thanks [~kazuakibanzai] for the feeback on ZOOKEEPER-2276.
If you have already fixed both scenarios you mentioned I can assign you ZOOKEEPER-2276, may be you can submit patch there or here in this jira.
Otherwise i will submit new patch for ZOOKEEPER-2276 soon.
, Async multi API does process the result and also it does not throw exception. Result is processed in the callback handler
I think the logic to find path of failed operation should be written in the callback handler.
Any thought?
I am just re-basing the ZOOKEEPER-2276 patch, For a unit test, yes, the check on whether the path returned by the exception (or rather, the return code indicating there was one) has to be checked by the callback handler.

Our path for ZOOKEEPER-2496 from 2016-08-01 does not include a test for asynchronous multi. Such a test would be welcome.

In ZooKeeper itself, it is of course preferable if the missing path info can be fixed in one place (same fix for sync and async). I have not checked the source in detail, but I would only fix this in two places (separate fix for sync and async) if there is no other way. Otherwise we have partial code duplication that may lead to future changes not being applied consistently in both cases., Thanks [~arshad.mohammad] for uploading the path.
I added a test for async multi and its fix to your patch.
Unfortunately, I couldn't fix this bug in the same place(the fix is in ClientCnxn.processEvent).
For future changes, I added a comment to ZooKeeper.multiInternal. ]