[This issue is not about reconfig, so I'm renaming the JIRA. Its about whether or not to have an explicit connection from a server to in QuorumCnxManager.java

It looks like in FLE we a server skips sending messages to itself by immediately putting the message in the receiving queue, so although a connection to itself exists it will not be used.

But if I understand correctly a leader will explicitly send operations (proposals) to itself over an open connection. When a message is received it passes through several layers of request processors. So its not so clear to me on what layer we'd want to enqueue a packet from the leader to itself if we want to avoid explicitly sending it. Alternatively we could jut explicitly call Leader.processAck(myself) before sending the packet to others. [~fpj], [~breed], others, what do you think ? is this something we want to fix ?, I'm a bit confused by the summary. Aren't both server 1 and 2 trying to connect to server 2?, I just noticed that the specific error in the description is due to something else - when we reconfigure, we restart leader election, which involves shutting down QCM. I think this is why 1 can't connect to 2 momentarily. On the other hand 2 tries to connect to 1 from connectNewPeers, and the attached patch prevents this.

I'm still not sure whether QCM connects to itself by default when its created., sorry I meant "2 tries to connect to 2 from connectNewPeers", QuorumCnxManager doesn't connect to itself by default.

https://github.com/apache/zookeeper/blob/trunk/src/java/main/org/apache/zookeeper/server/quorum/QuorumCnxManager.java#L322, I found this line, but its used by FLE only, not leader -> follower. What about connections for sending the operation proposals ?, If I understand it correctly, followers/observers connect to the leader by calling connectToLeader(). The leader accepts connections and initialize LearnerHandler objects. It doesn't use QuorumCnxManager, and the leader doesn't connect to itself.

https://github.com/apache/zookeeper/blob/trunk/src/java/main/org/apache/zookeeper/server/quorum/Leader.java#L390, Thanks, you're right. I guess its too late here :)
I found how this works now - ProposalRequestProcessor on the leader invokes propose() that sends messages to all learners and then ProposalRequestProcessor hands it over to AckRequestProcessor that creates an ACK from the leader itself. Anyway, I changed the title back to what it was. I tried the patch, looks like it solves the issue - no message from 2 to 2 connection failure., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12640396/ZOOKEEPER-1840.patch
  against trunk revision 1587812.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2045//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2045//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2045//console

This message is automatically generated., +1 Thanks Alex!, trunk: http://svn.apache.org/viewvc?view=revision&revision=1587818, FAILURE: Integrated in ZooKeeper-trunk #2292 (See [https://builds.apache.org/job/ZooKeeper-trunk/2292/])
ZOOKEEPER-1840. Server tries to connect to itself during dynamic reconfig (Alexander Shraer via michim) (michim: http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1587818)
* /zookeeper/trunk/CHANGES.txt
* /zookeeper/trunk/src/java/main/org/apache/zookeeper/server/quorum/QuorumPeer.java
]