[This patch moves the check for outstanding watches in send_set_watches, going to try to figure out how to test this later, any suggestions?
, this looks like a critical problem. This could cause setwatches never to be set if the count is initialized to 0 for all the three watches. We should definitely have a test  case for this. How about setting a watch on a zookeeper server and shutting it down and making sure that the watch gets fired on the second server it reconnects to? , Sounds good Mahadev, I'll get started on it., steve, any update on this? we should try to get this into 3.3.0, Looks like I need to add multi server handling to the C tests to manage this, I'll try to get a rough cut done and post the patch., Started on adding multi server testing for C client, started creating the scripts, got stuck. main() in TestDriver.cc will always start the single server.

This patch has the scripts that I created so far.

It looks like adding this will need quite a few changes.  Should I open a new JIRA?
, Ben, can you look at this as well? seems related to the close?, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12430524/ZOOKEEPER-622.patch
  against trunk revision 903483.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 36 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    -1 release audit.  The applied patch generated 6 release audit warnings (more than the trunk's current 1 warnings).

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h7.grid.sp2.yahoo.net/60/testReport/
Release audit warnings: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h7.grid.sp2.yahoo.net/60/artifact/trunk/patchprocess/releaseAuditDiffWarnings.txt
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h7.grid.sp2.yahoo.net/60/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h7.grid.sp2.yahoo.net/60/console

This message is automatically generated., good catch steven and excellent patch! will you put the license header in the generateCfgs.sh script? will you also put the header at the end of localserverlist (making it a footer :) to avoid a release warning?, sorry, i looked at this a bit more closely and i realized that we can't really assume that there is a /tmp. we should be using  ${base_dir}/build/tmp/ i'll take a whack at fixing the zkMultiServer.sh., hey steven, it appears the test case isn't testing anything. can you clarify how it works?, Hi Ben, sorry about that, this was just a rough cut patch, I got stuck when I tried to add zkMultiServer.sh into the tests since the Zookeeper server gets started in main() rather than in the test classes, so I posted it here to see if I was on the right track.   Not sure if that was the right thing to do, mainly didn't want to go through and start changing all of the test setup without checking first.

If there isn't anything wrong with moving the Zookeeper server startup into the setup() methods of the test classes, I can probably get the patch starting up multiple servers in /tmp and the basic test in place after some work.  To handle $base_dir I was planning to generate the config files somewhere in $base_dir and point the server to them.
, sorry steven, i didn't notice that you had commented. yes, please finish the test you can make simplifying assumptions such as /tmp and i can help you clean it up once things are working. thanx!, A working test case for watch transfer with multiple hosts.  I left testScript in there because it is quite useful for basic sanity testing for the scripts.

, This patch works but is still in rough shape!  The multi host test servers are started on separate ports and are running concurrently with the single host test server.  Would be helpful to make this more clear.

Paths still hardcoded to /tmp.

zooX.cfg are in the patch but are generated by generateCfgs.sh

I encountered a ZCONNECTIONLOSS from an operation executed after the client reconnects to a new host.  Adds an awkward section to the test case.  I guess in some sense the client should not be oblivious to one of these "lucky" disconnect/reconnect situations.

, this is the patch with just the bug fix in it. the system test has been moved to the related jira., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12437783/ZOOKEEPER-622.patch
  against trunk revision 918757.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h7.grid.sp2.yahoo.net/77/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h7.grid.sp2.yahoo.net/77/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h7.grid.sp2.yahoo.net/77/console

This message is automatically generated., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12437783/ZOOKEEPER-622.patch
  against trunk revision 919640.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h8.grid.sp2.yahoo.net/132/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h8.grid.sp2.yahoo.net/132/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h8.grid.sp2.yahoo.net/132/console

This message is automatically generated., I just committed this. thanks ben and steven., Integrated in ZooKeeper-trunk #716 (See [http://hudson.zones.apache.org/hudson/job/ZooKeeper-trunk/716/])
    . Test for pending watches in send_set_watches should be moved (ben and steven via mahadev)
]