[ZOOKEEPER-2071-1.diff addresses
 
"The first and most prominent reference to a project or product on each page, and especially in page titles or headers, must use the "Apache Foo" form of its name."

and

"At the top of each project or product homepage, and on the top banner of each page where the project name appears, you should include a "TM" symbol next to the first main occurrence of the "Apache Foo" project name, both in header/title text and in the first place in running text.", See also "Project Naming And Descriptions"

The project home page and download page need to be updated with a one-sentence description of the form:

The Apache ZooKeeper [something] is [description].

Currently the top level site says "Apache ZooKeeper is an effort ..." 
and then "ZooKeeper is a centralized service ... "
and trunk/docs says "ZooKeeper is a high-performance coordination service ..." 

(Because trunk/docs gets shipped separately in the .tar.gz without the top-level site, the description should be used there, too.)
, The patch looks good to me, I'll update the docs with the sentence you're asking for and will upload a new patch, [~wsmoak]., I'm not in love with the TM marks on every single page.  At the time I was trying to follow The Rules as I interpreted them... but that part is a 'should' rather than 'must' anyway.

My main concern was that I downloaded the 3.5.0-alpha .tar.gz distribution, and there was virtually no indication that it came from Apache.  Not in the README, not in the filename or the directory it expands into, not in the html docs. (Only a breadcrumb at the top and the copyright notice at the bottom.)

So... adjust the TMs as needed, if you want.  Thanks!

(There are two small unrelated changes in that patch -- one spelling fix, and I changed the version number on the 'tab' from 3.4 to 3.5.), I have uploaded a new patch that changes the build file so that the name is now "apache-zookeeper" instead of just "zookeeper". This way the artifacts we generate are named apache-zookeeper... rather than just zookeeper.... I have updated the README file accordingly.
]