[Have there been any updates on this? We seem to be running into the same problem. The leader election completes after some period but the nodes are taking 15+ seconds before they stop logging the "ZooKeeperServer no running" message and start processing traffic. This is happening on the leader and followers. See logs excerpts below. After this everything seems to go back to normal.

From the leader:

2016-09-04 01:00:41,024 [myid:5] - INFO  [QuorumPeer[myid=5]/0:0:0:0:0:0:0:0:2181:Leader@358] - LEADING - LEADER ELECTION TOOK - 10251

2016-09-04 01:00:48,814 [myid:5] - INFO  [QuorumPeer[myid=5]/0:0:0:0:0:0:0:0:2181:Leader@943] - Have quorum of supporters, sids: [ 1,2,5 ]; starting up and setting last processed zxid: 0x160000000

From a follower:

2016-09-04 01:00:43,823 [myid:3] - INFO  [QuorumPeer[myid=3]/0:0:0:0:0:0:0:0:2181:Follower@63] - FOLLOWING - LEADER ELECTION TOOK - 8684

016-09-04 01:00:57,964 [myid:3] - INFO  [NIOServerCxn.Factory:0.0.0.0/0.0.0.0:2181:NIOServerCnxnFactory@197] - Accepted socket connection from /X.X.X.X:39700
2016-09-04 01:00:57,964 [myid:3] - WARN  [NIOServerCxn.Factory:0.0.0.0/0.0.0.0:2181:NIOServerCnxn@362] - Exception causing close of session 0x0 due to java.io.IOException: ZooKeeperServer not running
2016-09-04 01:00:57,964 [myid:3] - INFO  [NIOServerCxn.Factory:0.0.0.0/0.0.0.0:2181:NIOServerCnxn@1007] - Closed socket connection for client /X.X.X.X:39700 (no session established for client)
2016-09-04 01:00:58,055 [myid:3] - WARN  [QuorumPeer[myid=3]/0:0:0:0:0:0:0:0:2181:Follower@118] - Got zxid 0x1600000c80 expected 0x1

, [~cammckenzie] from your log messages, it looks like the leader election is taking quite some time. The leader one says 10s plus another 7s until it got a quorum of supporters. Your ensemble for some reason is taking its time to come back up., [~fpj]. Yeah, not sure why the election is taking so long. Some sort of network issues perhaps. It still seems though that after the election is complete it takes another 10+ seconds before the ZooKeeperServer not running log messages stop appearing., Note that it is taking another 7s after election for the leader to gather a quorum of supporters. Until the leader has a quorum of supporters, it won't lead. To sum up, the leader election took 10s and it took 7s for the quorum of supporters, so you have 17s right there just waiting for the leader to come up. I'm not sure where the remaining time is coming from, but I suspect it is just client backoff. , Thanks Flavio,
I assumed that once the LEADING - ... log occurred that the election was complete. I must not understand how the election works correctly. I thought that the support of the quorum was required for the election to complete. Is this not the case? Should I ask this on the zookeeper list instead?
cheers, I believe leader election completion does not imply quorum being formed - followers have to sync with leader (i.e. transferring snapshot over the wire then load in memory), and this step could take a while depends on size of snapshot diffs, network condition and the load of quorum machine. After followers sync-ed with leader a quorum will be formed., Thanks for the explanation, that would make sense.
cheers]