[Has anyone come up with a workaround for this while it is being fixed? Also, what about 3.4.x?, [~nehanarkhede] any updates on this? last I see on the mailing list thread is a comment from you that seems to indicate you have a fix:

{noformat}
I haven't had the chance to reproduce this on zookeeper 3.4, but I was able
to reproduce this on 3.3.4. Filed
https://issues.apache.org/jira/browse/ZOOKEEPER-1740. I will try to see if
the fix works.
{noformat}, I'd like to know if this same problem happens in the 3.4 branch., Shouldn't this be a Blocker?, This issue has been created for the 3.3 branch and there is no further evidence that it happens in the 3.4 branch. In fact, Neha was not able to reproduce it in the 3.4 branch according to the e-mail thread posted above. I'm actually thinking about closing this issue, since users should actually consider upgrading to the 3.4 branch. Short answer is that I don't think this is a blocker. , I'm marking this jira as "not a problem" based on my previous comment. If anyone disagrees, please reopen it., I think ZOOKEEPER-1809 is related, or maybe even a duplicate of ZOOKEEPER-1740. Could you please check?, It's possible that ZOOKEEPER-1809 is a duplicate of ZOOKEEPER-1740, but [~fpj] indicated the issue wasn't reproducible on the 3.4 branch (1809 was reproduced on 3.4.5).

This ticket indicates that the fix version is 3.4.6, so I will see if I can build that locally and reproduce the problem, This was resolved as "Not a Problem" and there is no solution implemented in branch 3.4.
You might have been able to reproduce it in the 3.4 branch with your test., My understanding is that this issue was closed as "Not a problem" because it wasn't reprodicible under 3.4 at the time.  However, the behaviour seems to be the same and I am able to consistently reproduce it under 3.4.5 using the app in ZOOKEEPER-1809.  Perhaps this ticket can remain closed, as it pertains to 3.3, and any further investigation happens on ZOOKEEPER-1809?, Apparently this issue isn't totally resolved, so I'm reopening it and I've linked it to the corresponding kafka issue., Hi [~fpj] is this still an issue for Kafka? Should we target a release?, The corresponding Kafka issue has been resolved, so I'm resolving this one as fixed.]