[Michi would you (anyone really) mind taking a look?, Sorry to bug you [~michim] but I'm assuming we should include this in 3.5.0?, The real problem here is this line:

{noformat}
.\src\zookeeper.c(2007): error C2059: syntax error : '.'
{noformat}

I'll submit a patch shortly., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12657810/ZOOKEEPER-1974.patch
  against trunk revision 1613328.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 2.0.3) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2235//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2235//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2235//console

This message is automatically generated., Oh wow, winvs2008 doesn't do C99? (i.e.: initializing structs like { .tv_sec = timeout } ?). Or we are missing a flag when building for Windows?

I am happy with the patch, but maybe this will bite us again later on if we don't get Win builds to support C99 stuff.

+1 regardless. 

, Well, probably there isn't a way for this in VS 2008:

http://stackoverflow.com/questions/5440611/how-to-rewrite-c-struct-designated-initializers-to-c89-resp-msvc-c-compiler

So we'll have to go with the patch. Sorry about this, it was a change I introduced. , No worries at all [~rgs] - that's why we have the jenkins jobs. ;-), Committed to trunk. Thanks Flavio!, FAILURE: Integrated in ZooKeeper-trunk #2386 (See [https://builds.apache.org/job/ZooKeeper-trunk/2386/])
ZOOKEEPER-1974. winvs2008 jenkins job failing with "unresolved external symbol" (flavio via phunt) (phunt: http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1613463)
* /zookeeper/trunk/CHANGES.txt
* /zookeeper/trunk/src/c/src/zookeeper.c
]