[ZOOKEEPER-1646 is the same issue as my comment on ZOOKEEPER-1742

see: https://issues.apache.org/jira/browse/ZOOKEEPER-1742?focusedCommentId=13790629&page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel#comment-13790629, Just so that I understand, in your comment in ZOOKEEPER-1742, you say that you're observing this problem only on trunk, so why is it a blocker for 3.4.6?, I reported two issues on ZOOKEEPER-1742; one that only happens on 3.4 branch (this one), and another one that only happens on trunk ("tests/TestReconfigServer.cc:128:16: error: ‘sleep’ was not declared in this scope")

I'm looking into this one. So far I've figured out it doesn't seem to be a timing issue - the notification is never sent to the watcher, even after extending the timeout to 10 seconds (from 1). However I haven't gotten much further - the C++ code is cumbersome., Once ZOOKEEPER-1795 is applied I'm seeing this on trunk as well., Oddly the problem only occurs when -O2 compiler flag is used. When I drop -O2 the test passes.

It seems that glibc is doing some magic under the covers, see this for background:
https://wiki.ubuntu.com/ToolChain/CompilerFlags#A-D_FORTIFY_SOURCE.3D2

In the case of the poll system call it's interposing a "fortified" poll call as can be seen in this file
http://code.woboq.org/userspace/glibc/io/bits/poll2.h.html

which is causing our poll mock to be ignored, but only when -O2 is used - inlining the function it seems.

I have a basic patch that looks like it addresses the issue, I'll clean it up and submit soon., This patch fixes the issue for me on raring., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12608671/ZOOKEEPER-1646.patch
  against trunk revision 1532152.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1701//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1701//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1701//console

This message is automatically generated., +1 for the patch. Nice catch Pat!, Committed to 3.4.6 and trunk., SUCCESS: Integrated in ZooKeeper-trunk #2093 (See [https://builds.apache.org/job/ZooKeeper-trunk/2093/])
ZOOKEEPER-1646. mt c client tests fail on Ubuntu Raring (phunt) (phunt: http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1533161)
* /zookeeper/trunk/CHANGES.txt
* /zookeeper/trunk/src/c/tests/LibCMocks.cc
, Closing issues after releasing 3.4.6.]