[Here's the patch updated for Git. I haven't been able to test this as I don't have direct access to Jenkins, but I believe it should work (I pulled the changes from some older HBase build infra)

Note that the Jenkins job help text for "cleanup before checkout" git action says the following, which I believe means we don't need to cleanup in the script itself:
---
Clean up the workspace before every checkout by deleting all untracked files and directories, including those which are specified in .gitignore. It also resets all tracked files to their versioned state. This ensures that the workspace is in the same state as if you cloned and checked out in a brand-new empty directory, and ensures that your build is not affected by the files generated by the previous build.
---, Merged:

https://git-wip-us.apache.org/repos/asf?p=zookeeper.git;a=commitdiff;h=8c4082647f89b0a92fa00a2af8de84b3c7314e23

Do we need this in any other branch besides trunk or we only kick things from trunk?

Thanks [~phunt]!, (waiting for reply before closing), (waiting for reply before closing), Oops -- committed with the wrong credentials. Updating my git config now. Sorry about that. , SUCCESS: Integrated in Jenkins build ZooKeeper-trunk #3081 (See [https://builds.apache.org/job/ZooKeeper-trunk/3081/])
ZOOKEEPER-2576: After svn to git migration ZooKeeper Precommit jenkins (rgs: rev 8c4082647f89b0a92fa00a2af8de84b3c7314e23)
* (edit) CHANGES.txt
* (edit) src/java/test/bin/test-patch.sh
, I missed the build.xml change (svn.cmd to git.cmd).

[~rgs] - can you review/commit "part2" patch as well? Thanks!
, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12828138/ZOOKEEPER-2576-part2.patch
  against trunk revision 8c4082647f89b0a92fa00a2af8de84b3c7314e23.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 2.0.3) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3420//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3420//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3420//console

This message is automatically generated., Merged: https://git-wip-us.apache.org/repos/asf?p=zookeeper.git;a=commitdiff;h=b2a484cfe743116d2531fe5d1e1d78b3960c511e
, SUCCESS: Integrated in Jenkins build ZooKeeper-trunk #3083 (See [https://builds.apache.org/job/ZooKeeper-trunk/3083/])
ZOOKEEPER-2576: Missing changes (cleanup build.xml) (Patrick Hunt via (rgs: rev b2a484cfe743116d2531fe5d1e1d78b3960c511e)
* (edit) CHANGES.txt
* (edit) build.xml
]