[what version of gcc is this? Anyways we should fix it in 3.2, Interesting, with gcc (Ubuntu 4.3.2-1ubuntu12) 4.3.2
this warning is not output by the compiler. Seems that the newer version
of the compiler is able to determine that auth is only accessed (written/read) when the following
condition is true:

    if(cert!=NULL && certLen!=0){

as a result it doesn't complain in this instance on my system.

I'll submit a patch for this to work on older gccs.
, fixed warning and added tests to verify, +1. Works for me., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12405500/ZOOKEEPER-374.patch
  against trunk revision 764673.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-vesta.apache.org/32/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-vesta.apache.org/32/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-vesta.apache.org/32/console

This message is automatically generated., +1 for the patch.. the test fails on java test case LETest which the patch has ntohing to do with., I just committed this. thanks pat., Integrated in ZooKeeper-trunk #283 (See [http://hudson.zones.apache.org/hudson/job/ZooKeeper-trunk/283/])
    . Uninitialized struct variable in C causes warning which is treated as an error (phunt via mahadev)
]