[Found this while reviewing C client code - upload the patch for fix., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12821771/ZOOKEEPER-2498.patch
  against trunk revision 1754582.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 2.0.3) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3320//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3320//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3320//console

This message is automatically generated., Failed test is Java test, which also has solid track record of failures in previous couple of builds, logged ZOOKEEPER-2499 to track., [~hanm]: thanks! Merged:

https://github.com/apache/zookeeper/commit/21b0152ed0e0841b961ff3bca0b0d3c8567ce1a4
https://github.com/apache/zookeeper/commit/9518d9cb69cf1aaa05194795df3bfd6950b64a04
https://github.com/apache/zookeeper/commit/c00937a34b124fb705febab3422827be4891eb39
, SUCCESS: Integrated in ZooKeeper-trunk #3020 (See [https://builds.apache.org/job/ZooKeeper-trunk/3020/])
ZOOKEEPER-2498: Potential resource leak in C client when processing
unexpected / out of order response (Michael Han via rgs) (rgs: [http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1755100])
* trunk/CHANGES.txt
* trunk/src/c/src/zookeeper.c
, Thanks [~rgs] for committing the patch!]