[Alex mentioned:

yep, I think what happens is that server 3 is becoming leader and not server 1, so its not completing the reconfig. Let me think about how to solve this...

then later:

Actually if servers 1 and 3 are talking and 3 is elected and not 1, it means that 3 also saw the reconfig. So it should also complete it when it reboots. To debug this I suggest to print out the last seen config in the beginning of leader.lead(). 

Is it possible that writing the .next file to disk fails ?

Alternatively we could just remove this part of the test (attached patch) - the test's goal is to check that the leader times out when it looses a quorum of the new config, and the part of the test that fails now is not needed to check that. There are other tests in ReconfigRecoveryTest that are supposed to check recovery., bq. Is it possible that writing the .next file to disk fails ?

possible but I don't think so, at least not environmental -  the system has plenty of disk space and the other operations are ok., Alex would you mind attaching your proposed patch here? Thanks., removing the part of the test that fails since its beyond the scope of the test. the test's goal is to make sure a leader times out if there is no quorum of new config. , -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12657195/small_fix.patch
  against trunk revision 1612458.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    -1 findbugs.  The patch appears to introduce 1 new Findbugs (version 2.0.3) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2216//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2216//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2216//console

This message is automatically generated., Thanks Alex! Committed to trunk., SUCCESS: Integrated in ZooKeeper-trunk #2384 (See [https://builds.apache.org/job/ZooKeeper-trunk/2384/])
ZOOKEEPER-1984. testLeaderTimesoutOnNewQuorum is a flakey test (Alex Shraer via phunt) (phunt: http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1612867)
* /zookeeper/trunk/CHANGES.txt
* /zookeeper/trunk/src/java/test/org/apache/zookeeper/test/ReconfigTest.java
]