[Marking this as a blocker for 3.5.2 given you can't deploy to OSGI containers (and we want to enable as many folks as possible), [~phunt] do you know what needs to be done here?, bq. Instead of using 3.5.1-alpha, manifest needs to contain 3.5.1.alpha

sounds like some sort of string replacement operation in the build.xml file. But really I have no idea, just going by what's in the description. [~niveau0]  any chance you can provide a patch?, Hello @Patrick Hunt, don't know about the version policy for Zookeeper, but I think the problem is gone with every release version that is not "alpha" anymore. So if you want to avoid that "-alpha" breaks in OSGi, I fear you need to introduce an extra "osgi.version" property, using dots instead of dashes.
Or some string replacement as you suggested, but this depends on the version if it always works (by just replacing dashes with dots).
Here is some discussion on the topic:
http://blog.osgi.org/2011/06/negative-qualifiers.html
Additionally I'm not sure if you can use two dots for the qualifier, like:
3.5.2.alpha.SNAPSHOT

, [~phunt] please look at next comment, the name-link did not work in that comment, sorry, Thanks [~niveau0]. Do you think this is worth addressing then? Personally I was hoping to get it resolved prior to non-alpha/beta so that more folks could try it out. Unfortunately I'm not in a position to develop/test the fix. Would you be able to provide a patch? Looks like ant provides "propertyresource" that can do the replacement: http://stackoverflow.com/questions/1176071/replacing-characters-in-ant-property, Hi All,

Is there any work in progress for this issue.

We are also facing such issue in our code.


, [~sachin_garg] given that there is no one assigned, I'd think that there is no one working on it. If you're willing to provide a patch, it'd greatly help us. would you be ok if I assign it to you?, Did some change in build.xml and repackaged it from alpha to 3.5.1.1
We are testing it . Let me know how i can attached build.xml in this issue., [~sachin_garg] You can contribute by generating and attach a patch to the JIRA.
Patch guideline: https://cwiki.apache.org/confluence/display/ZOOKEEPER/HowToContribute
As for attach a patch, you should be able to attach the patch to the JIRA once you are assigned the role of contributor.
[~fpj] or [~phunt], could you help assigning [~sachin_garg] a contributor role?, Role assigned. Thanks!, 
Here is a patch with a proposed fix. The idea is to segregate out an OSGI compatible version string that gets put into the meta-data. I don't have an OSGI container handy for testing, but will be able to get a customer to test shortly., +1 overall.  GitHub Pull Request  Build
      

    +1 @author.  The patch does not contain any @author tags.

    +0 tests included.  The patch appears to be a documentation patch that doesn't require tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 3.0.1) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-github-pr-build/1738//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-github-pr-build/1738//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-github-pr-build/1738//console

This message is automatically generated., Issue resolved by pull request 531
[https://github.com/apache/zookeeper/pull/531], FAILURE: Integrated in Jenkins build ZooKeeper-trunk #43 (See [https://builds.apache.org/job/ZooKeeper-trunk/43/])
ZOOKEEPER-2317: Ensure that OSGi versions are valid (phunt: rev 1c3aac025528faf8c776f5b715c23c4cc58138b8)
* (edit) build.xml
]