[Fixed the test:

1) delete now uses name rather than path (since create is using seq flag)
this was the main issue previously
2) fail the test if create or delete operations fail
3) don't send messages to the server until connected - otw false positive failure due to queued aysnc op when client times out
, +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12424290/ZOOKEEPER-570.patch
  against trunk revision 833639.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 5 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h8.grid.sp2.yahoo.net/55/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h8.grid.sp2.yahoo.net/55/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h8.grid.sp2.yahoo.net/55/console

This message is automatically generated., same patch as before, however I noticed that there was a serious flaw with the
verification phase, which restarted the quorum. The restart code was wrong,
it caused a new quorum to be started, rather than restarting the existing quorum.

This addresses the original cause of the test failing, plus the original patch's
fix for the delete not being correct (etc...), +1 good job. what a messed up patch!, Committed revision 833938.
, Integrated in ZooKeeper-trunk #528 (See [http://hudson.zones.apache.org/hudson/job/ZooKeeper-trunk/528/])
    , Dropping this from 3.2.2, it's not a bug fix (well, it is a fix to a test) but it does depend on refactored code from
3.3, it's not clear how this would be done (easily/successfully), dropping from 3.2.2, Integrated in ZooKeeper-trunk #545 (See [http://hudson.zones.apache.org/hudson/job/ZooKeeper-trunk/545/])
    . AsyncHammerTest is broken, callbacks need to validate rc parameter
]