[the last time a similar issue came up like this on a different project an unnamed companies legal team pointed out that you don't need to keep updating the date. after a long and heated discussion among engineers with no legal background, we decided to follow advice and just leave the date.

i don't have the legal background to make a definitive statement, but it does make maintenance easier if we don't have to keep updating the year. we can just make it 2008 and not worry about changing it., Cool, [~breed]! :) I have no problem leaving it 2008 nor legal knowledge to make a definitive statement. I am okay with closing this issue tough. Anybody else agrees?, Sounds good to me.

Another approach is to automate things like date update as part of doc gen process as it will never be problem if we keep the copy right up to dates (right?). An example is [Clang's doc gen|https://github.com/llvm-mirror/clang/blob/master/docs/conf.py#L45]. Not sure how practical it is for us as Apache Forrest seems pretty limited in terms of programmability., Yes, Michael, I was going to investigate this approach, that is, to get current year as part of the doc generation. But my first dig into Forrest left me with the same opinion as yours: quite limited in terms of programmability (didn't finish to look it tough).

IMHO, we should open a new ticket to look for alternatives for doc gen. Maybe Sphinx or something else?, bq. we should open a new ticket to look for alternatives for doc gen.
Sounds a big project :) A new JIRA is definitely required as it is out of scope of this one. Might also be good to discuss on dev list as well. It'll be cool if we modernize doc system (after we modernize from svn to git..).
, This page says that the dates in the notice file need to contain the dates reflecting current and past versions of the product:

http://www.apache.org/legal/src-headers.html

The dates refer to the copyright, so I'd expect any copyright reference to reflect those dates. If we are unsure, though, then we need to ask on legal-discuss.
 , agreed, unless there is a conversion script or something, moving to a new system could be quite painful. to be very honest, before moving to a new doc system, I'd rather focus on cleaning up and completing the docs. there are still tbds in the docs... which I personally find rather embarrassing (and also partly guilty)., Yeah, totally agree with you both. Also, as [~fpj] pointed out, it's very important to clean up and complete the docs. I am voluteering to help on this task, btw., I propose to address the current year on this issue (it's a quite trivial patch) and then proceed to a more long term discussion on legal-discuss or similar channels. Wdyt?, Hi [~cnauroth],

As the issue is marked as {{Blocker}}, I am providing a patch to fix the dates. _But, as Ben Reed rightfully commented, we should discuss on the mailing list and with legal oriented people if it is really required to update the copyright each year._

Cheers! :)

PS: the patch applies to trunk and branch-3.5, it's was generated with {{--no-prefix}}, btw.

, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12828304/ZOOKEEPER-2465.patch
  against trunk revision b2a484cfe743116d2531fe5d1e1d78b3960c511e.

    +1 @author.  The patch does not contain any @author tags.

    +0 tests included.  The patch appears to be a documentation patch that doesn't require tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 2.0.3) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3423//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3423//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3423//console

This message is automatically generated., I think the patch missed a change that should be done here:
https://github.com/apache/zookeeper/blob/master/src/docs/src/documentation/skinconf.xml#L87

I believe this is where the copy right notice was generated in *.html - so change here and then regenerate all htmls should do., [~hanm], you right! Uploading a new version of the patch now., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12828341/ZOOKEEPER-2465.2.patch
  against trunk revision b2a484cfe743116d2531fe5d1e1d78b3960c511e.

    +1 @author.  The patch does not contain any @author tags.

    +0 tests included.  The patch appears to be a documentation patch that doesn't require tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 2.0.3) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3426//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3426//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3426//console

This message is automatically generated., new patch LGTM., I am not claiming this is the ultimate answer to that question about whether or not should we update the copyright dates, but looks like the answer is no. :)

http://stackoverflow.com/questions/2390230/do-copyright-dates-need-to-be-updated/2391555#2391555, I actually think we need to update it based on my argument above. If you're unsure, could you ask on legal-discuss, please?, Relevant links:

https://www.law.cornell.edu/uscode/text/17/401

http://mail-archives.apache.org/mod_mbox/www-legal-discuss/201609.mbox/%3cCAC==nPSUtKaU=2e2HKY9nufojS1L9kPMba68HyL8mexLu8EMAw@mail.gmail.com%3e, GitHub user eribeiro opened a pull request:

    https://github.com/apache/zookeeper/pull/126

    ZOOKEEPER-2465: Documentation copyright notice is out of date.

    

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/eribeiro/zookeeper ZOOKEEPER-2465

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/zookeeper/pull/126.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #126
    
----
commit fea03adb512a6414e5b8733416c4bc3ef202d2cc
Author: Edward Ribeiro <edward.ribeiro@gmail.com>
Date:   2016-12-15T17:25:24Z

    ZOOKEEPER-2465: Documentation copyright notice is out of date.

----
, hey [~cnauroth] and [~fpj], sorry taking too much time procrastinating on this issue. According the fruitful discussions we had back in September, 2016 (link provided by Flavio above), I have removed the date from copyright notices on current docs as well as in template XML that generates the HTML and PDFs. See if you agree, please., Github user eribeiro commented on the issue:

    https://github.com/apache/zookeeper/pull/126
  
    @cnauroth and @fpj, this patch applies cleanly for both branch-3.5 and master. I also re-generated the docs to see if the year interval was omitted.
    
    PS: unfortunately, it doesn't apply to branch-3.4 due to many new features and changes, so let me know if you want a variation of this PR targeting branch-3.4 (still unsure how to do this).
, +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12828341/ZOOKEEPER-2465.2.patch
  against trunk revision cd0e323831c8b4cde64976325bfc79bb53cdd9b7.

    +1 @author.  The patch does not contain any @author tags.

    +0 tests included.  The patch appears to be a documentation patch that doesn't require tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 3.0.1) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3550//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3550//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/3550//console

This message is automatically generated., Github user hanm commented on the issue:

    https://github.com/apache/zookeeper/pull/126
  
    @eribeiro should we only change the document sources and generate the html/pdf in separate commit? There was a recent discussion on dev-list about this proposal and most folks leaning towards separation of doc source change and actual doc binary change. We can use ZOOKEEPER-2635 again before 3.5.3 release to regenerate everything.
, Github user eribeiro commented on the issue:

    https://github.com/apache/zookeeper/pull/126
  
    @hanm Hey Michael, I was absent last week so I delayed a bit to answer this question, excuse me.
    
    Yup, I am aware of the discussion but I didn't have time to catch up with it until I leave for holidays (shame on me). What do you suggest is the best approach regarding this issue? I can close this PR, no problem. :smiley: 
, Github user hanm commented on the issue:

    https://github.com/apache/zookeeper/pull/126
  
    @eribeiro I am thinking we can just change src/docs/src/documentation/skinconf.xml and leave other files in your original patch intact. What do you think?
, Github user eribeiro commented on the issue:

    https://github.com/apache/zookeeper/pull/126
  
    +1. Gonna change the PR. Thx!
, Github user eribeiro commented on the issue:

    https://github.com/apache/zookeeper/pull/126
  
    Done. 👍 
, Github user eribeiro closed the pull request at:

    https://github.com/apache/zookeeper/pull/126
, GitHub user eribeiro opened a pull request:

    https://github.com/apache/zookeeper/pull/138

    ZOOKEEPER-2465: Documentation copyright notice is out of date.

    

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/eribeiro/zookeeper ZOOKEEPER-2465

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/zookeeper/pull/138.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #138
    
----
commit c5a2fbea7351444f037bad9052d83f826cddf83b
Author: Edward Ribeiro <edward.ribeiro@gmail.com>
Date:   2016-12-28T18:31:27Z

    ZOOKEEPER-2465: Documentation copyright notice is out of date.

----
, Github user eribeiro commented on the issue:

    https://github.com/apache/zookeeper/pull/138
  
    @hanm I created a new PR for branch-3.4 (also applies to branch-3.5 and master) changing only the XML files as you have suggested on the previous PR.
, Github user asfgit closed the pull request at:

    https://github.com/apache/zookeeper/pull/138
, Issue resolved by pull request 138
[https://github.com/apache/zookeeper/pull/138], Thanks [~eribeiro] for driving and fixing this issue., SUCCESS: Integrated in Jenkins build ZooKeeper-trunk #3218 (See [https://builds.apache.org/job/ZooKeeper-trunk/3218/])
ZOOKEEPER-2465: Documentation copyright notice is out of date. (hanm: rev 670bb5d5ecc2d6a94bf24effcc7bf497e8778cc5)
* (edit) src/docs/src/documentation/skinconf.xml
]