[Vishal, would it be possible for you to submit this as a patch? see:
http://wiki.apache.org/hadoop/ZooKeeper/HowToContribute, Request for review.

There is probably a better way to handle backlashes in Windows. I tried a use properties (file.separator etc), but didn't work. So finally decided to do it the dumb way. Replace "\\" with "/". If we done replace backslash, then java considers it as escape sequence and essentially the backslash gets removed.

Please, feel free to drop the patch If there is a better way to handle it., Thanks Vishal, appreciated!

Btw, once you have a patch that you think is ready, just go ahead and "submit patch" on the left hand side (link).
This will run the patch through the automated tests and advance the workflow (so the committers will review,
perhaps provide feedback if changes need to be made, then eventually commit).

Thanks!, +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12442606/ZOOKEEPER-734.patch
  against trunk revision 936624.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 6 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h1.grid.sp2.yahoo.net/69/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h1.grid.sp2.yahoo.net/69/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h1.grid.sp2.yahoo.net/69/console

This message is automatically generated., +1 thanks Vishal!]