[GitHub user mfenes opened a pull request:

    https://github.com/apache/zookeeper/pull/391

    ZOOKEEPER-2727: WARN and stacktrace for normally closed socket

    
    ZOOKEEPER-2727: WARN and stacktrace for normally closed socket
    
    Log level reduced to info for EndOfStreamException as asked in the Jira.
    Logging stack trace for EndOfStreamException has been already moved to debug level in an earlier commit:
    https://github.com/apache/zookeeper/commit/34665cd5bdbcb6aaeecb6b204028ef1ffab9f2d8
    


You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/mfenes/zookeeper ZOOKEEPER-2727

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/zookeeper/pull/391.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #391
    
----
commit ab3b6a0de3442fbf782984c0b35de52c76b0974d
Author: Mark Fenes <mfenes@cloudera.com>
Date:   2017-10-04T21:13:26Z

    ZOOKEEPER-2727: WARN and stacktrace for normally closed socket

----
, +1 overall.  GitHub Pull Request  Build
      

    +1 @author.  The patch does not contain any @author tags.

    +0 tests included.  The patch appears to be a documentation patch that doesn't require tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 3.0.1) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-github-pr-build/1082//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-github-pr-build/1082//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-github-pr-build/1082//console

This message is automatically generated., Github user phunt commented on the issue:

    https://github.com/apache/zookeeper/pull/391
  
    I personally am not super excited about this change and would be -1. We log at this level for a reason - it's very difficult to debug user environments, esp in production where an issue may only happen once and be hard to reproduce. Many users run at WARN level and INFO would be lost.
, Github user dernasherbrezon commented on the issue:

    https://github.com/apache/zookeeper/pull/391
  
    Hey @phunt, using WARN log level for debugging sounds weird, don't you think? Especially when special log level DEBUG exists. And stacktrace already logged in DEBUG.
, Github user phunt commented on the issue:

    https://github.com/apache/zookeeper/pull/391
  
    See my comment above. Additionally I would not have approved of the other change mentioned (moving that to debug).
, Github user mfenes closed the pull request at:

    https://github.com/apache/zookeeper/pull/391
]