[GitHub user bitgaoshu opened a pull request:

    https://github.com/apache/zookeeper/pull/351

    ZOOKEEPER-915: Error get propagated back to the client

    If an error in sync() processing happens at the leader (SESSION_MOVED for example), they are not propagated back to the client. And use QuorumPacket::Zxid indicates  the exception happens or not.

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/bitgaoshu/zookeeper ZOOKEEPER-915

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/zookeeper/pull/351.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #351
    
----
commit c4170cbe16cbccc9f6f5292528b6fd7650bfa32b
Author: bitgaoshu <bitgaoshu@gmail.com>
Date:   2017-08-30T03:17:41Z

    ZOOKEEPER-915: Errors that happen during sync() processing at the leader get propagated back to the client.

----
, +1 overall.  GitHub Pull Request  Build
      

    +1 @author.  The patch does not contain any @author tags.

    +0 tests included.  The patch appears to be a documentation patch that doesn't require tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 3.0.1) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-github-pr-build/980//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-github-pr-build/980//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-github-pr-build/980//console

This message is automatically generated.]