[-1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12754001/ZOOKEEPER-2265-01.patch
  against trunk revision 1698058.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 2.0.3) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2854//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2854//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2854//console

This message is automatically generated., Thanks for the patch [~arshad.mohammad], though -1.

Without create-cppunit-configure, package builders (i.e.: RPMs) wouldn't be able to build the C library from the tarball (i.e.: no configure script).

If anything, we could make ant tar fail with a more obvious message if you are missing autoreconf. But I think tarballs should always allow you to build the C library without having to install autoreconf... (that step definitely belongs to the building the tarball step)., Thanks [~rgs] for looking into this.
Can we add some flag like {{skip.cppunit.test}} to skip cppunit configuration and cppunit test execution., Thanks [~rgs] for looking into this.
Can we add some flag like {{skip.cppunit.test}} to skip cppunit configuration and cppunit test execution., Cancelling the patch based on recent comments (need to use different approach)]