[-1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12613061/ZOOKEEPER-1812.patch
  against trunk revision 1539529.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1758//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1758//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1758//console

This message is automatically generated., We shouldn't fix this issue with a patch to zooinspector, this is really and issue with the zk client code. I see ZOOKEEPER-1057 which sounds related, however that's c client and not java. I thought I had seen something similar reported against just but I can't find it. (although there is ZOOKEEPER-1734/ZOOKEEPER-1576)

I think we need to address this as an issue in the client implementation., I'm not sure about this, all the other JIRAs are about not being able to connect to the ensemble when the connection to 1 node fails.
In our case there is only 1 ZooKeeper server., Regardless though I think it's an issue that needs to be fixed in the client., The way it's handled right now in ZooInspectorManagerImpl just cannot work : the connection is attempted only if this.zooKeeper is null.
The first time around, this.zooKeeper is null, so it creates a new ZooKeeper client and tries to connect, which is good.
The problem is that it never resets this.zooKeeper to null so we never enter the <if> again., Ok, makes sense. Committed to 3.4.6/trunk. Thanks Benjamin!, Thanks Patrick, SUCCESS: Integrated in ZooKeeper-trunk #2118 (See [https://builds.apache.org/job/ZooKeeper-trunk/2118/])
ZOOKEEPER-1812. ZooInspector reconnection always fails if first connection fails (Benjamin Jaton via phunt) (phunt: http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1540961)
* /zookeeper/trunk/CHANGES.txt
* /zookeeper/trunk/src/contrib/zooinspector/src/java/org/apache/zookeeper/inspector/manager/ZooInspectorManagerImpl.java
, Closing issues after releasing 3.4.6.]