[Added license headers to all files. Sorry about missing this in the first place. , +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12449427/ZOOKEEPER-814.patch
  against trunk revision 963957.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 4 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h1.grid.sp2.yahoo.net/143/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h1.grid.sp2.yahoo.net/143/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h1.grid.sp2.yahoo.net/143/console

This message is automatically generated., +1 the patch looks good. 

Andrei,
  I think the monitoring tools and scripts are quite useful, though it would have been great to have forrest docs for all the plugins like ganglia/others, so that we can publish them as part of the release documentation!!  Please consider adding forrest documentation (it should not be hard at all)!!! It would be really good to have admin documentation link to these forrest docs in case they want to use it!

Having all the documentation as forrest docs and availalbe on the documentation website (as part of release) will highly increase the adoption of such a plugin!

, I just committed this.

thanks andrei!, thanks Mahadev! , Integrated in ZooKeeper-trunk #887 (See [http://hudson.zones.apache.org/hudson/job/ZooKeeper-trunk/887/])
    ZOOKEEPER-814. monitoring scripts are missing apache license headers (andrei savu via mahadev)
]