[I've modified the build.xml, replacing the previous svnant task with the same functionality using svntask (http://code.google.com/p/svntask/).  Svntask is apache-licensed, however, it relies on svnkit, which has an odd dual license (http://svnkit.com/licensing.html).  I'm not sure if this will create a licensing issue.  Not reflected in the patch is deleting the svnant directory in src/java/lib/ and adding a new directory, src/java/lib/svntask, that includes svnkit.jar and svntask.jar, obtained from the two sites above.  

Hope this is useful., patch removes svnant and adds svntask to build script, My reading of the svnkit license would make it incompatible with the Apache license. If it is incompatible, you can not depend on it or distribute it as part of Zookeeper. See http://www.apache.org/legal/3party.html . If there isn't away to avoid svnkit or fix svnant, you can ask legal about the TMate license. In my opinion, the clause that will be fatal is:

{quote}
  * Redistribution in any form without redistributing source code for software 
      that uses SVNKit is possible only when such redistribution is explictly permitted 
      by TMate Software. Please, contact TMate Software at support@svnkit.com to 
      get such permission.
{quote}

which is effectively a GPL-like viral clause with an escape clause that lets TMate give/sell exceptions., I'm +1 on this change, -1 on using svntask re the issues Owen mentioned.

Jakob -- notice that Hadoop core does something very similar, however they use a script, could you reuse this rather than relying on a third party library?

http://svn.apache.org/repos/asf/hadoop/core/trunk/build.xml
    <exec executable="sh">
       <arg line="src/saveVersion.sh ${version}"/>
    </exec>
http://svn.apache.org/repos/asf/hadoop/core/trunk/src/saveVersion.sh

, Basically, the saveVersion script creates a Java source file that defines a package level attribute. There is a utility class that looks for the attribute and uses it if it is available. I took that approach so that the project compiles and runs, even if the script was not run to generate the version information.
, I'd like to point out that the hadoop's solution is non-portable. The <exec> task will fail on Windows -- it won't be able to find the executable "sh.exe". By the way, this portability issue was one of the reasons we had to use svnant., > The <exec> task will fail on Windows - it won't be able to find the executable "sh.exe".

Hadoop requires cygwin on Windows., And the script *does* work on Windows, provided you have cygwin installed., We don't want to add dependency on cygwin for zookeeper.

What other options are available? In ant there is no way to determine we are on windows and run another script?
, Yes, in the ant exec task you can specify which os the command should run on, so we should be able to write two separate exec tasks: one for win, one for *nix.  I'm writing the script for linux now/modifying the buld.xml and will upload the patch in a bit.  I can look at how to do it in windows as well, but I'm not sure how to get the info without a good scripting environment.  Sorry if it was incorrect to upload the patch that required the bad license. -jg
, No worries Jakob, we appreciate your contributions and willingness to work with the community! Honestly I didn't know myself until Owen mentioned it. (that's why we have parental oversight. ;-) )  Regards., I've re-done the patch to use a shell script to obtain the revision number, ala Hadoop's approach.  This works on *nix machines, maintains functionality, removes the reliance on svnant (which can be deleted from the lib directory) and introduces no new dependencies.  

As far as Windows machines go, the operating system's poor default scripting environment makes this rather easy task pretty difficult.  However, it would be easy enough to do in MS Powershell, and I don't think it's unreasonable to expect developers' machines to have that tool installed at this point.  So I could certainly write up an equivalent script in Powershell, create another exec task targeted to Windows, and we'd be back to good without introducing a cygwin dependency (just a Powershell one).  One unknown: I don't know how ant would identify a Windows machine with cygwin but without Powershell.  Let me know if this sounds reasonable.  If so, I can explore that option.

Hope this is useful. -jg, I noticed this in the ant exec manpage:

Cygwin Users

The <exec> task will not understand paths such as /bin/sh for the executable parameter. This is because the Java VM in which Ant is running is a standard Windows executable and is not aware of the Cygwin environment (i.e., doesn't load cygwin1.dll). The only work-around for this is to compile a JVM under Cygwin (at your own risk). See for instance sun jdk 6 build instructions for cygwin. 

I created a simple build.xml and regardless of whether I run under cmd or cygwin bash I still get "Windows XP" as the os.name.

What about Mac users, are they covered as well?, I'm against (-1) adding any new dependencies... eg powershell.

Andrew -- would you be able to provide a working .bat file?

Jakob -- FYI we are following a convention for patch file naming such as "ZOOKEEPER-110.patch" where the file name is the ID of the jira issue. If you update a patch just re-upload with the same name, jira maintains a history of files with the same name. (please remove the old/invalid patches). Among other things this helps reviewers to keep track of the various patches. Thanks., renamed patch, deleted old version., OK, I've coded up a DOS batch file that exactly replicates the shell script using only Windows built-in commands, so this fixes the original problem I identified, removes the svnant dependency, adds no new dependencies and will work on Windows natively.  Huzzah!

I tested it on my OSX, Ubuntu and XP machines and they all worked.

Again, the patch doesn't reflect deleting the svnant directory and contents.
-jg,  +1  I'll commit the patch and delete the svnant directory and its contents., can we add apache headers to .sh files? all new files need apache headers .... , Added Apache liecense header to both new files., It turns out that the original patch used the  <exec> task attribute "osfamily" that is only available since ant 1.7. This patch ensures that build.xml is compatible with pre-1.7 versions. The apache license headers are also included. Please review. Thanks!, Commited the patch, deleted the svnant directory. Thanks, Jakob!, Integrated in ZooKeeper-trunk #58 (See [http://hudson.zones.apache.org/hudson/job/ZooKeeper-trunk/58/]), 3.0.0 has been released, closing issues.]