[-1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12768596/ZOOKEEPER-2302-01.patch
  against trunk revision 1709293.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 8 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 2.0.3) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2925//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2925//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2925//console

This message is automatically generated., No test case failed. Only one test case skipped. This is an example of wrong feedback. After ZOOKEEPER-2285 is committed we will not -1 in these cases., This patch looks good, but please submit one for trunk and 3.4 as well., Thanks [~fpj] for your comment.
# Patch ZOOKEEPER-2302-01.patch gets applied successfully on both trunk and branch-3.5. So  ZOOKEEPER-2302-01.patch is for trunk as well as  for branch-3.5
# The files, being modified in this path, were added recently and are not part of branch-3.4 code. Therefore no patch required for branch-3.4, +1, thanks for the patch.
Trunk: Committed revision 1711151.
3.5 branch: Committed revision 1711152., FAILURE: Integrated in ZooKeeper-trunk #2804 (See [https://builds.apache.org/job/ZooKeeper-trunk/2804/])
ZOOKEEPER-2302: Some test cases are not running because wrongly named (Arshad Mohammad via fpj) (fpj: [http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1711151])
* trunk/CHANGES.txt
* trunk/src/java/test/org/apache/zookeeper/server/quorum/QuorumPeerConfigTest.java
* trunk/src/java/test/org/apache/zookeeper/server/quorum/RemotePeerBeanTest.java
* trunk/src/java/test/org/apache/zookeeper/server/quorum/TestQuorumPeerConfig.java
* trunk/src/java/test/org/apache/zookeeper/server/quorum/TestRemotePeerBean.java
]