[This patch moves ClientBase to the test package and eliminates the dependency of LocalBookkeeper class to ClientBase (LocalBookkeeper is a class for running BookKeeper manually in a single computer)., Re-trying hudson., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12427900/ZOOKEEPER-623.patch
  against trunk revision 889848.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 18 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h8.grid.sp2.yahoo.net/86/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h8.grid.sp2.yahoo.net/86/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: http://hudson.zones.apache.org/hudson/job/Zookeeper-Patch-h8.grid.sp2.yahoo.net/86/console

This message is automatically generated., flavio,
  Is this ClientBase file the same as in top level src/java/test? If yes, why are we not using that instead of copying it over to bookkeeper directory? We can just add a dependency on ant compile-test to be run from top level before you can run the ant test in bookkeeper and add build/test/classes to the classpath? no? , It is a good observation, Mahadev. I'm uploading a new patch that uses the zookeeper version of the class. This patch, however, does not compile because we need to modify bookeeper/build.xml as you suggest. I haven't had a chance to look into it so if you know exactly what to modify, please either make the modification yourself or let me know where it is., Committed revision 891809., makes bookkeeper tests work again., +1 great patch ben!!! , updated to not try to resolve ClientBase and print a better message., reopening the issue., Integrated in ZooKeeper-trunk #632 (See [http://hudson.zones.apache.org/hudson/job/ZooKeeper-trunk/632/])
    , Integrated in ZooKeeper-trunk #633 (See [http://hudson.zones.apache.org/hudson/job/ZooKeeper-trunk/633/])
    . ClientBase in bookkeeper.util requires junit
, Has been integrated into trunk.]