[In StaticHostProvider, use the already resolved address which already contains the hostname and host address when available.  This will prevent the reverse dns lookup in ClientCnxn
, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12571025/ZOOKEEPER-1652.patch
  against trunk revision 1448007.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1410//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1410//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1410//console

This message is automatically generated., +1 nice fix, I believe this addresses the same issue as ZOOKEEPER-1666, but will work for 3.4.6. So I'm going to use this for 3.4.6, but not trunk, which was resolved with the other patch., Actually, when I apply this change with the test for ZOOKEEPER-1666, that test fails. [~georgecao], [~sbridges], want to take a look?, Elected to make a patch for ZOOKEEPER-1666 that makes that work on 3.4.6. Please look there for that, and leave comments., I am using 3.4.6 and I still have slow 5 seconds connections.

What about clone ZOOKEEPER-1661? Is it ok that we have this item closed and clone still open?

Debugging shows that root cause is definitely near code shown in item description.
Still not sure what exactly causes the problem in my case. 
But! As a quick workaround enlisting all ZK nodes in hosts file definitely helps., Hi,

I have a question about this issue, in which version is this resolved? Because there is no "Fixed version" in this ticket.

Thanks, Hello there, This issue duplicates ZOOKEEPER-1666, which has been fixed in 3.4.6 and 3.5.0. ]