[use forrest.bat instead of forrest. , -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12754638/ZOOKEEPER-2268-01.patch
  against trunk revision 1701505.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 2.0.3) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2862//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2862//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/2862//console

This message is automatically generated., Test failures are not related to this patch, +1 for the patch.

I applied the patch locally and verified the docs build on both Mac and Windows, using trunk and branch-3.4.  I discovered an unrelated problem with the docs build on branch-3.5.  The releasenotes.xml file is missing.  I'm going to start a separate thread on that.

I plan to commit this to trunk, branch-3.5 and branch-3.4 later this week, unless any other committers have comments.
, I have committed this to trunk, branch-3.5 and branch-3.4.  [~arshad.mohammad], thank you for contributing this patch., FAILURE: Integrated in ZooKeeper-trunk #2802 (See [https://builds.apache.org/job/ZooKeeper-trunk/2802/])
ZOOKEEPER-2268: Zookeeper doc creation fails on windows (Arshad Mohammad via cnauroth) (cnauroth: [http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1706628])
* trunk/CHANGES.txt
* trunk/build.xml
, Thanks [~cnauroth] for committing the patch.]