[Attaching a patch, which
 - adds a .gitattributes file
 - fixes all line endings to be LF 

Credit goes to Raja Aluri for the patch. , +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12619189/zookeeper-1847_v1.patch
  against trunk revision 1551624.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 28 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1846//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1846//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-ZOOKEEPER-Build/1846//console

This message is automatically generated., I would love to fix this as well. However, it is going to get reintroduce as new patch being accepted. 

It would be better to invest effort in enforcing this on a new patch which I don't know how to do that with the current workflow, Yeah, -1 to doing this as a whole-scale change to the whole repo., bq. Yeah, -1 to doing this as a whole-scale change to the whole repo.
I fail to understand your reasoning. Do you suggest we do this file by file? I think we have to normalize on line endings and fix the ones in the repo. 
If you want to enforce standard line endings, the best practice is to enforce it from the source control. The gitattributes file introduced in this patch enforces this, and the patch fixes the endings to that a fresh checkout will contain normalized line endings which will ensure seamless setup in linux or windows dev environments. , Duplicate of ZOOKEEPER-1575 and ZOOKEEPER-1574]