[This is the pull request:
https://github.com/apache/storm/pull/336
, Attached a simple design document., Github user shanyu commented on the pull request:

    https://github.com/apache/storm/pull/336#issuecomment-65887725
  
    @revans2 Yes, this is the JIRA:
    https://issues.apache.org/jira/browse/STORM-583
    A design document is also attached to the JIRA. Thanks!
, Github user lazyval commented on the pull request:

    https://github.com/apache/storm/pull/336#issuecomment-66102829
  
    @shanyu it might be a good idea to put *STORM-583* in this PR title, so jira's github bot and people could relate issue and PR to each other. 
, Github user ptgoetz commented on a diff in the pull request:

    https://github.com/apache/storm/pull/336#discussion_r21771427
  
    --- Diff: external/storm-eventhubs/pom.xml ---
    @@ -0,0 +1,107 @@
    +<?xml version="1.0" encoding="UTF-8"?>
    --- End diff --
    
    Need apache license header.
, Github user ptgoetz commented on the pull request:

    https://github.com/apache/storm/pull/336#issuecomment-66832916
  
    I would support pulling this in, but we need additional committers to approve it, and one or more to volunteer as sponsor(s).
    
    As @revans2 mentioned, this is a sizable amount of code, and effectively amounts to a code donation from Microsoft. As such it needs to go through the IP clearance process before it can be merged.
    
    If there are enough +1 votes from committers (an no vetoes), I will initiate the IP clearance process.
, Github user shanyu commented on a diff in the pull request:

    https://github.com/apache/storm/pull/336#discussion_r22196840
  
    --- Diff: external/storm-eventhubs/pom.xml ---
    @@ -0,0 +1,107 @@
    +<?xml version="1.0" encoding="UTF-8"?>
    --- End diff --
    
    Thanks @ptgoetz ！This is fixed.
, Github user sasincj commented on the pull request:

    https://github.com/apache/storm/pull/336#issuecomment-71170550
  
    @ptgoetz Is storm-eventhubs available to use?
, Github user harshach commented on the pull request:

    https://github.com/apache/storm/pull/336#issuecomment-71211394
  
    @sasincj its in the process of getting into storm/external. But you can use by going into the shanyu's branch directly
, Github user harshach commented on the pull request:

    https://github.com/apache/storm/pull/336#issuecomment-71211421
  
    @ptgoetz  @revans2  I am +1 on merging this in
, Github user revans2 commented on the pull request:

    https://github.com/apache/storm/pull/336#issuecomment-71215853
  
    @sasincj 
    I don't understand the EventHub system well enough to really be able to judge if the code is functioning properly in corner cases, etc.  I get at a high level what it does (http://azure.microsoft.com/en-us/services/event-hubs/) but I have never used it myself.  The code itself looks OK, but I am not comfortable voting on it either way with my current knowledge.  
    
    I am a bit nervous about pulling this in as we don't have a very good way to test it beyond the unit tests. EventHubs is a Microsoft Azure specific system.  I cannot spin up my own instance of it to validate that the code is doing what I expect prior to a release.  Although it may be a bit painful, I can do that for Kafka, Redis, HDFS, and HBase integration that we have accepted in so far.  That doesn't mean we cannot/should not pull it in.  To me it mostly means that we need more assurances and support prior to doing so. 
, Github user sasincj commented on the pull request:

    https://github.com/apache/storm/pull/336#issuecomment-71300125
  
    @revans2 Without storm-eventhubs, Developers who are using storm with eventhub has to write their own Spout to receive the events. So I thought it would save developer's time when we have it as storm's add-on. For now I'll use it from @shanyu 's branch and let you know my experience...
, Github user ptgoetz commented on the pull request:

    https://github.com/apache/storm/pull/336#issuecomment-71903553
  
    +1 for accepting this as a code donation from Microsoft and moving forward with the IP clearance process.
    
    COMMTTERS please note that this must not be merged until the IP clearance process is completed successfully. I am working with @shanyu to complete those requirements.
, Github user ptgoetz commented on the pull request:

    https://github.com/apache/storm/pull/336#issuecomment-71907274
  
    @shanyu Also, once the source code tarball for IP clearance has been created, please don't add any commits to this pull request. Any necessary modifications can take place later after IP clearance is complete.
, Github user shanyu commented on the pull request:

    https://github.com/apache/storm/pull/336#issuecomment-71946467
  
    @ptgoetz Got it. I will keep the pull request intact during the IP clearance phase. Thanks a lot!
, Github user shanyu commented on the pull request:

    https://github.com/apache/storm/pull/336#issuecomment-78383657
  
    @ptgoetz It has been a while, is the IP clearance done? Thx
, Attach code for IP clearance., IP Clearance form submitted:

http://incubator.apache.org/ip-clearance/storm-azure-eventhubs.html, IP Clearance has completed:

http://mail-archives.apache.org/mod_mbox/incubator-general/201504.mbox/%3cC1F10B96-87C4-4DD8-8433-C4DFA013E9DD@apache.org%3e, +1 for merging this and I'm willing to act as a committer-sponsor.

For future work, I would like to see further documentation regarding deploying/testing, but that can be handled as a separate JIRA., Github user asfgit closed the pull request at:

    https://github.com/apache/storm/pull/336
, Github user ptgoetz commented on the pull request:

    https://github.com/apache/storm/pull/336#issuecomment-96056354
  
    Thanks @shanyu. I merged this into master.
]