[GitHub user miguno opened a pull request:

    https://github.com/apache/storm/pull/278

    STORM-488: Exit with 254 error code if storm CLI is run with unknown command

    This change follows the existing semantics when the `storm` CLI tool is invoked without _any_ parameters.
    
    With this change, whenever the user tries to run `storm <cmd>` with an unknown command the `storm` script will print the usage help (existing behavior) AND then exit with a 254 error code.
    
    I decided not to re-use the 255 error code, which is returned by the `storm` CLI tool when being invoked without any parameters.  Having two separate error codes allows downstream applications (including Ansible, Puppet) to better understand what went wrong and react accordingly -- e.g. giving the user more meaningful feedback.

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/miguno/storm STORM-488

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/storm/pull/278.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #278
    
----
commit b3528c7d9bcb5a04bc5bac5f7ea571f0c8ea0984
Author: Michael G. Noll <mnoll@verisign.com>
Date:   2014-10-02T08:02:55Z

    STORM-488: Exit with 254 error code if storm CLI is run with unknown command

----
, Github user harshach commented on the pull request:

    https://github.com/apache/storm/pull/278#issuecomment-57908996
  
    +1
, Github user miguno commented on the pull request:

    https://github.com/apache/storm/pull/278#issuecomment-58000787
  
    Thanks, @harshach.  I'll wait one or two days more so that other people can voice their opinion if needed.
, Github user lloydchang commented on the pull request:

    https://github.com/apache/storm/pull/278#issuecomment-58001824
  
    :+1:
, Github user HeartSaVioR commented on the pull request:

    https://github.com/apache/storm/pull/278#issuecomment-58007995
  
    +1 (non binding)
, Github user ptgoetz commented on the pull request:

    https://github.com/apache/storm/pull/278#issuecomment-58240854
  
    +1
, Github user asfgit closed the pull request at:

    https://github.com/apache/storm/pull/278
, Github user miguno commented on the pull request:

    https://github.com/apache/storm/pull/278#issuecomment-58267519
  
    Thanks for merging, @ptgoetz !
]