[though changing the syslog setting in cluster.xml immediateFlush="false" => "true" seems to fix the issue
Description from log4j2 website:
immediateFlush - When set to true - the default, each write will be followed by a flush. This will guarantee the data is written to disk but could impact performance.
, GitHub user jerrypeng opened a pull request:

    https://github.com/apache/storm/pull/1068

    [STORM-1519] - Storm syslog logging not confirming to RFC5426 3.1

    

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/jerrypeng/storm STORM-1519

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/storm/pull/1068.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #1068
    
----

----
, Github user erikdw commented on the pull request:

    https://github.com/apache/storm/pull/1068#issuecomment-178916497
  
    This seems like it could have a *major* impact on performance, no?   It's not clear to me what is so horrible in STORM-1519 that we need to force a disk write for every single log message.
, Github user jerrypeng commented on the pull request:

    https://github.com/apache/storm/pull/1068#issuecomment-178962569
  
    Well this only changes that config for the syslog appender.  The syslog appender writes data to a network socket.  This doesn't change the other appenders that will actually write to disk.
, Github user jerrypeng commented on the pull request:

    https://github.com/apache/storm/pull/1068#issuecomment-178963442
  
    If a user has a log parser that adheres to RFC5426, then how log4j2 is configured to write to syslog is a problem. 
, Github user erikdw commented on the pull request:

    https://github.com/apache/storm/pull/1068#issuecomment-178964338
  
    @jerrypeng : ahhh.... thanks for the extra info, both points make sense. To be pedantic, that detail woulda been cool in the (empty :wink:) description.
, Github user jerrypeng commented on the pull request:

    https://github.com/apache/storm/pull/1068#issuecomment-178964694
  
    @erikdw the jira i filed contained more detailed information
    
    https://issues.apache.org/jira/browse/STORM-1519
, Github user erikdw commented on the pull request:

    https://github.com/apache/storm/pull/1068#issuecomment-178969462
  
    @jerrypeng : heh, yep, I read the whole bug before my first reply.  And it had this note:
    * "immediateFlush - When set to true - the default, each write will be followed by a flush. This will guarantee the data is written to disk but could impact performance."
    
    And *that* is what scared me into replying actually!   The log4j2 docs should probably just be updated to "written to disk or network".
, Github user revans2 commented on the pull request:

    https://github.com/apache/storm/pull/1068#issuecomment-182554794
  
    The change looks fine to me +1.
    
    @erikdw do you have any other concerns about this?
, Github user erikdw commented on the pull request:

    https://github.com/apache/storm/pull/1068#issuecomment-182593254
  
    @revans2 : not at all!  I just misunderstood the implications, totally my bad.
, Github user asfgit closed the pull request at:

    https://github.com/apache/storm/pull/1068
, Thanks [~jerrypeng],

I merged this into master and 1.x-branch]