[Now I can give an easy fix just to counter this specific scenario, I do not like the whole flow involved in this debugging utility. I send a jstack request and then I have to go to files section to wait for jstack dump to appear (which in itself is not intuitive). And the requests are being routed through zookeeper, which leads to error scenarios like these. 

These calls should be inline and synchronous for a better user experience. One option is to have an admin port in worker. jstack, jmap requests can be sent to this admin port. Downside is that for each worker, two ports need to be configured. 

Another option is to have an admin port in supervisor itself. Supervisor can execute the jstack, jmap commands in a separate process, read the results/errors and return them back to user in the UI. 

Any thoughts/suggestions?, Another problem is handling retention for the dumps being created on disk, was pondering over this and logviewer seems like the right place to do worker profiling/debugging. logviewer can be used as an admin tool to take thread stacks, heap dumps etc. There is no need to configure additional ports on supervisor, worker etc. zookeeper need not be used at all for debugging. Debugging requests can be served inline synchronously rather than through files on system. 
[~ptgoetz] [~revans2] Fix for debugging/profiling is an important part of 1.0 stabilization. If the approach mentioned above sounds good, I can put up a patch for this. , I'm not totally sure what you are proposing.  Do you want the logviewer to expose a REST API for taking the JStack and we would remove the corresponding thrift API?  That does seem simpler then what we have now.  [~kishorvpatil] do you see any issues with a change like this?  My only concern is that it prevents a command line tool from doing this, but I don't think that is too critical., 
We can change logviewer to expose the REST API to create jstack - as it might work. Even though it is overhead of refactoring portions of logic supervisor uses to find which pid to launch the jstack command. 
Not all actions are synchronous - run profiler for next 10 minutes ( needs to remember to shut it down/ take profiler dump before shutting down the profiler.)
It may good advice to do that for other profiling actions such as run profiler ( which requires remembering how long to run and stop etc. - we are using Zookeeper for that.). Also, it is useful to have UI route all pending actions via ZK to supervisor - so that multiple users requesting for same action - does not reflect in multiple actions being taken. Currently, supervisor kind of merged those to single action for profiling.

[~abhishek.agarwal],
I don't see any special advantage to avoiding ZK here. Can you please elaborate if I am missing something?, [~revans2] Yes, your assumption is correct. Also we can build a command line tool over rest API, if needed.

[~kishorvpatil] The disadvantage I see is that it is very important to clear an action in zookeeper so that it is not executed again. However such scenarios can be identified and fixed. My primary concern is the asynchronous nature of call and viewing the output through a file dump. If I submit a request such as jstack, jmap on UI, I as a user expect an immediate output on the web page itself. If logviewer consumes these requests, it can serve the request synchronously without storing in a file. Additionally there is no mechanism of cleaning up file dumps and for a user it is difficult to know which dump corresponds to his jstack request. By serving the output directly on page solves that problem.

If multiple users are submitting heap dump requests, we can chose to do that in different threads. 
Other concerns coming out in doing it synchronously through logviewer
1. pid discovery - logviewer has access to same configuration as supervisor. Supervisor reads worker-artifcats directory to read the pid. Logviewer can do the same as long as it knows the worker-id
2. profiler actions - It is inherently asynchronous in nature. We can move away from time-bound stop to manual stop. User can start the profiler and manually stop the profiler (similar to debug/stop-debug we have for topologies). 
What do you think? , [~abhishek.agarwal] It looks like a good option to turn this into a synchronous mode. I would be watchful during implementation 
- for multitenant, these operations needs to be launched as user. 
- the heap-dump like actions in synchronous mode could take long time - due to heapsize and + time to download dump results back to browser in synchronous mode.

Currently, supervisor relaunches the profiler ( in case of worker restarts..) but that feature would seize to exist ( as supervisor uses ZK to remember launching profilers for that worker)

The idea otherwise sounds good., Thanks Kishor for your insights. We may also disallow operations if user is not same as which topology process is running with. I will first start with jstack, heap and restart worker command. These also happen to be the utilities which are enabled by default. For moving profiler, I will file a separate JIRA. I am fine with executing profiler through the existing flow. 

Also currently the profile-action is not removed if the command exit code is non-zero. I will remove that condition so that supervisor doesn't repeat a command forever. , GitHub user abhishekagarwal87 opened a pull request:

    https://github.com/apache/storm/pull/1138

    STORM-1542: Remove profile action retry in case of non-zero exit code

    This fixes the infinite retry problem in profiling. As a follow up on the discussion in STORM-1542, I have created  STORM-1568. 

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/abhishekagarwal87/storm logviewer

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/storm/pull/1138.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #1138
    
----
commit 86e9254b1f7180275c9708dffe13a8c7fa88e16b
Author: Abhishek Agarwal <abhishek.agarwal@inmobi.com>
Date:   2016-02-22T12:39:25Z

    STORM-1542: Remove profile action retry in case of non-zero exit code

----
, Github user abhishekagarwal87 commented on the pull request:

    https://github.com/apache/storm/pull/1138#issuecomment-188688560
  
    @kishorvpatil can you review this? 
, Github user kishorvpatil commented on the pull request:

    https://github.com/apache/storm/pull/1138#issuecomment-188963245
  
    LGTM. +1. 

, Github user HeartSaVioR commented on a diff in the pull request:

    https://github.com/apache/storm/pull/1138#discussion_r54189546
  
    --- Diff: bin/flight.bash ---
    @@ -15,7 +15,7 @@
     # See the License for the specific language governing permissions and
     # limitations under the License.
     
    -JDKPATH="/home/y/share/yjava_jdk/java"
    --- End diff --
    
    OMG... It shouldn't be included...
, Github user HeartSaVioR commented on the pull request:

    https://github.com/apache/storm/pull/1138#issuecomment-189054809
  
    +1
, Github user asfgit closed the pull request at:

    https://github.com/apache/storm/pull/1138
, Thanks [~abhishek.agarwal],
I merged into master and 1.x respectively.]