[Compiled topology refers SqlFunctions on calcite-core which also depends on several sub-projects like avatica, linq4j, and so on. 
I asked dev group of Calcite to how others handle such things (there seems no user group on Calcite) and would like to see suggested answers., It also needs to copy dependencies (sure transitive too) to dist vs assembly (and shade).
Since there's no clear decision made for shading non-storm-core modules, I'll follow storm-sql-core (copy dependencies) and revisit when we're clear on that.
, GitHub user HeartSaVioR opened a pull request:

    https://github.com/apache/storm/pull/1610

    STORM-2023 Add calcite-core to dependency of storm-sql-runtime

    * also copy (transitive) dependencies to binary distribute, as storm-sql-core did
    
    It can be easily applied to 1.x-branch.
    We can apply this to 1.0.x-branch but without STORM-2016 users still need to copy them to extlib directory which is bad.

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/HeartSaVioR/storm STORM-2023

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/storm/pull/1610.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #1610
    
----
commit 34d9bf2d87667669d45c5166f8827f23369124ca
Author: Jungtaek Lim <kabhwan@gmail.com>
Date:   2016-08-05T09:16:13Z

    STORM-2023 Add calcite-core to dependency of storm-sql-runtime
    
    * also copy (transitive) dependencies to binary distribute, as storm-sql-core did

----
, FYI: I'm talking with Julian Hyde to minimize the dependencies for SqlFunctions so that we can copy it to Storm and get rid of calcite-core dependency.
This is tracked from https://issues.apache.org/jira/browse/CALCITE-1349, Github user HeartSaVioR commented on the issue:

    https://github.com/apache/storm/pull/1610
  
    This is needed with/without STORM-2016 since calcite-core is needed at runtime of compiled topology. Please review this.
, Github user harshach commented on a diff in the pull request:

    https://github.com/apache/storm/pull/1610#discussion_r73901017
  
    --- Diff: storm-dist/binary/src/main/assembly/binary.xml ---
    @@ -305,12 +305,13 @@
                 </includes>
             </fileSet>
             <fileSet>
    -            <directory>${project.basedir}/../../external/sql/storm-sql-runtime/target</directory>
    +            <directory>${project.basedir}/../../external/sql/storm-sql-runtime/target/appassembler/repo</directory>
    --- End diff --
    
    can we call appassembler to app-assembler. single word making it confusing.
, Github user HeartSaVioR commented on a diff in the pull request:

    https://github.com/apache/storm/pull/1610#discussion_r73984110
  
    --- Diff: storm-dist/binary/src/main/assembly/binary.xml ---
    @@ -305,12 +305,13 @@
                 </includes>
             </fileSet>
             <fileSet>
    -            <directory>${project.basedir}/../../external/sql/storm-sql-runtime/target</directory>
    +            <directory>${project.basedir}/../../external/sql/storm-sql-runtime/target/appassembler/repo</directory>
    --- End diff --
    
    OK. Addressed.
, Github user HeartSaVioR commented on the issue:

    https://github.com/apache/storm/pull/1610
  
    Build failure is not related to this.
    
    ```
    [ERROR] Failed to execute goal org.apache.maven.plugins:maven-remote-resources-plugin:1.2.1:process (default) on project storm-hive: Error resolving project artifact: Could not transfer artifact net.hydromatic:linq4j:pom:0.4 from/to sonatype-apache (https://repository.apache.org/releases/): Connect to repository.apache.org:443 [repository.apache.org/207.244.88.143] failed: Connection timed out for project net.hydromatic:linq4j:jar:0.4 -> [Help 1]
    ```
    
    I requested Travis support team to take a look at recent often time out for repository.apache.org. I'll update the news once I get one.
, Github user harshach commented on the issue:

    https://github.com/apache/storm/pull/1610
  
    +1
, Github user asfgit closed the pull request at:

    https://github.com/apache/storm/pull/1610
, I merged into master and 1.x-branch.
I don't merge this into 1.0.x-branch since we should need STORM-2016 to reduce the complexity of precondition of executing `sql`, and it should be on next minor version (no bugfix).]