[Can you elaborate on your plan?

There's a recent pull request that may do something similar. I'll try to dig it up., [~ptgoetz] https://github.com/apache/storm/blob/1.x-branch/external/storm-kafka/src/test/org/apache/storm/kafka/KafkaTestBroker.java#L70 
need to change above line to return KafkaConfig.fromProps(p), [~harsha_ch] From a dev community perspective, we have no context about your intention here. Pointing to a line number makes us dig into code, essentially reverse engineer, and context switch.

Ideally a JIRA should have enough why/how information in the description to let others determine quickly whether or not the issue, bug, or patch is something they should be interested in. 

I'm sure I've been guilty of the same, but it is something we should strive to correct., [~ptgoetz] I am not sure what context you are missing here .The title is good enough and I posted clear enough details in my comment above. Its a one-line fix which shouldn't require a JIRA let alone long explanation about the fix. If someone is not willing to look at the code they shouldn't worried about JIRA at all., [~ptgoetz] updated the title to reflect the intended change. I hope this doesn't require reverse engineer the code to understand the intent of the JIRA., {quote}
I hope this doesn't require reverse engineer the code to understand the intent of the JIRA.
{quote}

Of course it doesn't.

I just feel that JIRAs should be descriptive, and enable other developers to better understand what's being proposed., I didn't encounter this error building the 1.0.1 rc2 release candidate (done from a clear checkout from git, etc.).

Can you share more about your environment?, GitHub user harshach opened a pull request:

    https://github.com/apache/storm/pull/1376

    STORM-1736. Change KafkaTestBroker.buildKafkaConfig to new KafkaConfig api.

    

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/harshach/incubator-storm STORM-1736

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/storm/pull/1376.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #1376
    
----
commit 68bdcc53d5ea88e6ee84bcea3a0aa5fcfe0979d5
Author: Sriharsha Chintalapani <harsha@hortonworks.com>
Date:   2016-04-28T02:50:28Z

    STORM-1736. Change KafkaTestBroker.buildKafkaConfig to new KafkaConfig api.

----
, Github user ptgoetz commented on the pull request:

    https://github.com/apache/storm/pull/1376#issuecomment-215303147
  
    The patch looks okay to me, but I would like to know why it's necessary. I can't reproduce the issuue from the branch or rc2 build.
, Github user HeartSaVioR commented on the pull request:

    https://github.com/apache/storm/pull/1376#issuecomment-216467060
  
    I also don't encounter this through 1.0.1 RC1 to 1.0.1 RC3. Did you set the custom Kafka version while building?
, Github user abhishekagarwal87 commented on the pull request:

    https://github.com/apache/storm/pull/1376#issuecomment-216560931
  
    This would also break the compatibility of storm 1.0.0 with 0.8.x kafka client API. 
, Github user harshach commented on the pull request:

    https://github.com/apache/storm/pull/1376#issuecomment-216579561
  
    @HeartSaVioR @abhishekagarwal87 this issues happens with Kafka 0.10 branch. 
    Yes it does break test compatability with 0.8.x . Keep in mind that KafkaConfig is an internal kafka class that we use to start a in-process kafka broker. We shouldn't be calling it as breaking comptability with client api. Also this change will work with Kafka 0.9.x on wards
, Github user abhishekagarwal87 commented on the pull request:

    https://github.com/apache/storm/pull/1376#issuecomment-216587066
  
    @harshach - with this change, test compilation will fail once the #1386 is merged. Since this is the internal class used only in test, do we really need to make it compatible with 0.10 branch? 
, Github user harshach commented on the pull request:

    https://github.com/apache/storm/pull/1376#issuecomment-216590606
  
    @abhishekagarwal87 commented on your PR https://github.com/apache/storm/pull/1386 . 
]