[Attached patch adds support for remoteconfvalue command. [~ptgoetz], can you please review the patch?, Github user revans2 commented on the pull request:

    https://github.com/apache/incubator-storm/pull/60#issuecomment-39785521
  
    This is not strictly compatible with the python version.  This will come out as 
    
    "VALUE: ${VALUE}"
    
    where as the python strips of "VALUE:" and replaces it with "${name}:"
    
    I don't know if this needs to be fixed or not.  I am not sure who is reading these values.
    
    Also did you intend to include the STORM-273 fix in there as well?  It also looks OK to me, but I want to be sure that it is complete.
, Github user sureshms commented on the pull request:

    https://github.com/apache/incubator-storm/pull/60#issuecomment-39786095
  
    I have a separate pull request for STORM-273. So just STORM-274 is required in this pull request. Let me know if I need to do this off another branch to do it the right way.
    
    I did not understand the "VALUE:${VALUE}" comment. Which line are you talking about?
, Github user revans2 commented on the pull request:

    https://github.com/apache/incubator-storm/pull/60#issuecomment-39866773
  
    If I run remoteconfvalue through python I get
    ```
    $ storm remoteconfvalue ui.port
    ui.port: 8080
    ```
    
    If I call the java code directly like this patch is doing I get
    ```
     $ storm jar bogus backtype.storm.command.config_value ui.port
    ...
    VALUE: 8080
    ```
    
    The python code replaces the VALUE: with ui.port:.  Like I said I am not sure it is critical, but it is a difference.
    
    As for STORM-273 vs STORM-274, STORM-273 has two +1 on it so I'll just pull it in, and then this pull request should hopefully recognize it and you won't need to do anything.
, Github user d2r commented on the pull request:

    https://github.com/apache/incubator-storm/pull/60#issuecomment-47282498
  
    This needs an upmerge, and I am +1.
    
    Even better if we can fix the "VALUE" output to be like the python script.
, Github user d2r commented on the pull request:

    https://github.com/apache/incubator-storm/pull/60#issuecomment-52245015
  
    Hi @sureshms, can you upmerge this?
, Github user revans2 commented on the pull request:

    https://github.com/apache/incubator-storm/pull/60#issuecomment-53301164
  
    The upmerge was trivial.  One line conflicted that was a list of commands.  I added the new command to the old list and it works fine.  I am +1
, Thanks Suresh,

I merged this into master., Github user asfgit closed the pull request at:

    https://github.com/apache/incubator-storm/pull/60
]