[I dont want SQLBolt. I want postgresbolt which is written in STORM to connect to postgresdb. I have already tried to execute the link which u have sent but, showing the following error while executing the POM.xml file .

ERROR : [ERROR] Failed to execute goal on project storm-core: Could not resolve dependencies for project org.apache.storm:storm-core:jar:0.11.0-SNAPSHOT: Could not find artifact org.clojure:clojure:jar:1.7.1 in central (http://repo1.maven.org/maven2/) -> [Help 1]

That is my issue and Yes I want help in executing the link which you have sent. Its a jar file first i am trying to execute the storm-master pom.xml . I am facing error at STORM-CORE. It is failed to executed so the rest of the 
packages have stopped its maven compilation . SO guide me in executing the link that u have sent.

I dont know how to use the "users mailing list". So I am  commenting here it self. So please don't mind as i am new to JIRA., I dont want SQLBolt. I want postgresbolt which is written in STORM to connect to postgresdb. I have already tried to execute the link which u have sent but, showing the following error while executing the POM.xml file .

ERROR : [ERROR] Failed to execute goal on project storm-core: Could not resolve dependencies for project org.apache.storm:storm-core:jar:0.11.0-SNAPSHOT: Could not find artifact org.clojure:clojure:jar:1.7.1 in central (http://repo1.maven.org/maven2/) -> [Help 1]
, [~Jayasree]  not sure whats this jira about. Did you try using the JDBC connector we've?. It doesn't look like a storm related issue. Can you add more details on what error you are seeing. Also make sure you sent a mail on user@storm.apache.org . More details are here https://storm.apache.org/getting-help.html, make sure you point to published storm maven artifacts. By looking at the attachment it looks like you are referring to 0.11.0-SNAPSHOT. , Actually what i want exactly is., I am trying to store the streaming tweets coming from storm bolt into the postgresql database. For that  i need full coding to do that job. i.e., to store the data coming from the storm bolt to postgresql database and i need pom.xml file too. Can you please help me to solve this issue., Actually what i want exactly is., I am trying to store the streaming tweets coming from storm bolt into the postgresql database. For that i need full coding to do that job. i.e., to store the data coming from the storm bolt to postgresql database and i need pom.xml file too. Can you please help me to solve this issue., Actually what i want exactly is., I am trying to store the streaming tweets coming from storm bolt into the postgresql database. For that i need full coding to do that job. i.e., to store the data coming from the storm bolt to postgresql database and i need pom.xml file too. Can you please help me to solve this issue.
, Actually what i want exactly is., I am trying to store the streaming tweets coming from storm bolt into the postgresql database. For that i need full coding to do that job. i.e., to store the data coming from the storm bolt to postgresql database and i need pom.xml file too. Can you please help me to solve this issue.]