[GitHub user dashengju opened a pull request:

    https://github.com/apache/incubator-storm/pull/217

    [STORM-443] fix the problem of log level implementation to compatible with old log p...

    Storm now support logging level to multilang protocol spout and bolt. But the implementation is not compatible with old log protocol with no logging level.
    
    With old topology who use old protocol, when they send log with no loglevel, JsonSerializer's readShellMsg function will throw NPE at:
    
     if (command.equals("log"))
     { 
         long logLevel = (Long)msg.get("level"); //throw NPE at here 
         shellMsg.setLogLevel((int)logLevel); 
     }
    
    ShellBolt will catch the NPE, and call die(), and die() will get error info from sub process's error stream in _process.getProcessTerminationInfoString(), but the error stream have no data come, it will hangs.
    
     private void die(Throwable exception)
     { 
         String processInfo = _process.getProcessInfoString() + _process.getProcessTerminationInfoString(); 
         _exception = new RuntimeException(processInfo, exception); 
      }
    
    This PR will fix the problem of log level implementation to compatible with old log protocol. And the die problem should be solved by Kang Xiao 's PR https://github.com/apache/incubator-storm/pull/46

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/dashengju/incubator-storm Multilang_JsonSerializer

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/incubator-storm/pull/217.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #217
    
----
commit 837b9e50acbfb3b91009ed08259c44e0efebcebf
Author: JuDasheng <judasheng@meituan.com>
Date:   2014-08-07T08:39:59Z

    fix the problem of log level implementation to compatible with old log protocol with no loglevel

----
, Github user ptgoetz commented on the pull request:

    https://github.com/apache/incubator-storm/pull/217#issuecomment-51650261
  
    +1
, Github user dashengju commented on the pull request:

    https://github.com/apache/incubator-storm/pull/217#issuecomment-52027778
  
    @revans2  can you help to review?
, Github user d2r commented on the pull request:

    https://github.com/apache/incubator-storm/pull/217#issuecomment-52058931
  
    > And the die problem should be solved by Kang Xiao 's PR #46
    
    This seems to be the bigger issue that needs to be fixed.
    
    Looking at #46, I am not sure this fixes the hang calling `_process.getProcessTerminationInfoString()`.  Is there a way to peek at the steam to see if there is anything to read?
, Github user dashengju commented on the pull request:

    https://github.com/apache/incubator-storm/pull/217#issuecomment-52169197
  
    @d2r 
    
    at first, I think just remove call _process.getProcessTerminationInfoString() is ok. 
    #46 when make a upmerge,  it call _process.getProcessTerminationInfoString() again, so it did not fixes the problem.
    
    I think we need another PR to fix the problem, may be in #218 ,  but now the PR is not finish,  I will try to find a way to peek at the steam to see if there is anything to read. After that, I will ask for a review.
, Github user dashengju commented on the pull request:

    https://github.com/apache/incubator-storm/pull/217#issuecomment-52169337
  
    And this PR will just fix the problem of log level implementation to compatible with old log protocol
, Github user d2r commented on the pull request:

    https://github.com/apache/incubator-storm/pull/217#issuecomment-52181883
  
    > And this PR will just fix the problem of log level implementation to compatible with old log protocol
    
    OK I see, the hang will be handled in STORM-442/#218.  I was confused by the JIRA/Pull Request descriptions.  In the future, it would be nice if we could make descriptions specific to the issues they address.
    
    +1 Looks OK to me.
, Github user revans2 commented on the pull request:

    https://github.com/apache/incubator-storm/pull/217#issuecomment-52214895
  
    +1
, Thanks DashengJu for the fix.  I merged this into master, Github user asfgit closed the pull request at:

    https://github.com/apache/incubator-storm/pull/217
]