[GitHub user revans2 opened a pull request:

    https://github.com/apache/storm/pull/528

    STORM-791: Storm UI displays maps in the config incorrectly

    

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/revans2/incubator-storm STORM-791

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/storm/pull/528.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #528
    
----
commit 6bfcb2c888481555e9ae6fd93133b82117baa7b7
Author: Robert (Bobby) Evans <evans@yahoo-inc.com>
Date:   2015-04-17T18:33:25Z

    STORM-791: Storm UI displays maps in the config incorrectly

----
, Github user revans2 commented on the pull request:

    https://github.com/apache/storm/pull/528#issuecomment-94048702
  
    ![jsonformat](https://cloud.githubusercontent.com/assets/3441321/7208538/390f8776-e507-11e4-9bb2-a738ce8dd3bb.png)

, Github user knusbaum commented on the pull request:

    https://github.com/apache/storm/pull/528#issuecomment-94063949
  
    +1
    Super cool.
, Github user HeartSaVioR commented on the pull request:

    https://github.com/apache/storm/pull/528#issuecomment-94242208
  
    Cool!
    Is it copied to clipboard as same as we're seeing?
, Github user harshach commented on the pull request:

    https://github.com/apache/storm/pull/528#issuecomment-94299407
  
    +1
, Github user revans2 commented on the pull request:

    https://github.com/apache/storm/pull/528#issuecomment-94464428
  
    @HeartSaVioR I didn't try it, but I will.
, Github user revans2 commented on the pull request:

    https://github.com/apache/storm/pull/528#issuecomment-94467475
  
    @HeartSaVioR yes, copy/paste comes out exactly as you see it.  Even in the case of maps and lists with values in them there are new lines.  I like the JSON because you can copy and paste it on the command line with a -c command.  But the new lines make it a little difficult.  If you think this is a blocker please let me know and I'll look for a work around, like having a copy button that does not include any extra white space.  Of we could file a follow on JIRA for it.
, Github user HeartSaVioR commented on the pull request:

    https://github.com/apache/storm/pull/528#issuecomment-94480822
  
    @revans2 I don't think it's a blocker and it can be fixed when we think it'll be really necessary.
    Looks good to me again.
, Github user asfgit closed the pull request at:

    https://github.com/apache/storm/pull/528
, I merged this into master.  If copy/paste becomes an issue we can file a JIRA at that time.]