[GitHub user itaifrenkel opened a pull request:

    https://github.com/apache/storm/pull/291

    [STORM-529] Send fail(tup) when BasicBolt process throws Exception

    

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/forter/storm python-basicbolt-fail-tuple

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/storm/pull/291.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #291
    
----
commit 899eaec53a9b0895924c703b825dc0118e47cc83
Author: Itai Frenkel <itai@forter.com>
Date:   2014-10-11T12:46:35Z

    Send fail(tup) when BasicBolt process throws Exception

----
, Github user itaifrenkel commented on the pull request:

    https://github.com/apache/storm/pull/291#issuecomment-58748794
  
    @revans2 Could you please advise regarding STORM-528 ?
, Github user revans2 commented on the pull request:

    https://github.com/apache/storm/pull/291#issuecomment-59222813
  
    @itaifrenkel Sorry for  the long silence.  We have been battling a fire here with all hands on deck. I don't see much of a reason for this to wait on STORM-528.  You made the same change to both python files so I think it should be fine.

, Github user revans2 commented on the pull request:

    https://github.com/apache/storm/pull/291#issuecomment-59226497
  
    I am +1 for this change.  The code looks to do as expected, and everything runs well.
, Github user itaifrenkel commented on the pull request:

    https://github.com/apache/storm/pull/291#issuecomment-59323312
  
    ok. please just note that there are 3 files to change and I only changed 2 of them. I cannot tell why was the third file diverted from the others. It looks like a mishap.
, Github user HeartSaVioR commented on the pull request:

    https://github.com/apache/storm/pull/291#issuecomment-59346967
  
    Looks good to me. :)
, Github user ptgoetz commented on the pull request:

    https://github.com/apache/storm/pull/291#issuecomment-60422965
  
    +1 I agree with @revans2, I don't think we need to wait for STORM-528
, Github user asfgit closed the pull request at:

    https://github.com/apache/storm/pull/291
, committed, thanks, Itai.]