[Could someone accept this pull request before 0.9.1 Release?
Please, take a look at this fix, since currently "storm jar" is broken utterly if you specify any STORM_JAR_JVM_OPTS., Github user patricklucas commented on a diff in the pull request:

    https://github.com/apache/incubator-storm/pull/27#discussion_r11274162
  
    --- Diff: bin/storm ---
    @@ -45,7 +46,9 @@ if (not os.path.isfile(USER_CONF_DIR + "/storm.yaml")):
         USER_CONF_DIR = CLUSTER_CONF_DIR
     CONFIG_OPTS = []
     CONFFILE = ""
    -JAR_JVM_OPTS = os.getenv('STORM_JAR_JVM_OPTS', '')
    +
    +#note that JAR_JVM_OPTS is now array instead of string
    --- End diff --
    
    I don't think this comment is necessary. (The [issue](https://issues.apache.org/jira/browse/STORM-196)/commit message should be sufficient and anyone seeing this code in the future doesn't need to know it used to be a string)
, Github user yerenkow commented on the pull request:

    https://github.com/apache/incubator-storm/pull/27#issuecomment-40209406
  
    You mean specify STORM-196 in subject? Done :)
, Github user revans2 commented on the pull request:

    https://github.com/apache/incubator-storm/pull/27#issuecomment-40209635
  
    Sadly to get this to link up to the JIRA you need to remove the square brackets '['  and ']'
, Github user revans2 commented on the pull request:

    https://github.com/apache/incubator-storm/pull/27#issuecomment-40209842
  
    Oh wait it looks like it worked, never mind

, Thanks [~yerenkow] for the patch.  I pulled this into master., Github user asfgit closed the pull request at:

    https://github.com/apache/incubator-storm/pull/27
, Github user revans2 commented on the pull request:

    https://github.com/apache/incubator-storm/pull/27#issuecomment-46425404
  
    @yerenkow I am trying to clean up the JIRA on apache with who actually contributed the fix.  Do you have an account at http://issues.apache.org/jira ?  If so I would like to give you credit on JIRA for your contribution to storm.  If you don't care I can leave it blank.  I found a yerenkow user there too, but I  your github profile didn't have enough information for me to be able to confirm it.
, Yep, it's me and mine pull request :) Would be neat to be in contributors for oneliner :)]