[I'd like to add 'newbie' label, since this can be done with only understanding of cleanup-corrupt-topologies!

https://github.com/apache/storm/pull/1572/files, It was asked on the mailing list where this code should live.  This was my answer.

bq. My guess is that this is going to be a new tool.  I think we want to start looking into supporting a storm admin tool that will give users that have access to super user credentials access to directly examine/modify the state of a running storm cluster, zookeeper, blobstore, and local state. I don't expect you to do all of that work, but at least starting a place for a storm admin command in my opinion is the best place for this., Hi Bobby,

Thanks for answering my query. 

Does it make sense to have this admin tool as part of Storm UI or it should be altogether a new command line tool., I would start off with command line, if you are feeling ambitious you could look at adding a UI component to it., I agree to your point. Being a newbie I would prefer to start with smaller steps and first work on command line tool. I'll think over and validate  my approach with you soon., I tried to think over the admin tool design and put down my thoughts in the attached document. Please look into this and let me know your views., [~bkamal]
Thanks for working on this. Since Storm already has several daemons and also REST API server, I'd like to see admin tool by not adding more daemons. My intention was just a command line tool which directly communicates with ZK, Nimbus, or so (need to address authentication) but originally this was an idea from [~revans2] so would like to see his opinion regarding this.
, I personally would prefer a tool that pretends to be Nimbus and acts like Nimbus.  Meaning it would connect to zookeeper, blobstore, local caches, etc. just as if it were the nimbus daemon. We have run into situations in the past where nimbus is down because of bad state stored somewhere.  Having a tool that can do everything nimbus does is important.  Having a separate daemon to do this feels too complicated, and also exposes a lot more potential for attack.  At the beginning I would say just have a command line tool that will create a [ClusterState|https://github.com/apache/storm/blob/master/storm-core/src/jvm/org/apache/storm/cluster/IStormClusterState.java] a [BlobStore|https://github.com/apache/storm/blob/master/storm-core/src/jvm/org/apache/storm/blobstore/BlobStore.java] and possibly a [LocalState|https://github.com/apache/storm/blob/master/storm-core/src/jvm/org/apache/storm/utils/LocalState.java] like nimbus currently does.  Once those are created for this project we would just then run through some code very similar to [cleanup-corrupt-topologies!|https://github.com/apache/storm/pull/1572/files].

In the future we could have it do many more things.  Having a UI in the future would probably need a separate daemon for security reasons, but we use this type of operation so rarely that I don't see much value in setting up an RPC daemon for it.  If we want a UI have the UI be baked into the admin command so it would be a web process that is running with the same privlages as nimbus, and there is no need for RPC at all, just run it locally., Thanks Jungtaek and Bobby for the clarification. I tried to write skeleton class based on your input. Please review the attached class and I'll further work on this based on your comments. 

Please also let me know which package this class should reside., Please put the class in org.apache.storm.command.  A pull request against https://github.com/apache/storm is preferable to posting a patch in the JIRA.  Just make sure to include the jira number (STORM-1985) in the title of the pull request.

There are a number of design/usability choices that I would like to see fixed.

https://github.com/apache/storm/blob/master/storm-core/src/jvm/org/apache/storm/command/Blobstore.java

Has a better framework for having a single command with multiple sub commands.  I would prefer to see admin be similar, having a special hard coded string with spaces in it does not fit with the rest of storm.

The code you posed is not complete and has a big TODO in it.

The code that you do have looks correct., Thanks for the input and sorry for the delay as some travel came up for me.

Please review the pull request
https://github.com/apache/storm/pull/1677

Hope it is correct as I have created it first time.

Also please suggest in case we need to implement more admin commands.

, Applied the review comments. Please take a look., Thanks [~bkamal],

I merged this into master.]