[Hi,

I am new to storm. I am getting same error.
Did you find out a way out of this !!?, Hi, 

Unfortunately no. I tried to run storm and cassandra on same Windows machine, but I couldn't. Now I am installing a linux VM so that I can run my storm-cassandra code on it.
Regards, [~erajabi] [~rahulravipati] Do you python and ruby installed on the cluster where you experiencing this issue and python should be 2.6+  as it requires "json" module., Hello,

I have experienced this error as well. Other have as well, noted [here|http://stackoverflow.com/questions/26568767/storm-starter-example-topologies-crash] on StackOverflow.

It is clear that the problem is with WordCountTopology., WordCountTopology confirmed working in v0.9.2-incubating. Since v0.9.3 has non-backwards-compatible multilang changes, WordCountTopology needs to be updated as such., [~blbradley] I don't see any issues with wordcount topology in 0.9.3. Are you seeing any issues with it in 0.9.3.
This JIRA issue could be due to  not having right python or ruby versions installed., [~sriharsha] Yes, I am experiencing this in v0.9.3.

➜  storm-starter git:(master) ✗ python --version
Python 2.7.6
, [~blbradley] I just tried by downloading the storm 0.9.3 and deploying wordcount with python  2.7.5  . So far topology ran for more than 5 mins didn't see any errors and its running fine. Does it happen in you env immediately after submitting the wordcount topology and also can you share your environment details like os , java version etc.. 
Did you upgrade the existing 0.9.2 storm to 0.9.3 also are you running this using LocalCluster?, [~blbradley] I just checked the stack overflow link you posted . The error user reported is because they are running the WordCountTopology in LocalCluster and in LocalCluster   we run it for 10 seconds before we call       cluster.shutdown(); which throws the InterrupttedException  . So its not an issue you can test it by running in a single node cluster.
cluster.submitTopology("word-count", conf, builder.createTopology());
Thread.sleep(10000);
, [~sriharsha] Alright, I am more understanding of what is going on now. Thanks for this last comment and all your input. I removed cluster.shutdown(), and the topology continues to run until stopped manually. So, now the confusion lies with output of errors in 0.9.3 vs output of 'BUILD SUCCESSFUL' in 0.9.2. This is very confusing to new users of Storm. Maybe WordCountTopology could be changed in a way that conforms more to the principle of least surprise., Agree with Brandon. 

I am new to storm and just downloaded storm and storm-starter code and tried running. For new folks it is not intuitive to figure this out and get thrown by the errors all over the place and then final result with "BUILD FAILURE".Changing example as per Brandon's suggestion will be good. , oh shit !  this happened 0.9.4 when run with " bin/storm jar examples/storm-starter/storm-starter-topologies-0.9.4.jar storm.starter.WordCountTopology"  ,WordCountTopology could be changed or update]