[[~zhuoliu] and [~knusbaum] I think you two did a fix like this for us internally when we changed the CWD of the worker process for better isolation.  Could one of you take a look at pulling that fix into open source sooner, rather than waiting for the full worker artifacts feature to be ported?, Hi Bobby [~revans2], I think that might be a different fix, and I just filed a separate JIRA for that in https://issues.apache.org/jira/browse/STORM-1066 since it is also important.
For this STORM-1063, I can take this issue., GitHub user zhuoliu opened a pull request:

    https://github.com/apache/storm/pull/760

    [STORM-1063] support relative log4j conf dir for both daemons and workers

    An easier fix might be dropping the default configuration of "log4j" and force users to provide complete path, however, we still prefer to support relative path of log4j conf dir.

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/zhuoliu/storm 1063

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/storm/pull/760.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #760
    
----
commit 94b156243eef1cef6e572e94918ac4153a0f82cf
Author: zhuol <zhuol@yahoo-inc.com>
Date:   2015-09-23T19:37:06Z

    [STORM-1063] fix log4j conf dir relative path issue

----
, Github user HeartSaVioR commented on the pull request:

    https://github.com/apache/storm/pull/760#issuecomment-142772757
  
    +1
, Github user jerrypeng commented on the pull request:

    https://github.com/apache/storm/pull/760#issuecomment-144137713
  
    LGTM +1
, Github user revans2 commented on the pull request:

    https://github.com/apache/storm/pull/760#issuecomment-144190457
  
    +1 looks great, thanks for doing this.
, Github user asfgit closed the pull request at:

    https://github.com/apache/storm/pull/760
, Thanks [~zhuoliu],

I merged this into master.]