[GitHub user ashnazg opened a pull request:

    https://github.com/apache/storm/pull/911

    STORM-1360:  storm.py issues with python 3

    This changes the "print" and "except" syntax usages such that they test fine for me on Python 2.6.6 (RHEL) and 3.5.0 (Win7).

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/ashnazg/storm python3

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/storm/pull/911.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #911
    
----
commit 56b52a0e61d63bb5a9ea3e6d2c651d209bf889f8
Author: Chuck Burgess <cburgess@progressrail.com>
Date:   2015-12-02T14:14:49Z

    make 'print' work with python2 and 3;

commit e92f3a6e7a67f9c67c5fdb3f588a377a47a94213
Author: Chuck Burgess <cburgess@progressrail.com>
Date:   2015-12-02T14:15:11Z

    make 'except' work with python2 and 3;

----
, Github user unsleepy22 commented on the pull request:

    https://github.com/apache/storm/pull/911#issuecomment-161324640
  
    @ashnazg 
    since python 3.x is officially not fully compatible with 2.x, is it necessary to make this change? By making this PR, we may need to check all python files.
, Github user ashnazg commented on the pull request:

    https://github.com/apache/storm/pull/911#issuecomment-161325344
  
    I intentionally tested it against 2.x to be sure it was still ok, so that a larger scale effort would not necessarily be required.  I simply couldn't get my Win7 builds to run, due to the syntax breakdown as seen in the clj multilang-test.
, Github user ashnazg commented on the pull request:

    https://github.com/apache/storm/pull/911#issuecomment-161326961
  
    As an aside, I had tried to find a reference in the Storm documentation with regard to Python version requirements, but did not see any.  That's why I explored why this file was failing for me on 3.x.
, Github user ashnazg commented on the pull request:

    https://github.com/apache/storm/pull/911#issuecomment-161329756
  
    I'll have to rebase after #912 merges before this one will test good on Travis.
, Github user revans2 commented on the pull request:

    https://github.com/apache/storm/pull/911#issuecomment-161362063
  
    @ashnazg the changes look good to me, and I would love to maintain both python2 and python3 compatibility.  I think the best way to do this is to have travis CI handle that for us.
    
    https://docs.travis-ci.com/user/languages/python
    
    Would you mind filing a JIRA to have travis run with different versions of python. Ideally it would be nice to configure it so we only run the multi-lang tests more than once, but that could be an optimization that comes later on.
    
    Also it would be good to update to docs to indicate the versions of python supported.
    
    I am +1 for this change.
, Github user ashnazg commented on the pull request:

    https://github.com/apache/storm/pull/911#issuecomment-161386724
  
    @revans2 , created STORM-1362 for it.  I'll take a stab at it, but someone more familiar with Travis might can knock it out faster.  I don't see an obvious "travis-ish" way to do this, so I'm guessing it'll require its own shellscript.
, Github user revans2 commented on the pull request:

    https://github.com/apache/storm/pull/911#issuecomment-161411832
  
    @ashnazg Ya I think we are going to need to do something special to make it work too, but travis is the place we should be doing it if we want to be sure we don't break things in the future.
, Github user ashnazg commented on the pull request:

    https://github.com/apache/storm/pull/911#issuecomment-161715238
  
    Not sure how I had this succeeding previously, but now it consistently does not.  What I'm seeing now implies that only a full-on python3 adjustment over many files solve this.  I'll just have to drop my Win7 env down to python2.
, Github user ashnazg closed the pull request at:

    https://github.com/apache/storm/pull/911
]