[Why is it unnecessary to remove this type of output when we do running storm daemons? 
It might be useful for debug to see the configuration and environment where the daemon is running. But I think there are some cases this output is needed when we storm user command such as {{list}}, {{jar}}. So it will be better to add some kind of option which decides whether remove this output or not., [~kaisasak] makes sense to add a debug option. The reason not removing this for storm daemons is I've seen users do ps -ef | grep nimbus to  check if nimbus running or not. If we remove this for all the commands than ps | grep won't work., I would suggest the traditional -v flag., GitHub user oleg03 opened a pull request:

    https://github.com/apache/storm/pull/553

    [STORM-710] bin/storm command list out all the classes in the output for a command

    Added -v flag for all bin/storm commands.
    Long commands' outputs are removed.
    Using -v flag prints traditional long output.

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/oleg03/storm test

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/storm/pull/553.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #553
    
----
commit 963b002cbc57be7292c72bb657a9b5d60f788a04
Author: oleg03 <oleg.ostashchuk@gmail.com>
Date:   2015-05-14T04:22:44Z

    [STORM-710]
    
    Added -v flag for all bin/storm commands.
    Long commands' outputs are removed.
    Using -v flag prints traditional long output.

----
, Hello,
[~sriharsha]
I've modified the output of the bin/storm commands according to the description. Now the original long outputs can be displayed by running commands with -v flag. Can somebody check this please and give me some feedback.
Thanks!

https://github.com/oleg03/storm/tree/test/, Github user revans2 commented on the pull request:

    https://github.com/apache/storm/pull/553#issuecomment-106580985
  
    I like the concept, but by having storm.py pull the -v out of the command line, it now makes it impossible for any command to use -v any other way.  This is not a big deal for the typical storm commands, but for storm jar it is backwards incompatible.  This is especially a problem for something that for some reason had a -v with an argument.  I would much rather use an environment variable, or a rather log parameter like '--storm-system-verbose' which is not likely to have any collision.
, Github user harshach commented on the pull request:

    https://github.com/apache/storm/pull/553#issuecomment-113996523
  
    @oleg03 can you send us a new patch with @revans2 feedback . Thanks.
, Github user revans2 commented on the pull request:

    https://github.com/apache/storm/pull/553#issuecomment-155916895
  
    @oleg03 I don't really like the idea of adding in a -v option that restricts all other commands, including storm jar from supporting it.  I would much rather have a long parameter that is unlikely to collide with something someone else is already using, or us a config or environment variable to trigger it instead.
, Github user knusbaum commented on the pull request:

    https://github.com/apache/storm/pull/553#issuecomment-193489974
  
    Closing this. Feel free to reopen with updates.
, Github user asfgit closed the pull request at:

    https://github.com/apache/storm/pull/553
]