[GitHub user harshach opened a pull request:

    https://github.com/apache/storm/pull/391

    STORM-635. logviewer returns 404 if storm_home/logs is a symlinked dir.

    

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/harshach/incubator-storm STORM-635

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/storm/pull/391.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #391
    
----
commit bf9a311848de6ac2abf5cbbe987953b120fd813c
Author: Sriharsha Chintalapani <mail@harsha.io>
Date:   2015-01-22T01:45:14Z

    STORM-635. logviewer returns 404 if storm_home/logs is a symlinked dir.

----
, The work around for this bug is to add storm.log.dir in storm.yaml with target log dir., Github user revans2 commented on the pull request:

    https://github.com/apache/storm/pull/391#issuecomment-71058840
  
    The change to check the parent directory is the root dir was put in on purpose for security reasons.  if someone puts in a file called "../../../etc/passwd" there could be some serious security issues involved.
    
    -1
    
    I am fine with supporting symlinks but we need to have a way to restrict what can be accessed through the logviewer.
, Github user harshach commented on the pull request:

    https://github.com/apache/storm/pull/391#issuecomment-71074482
  
    @revans2 my bad I missed security fix that went in before. Please check the latest patch . Thanks.
, Github user Parth-Brahmbhatt commented on the pull request:

    https://github.com/apache/storm/pull/391#issuecomment-71075304
  
    +1.

, Github user revans2 commented on the pull request:

    https://github.com/apache/storm/pull/391#issuecomment-71253695
  
    +1 looks good to me.
, Github user asfgit closed the pull request at:

    https://github.com/apache/storm/pull/391
, Thanks [~sriharsha],

I merged this into master.  Keep up the good work.]