[GitHub user srdo opened a pull request:

    https://github.com/apache/storm/pull/1428

    STORM-1848: Make KafkaMessageId and Partition serializable to support…

    … eventlogging

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/srdo/storm STORM-1848

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/storm/pull/1428.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #1428
    
----
commit 2795b97fd6113b705232a3cc0bd22632e4857432
Author: Stig Rohde Døssing <sdo@it-minds.dk>
Date:   2016-05-18T11:13:15Z

    STORM-1848: Make KafkaMessageId and Partition serializable to support eventlogging

----
, Github user abhishekagarwal87 commented on the pull request:

    https://github.com/apache/storm/pull/1428#issuecomment-220012471
  
    +1
, Github user HeartSaVioR commented on the pull request:

    https://github.com/apache/storm/pull/1428#issuecomment-220033151
  
    +1
    Build failures are due to nexus issue.
, Github user srdo commented on the pull request:

    https://github.com/apache/storm/pull/1428#issuecomment-220050357
  
    Does it make sense to restrict the emit functions on SpoutOutputCollector to take only serializable messageIds?
, Github user revans2 commented on the pull request:

    https://github.com/apache/storm/pull/1428#issuecomment-220056112
  
    @srdo that would not be a backwards compatible change for something that never had to have this before.  And we don't require it to be serializable, if you have it properly registered with kryo then it will handle it instead.
, Github user srdo commented on the pull request:

    https://github.com/apache/storm/pull/1428#issuecomment-220071724
  
    You're right, I forgot about backwards compatibility, I mainly wanted to ensure this doesn't pop up in other spouts :) Is there any way for the Kafka spout to register with Kryo instead?
    
    How about a comment on the SpoutOutputCollector interface about this?
, Github user hmcl commented on the pull request:

    https://github.com/apache/storm/pull/1428#issuecomment-220105450
  
    +1
, Github user revans2 commented on the pull request:

    https://github.com/apache/storm/pull/1428#issuecomment-220122053
  
    +1 for the comment. I think that would be great, and having the KafkaSpout register things with kryo would be good, but I don't know if the API is setup to support that, as the KafkaSpout would need to have access to the topology config before submitting the topology.
, Github user srdo commented on the pull request:

    https://github.com/apache/storm/pull/1428#issuecomment-220129656
  
    I'll leave it at adding the comments then.
, Github user ptgoetz commented on the pull request:

    https://github.com/apache/storm/pull/1428#issuecomment-221391859
  
    +1
, Github user asfgit closed the pull request at:

    https://github.com/apache/storm/pull/1428
, [~Srdo] Thanks, merged to master, 1.x-branch and 1.0.x-branch.]