[If we force users to set JAVA_HOME, we can detect it easily (by checking existence of java executable file).
But currently storm script uses 'java' (rely on PATH), which can be hard to detect.
*Nix can run 'which' and check return code. (not 0 indicates error)
But I don't know it can be possible with Windows., We can probably handle detection of the JAVA_HOME case.  If we are ambitious we could look at catching the exception and seeing if there is a way for us to clean it up to something simpler for the end user to understand., Hello!
I would really like to work on this issue. It is my first attempt to contribute in Apache Storm project, so it will be fine if someone could guide me through or give some advices. 

I'll start by following steps here: https://storm.apache.org/documentation/Contributing-to-Storm.html
According to this, issues with "newbie" label may be good to start with.  

Could you please provide me more information about the issue and where I can find files realated to it?
Thanks!
, [~oleg.ost],

The file in question is storm in the bin directory https://github.com/apache/storm/blob/master/bin/storm this file really just sets up the environment to call into java and run the storm code there.  But if JAVA_HOME is set incorrectly, or if the java executable cannot be found we get a really odd error that is hard to debug.  The goal here is to output a user readable error if JAVA_HOME is set incorrectly, and if we can manage it to print out a user readable error if JAVA_HOME is not set and java is not on the path.

One of the key parts of this though is that we want it to run on *NIX and Windows.  So using *NIX specific commands like which will not work, unless you can short circuit it for windows., GitHub user ppoulosk opened a pull request:

    https://github.com/apache/storm/pull/457

    [STORM-477]  Add warning for invalid JAVA_HOME

    This adds a check in the python script to ensure that JAVA_HOME points to an installation of storm, and prints an error message if it is not properly set.

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/ppoulosk/storm STORM-477

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/storm/pull/457.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #457
    
----
commit fc3dd60798c158a26380a931b31325249ca7af16
Author: Paul Poulosky <ppoulosk@yahoo-inc.com>
Date:   2015-03-05T14:58:38Z

    Add warning for invalid JAVA_HOME

----
, [~oleg.ost]  I had a fix for this I wrote last week that I have been meaning to submit, but hadn't gotten around to it.  It only verifies that JAVA_HOME is set correctly, not that java is seen in PATH., [~revans2]  There is a patch available https://github.com/apache/storm/pull/434 that does this already. Please take a look ., Github user revans2 commented on a diff in the pull request:

    https://github.com/apache/storm/pull/457#discussion_r26263810
  
    --- Diff: bin/storm ---
    @@ -82,6 +82,8 @@ CONFFILE = ""
     JAR_JVM_OPTS = shlex.split(os.getenv('STORM_JAR_JVM_OPTS', ''))
     JAVA_HOME = os.getenv('JAVA_HOME', None)
     JAVA_CMD = 'java' if not JAVA_HOME else os.path.join(JAVA_HOME, 'bin', 'java')
    +if JAVA_HOME and not os.path.exists(JAVA_CMD):
    +    print "WARNING:  Check JAVA_HOME.  Could not find java at %s." % JAVA_HOME
    --- End diff --
    
    I personally would rather have storm exit with an error here instead of just a warning.
, [~ppoulosk] Does it mean that the issue is solved? Or there still a need to do something?, [~oleg.ost] The above patch should fix this issue.  If you are interested in working on JIRAs please send us an email at  storm users or dev list we can find some for you. , [~sriharsha] Thank you for answer! Yes, I would really like to work on some issue. Can you please advise me some? I just wasn't sure which email I should contact you. It is my first attempt to contribute in Apache Storm project, so it will be fine to start with something easier.
Thanks!, [~oleg.ost] Happy to help. Lets move this discussion onto mailing list . You can find mailing list info under "Getting Help" section on this page https://storm.apache.org/documentation/Home.html ., Github user revans2 commented on the pull request:

    https://github.com/apache/storm/pull/457#issuecomment-106586323
  
    @ppoulosk any update on this?
, Github user ppoulosk commented on the pull request:

    https://github.com/apache/storm/pull/457#issuecomment-108532639
  
    Upmerged and addressed code comment.
, Github user revans2 commented on the pull request:

    https://github.com/apache/storm/pull/457#issuecomment-108567623
  
    +1 looks good to me
, Github user kishorvpatil commented on the pull request:

    https://github.com/apache/storm/pull/457#issuecomment-110489805
  
    +1
, Github user asfgit closed the pull request at:

    https://github.com/apache/storm/pull/457
, Github user kishorvpatil commented on the pull request:

    https://github.com/apache/storm/pull/457#issuecomment-115756416
  
    @ppoulosk Thank you for the patch. This is merged into the master now.
]