[Trying to reproduce this..., [~buriama8]

Are you running a secure cluster or is it insecure?  , I have not set up any security (authentication or anything else), so I would think insecure., And you saw this while upgrading from 1.0.3 to 1.0.4?, I was able to reproduce it and it looks like some of the code that we put in to help with a rolling upgrade is either not working properly or is not being executed.  I'll do some more debugging and see what I can come up with.  Also see if I can come up with a work around for it., I figured out the issue.  I'm not sure why my tests didn't catch it to begin with.  I'll get a pull request up ASAP., I also get this issue. We are using 1.11 and it is not running in secure mode., We started experiencing this immediately upon upgrading from 1.1.0 to 1.1.1 on one cluster and from 1.0.2 to 1.1.1 on another cluster. Oddly enough, the cluster seems to actually keep processing even with the supervisors dying repeatedly., [~dan.blanchard] 
Could you help us confirming Bobby's patch resolve the issue? Patch is ready https://github.com/apache/storm/pull/2267 for 1.x version line. If you don't want to apply this manually I'll provide patched version of 1.1.2-SNAPSHOT storm-core jar., Sure, if you can provide a 1.1.2-SNAPSHOT JAR I can test this out on our beta cluster., [~dan.blanchard],

The supervisor only needs to be up to launch and kill workers.  This failure only happens about 30 seconds after the supervisor comes up (on a background thread)  so the supervisors get 30 seconds of real work done before it crashes.  That is enough time to kill/launch a lot of workers., [~dan.blanchard] 
Just attached patched storm-core 1.1.2 SNAPSHOT jar., [~kabhwan] I have replaced storm-core-1.1.1.jar with the attach jar and restarted our test cluster. for the last hour it works without supervisor restarts and workers getting killed (issue)., [~smaldeniya]
Thanks for reporting!, Thanks [~revans2] for fixing critical issue so quickly. I merged into all 1.x version lines and master.
Let's discuss another bug fix releases sooner.]