[I think we already have this ability.

https://github.com/apache/storm/blob/master/storm-core/src/jvm/org/apache/storm/Config.java#L259-L268

By setting storm.local.hostname on each of the supervisors it should fix your issue, because that is what will be reported to nimbus, and is what will be used when building the URL for the logviewer.
, I think routing all log viewing through a single host/port running storm ui as requested in https://issues.apache.org/jira/browse/STORM-2708 is the most desirable approach for log viewiing in a container based deployment.

The obvious alternative is  leaving storm logging as is. This forces one to either give up the convenience of accessing all logs from the browser and instead requiring to ssh into each container, or an impractically complex setup that dynamically maps and open each supervisor's logviewer port to a port accessible from outside the cluster and handles container restarts and dynamic scaling of supervisors.

This issue has in some form been going on for almost 3 years in some form https://issues.apache.org/jira/browse/STORM-1342, but I believe it is now much more urgent than it used to be since deployment in containers is a lot more common now. Moreover I believe the solution should be orchestration agnostic. In particular it should not rely on runnning under mesos. It also should also not require running additional services: Since both a zookeeper and a nimbus are already required for any deployment, that should be sufficient for coordination for storm ui to display the logs of individual supervisors at its own port., [~jmoraleda],

In storm 2.x the supervisor now has a thrift server running on it that nimbus/others should be able to access.  It should be totally doable to have the UI talk directly to the supervisor's thrift server and fold all of the log management/access functionality into the supervisor.  As an added bonus that would mean one less daemon that we would have to run/worry about, and would mean we could also write command line code to read the logs back out., In case it's helpful, here's our proxy setup that solves this pretty well: [https://gist.github.com/xofer/e2a703d80979108c76ce53e5361fbc4d]

There are a handful of links that simply couldn't be rewritten, so remain broken.

Originally posted on https://issues.apache.org/jira/browse/STORM-580]