[Github user sethgrid commented on the pull request:

    https://github.com/apache/storm/pull/979#issuecomment-167593091
  
    @vesense after signing up for a JIRA account, I created the following. I hope it was set up properly: https://issues.apache.org/jira/browse/STORM-1422
, [~vesense] here is the JIRA ticket for https://github.com/apache/storm/pull/979, Github user d2r commented on the pull request:

    https://github.com/apache/storm/pull/979#issuecomment-167623574
  
    > @vesense after signing up for a JIRA account, I created the following. I hope it was set up properly: https://issues.apache.org/jira/browse/STORM-1422
    
    Looks good.  Can you edit the title of this pull request to include `STORM-1422` so they are linked?
, Github user sethgrid commented on the pull request:

    https://github.com/apache/storm/pull/979#issuecomment-167641111
  
    @d2r updated title as per your request
, Github user d2r commented on a diff in the pull request:

    https://github.com/apache/storm/pull/979#discussion_r48502324
  
    --- Diff: examples/storm-starter/README.markdown ---
    @@ -72,23 +72,6 @@ the Maven command to build and run storm-starter (see below), Maven will then be
     of Storm in this local Maven repository at `$HOME/.m2/repository`.
     
     
    -## Running topologies with Maven
    --- End diff --
    
    @ptgoetz, what do you think of this change to remove these instructions?
    
    What is the use case for running topologies using maven?
, Github user d2r commented on the pull request:

    https://github.com/apache/storm/pull/979#issuecomment-167649310
  
    @ptgoetz, what do you think of this change to remove these instructions? Asking because I see your name on that section of the README.
    
    What is the use case for running topologies using maven?
    
    It seems since storm-core is not in compile scope, it is not on the classpath for the exec plugin?
, Github user ptgoetz commented on the pull request:

    https://github.com/apache/storm/pull/979#issuecomment-168794540
  
    @d2r I'm fine with updating the instructions. If I remember correctly (it's been a while ;) ), it was to make it very easy for new users to see a topology run in local mode.
    
    +1 for the change.
, Github user d2r commented on the pull request:

    https://github.com/apache/storm/pull/979#issuecomment-168811766
  
    Thanks @ptgoetz.
    
    @sethgrid, I see also that this changes away from RollingTopWords. If RollingTopWords does not work properly, could you create a new Jira issue to fix that separately?  We do not have to fix it with this change.
    
    +1
, Github user asfgit closed the pull request at:

    https://github.com/apache/storm/pull/979
, Thanks, [~sethammons], I merged this to master.]