[Artifacts were pushed to maven central when 0.10.0 was released:

http://search.maven.org/#search%7Cga%7C1%7Corg.apache.storm, The 0.10.0 jars referenced aren't using the code in the 0.10.x branch e.g. https://github.com/apache/storm/blob/master/storm-core/src/jvm/org/apache/storm/generated/ClusterSummary.java#L72 the pushed jars are missing the ClusterSummary.nimbuses field.  This results in any call to 
backtype.storm.generated.Nimbus.Client.getClusterInfo() failing because it doesn't expect the nimbuses field and is instead looking for the nimbus_uptime_secs field mentioned.  There could be other issues but this was the first one I ran into attempting to upgrade our deployment.

Any chance the latest 0.10.x branch can be pushed or am I missing something?, [~cburch]:  0.10.x and 0.10.0 don't have {{ClusterSummary.nimbuses}}:
* https://github.com/apache/storm/blob/v0.10.0/storm-core/src/jvm/backtype/storm/generated/ClusterSummary.java#L68-L70
* https://github.com/apache/storm/blob/0.10.x-branch/storm-core/src/jvm/backtype/storm/generated/ClusterSummary.java#L68-L70

That field [landed into master|https://github.com/apache/storm/commit/4502bffbe3f9b4cd3674a56afbda1bb115cec239] and wasn't put into 0.10.0.  I believe it's part of the HA Nimbus support that is in 0.11.x., [~cburch] 
It's just a difference between vanilla 0.10.0 and HDP.
HDP includes nimbus H/A feature which is merged to 1.0.0 for Apache Storm and not released yet. So, it's not a problem with Apache Storm, but maybe an issue with HDP.
Could you move this issue to [Hortonworks Community Connection|http://hortonworks.com/community/]?
Thanks!, [~erikdw][~kabhwan]

Oof thank you for pointing me out to the Hortonworks Community.  I didn't realize they were running on a future release!

For any future people with issues, I was lead to this post: https://community.hortonworks.com/questions/8916/submitting-a-topology-to-strom-cluster-required-fi.html that has the same issue.  This will leave you to HDP's own maven repo here: 'http://repo.hortonworks.com/content/repositories/releases' If you plumb that in to your pom you can pull the specific version you need for your maven release (e.g. our install of HDP 2.3 was using store-core 0.10.0.2.3.0.0-2557).

Thanks again guys!]