[This probably has something to do with this -- http://superuser.com/questions/104845/permission-to-make-symbolic-links-in-windows-7

If the running user is in the Administrators group, then that seems to trump the user account itself being granted the Create Symbolic Links permission., I've just encountered an error which looks very much like this in the supervisor itself when trying to deploy when upgrading from Storm 0.10.0 to 1.0.1.

In our environment, it is not possible for all people who need it to be granted the relevant permissions (due to corporate security policies etc.).

I've verified that running Storm as an administrator made it work, but that shouldn't be necessary., Blobstore feature which is introduced at 1.0.0 heavily uses symbolic link, which works well with well-known Linux distro and OSX, but bothers Windows users.

We prepared windows user guide because of that (there's deadlink on website which should be fixed soon), so you can refer https://github.com/apache/storm/blob/master/docs/windows-users-guide.md on this. I guess you're already aware of.
I believe that the account which runs supervisor doesn't need to be administrator. If not it's bad of MS (sorry!)

Personally I don't think we have to get rid of usage of symbolic link. It should be not easy and need lots of effort.

Btw, supervisor is a daemon which should be launched only one for each node. Do multiple users launch supervisors?, This is occurring in our development environment. We have many developers each starting and stopping their own isolated storm clusters.

Unfortunately, the nature of the work being done means that they can't really share instances. It's also very unlikely (I'd go as far as to say impossible) that we'll be able to get the relevant security policies set up on all the environments that we would need to.

We were hoping to upgrade to 1.0.1 in order to take advantage of the performance improvements that have been put in. Unfortunately, this is likely to prevent us from doing that.]