[Hi Parth,
I am a newbie and I found this topic interesting in Storm. I would like to contribute to this issue. I am looking forward to get some siters to solve the issue. I kind of figured out that I have to make changes to the thrift file, the supervisor heart beat function in supervisor.clj and update the ui to read the info. Let me know if I have to take care of any other classes., Hi [~redsanket] , Welcome to the storm community and thanks for showing interest to contribute. Sorry for not providing enough details on jira in first place. 

Storm will start supporting rolling upgrades in either version 0.10 or the next version as most of our serialization has moved from java to thrift. Previous version used java serialization which meant the entire cluster had to be running on  same version so it made sense to have a cluster version. With the rolling upgrade this will change and different hosts in the cluster might be running different version. It will be useful for admins to view what hosts are on what versions. 

To expose this information this jira proposes to expose the storm version in supervisor summary. This means adding a verion string to this structure https://github.com/apache/storm/blob/master/storm-core/src/storm.thrift#L150 and re-generating the thrift structure using https://github.com/apache/storm/blob/master/storm-core/src/genthrift.sh. Supervisors will also have to store this information in zookeeper so nimbus can read this information so you will need to probably look into modifying https://github.com/apache/storm/blob/master/storm-core/src/clj/backtype/storm/daemon/supervisor.clj#L505 and https://github.com/apache/storm/blob/master/storm-core/src/clj/backtype/storm/cluster.clj#L397. Once this data is stored in zookeeper nimbus needs to read it and populate the SupervisorSummary instances with version https://github.com/apache/storm/blob/master/storm-core/src/clj/backtype/storm/daemon/nimbus.clj#L1250. Finally the ui changes can be made here https://github.com/apache/storm/blob/master/storm-core/src/clj/backtype/storm/ui/core.clj#L571 and https://github.com/apache/storm/blob/master/storm-core/src/ui/public/templates/index-page-template.html#L145. 

Let me know if you need any more information and once again thanks for considering to contribute. , Thanks Parth, that will really help me. I will work today until the end of this week and hope I contribute my first patch. Let me know if there is any SLA for this JIRA. I guess it is a minor one so I might take a bit more time to solve my first patch., Hi Parth,
I did change the code to display the version info in the browser. Let me know if it is sufficient so that I can submit a pull request and also let me know if I have to fullfill any other requirement., GitHub user redsanket opened a pull request:

    https://github.com/apache/storm/pull/529

    JIRA STORM-766 (Include version info in the service page)

    I have included the code to display the version info in the web-page. Let me know if you need any other requirement.

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/redsanket/storm master

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/storm/pull/529.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #529
    
----
commit 458042ea89bd648770dcfed19d8f840fa2aea8bb
Author: sanket <schintap@yahoo-inc.com>
Date:   2015-04-17T17:33:13Z

    made changes for adding the supervisor-info version

commit 337f187eff5894d07e207861639cf55304936f79
Author: sanket <schintap@yahoo-inc.com>
Date:   2015-04-17T20:34:05Z

    made changes for adding the supervisor-info version

----
, Github user Parth-Brahmbhatt commented on a diff in the pull request:

    https://github.com/apache/storm/pull/529#discussion_r28629385
  
    --- Diff: storm-core/src/clj/backtype/storm/converter.clj ---
    @@ -5,14 +5,17 @@
       (:require [backtype.storm.daemon [common :as common]]))
     
     (defn thriftify-supervisor-info [supervisor-info]
    -  (doto (SupervisorInfo.)
    +  (log-message "supervisor-version " (:version supervisor-info))
    --- End diff --
    
    unnecessary log.
, Github user Parth-Brahmbhatt commented on the pull request:

    https://github.com/apache/storm/pull/529#issuecomment-94073243
  
    All the generated files that really has no change other then the date should be removed from the PR. Looks good otherwise, will test once you remove the files.
, Github user redsanket commented on the pull request:

    https://github.com/apache/storm/pull/529#issuecomment-94288672
  
    Hi Parth,
    I have reverted back the unmodified thrift java classes and also removed the uneccessary logs. Kindly let me know if you need anything else to be done. Thanks
, Github user revans2 commented on a diff in the pull request:

    https://github.com/apache/storm/pull/529#discussion_r28690338
  
    --- Diff: storm-core/src/clj/backtype/storm/converter.clj ---
    @@ -23,7 +25,9 @@
           (if (.get_used_ports supervisor-info) (into [] (.get_used_ports supervisor-info)))
           (if (.get_meta supervisor-info) (into [] (.get_meta supervisor-info)))
           (if (.get_scheduler_meta supervisor-info) (into {} (.get_scheduler_meta supervisor-info)))
    -      (.get_uptime_secs supervisor-info))))
    +      (.get_uptime_secs supervisor-info)
    +      (.get_version supervisor-info);;log
    --- End diff --
    
    Please clean up the comment, not sure what ;;log means, and move the closing ')' to this line
, Github user revans2 commented on a diff in the pull request:

    https://github.com/apache/storm/pull/529#discussion_r28690473
  
    --- Diff: storm-core/src/storm.thrift ---
    @@ -153,6 +153,7 @@ struct SupervisorSummary {
       3: required i32 num_workers;
       4: required i32 num_used_workers;
       5: required string supervisor_id;
    +  6: required string version;
    --- End diff --
    
    This needs to be optional, to maintain rolling upgrade compatibility.
, Github user revans2 commented on the pull request:

    https://github.com/apache/storm/pull/529#issuecomment-94460394
  
    Overall the code looks good.  The trick with the rolling upgrade is that we want to be sure that an old nimbus can work with a new supervisor and a new nimbus can work with an old supervisor too.  Similarly for the client.  An old client should be able to work with a new nimbus and a new client should, in most cases, work with an old nimbus. Perhaps the simples way to do this is to provide a default value for version which is set to something like "VERSION NOT PROVIDED".
, Github user redsanket commented on the pull request:

    https://github.com/apache/storm/pull/529#issuecomment-94522345
  
    I have modified the code as per the specifications. Please let me know if there are any specifications that have to be met. Thanks Sanket
, Github user revans2 commented on the pull request:

    https://github.com/apache/storm/pull/529#issuecomment-94568937
  
    Please upmerge, there is a merge conflict in supervisor.clj, but it does not look too complex.
, Github user revans2 commented on the pull request:

    https://github.com/apache/storm/pull/529#issuecomment-94573682
  
    I ran a simple manual test where I had an old supervisor and a new nimbus and everything worked well.  I am +1 for merging this in once the merge conflict is resolved.
, Rebased my code. Hope you can check and let me know if you have any changes, Github user revans2 commented on the pull request:

    https://github.com/apache/storm/pull/529#issuecomment-95302000
  
    +1 looks good to me.
, Github user asfgit closed the pull request at:

    https://github.com/apache/storm/pull/529
, Thanks [~redsanket],

I merged this into master.]