[Got this exception while submitting the topology built with 0.9.6 on Storm 1.0.0 cluster
java.lang.NoClassDefFoundError: org/apache/storm/guava/base/Preconditions

[~revans2] what do you think of this? It can be fixed in 1.0.0 using the ClientJarTransformer with trivial changes. I am not sure how it will work for 0.10.0 though. , Topology jars are not supposed to depend on thing that storm has shaded.  Shading the jars is an attempt to hide it from end users and turn it into an implementation detail.  This is why we ship a dependency reduced pom which does not list the dependencies that we shaded, so that they can pull in the dependency themselves and package it with their topology jar.  We did this so that a topology jar is not tied to a specific storm release as much as before.  The shading went in as part of 0.10, I am -1 on undoing https://github.com/apache/storm/commit/12fdaa01b20eb144bf18a231a05c92873c90aa09.  If you want to add in some new mappings to the hack remapping jar I am OK with that, but I would like to see the code updated so a different warning about not depending on shaded storm dependencies is output. , [~abhishek.agarwal],

Sorry I guess I was typing while you were typing.  As part of the 0.10 transition for us, we told everyone that they had to recompile against the newer 0.10 version of storm, and gave out explicit instructions including the exact version of the storm dependencies that were in 0.9.x.  That way they could have a jar that would work on both 0.9.x and on 0.10.  Typically it involved asking them to run {{mvn dependency:tree}} and save it off to a file, then update the version of storm they were compiling against to be 0.10.x and rerun {{mvn dependency:tree}}.  We then had them compare the version of their dependencies and make them match the original one.

In this case it is different because they are trying to use a class that is intended to be private to storm.  I would ask them to first pick a version of guava that they want to depend on, because it is shaded in 0.9.6 they can pick just about any one that they want, add it to their pom.xml as a dependency (that is not provided), change their imports of the guava code to point to the proper location, and then recompile/package.  The new jar should work on 0.9.6 and 0.10, and if you use the hack remapping it will work on 1.0 too.  If you want to try and port the hack back to 0.10 you can, but I really want it yelling at them if they use one of our shaded dependencies., I think it should be ok to just add new mappings in the StormShadeRequest. Depending on the 0.10 doesn't need much changes in topology since the store-core packages are still the same. I will add a method for printing warning about not using private classes of storm. 

There is another problem related to jar dependency - STORM-1625
, GitHub user abhishekagarwal87 opened a pull request:

    https://github.com/apache/storm/pull/1240

    STORM-1622: Rename classes with older third party shaded packages

    

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/abhishekagarwal87/storm shaded-classes2

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/storm/pull/1240.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #1240
    
----
commit 77facb534b9dbbb7a37ca528c85af047f020e121
Author: Abhishek Agarwal <abhishek.agarwal@inmobi.com>
Date:   2016-03-20T12:34:02Z

    STORM-1622: Rename classes with older third party shaded packages

----
, Github user abhishekagarwal87 commented on the pull request:

    https://github.com/apache/storm/pull/1240#issuecomment-198922168
  
    @revans2 - This additional support need not be in master. Let me know if you want me to raise a PR for master as well. Thanks in advance for considering this change. 

, Github user revans2 commented on the pull request:

    https://github.com/apache/storm/pull/1240#issuecomment-199957592
  
    +1 looks OK to me.
, Github user ptgoetz commented on the pull request:

    https://github.com/apache/storm/pull/1240#issuecomment-199994152
  
    +1
, Github user asfgit closed the pull request at:

    https://github.com/apache/storm/pull/1240
, Thanks [~abhishek.agarwal]. Merged to 1.x-branch.]