[{code}
$ ls -l /usr/hdp/2.5.0.0-1245/storm/lib
total 27632
-rwxr-xr-x 1 root root    53231 Mar 28 07:53 asm-5.0.3.jar
-rwxr-xr-x 1 root root  3837631 Mar 28 07:53 clojure-1.7.0.jar
-rwxr-xr-x 1 root root    79474 Mar 28 07:53 disruptor-3.3.2.jar
-rwxr-xr-x 1 root root   285211 Mar 28 07:53 kryo-3.0.3.jar
-rwxr-xr-x 1 root root    29257 Mar 28 07:53 slf4j-api-1.7.7.jar
-rwxr-xr-x 1 root root   133531 Mar 28 07:53 log4j-api-2.1.jar
-rwxr-xr-x 1 root root   824749 Mar 28 07:53 log4j-core-2.1.jar
-rwxr-xr-x 1 root root    20647 Mar 28 07:53 log4j-over-slf4j-1.6.6.jar
-rwxr-xr-x 1 root root    22542 Mar 28 07:53 log4j-slf4j-impl-2.1.jar
-rwxr-xr-x 1 root root     5711 Mar 28 07:53 minlog-1.3.0.jar
-rwxr-xr-x 1 root root    41755 Mar 28 07:53 objenesis-2.1.jar
-rwxr-xr-x 1 root root    20738 Mar 28 07:53 reflectasm-1.10.1.jar
-rwxr-xr-x 1 root root     5647 Mar 28 07:53 ring-cors-0.1.5.jar
-rwxr-xr-x 1 root root   105112 Mar 28 07:53 servlet-api-2.5.jar
-rwxr-xr-x 1 root root 20303157 Mar 28 07:53 storm-core-1.0.1.2.5.0.0-1245.jar
-rwxr-xr-x 1 root root  2492576 Mar 28 07:53 storm-rename-hack-1.0.1.2.5.0.0-1245.jar
lrwxrwxrwx 1 root root       45 Mar 28 07:55 zookeeper.jar -> /usr/hdp/2.5.0.0-1245/zookeeper/zookeeper.jar
{code}, {code}
slf4j-api-1.7.7.jar
log4j-api-2.1.jar
log4j-core-2.1.jar
log4j-over-slf4j-1.6.6.jar
log4j-slf4j-impl-2.1.jar
{code}
the main issue is, {{log4j-over-slf4j-1.6.6.jar}} and {{log4j-slf4j-impl-2.1.jar}}, living together.
refer to: https://logging.apache.org/log4j/2.x/log4j-slf4j-impl/index.html

if upgraded also needs, {{log4j-1.2.17.jar}}, due to direct reference to it in the storm code base.

[~ptgoetz][~sriharsha], What we did in our project was to exclude sf4j bridge to log4J and vice-versa everywhere. This way, Storm own logging framework continue to work, and we put a separated log4j contiguration in Storm classpath., Hi [~sreevaddi]. What you are seeing looks to be because there are multiple SLF4J bindings on the classpath. Here is a brief description of the jars involved:

* slf4j-api - Pretty self-explanatory, this is the SLF4J API classes. There's no implementation included in this.
* log4j-sfl4j-impl-2.1 - This is the Log4j 2 binding to SLF4J. This causes logs via the SLF4J API to go to a Log4j 2 logger. These loggers are configured via the log4j2/worker.xml configuration file.
* log4j-over-slf4j-1.6.6 - This is the Log4j 1 bridge to SLF4j. This causes logs on the Log4j 1 API to go to SLF4J. The result of this file along with log4j-slf4j-impl-2.1 is that both SLF4j API and Log4j 1 API logs will go to the Log4j 2 API.

Then there are the other two files, log4j-api-2.1 and log4j-core-2.1, which contain the Log4j 2 API and implementation. 

Given this line
{code}
SLF4J: Found binding in [jar:file:/tmp/356865dafc1a11e69341ecb1d7ac1510.jar!/org/slf4j/impl/StaticLoggerBinder.class]
{code}
it looks like your topology jar contains a different SLF4J binding from log4j-sfl4j-impl-2.1. You should ensure that your topology jar doesn't depend on the following (not a complete list):

* slf4j-log4j12 - This is the Log4j 1 SLF4J binding.
* slf4j-simple - This is a simple stdout binding for SLF4J

You may also want to check that your jar doesn't depend on log4j.jar, the Log4j1 implementation. log4j-over-slf4j-1.6.6 will provide classes that conflict with this.

Finally you should set the jars provided by Storm to "provided" scope in Maven. You don't want your jar to contain classes that are also on the Storm classpath. Someone else ran into this here, maybe it'll be helpful: https://stackoverflow.com/questions/36097878/exception-in-thread-main-java-lang-illegalaccesserror-in-storm-topology, Lower the priority since it is specific to the case and answer is provided. I'm thinking about closing this if there's no further input here., [~Srdo]:

Thank you. But I do not have the choice of changing the jar in my topology due to other dependencies.

I upgraded and made our own internal storm jar (I know) and proceeded further.

 

[~kabhwan]:

Please consider removing this tight coupling of logging, either now or in the future.

 ]