[GitHub user revans2 opened a pull request:

    https://github.com/apache/storm/pull/515

    STORM-762: uptime for worker heartbeats is lost when converted to thrift

    I made uptime_secs required because this is a bug where falling back to broken behavior does not feel right, and the current code has not been officially released yet.  If you want me to make it able to do a rolling upgrade I can without too much difficulty.

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/revans2/incubator-storm STORM-762

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/storm/pull/515.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #515
    
----
commit 0e9cccddeebacc42995da37bb03232867e704542
Author: Robert (Bobby) Evans <evans@yahoo-inc.com>
Date:   2015-04-08T13:46:32Z

    STORM-762: uptime for worker heartbeats is lost when converted to thrift

----
, Github user Parth-Brahmbhatt commented on the pull request:

    https://github.com/apache/storm/pull/515#issuecomment-90948540
  
    There are some unchanged files in the generated packages that should be removed from the commit.  I  think given we have not released this version yet it is ok to make this required field. 
, Github user revans2 commented on the pull request:

    https://github.com/apache/storm/pull/515#issuecomment-90992256
  
    Some of the python files had `#/bin/env python` added at the beginning.  This was part of the script that generated them.  I left them in, because it looked like they were dropped out somehow.  Not totally sure how.  If you want me to remove them I can, but then every time someone generates them again using the current scripts they will show up again.
, Github user Parth-Brahmbhatt commented on the pull request:

    https://github.com/apache/storm/pull/515#issuecomment-90996432
  
    Ok, I think we can keep them as is. I am +1 for the change and thanks for catching this.
, Github user asfgit closed the pull request at:

    https://github.com/apache/storm/pull/515
, Thanks for the reviews I merged this into master]