[This problem exists only for the 0.10.x branch and it is a minor bug. So I am not completely sure if this needs to be fixed. , For us, running multiple storm nimbus instances on one server this is quite an annoying problem as we have to set three ports for the nimbus instances to listen on. So, we would be very happy if this bug gets solved. Thanks in advance for reconsidering this.

Best regards,
Alex, [~aswen],

It should be a very simple fix.

Change

https://github.com/apache/storm/blob/v0.10.0/storm-core/src/clj/backtype/storm/thrift.clj#L76

to be

{code}
 nimbusClient (NimbusClient. conf host (int port) nil as-user)
{code}

I don't really have time to test this myself, but if you want to test it and create a pull request that would be great., GitHub user abhishekagarwal87 opened a pull request:

    https://github.com/apache/storm/pull/1301

    STORM-1645: convert nimbus.thrift.port to int to avoid ClassCastException

    Verified that it works

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/abhishekagarwal87/storm 0.10.x-branch

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/storm/pull/1301.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #1301
    
----
commit 5d9fede5d240645b1bd17835ed2cf7a4c6fad93b
Author: Abhishek Agarwal <abhishek.agarwal@inmobi.com>
Date:   2016-04-02T07:56:57Z

    STORM-1645: convert nimbus.thrift.port to int to avoid ClassCastException

----
, Github user HeartSaVioR commented on the pull request:

    https://github.com/apache/storm/pull/1301#issuecomment-208800261
  
    +1
, Github user abhishekagarwal87 commented on the pull request:

    https://github.com/apache/storm/pull/1301#issuecomment-209359442
  
    @HeartSaVioR - can you merge this?
, Github user asfgit closed the pull request at:

    https://github.com/apache/storm/pull/1301
, Merged to 0.10.x-branch.]