[I discovered the issue when trying to refactor the test, It looks like the test is doing a partial mock of LocalFsBlobStore, where the parts that would be hitting Zookeeper are stubbed. It's kind of an unfortunate way to do this kind of test (partial mocks usually point to the class doing too much), but the test itself looks correct to me. I don't think this points to a bug, it's just that the test probably should have been written differently (and LocalFsBlobStore split up). , It looks like that not all Zookeeper calls are stubbed correctly. Exception are thrown when LocalFsBlobStore#prepare gets called, which calls BlobStoreUtils.createZKClient and ClusterUtils.mkStormClusterState, which then issue connection to zookeeper under the hood. I guess that the exception is suppressed implicates that this is a common issue, but may be hard to fix. [~Srdo], Yes, but prepare just opens a Zookeeper client, which then complains about not being able to connect. The test stubs checkForBlobOrDownload and checkForBlobUpdate, which are the methods that would actually make use of the client. You are right that it would be much nicer if we didn't open a Zookeeper client at all, but I think the best way to fix this would be to do some refactoring of LocalFsBlobStore so it's possible to write this test without partial mocking., Also I'm not sure the exception is suppressed as such, the Zookeeper client runs a separate thread that tries to connect and logs that warning when it can't. It's not going to throw an exception in the main thread unless the test tries to actually use the client., It doesn't, but it's likely to cause a timeout error. If I remembered correctly, StormTimer terminates the process in case of a time out, with code 20, "Error when processing event", which was what I saw in the test failure message. [~Srdo], I might be wrong. Let me take a look at StormTimer again., Could you point me in the right direction, I'm missing where StormTimer is being used for Zookeeper stuff in this test?, I added the stack trace of the exception that crashed the test. It looks like other build failures are likely to be caused by the same error. It's really strange though. [~Srdo]]