[2 log files build with IBM JVM. Both with "Clojure failed" error message.
2 log files built with Oracle JVM. One without "Clojure failed" error message. One with.

All done on Ubuntu / x86_64 .

$ uname -a
Linux dorado-vm3 3.13.0-24-generic #47-Ubuntu SMP Fri May 2 23:30:00 UTC 2014 x86_64 x86_64 x86_64 GNU/Linux
, Hi,
Still with Oracle JVM, I've tested with fresh Clojure version (Master from today's Clojure GitHub : 1.7.0-master-SNAPSHOT) and I've got the same results:
  Out of 3 tries, I've got one success (no "Clojure failed" message) and 2 failures ("Clojure failed" message).

Moreover, though Clojure failed, no failures appear in the summary of tests:
Module                                          Total Failure Error Skipped
---------------------------------------------------------------------------
Storm Core 0.10.0-SNAPSHOT                         10     0     0     0
storm-starter 0.10.0-SNAPSHOT                     226     0     0     0
storm-kafka 0.10.0-SNAPSHOT                        36     0     0     0
---------------------------------------------------------------------------
                                        Total     272     0     0     0
, About the master of Clojure (version clojure-1.7.0-master-SNAPSHOT) that I compiled on my Ubuntu/x86_64 machine, I've run 6 times the tests and never got any failure.
So, in my opinion, the issue is in Storm. Can you reproduce my issue ?, Who could provide me some hints about this issue ?
I see many discussions about this "Clojure failed" on the Web, but I do not see any clear answer about the root cause and the solution., "clojure failed" is a generic response from the clojure maven plugin to say that the external clojure process did not run well, for any number of reasons.

https://github.com/talios/clojure-maven-plugin/blob/clojure-maven-plugin-1.3.18/src/main/java/com/theoryinpractise/clojure/AbstractClojureCompilerMojo.java#L451

if you look at the code it could be an IOException, the details of which are eaten by the plugin, or it could be that the spawned processes exited with a non-zero value.  Sadly newer versions of the plugin are not more descriptive.  I would suggest modifying the theoryinpractice plugin to give out more details about exactly what failed, install it in your m2 repo and reproduce the issue.

Once you know if it is an IOException or exit code you know which place to look.  My guess is that it is an exit code.  At that point you need to start looking to what the exit code was, and what can cause that exit code. , I'm running into the same problem. I've some local changes which I'm trying to compile, but build fails. I can't fix it as I don't know what the problem is. So, I'm wondering how storm-dev builds storm? I'm sure it won't be like this because how would you suppose to fix problems if you don't know what it is. And if there is a different process, it should be documented.]