[https://github.com/apache/storm/pull/385 - STORM-469, Does this duplicate STORM-360, or is there something here we want to add to further help?, [~dagit] you are right, looks to be a duplicate., I think it would help to link from the error to the longer form error and to include text indicating the log file in which the error can also be seen. That is what would have helped me at the time., That could be tricky.  The storm worker code would need to know the byte-offset into the log at which the error occurred and report that as part of the error, and I'm not sure we would want the worker to know such details of the logging system.

Recently we started testing a change to storm that allows us to search the most recent, active worker logs for a fixed string.  Once we find the opportunity to submit it to apache/storm, we could then add a link to perform a search on the corresponding worker log for that sub-string that we see now.  This way the storm worker code does not have to know where its log messages are going or know anything about file offsets.

We could click this new link next to the cut-off error text and we would be able to see any instances in the real worker log file with that error snippet., Such a solution would have helped me significantly., https://github.com/apache/storm/pull/388, Meant to reply earlier.  OK, I would rather not resolve this jira as a duplicate then.  What if we rename it to something like "No easy way to reach full stack trace from UI Last Error Detail?"  Then we can see what solution would be appropriate., Github user rekhajoshm commented on the pull request:

    https://github.com/apache/storm/pull/385#issuecomment-72723038
  
    created separate pulls.
, Github user rekhajoshm closed the pull request at:

    https://github.com/apache/storm/pull/385
, Github user revans2 commented on the pull request:

    https://github.com/apache/storm/pull/388#issuecomment-78327431
  
    +1 I think the change is a good start to this problem.
, Github user asfgit closed the pull request at:

    https://github.com/apache/storm/pull/388
, Thanks [~rekhajoshm],

I merged your pull request into master.  It is as good of a solution as we can probably do at this time. Keep up the good work., Github user d2r commented on the pull request:

    https://github.com/apache/storm/pull/388#issuecomment-102503828
  
    > @d2r Thanks, and that is another thing - why do we have log link on port number?
    > That does not make any sense at all.The truncated text is where the user expects a error log link on.
    
    @rekhajoshm , sorry, somehow I did not get notified of this post.
    
    The worker log link on the port number corresponds to the way the worker log link is designed into the Executors table on the Component page.  The two are thus consistent.  But that does not mean it makes more sense than having the link to the worker log somewhere else. You have raised a good point.
    
    It turns out that this change breaks the red-coloring of errors reported less than 5 minutes in age (since it makes the entire text a blue link), so we need to revert this change for now.
    
    I am -1, since it breaks functionality.
, Had to revert changes with the [pull request|https://github.com/apache/storm/pull/388] as it broke recent-red coloring of the truncated error text., [~rekhajoshm]

What if we did this:
1) Remove worker log links from port numbers.
2) Add "Worker Log" link after the truncated error message on its own line.

This would prevent the redundant link, let the red-coloring still work, and make it clearer how to find the worker log for the error.  What do you think?, This would work for me as the issue is just knowing where to go to get to the error when you are new to the system.]