[GitHub user Lewuathe opened a pull request:

    https://github.com/apache/storm/pull/352

    [STORM-591] exclude logback.xml from jar

    `logback.xml` should not be included jar file because it will override other configuration who use your jar. 
    To avoid this case exclude `logback.xml` file from storm-core jar file. 

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/Lewuathe/storm exclude-logbackxml

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/storm/pull/352.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #352
    
----
commit 4ffb02d80df3e068d34f14b4c625d6e3a696cec7
Author: lewuathe <lewuathe@me.com>
Date:   2014-12-19T11:22:20Z

    [STORM-591] exclude logback.xml from jar

----
, Github user harshach commented on the pull request:

    https://github.com/apache/storm/pull/352#issuecomment-67654350
  
    @Lewuathe I think logback.xml is not being used anymore instead there is logback/cluster.xml, worker.xml. I think a better fix is to remove the file itself.
, Github user Lewuathe commented on the pull request:

    https://github.com/apache/storm/pull/352#issuecomment-67724394
  
    @harshach OK. I'll remove `logback.xml`. Thank you for your advice. 
, Github user revans2 commented on the pull request:

    https://github.com/apache/storm/pull/352#issuecomment-67997538
  
    This seems to be used by the tests, after this change see a lot of DEBUG and INFO logs from zookeeper.  Instead of deleting it, can we move it to a directory that is only on the classpath for tests?
, Github user Lewuathe commented on the pull request:

    https://github.com/apache/storm/pull/352#issuecomment-68525425
  
    I found logback searches logback-test.xml first and at eventually I renamed xml file and excluded it when it is packaged. I think it is a better way because it can show this xml file is only used for test explicitly. 
, Github user d2r commented on the pull request:

    https://github.com/apache/storm/pull/352#issuecomment-112214321
  
    I like the change, but I think now we need to update for log4j2. @Lewuathe would you be willing to convert the syntax for log4j2?
, Confirmed logback.xml file exists within 0.9.4 and 0.9.5 as well.  

Appears to have been removed in 0.10+ but has been replaced by log4j2.xml file which I believe is redundant., Github user d2r commented on the pull request:

    https://github.com/apache/storm/pull/352#issuecomment-146660961
  
    @Lewuathe ,
    The file has been converted to log4j2.xml, so all we need to do get your branch upmerged.  Would you take a look?
, Github user knusbaum commented on the pull request:

    https://github.com/apache/storm/pull/352#issuecomment-193486500
  
    Closing this. Feel free to reopen with updates.
, Github user asfgit closed the pull request at:

    https://github.com/apache/storm/pull/352
]