[GitHub user ashnazg opened a pull request:

    https://github.com/apache/storm/pull/928

    Use File.separator for OS independence in Blobstore LocalizerTest

    This clears up one incidental issue shown on STORM-1378, the one test failure due solely to "/" vs "\" in the path comparison.  This does _not_ solve the larger issue on STORM-1378.

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/ashnazg/storm fileSep

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/storm/pull/928.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #928
    
----
commit 8e7a6f227cdaeb166f743ed931df8d2508f31de1
Author: Chuck Burgess <cburgess@progressrail.com>
Date:   2015-12-07T21:39:57Z

    use File.separator for OS independence;

----
, PR #928 solves the one failure that's shown (due solely to "/" vs "\" in the path comparison), but it does not address the main issue of this JIRA., readBlobTo in BlobStore.java does not close the output stream before the move is performed inside the supervisor code. I suspect that might fix the problem. It would be great if you can test for it, @sanket991 good eye, though that didn't solve it.

A large part of these failures is the Windows symlink issue with Adminstrators group (http://superuser.com/questions/104845/permission-to-make-symbolic-links-in-windows-7)

At best, my PR clears up the incidental failures due to OS path slashes and testcase cleanup failures.  The symlink issue cannot be solved., Github user ashnazg commented on the pull request:

    https://github.com/apache/storm/pull/928#issuecomment-163412824
  
    These last additions are the best that can be done.  The symlink issue can't be solved (see JIRA).
, Github user revans2 commented on the pull request:

    https://github.com/apache/storm/pull/928#issuecomment-163675116
  
    +1
, Github user asfgit closed the pull request at:

    https://github.com/apache/storm/pull/928
, Thanks [~ashnazg],

I merged this into master.]