[[~bbaugher] are you able to see the above topology name "destination_backfill" in UI main page(/index.html) as part of topology summary section. NotAliveException thrown if it can't find the topology name for a given topology id ., Yes I see the topology as part of the main page but its id is 'destination%F5backfill'. Following the link gives me that error because it changes the id., [~bbaugher] Thanks.  I am able to reproduce this. We should encode these at the nimbus level. I'll send a patch., 1) For me, the string "destination%5Fbackfill" breaks on master now because the back-end is looking for the decoded '_'.

2) Interestingly, the string "destination%F5backfill" breaks on master, but not because the encoding did not happen; it breaks on the client side because %F5 (not %5F as perhaps you meant) does not actually decode.  The error comes from purl.js, where it tries to parse the URI to get the topology ID, but the string is not able to parse the %F5.

You can see it happen when you call decodeURI('%F5').  When you decodeURI('%5F'), you just get the underscore.

It seems we 1) are decoding when we shouldn't and 2) neglecting to encode when we should.

I agree that using either string in a topology name are valid use cases., For me the destination_backfill works just fine. 

As Derek pointed out destination%5Fbackfill fails, but that is not really a nimbus issue. The client is sending a get request with already decoded url so client sends denstination_backfill which is what master looks for and fails. The decoding happens as part of topology.html which tries to construct a new url by decoding the windows own url using purl.js

destination%F5backfill fails because purl.js is trying to decode a non encoded string. 

Even if we encode the url on server side , purl.js decodes it twice once during the data: phase and then during the param: extraction phase. So for a string like Even if we encode the url on server side , purl.js decodes it twice so destination%5Fbackfill is encoded to destination%255Fbackfill on server side. This gets decoded twice on client side converting to original destination%5Fbackfill in the first data phase and then to destination_backfill which is the string sent to nimbus.

We either need to fix purl.js library or move to ajax.url. I haven't yet had success with ajax.url but not sure what the root cause is in that library.

, I have opened up an issue https://github.com/allmarkedup/purl/issues/86 for fixing the purl.js bug in the purl.js repo.  

In the mean time I have started using an alternative library, jquery's url plugin http://plugins.jquery.com/url/.

I found a bug on the server side code due to which we were double decoding the url params. Once during clout.core's CompiledRoute method and then in our ui/core.clj in all the Get and Post methods. This bug again results in the same effect as the bug in purl.js. I have removed the decoding from core.clj. Please let me know if you want me to open a separate issue for the bug.

As we are using mustache templates with anchor tags there is no way to encode topologyids on client side without either moving away from mustache or replacing all anchor tags with some jquery onclick binding. If we just send the encoded id's back to client then both, the anchor tag and the user's display text, appears encoded. To overcome this I had to update the response on the server side to include both the encoded and normal ids. 

I have tested the ui locally with topology name = destination%@#$^*-_=+backfill. I will send a pull request shortly. 
, GitHub user Parth-Brahmbhatt opened a pull request:

    https://github.com/apache/incubator-storm/pull/242

    STORM-439: Replace purl.js with jquery url plugin to support special cha...

    ...racters in topology names.
    
    BugFix: Remove double decoding from the ui server, currently the decoding happens as part of clout.core.clj and ui.core.clj. Removed the decoding from ui.core.clj.
    Encode all url components on server side. Added the encodedId as response param to ensure the url from client side uses encoded component but the user still sees unencoded value.

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/Parth-Brahmbhatt/incubator-storm STORM-439

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/incubator-storm/pull/242.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #242
    
----
commit c0eec64c74a97ff8a1ba28488a5c2775f4f81bfd
Author: Parth Brahmbhatt <brahmbhatt.parth@gmail.com>
Date:   2014-08-26T04:12:50Z

    STORM-439: Replace purl.js with jquery url plugin to support special characters in topology names.
    BugFix: Remove double decoding from the ui server, currently the decoding happens as part of clout.core.clj and ui.core.clj. Removed the decoding from ui.core.clj.
    Encode all url components on server side. Added the encodedId as response param to ensure the url from client side uses encoded component but the user still sees unencoded value.

----
, Github user revans2 commented on a diff in the pull request:

    https://github.com/apache/incubator-storm/pull/242#discussion_r16714479
  
    --- Diff: storm-core/src/clj/backtype/storm/ui/core.clj ---
    @@ -424,7 +424,7 @@
                              (if bolt-summs
                                (mapfn bolt-summs)
                                (mapfn spout-summs)))
    -                :link (url-format "/component.html?id=%s&topology_id=%s" id storm-id)
    +                :link (url-format "/component.html?id=%s&topology_id=%s" (url-encode id) (url-encode storm-id))
    --- End diff --
    
    Why do we need to double encode the id and storm-id?  url-format already encodes them once.
    
    ```
    (defn url-format [fmt & args]
      (String/format fmt
        (to-array (map #(url-encode (str %)) args))))
    ```
, Github user revans2 commented on the pull request:

    https://github.com/apache/incubator-storm/pull/242#issuecomment-53427732
  
    OK so mustache will do HTML escaping with the ```{{var}}``` like syntax, but it will not do URL encoding. So we have added in URL encoded ids to the result of the REST APIs to allow us to not bother with doing the URL encoding in the browser.  That seems OK I guess.  But why are we not url decoding the url parameters in the REST API any more?  Is it because the ring framework already decodes them for us?  And I am really confused why in the visualization-data function we need to double url encode the ids in the link? From the look of it, it is because we take those parameters and place them in a new URL for the rest call.  I would much rather have the browser encode them again when making them a part of the URL.  encodeURIComponent should be what we want and is a standard part of javascript.
, Github user revans2 commented on the pull request:

    https://github.com/apache/incubator-storm/pull/242#issuecomment-53428003
  
    Oh and if we don't need/use purl any more we should remove it and the license section for it.
, Github user Parth-Brahmbhatt commented on a diff in the pull request:

    https://github.com/apache/incubator-storm/pull/242#discussion_r16726994
  
    --- Diff: storm-core/src/clj/backtype/storm/ui/core.clj ---
    @@ -424,7 +424,7 @@
                              (if bolt-summs
                                (mapfn bolt-summs)
                                (mapfn spout-summs)))
    -                :link (url-format "/component.html?id=%s&topology_id=%s" id storm-id)
    +                :link (url-format "/component.html?id=%s&topology_id=%s" (url-encode id) (url-encode storm-id))
    --- End diff --
    
    I missed this , I just blindly went through all the urls and encoded the components. Not sure why in my testing I was not able to catch this though. 
, Github user Parth-Brahmbhatt commented on the pull request:

    https://github.com/apache/incubator-storm/pull/242#issuecomment-53454343
  
    Our mustache templates have anchor tags where we just do the following 
    
    <a href="/topology.html?id={{id}}">{{name}}</a>
    
    As you already mentioned mustache does the escaping but not encoding. So the above results in unencoded url which results in the bug that we are trying to fix.  I have tried reading through mustache docs and googling around to see if there is any way to invoke javascript functions like encodeURIComponent as part of mustache template and I haven't had much luck. The only suggestion was to send lambda constructs as response from server side which is no different then just sending encoded components. There are 3 other alternatives that I could think of:
    
    1) Encode and server side, which is what we are doing right now.
    2)  Process the json on browser side before rendering using mustache. Pretty much the same thing as above but the client will have to loop through json response twice once to encode and once to render using mustache.
    3) Use a more powerful library than mustache or replace all anchor tags with some div's with onclick being handled by jquery. 
    
    The easiest of 3 was the 1st option so I went with it. That said, I am not sure what are the general best practices so I don't mind changing it to option 2 or 3 or any other idea that someone else can propose.
    
    The URL decoding happens as part of https://github.com/weavejester/clout/blob/master/src/clout/core.clj#L96
    So the decoding on our side results in a bug. 
    
    test%5Ftest -> browser sends encoded test%255Ftest -> clout decodes to test%5Ftest -> our code decodes again and tries to look for test_test topology which is not alive. 
    
    I can remove the purl.js but I am not sure which library is actually better so if anyone has any comparison points please let me know. I am planning to fix the purl.js bug so if the change request gets approved we can always revert back to it. 
    

, Github user revans2 commented on the pull request:

    https://github.com/apache/storm/pull/242#issuecomment-56726151
  
    I am really sorry that it took me so long to look at this again since you made the last commit.  It looks great. But now it needs to be upmerged because some of the templates were reformatted.  Again looks great +1.
, Github user Parth-Brahmbhatt commented on the pull request:

    https://github.com/apache/storm/pull/242#issuecomment-56735833
  
    upmerged.
, Github user revans2 commented on the pull request:

    https://github.com/apache/storm/pull/242#issuecomment-56985857
  
    +1 looks great.  Give a few more days for others to comment on the upmerge.
, Github user harshach commented on the pull request:

    https://github.com/apache/storm/pull/242#issuecomment-57407000
  
    +1 looks good. Tested this on a cluster.
, Github user ptgoetz commented on the pull request:

    https://github.com/apache/storm/pull/242#issuecomment-57415388
  
    +1 If no one minds, I'd like to merge this one so I can verify the licensing is correct (no code changed).
, Github user asfgit closed the pull request at:

    https://github.com/apache/storm/pull/242
]