[After some serious digging we noticed that the problem is to be searched in Apache Curator, as the ZNode is apparently created in an incomaptible {{CreateMode}}. See https://issues.apache.org/jira/browse/CURATOR-435 for more details., The Curator community addressed the problem in https://issues.apache.org/jira/browse/CURATOR-436. 
, FYI - I'm the lead on Curator. We've EOL'd 2.x but might consider a release with this fix if the Storm community thinks it's important. Please let us know., [~randgalt]
Hi Jordan, I think it is ideal for resolving current issue if Curator could have new 2.x release. If not we may need to go on upgrading Curator version.
AFAIK, we intended to not update Curator version because it refers Zookeeper 3.5.x which Zookeeper community has been saying it as 'alpha', and recently saying it as 'beta'.
Does curator community feel safe for Zookeeper 3.5.x to upgrade?, [~kabhwan] Version 4.0.0 of Curator should support Zookeeper 3.4.x. https://curator.apache.org/zk-compatibility.html. We might give upgrading to the latest Curator while leaving the current Zookeeper version alone a shot if we're not comfortable upgrading Zookeeper? , Upgrading to 4.0.0 seems pretty easy, the tests pass with it with only a few minor changes. I'll poke a bit more at it and then open a PR so others can hopefully help try it out. The upgrade should probably go on this issue, so I'll assign it to me. Let me know if the upgrade belongs in a different issue instead., We'd prefer that you use 4.0.x but if you want a new 2.x delta please open a ticket in our Jira and we can do it., [~Srdo]
According to zk-compatibility page, Curator 4.0.x supports both Zookeeper 3.5.x and 3.4.x, but major support version is 3.5.x and supporting 3.4.x looks more like a compatibility mode. We may need to do full manual/system tests with Curator 4.0.x/Zookeeper 3.4.x before deciding to move to Curator 4.0.x., [~kabhwan] Sorry, I missed your comment here. I just merged https://github.com/apache/storm/pull/2378 to master. Do you want me to revert it until we can do more tests?, [~Srdo]
We checked that only Curator version is changed in dependency tree, then I'm OK to move forward on this.
We should do some manual tests (and automated system tests if possible) before releasing version for every releases so I'm expecting that will be covered later.
Maybe you would want to bring this to also 1.2.0, then please craft a pull request on 1.x branch as well., Thanks [~Srdo],

I merged this into branch-1.x and branch-1.1.x.  It didn't apply cleanly to 1.0.x so I didn't pull it in there., [~randgalt] We're going to give 4.0.0 a shot. Thanks for the great work on Curator.]