[I am not sure why we keep deleting hadoop-auth dependency from core pom.xml. Its in 10.x branch but not master. In secure cluster this dependency is essential to have a login into ui . Without this we will be shipping non-functional storm ui. This jira is to add this dependency back., [~sriharsha],

The problem is that it is not actually a dependency of storm-core.  It is a dependency for an HttpServletFilter pulled over from Hadoop that can be added in after the fact.  When people try to look at storm dependencies they see that hadoop-auth is not used and they remove it.  Perhaps what we really need to do is to have a separate external package that pulls in the ui filter and all the dependencies it needs.  Then we can have simple instructions on how to configure the filter using either the {code}${storm.home}/extlib-daemon{code} directory or preferably the {code}STORM_EXT_CLASSPATH_DAEMON{code} environment variable and {code}storm_env.ini{code}.  This way it would not add an unnecessary dependency on the classpath for anyone, and it is properly packaged + documented as an official part of storm., [~revans2] I disagree on this. when we are saying we are shipping security and pretty much not allow user to login into ui in secure manner unless they drop a another jar int ext-lib. This is very broken. I still don't understand why having this dependency is an issue. 
We can just add a comment on the pom.xml dependency explaining why its there and lets not remove it., Sorry at Yahoo we have a separate single sign on, which I wish would die but that is a different discussion, so I don't completely understand how the SPNEGO code is packaged.  If hadoop-auth provides all of the functionality that we need for the HttpServletFilter then yes, we should have it as a part of storm-core, and put a big comment in the pom that explains why it is here along with a big 'DO NOT TOUCH'.  I would prefer to have it be shaded or only installed on the daemon classpath to avoid conflicts with different versions of Hadoop that a user might want instead, but that is just me., GitHub user priyank5485 opened a pull request:

    https://github.com/apache/storm/pull/1000

    STORM-1160: Add hadoop-auth dependency needed for storm-core

    hadoop-auth is needed for storm ui in a secured cluster for
    authentication. Adding the dependency back since it was removed in one
    of the commits.

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/priyank5485/storm STORM-1160

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/storm/pull/1000.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #1000
    
----
commit f939fc27fbcc8dd1fc1e3b9d8948f1994fc399af
Author: Priyank <pshah@hortonworks.com>
Date:   2016-01-09T01:15:51Z

    STORM-1160: Add hadoop-auth dependency needed for storm-core
    
    hadoop-auth is needed for storm ui in a secured cluster for
    authentication. Adding the dependency back since it was removed in one
    of the commits.

----
, Github user revans2 commented on the pull request:

    https://github.com/apache/storm/pull/1000#issuecomment-170580035
  
    +1 hopefully we get true integration tests soon so we can catch this earlier.
, Github user asfgit closed the pull request at:

    https://github.com/apache/storm/pull/1000
, Thanks [~pshah],

I merged this into master.]