[GitHub user revans2 opened a pull request:

    https://github.com/apache/incubator-storm/pull/231

    STORM-461: exit-process! does not always exit the process, but throws an...

    ... exception instead

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/revans2/incubator-storm STORM-461

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/incubator-storm/pull/231.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #231
    
----
commit 9c9803b98efbea2b651a56051ed1d9b4d7c484b9
Author: Robert (Bobby) Evans <evans@yahoo-inc.com>
Date:   2014-08-19T20:35:04Z

    STORM-461: exit-process! does not always exit the process, but throws an exception instead

----
, When was halt-process! changed to exit-process!, and why? The reason halt was used in the first place was because in some situations exit won't always shutdown the process, so it's much safer to use halt and minimize the chance of having a living process that's supposed to be dead but in an unknown state., https://issues.apache.org/jira/browse/STORM-183
https://github.com/apache/incubator-storm/pull/139

We replaced the halt with exit, and then added in a shutdown hook that would call halt after 1 second.  This gives the process 1 second to call cleanup before everything is shot in the head., Sorry correcting myself, the code does not actually call Runtime.halt, it sends a kill -9 to itself ```(force-kill-process (process-pid))``` we can switch it to a Runtime.halt if you think that is less error prone., Yea Runtime.halt would definitely be better than sending a process signal., I filed STORM-471 for the issue.  I'll try to through up a pull request shortly., Github user d2r commented on the pull request:

    https://github.com/apache/incubator-storm/pull/231#issuecomment-53903767
  
    +1 Confirmed this works while testing #177.
, Thanks, Bobby.  I merged this to master., Github user asfgit closed the pull request at:

    https://github.com/apache/incubator-storm/pull/231
, Github user Parth-Brahmbhatt commented on the pull request:

    https://github.com/apache/incubator-storm/pull/231#issuecomment-53917927
  
    +1 sorry about the bug.  
, Github user d2r commented on the pull request:

    https://github.com/apache/incubator-storm/pull/231#issuecomment-53920239
  
    @Parth-Brahmbhatt it is fine. This is what the testing is for :)
]