[[~arunmahadevan] any update on this doc., GitHub user arunmahadevan opened a pull request:

    https://github.com/apache/storm/pull/1269

    [STORM-1544] Document Debug/Sampling of Topologies

    Added documentation for logging/sampling events in a topology.

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/arunmahadevan/storm STORM-1544

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/storm/pull/1269.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #1269
    
----
commit 9dfe488a4dfaeadcd55cd7e5715eb8782ea036b2
Author: Arun Mahadevan <aiyer@hortonworks.com>
Date:   2016-03-28T08:49:31Z

    [STORM-1544] Document Debug/Sampling of Topologies
    
    Added documentation for logging/sampling events in a topology.

----
, Github user HeartSaVioR commented on the pull request:

    https://github.com/apache/storm/pull/1269#issuecomment-202422084
  
    +1
    I think we can add a note about performance issue regarding #1217 when we're sure it does have performance hit.
, Github user revans2 commented on the pull request:

    https://github.com/apache/storm/pull/1269#issuecomment-202469629
  
    It looks good can we add a link to this in docs/index.md as well?  Otherwise it will not be easy to find in the UI.
, Github user ptgoetz commented on the pull request:

    https://github.com/apache/storm/pull/1269#issuecomment-202503186
  
    @revans2 The yaml front matter `documentation: true` should take care of that.
    
    +1
, Github user revans2 commented on the pull request:

    https://github.com/apache/storm/pull/1269#issuecomment-202505790
  
    @ptgoetz Not for the release specific docs.  At least I didn't end up setting it up that way, and so if I missed something, then I am happy to go back and try and fix it.
, Github user ptgoetz commented on the pull request:

    https://github.com/apache/storm/pull/1269#issuecomment-202512108
  
    @revans2 Okay. I didn't realize that had changed, I'm okay with either approach.
    
    One thing I did notice is that the documentation dropdown is missing from the home page, and the downloads page is now a 404.
    
    (sorry for hijacking this pull request)
, Github user revans2 commented on the pull request:

    https://github.com/apache/storm/pull/1269#issuecomment-202522582
  
    @ptgoetz I didn't realize that we were generating an index using the docs tag.  I am happy to go back and add something in again for it.
    
    Also everything is working fine for me.  what browser are you using?  is there something in your cache that is messed up? Just FYI I renamed the download.html to releases.html, because it includes more then just download links, but the download button points to the proper place.  I am happy to revert that change too if you had other stuff pointing to it.
, Github user harshach commented on the pull request:

    https://github.com/apache/storm/pull/1269#issuecomment-202525621
  
    @revans2 we should add redirection from downloads.html to release.html. 
, Github user ptgoetz commented on the pull request:

    https://github.com/apache/storm/pull/1269#issuecomment-202531899
  
    @revans2 It was a caching issue. Sorry for the noise.
    
    I agree with @harshach, we may want to consider a redirect from downloads.html to release.html to keep from breaking external links and bookmarks.
    
    I think we need to add a link to the KEYS file for releases, and it might help to add maven information like we did in the old downloads page.
, Github user arunmahadevan commented on the pull request:

    https://github.com/apache/storm/pull/1269#issuecomment-202704798
  
    @revans2 @ptgoetz added a link in docs/index.md
, Github user HeartSaVioR commented on the pull request:

    https://github.com/apache/storm/pull/1269#issuecomment-202728833
  
    +1 again.
    I think we can grep issues on website and raise an issue to follow up.
, Github user arunmahadevan commented on the pull request:

    https://github.com/apache/storm/pull/1269#issuecomment-202733505
  
    Appears that some html pages are broken. E.g. http://storm.apache.org/releases/1.0.0-SNAPSHOT/State-checkpointing.html beyond the section "IStateful bolt hooks", the formatting and sections headings are lost. Do we need to fix something in the scripts that generate the html files ?

, Github user ptgoetz commented on the pull request:

    https://github.com/apache/storm/pull/1269#issuecomment-203605038
  
    @arunmahadevan That's likely a typo or formatting error in the markdown file.
, Github user arunmahadevan commented on the pull request:

    https://github.com/apache/storm/pull/1269#issuecomment-204244154
  
    @ptgoetz updated the doc to reflect the new (disabled by default) behavior. Please review.
, Github user HeartSaVioR commented on the pull request:

    https://github.com/apache/storm/pull/1269#issuecomment-204250943
  
    +1
, We forgot to merge this before releasing Apache Storm 1.0.0.

Adding Epic Link to not forget about merging and rebuilding site before releasing 1.0.1., Github user asfgit closed the pull request at:

    https://github.com/apache/storm/pull/1269
, Thanks [~arunmahadevan]. Merged to master and 1.x-branch.]