[I really want to resolve this issue in order to be sure about Travis CI result.
I'm trying to increase baseSleepTimeMs and maxRetries in ExponentialBackoffRetry, but it doesn't help. 
It actually makes another strange problems., [~kabhwan] does the "KafkaUtilsTest" still fail after the Kafka version upgrade and related configuration change in the test by storm-826?

https://github.com/apache/storm/pull/572, I didn't test it. I'll include storm-kafka to Travis CI build and test it.

First try: https://travis-ci.org/HeartSaVioR/storm/builds/74841343, In your first try, storm-kafka tests did not fail (storm-hive failed, not sure about the reason).
We need to further verify whether the storm-kafka tests still fails intermittently. Thanks!, Build fails on master branch, because of storm-hive, too.
It couldn't reach unit tests so we should fix storm-hive issue first., storm-hive tries to download SNAPSHOT of calcite, but nexus.codehaus.org is not reachable so downloading is failed.
STORM-944 is a workaround, so I apply it and re-test. 

Here's a new build link.
https://travis-ci.org/HeartSaVioR/storm/builds/75000336

Btw, you can setup your fork to try building Storm from Travis CI. 
Why not try it? :) It would really help to determine random failure., [~zhuoliu]
I rebuilt "test-kafka-test" branch 5 times in a row (tested with jdk7, jdk8, so storm-kafka unit tests were run 10 times).
And I can see there's no longer storm-kafka's random failure. Great!

We can create a PR which removes exclude option now., Unfortunately I found random test failures on storm-kafka at 6th build., Actually I've met a random test failures on storm-core first, so we're leaving decision whether we ignore low probabilities of random failures or not., Thanks Jungtaek for your test efforts! 
What is the reason for storm-core test failure, should that one be ignored or we may need to fix it? It is possible that these two failures are related or have a common reason?  
, Thanks!

I didn't track build failures at that time but I don't think those are related.
Btw, I'm tracking random failures to umbrella issue, https://issues.apache.org/jira/browse/STORM-915., Seems like I found random test failure.
Filed issue : https://issues.apache.org/jira/browse/STORM-981, Nice. For the storm-kafka tests, as you said, we're leaving decision whether we ignore low probabilities of random failures or not. And it may be good for us to include the kafka tests now since it is no longer "all the time fails"., Yes, I agree.
I made a new issue addressing re-include storm-kafka to Travis CI build. https://issues.apache.org/jira/browse/STORM-980, Linking the JIRA that probably fixed this issue.

The Sub-Tasks are closed now.  If the CI build succeeds without storm-kafka tests failing, we should be able to close this Bug.]