[1.x / 2.x doc has explanation of old doc - "Its perfectly fine to launch new threads in bolts that do processing asynchronously. OutputCollector is thread-safe and can be called at any time." - which was wrong for older than 1.0.0, but it is now valid for 1.0.0 and above versions.

http://storm.apache.org/releases/1.0.0/Concepts.html
http://storm.apache.org/releases/1.0.1/Concepts.html
http://storm.apache.org/releases/2.0.0-SNAPSHOT/Concepts.html

While we would be better to announce this change for users, the docs for 1.x and 2.x are no issue on this., [~kabhwan]
http://storm.apache.org/releases/1.0.0/Troubleshooting.html
http://storm.apache.org/releases/1.0.1/Troubleshooting.html
shows below info which needs to be corrected

{quote} 
This is caused by having multiple threads issue methods on the OutputCollector. All emits, acks, and fails must happen on the same thread. One subtle way this can happen is if you make a IBasicBolt that emits on a separate thread. IBasicBolt's automatically ack after execute is called, so this would cause multiple threads to use the OutputCollector leading to this exception. When using a basic bolt, all emits must happen in the same thread that runs execute.
{quote}, Oh I missed it. Half resolved. Thanks for noticing., GitHub user HeartSaVioR opened a pull request:

    https://github.com/apache/storm/pull/1622

    STORM-1999 Update docs with OutputCollector's threadsafety

    * From Storm 1.0.0, OutputCollector is thread safe
    
    This should be also downmerged to 1.x and 1.0.x branches, and applied to docs of 1.0.0, 1.0.1, 1.0.2, 2.0.0-SNAPSHOT.
    
    NOTE: This is non-code change so lazy consensus is applied. (don't need to wait for +1 and also 24 hrs)

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/HeartSaVioR/storm STORM-1999

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/storm/pull/1622.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #1622
    
----
commit 3e4d9444c4a637538bf66d36f99c8f36cd50edf5
Author: Jungtaek Lim <kabhwan@gmail.com>
Date:   2016-08-11T23:27:39Z

    STORM-1999 Update docs with OutputCollector's threadsafety
    
    * From Storm 1.0.0, OutputCollector is thread safe

----
, Github user satishd commented on the issue:

    https://github.com/apache/storm/pull/1622
  
    +1
, Github user asfgit closed the pull request at:

    https://github.com/apache/storm/pull/1622
, Merged to codebase, now building the docs to publish..., Change reflected to website.]