[[~krystian] Do you plan on updating the poms to exclude the extra version of netty?  Should be a fairly simple thing to do., [~revans2] I am using customized version of _lib_ folder anyway (as I am using _logback_ custom appender with _log4j_ libs to connect to _logstash_ rather than the _slf4j_ bridges - so I need to "patch" some _Storm_ libraries anyway), but I think if a simple patch is enough (or do you rather prefer to have pull request?) that should be easily doable :), I was mostly just curious if this was something you were going to do a pull request/patch for or not?  If not I was going to mark it as a newbie jira and see if someone new wanted to work on it.  , Here is the patch that needs to be applied on top-level _pom.xml_ file, GitHub user krystiannowak opened a pull request:

    https://github.com/apache/incubator-storm/pull/148

    STORM-355: excluding outdated netty transitively included via curator

    STORM-355: excluding outdated netty transitively included via curator

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/krystiannowak/incubator-storm v0.9.2-incubating

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/incubator-storm/pull/148.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #148
    
----
commit 4ec75dfac6fd9b93f76fe58b40feff7ffe80cf84
Author: knowak <krystian.nowak@holidaycheck.com>
Date:   2014-06-18T08:40:32Z

    STORM-355: excluding outdated netty transitively included via curator dependency

----
, [~revans2] Or you can just merge this [https://github.com/apache/incubator-storm/pull/148] pull request instead of applying the patch attached - whichever is more convenient :), Github user revans2 commented on the pull request:

    https://github.com/apache/incubator-storm/pull/148#issuecomment-46469298
  
    looks good to me +1
, Github user krystiannowak commented on the pull request:

    https://github.com/apache/incubator-storm/pull/148#issuecomment-46830704
  
    seems a bit of must-have before releasing 0.9.2, right? (I mean it's better not to have 2 libs in lib directory to be randomly chosen... ;) )
, Github user revans2 commented on the pull request:

    https://github.com/apache/incubator-storm/pull/148#issuecomment-46848271
  
    0.9.2 has already been released, so at best it can go into 0.9.3.  It has been this way for quite a while, and has not caused us a problem yet.  I agree that it is not ideal, but I don't think this is a blocker.  
, Github user krystiannowak commented on the pull request:

    https://github.com/apache/incubator-storm/pull/148#issuecomment-46849238
  
    Ah sorry - I was looking at http://storm.incubator.apache.org/downloads.html and was confused with 0.9.1
, Github user revans2 commented on the pull request:

    https://github.com/apache/incubator-storm/pull/148#issuecomment-46849882
  
    Not a big deal. The vote passed at the end of last week, and I am assuming Taylor has not updated the web page yet.
, Github user krystiannowak commented on the pull request:

    https://github.com/apache/incubator-storm/pull/148#issuecomment-46936301
  
    So hopefully it would go at least to [0.9.3](https://issues.apache.org/jira/browse/STORM/fixforversion/12327112) then.
, Github user revans2 commented on the pull request:

    https://github.com/apache/incubator-storm/pull/148#issuecomment-47024284
  
    Yes, as soon as another commiter gives this a +1 I'll merge it into master.
, Github user d2r commented on the pull request:

    https://github.com/apache/incubator-storm/pull/148#issuecomment-47024717
  
    +1
, Github user asfgit closed the pull request at:

    https://github.com/apache/incubator-storm/pull/148
, Thanks Krystian for the patch.  I pulled this into master.  Keep up the good work., Github user krystiannowak commented on the pull request:

    https://github.com/apache/incubator-storm/pull/148#issuecomment-47029088
  
    Thanks guys!
, Github user danielcompton commented on the pull request:

    https://github.com/apache/incubator-storm/pull/148#issuecomment-54101048
  
    Has anyone examined whether there were any breaking changes in Netty between the version that Zookeeper was using and the version Storm was using? We came across this issue but weren't 100% sure it was safe to just exclude org.jboss.netty.
, Github user krystiannowak commented on the pull request:

    https://github.com/apache/incubator-storm/pull/148#issuecomment-54113092
  
    Not sure about differences between these two versions (others maybe?), but from the setup point of view any of those versions needed to be selected explicitly as the runtime choice might have been random and in case of errors it might be a factor making them harder to reproduce.
, Github user viktortnk commented on the pull request:

    https://github.com/apache/incubator-storm/pull/148#issuecomment-54121788
  
    I the current master branch Storm refers to Curator 2.5 -> Zookeeper 3.4.6 -> io.netty#netty 3.7
    
    So there is actually no need to exclude old version of netty (`org.jboss.netty`)
, Github user revans2 commented on the pull request:

    https://github.com/apache/incubator-storm/pull/148#issuecomment-54490894
  
    Zookeeper does not use netty by default it has to be configured on, and when it does it is only on the server side, not on the client side, so it is something that we can ignore, and possibly exclude.
]