[Deleting the supervisor and worker state directories and unzipping this tar into storm.home will reproduce this bug., For some strange reason all of the local state files are empty, but not the isupervisor ones.  This either means that Utils.serialize returned an empty array, or that FileUtils.writeByteArrayToFile did not fully write out what it was supposed to.  Either way this seems very odd. , For those coming across this, a workaround is to delete the {{storm/supervisor}} and {{storm/workers}} directories before the supervisor is started in your storm supervisor init script, if you've got one. Then the state is re-created anew every time the supervisor is started, and this bug is never hit., GitHub user wurstmeister opened a pull request:

    https://github.com/apache/storm/pull/282

    STORM-307: reset LocalState if files are corrupt

    * allow supervisor to start even if LocalState files are empty


You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/wurstmeister/incubator-storm STORM-307

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/storm/pull/282.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #282
    
----
commit b2ecd44a7ee13d6c98171c63d056bdef481d6e0f
Author: Wurstmeister <wurstmeister@users.noreply.github.com>
Date:   2014-10-05T20:46:24Z

    STORM-307: reset LocalState if files are corrupt
    
    * allow supervisor to start if LocalState was corrupted
    
    Change-Id: I3dbf957dd2e37c9c6be39dab29a9a71e99b7a2c3

----
, Github user wurstmeister commented on the pull request:

    https://github.com/apache/storm/pull/282#issuecomment-57995451
  
    Thanks @HeartSaVioR! should be fixed now.
    I was wondering if we actually need this retry logic. i.e. if we can just reset the state whenever there is an IOException (rather than not starting up and users having to manually remove state files). 
    
    I am not sure why the retry logic was implemented this way, so I picked out the empty file case because that's been reported multiple times (incl the workaround of resetting the state). 

, Github user ptgoetz commented on the pull request:

    https://github.com/apache/storm/pull/282#issuecomment-60423299
  
    +1
, Github user Parth-Brahmbhatt commented on the pull request:

    https://github.com/apache/storm/pull/282#issuecomment-60429586
  
    +1
, Github user clockfly commented on the pull request:

    https://github.com/apache/storm/pull/282#issuecomment-61636291
  
    +1
, Github user asfgit closed the pull request at:

    https://github.com/apache/storm/pull/282
, committed to trunk.
Thanks, wurstmeister and Damien Raude-Morvan]