[GitHub user Lewuathe opened a pull request:

    https://github.com/apache/storm/pull/403

    [STORM-639] storm-maven-plugin not found

    maven compile is fail due to missing storm-maven-plugin. 
    This plugin should be installed before compiling storm-core project.

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/Lewuathe/storm maven-plugin-failure

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/storm/pull/403.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #403
    
----
commit 715dfb9a430990835f531c316c93e0b99df626c8
Author: lewuathe <lewuathe@me.com>
Date:   2015-01-30T15:08:55Z

    [STORM-639] storm-maven-plugin not found

----
, Github user d2r commented on the pull request:

    https://github.com/apache/storm/pull/403#issuecomment-72268036
  
    I am seeing this happen too.  Even with this change, if I try to compile with `mvn compile` from the top level, I see the following error:
    ```
    Error resolving version for plugin 'org.apache.storm:storm-maven-plugins'
    ```
    After `mvn install`, it does compile OK.
, Github user Lewuathe commented on the pull request:

    https://github.com/apache/storm/pull/403#issuecomment-72318223
  
    @d2r Thank you for reporting. I'll fix to succeed compile with `mvn compile`.
, Github user Lewuathe commented on the pull request:

    https://github.com/apache/storm/pull/403#issuecomment-72356826
  
    It seems that there is no way to install `storm-maven-plugin` in local repository before compiling `storm-core` because with `compile` phase there is no jar files enough to install. So I think there are two options. 
    1. Update documents to install `storm-maven-plugin` before compiling `storm-core` project.
    2. Deploy `storm-maven-plugin` on remote repository.
    
    What do you think? If someone has any other ideas, please let me know.
, Github user d2r commented on the pull request:

    https://github.com/apache/storm/pull/403#issuecomment-72554412
  
    > Update documents to install storm-maven-plugin before compiling storm-core project.
    
    Yeah... I was afraid of that.  It is a binary dependency, and maven does not support making this kind of thing work.
    
    So I think your suggestion of changing the documents is better.
, Github user revans2 commented on the pull request:

    https://github.com/apache/storm/pull/318#issuecomment-74683011
  
    We put in some changes so the storm build now uses a plugin that is also built as part of the build.  This makes it so you cannot run ```mvn compile``` on its own any more, you need to run at least ```mvn package``` because needs a jar on the classpath.  If you plan on building in just storm-core you need to have installed the plugin  into your local repo first.  We are working on a way to fix this, but don't have a perfect solution yet https://issues.apache.org/jira/browse/STORM-639.
, Perhaps the best long term solution is to separate the plugin out into a stand alone plugin that is published/released separately from the rest of storm.  We could reach out to the maven community and see if they would be interested in making the plugin official, but in the short term, we create a new version number for the plugin, that is not the same as storm's and publish the artifact to the maven repo on its own.  We may also need to separate out the build for the plugin from the rest of storm so it does not try to pull it in and get confused., Github user Lewuathe commented on the pull request:

    https://github.com/apache/storm/pull/403#issuecomment-75163410
  
    I changed documentation. Can someone review it?
, Github user d2r commented on the pull request:

    https://github.com/apache/storm/pull/403#issuecomment-75309369
  
    > Update documents to install storm-maven-plugin before compiling storm-core project.
    
    It looks as though the documents already say how to build it so that it works.  It does not claim that doing the build directly from storm-core without the plugin jar on the classpath will succeed.  So now I am not sure we want to add to the document one way not to build storm.
    
    Really, it would be good if the plugin were pushed to maven repositories separately from storm, like @revans2 [suggested](https://issues.apache.org/jira/browse/STORM-639?focusedCommentId=14324305&page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel#comment-14324305).

, Github user asfgit closed the pull request at:

    https://github.com/apache/storm/pull/403
, [~lewuathe],

I merged your doc pull request into master.  I thought it had sat long enough without anything happening on it, and it was good.  but I don't want to close this JIRA until we have separated out the maven plugin's version/release from the rest of the release process., Github user revans2 commented on the pull request:

    https://github.com/apache/storm/pull/403#issuecomment-89378042
  
    I forgot to add +1
]