[Hi [~RPCMoritz], 
I am new to the open source community. I was looking for issues to contribute towards, and I think this issue would be a good starting point. I have started looking at the https://github.com/apache/storm/blob/master/external/storm-jdbc/src/main/java/org/apache/storm/jdbc/common/JdbcClient.java class. Any other part I should look into?, From my analysis, this issue is restricted to that class, so I think you should be able to solve it within that scope., Upon inspection, something like the following method should be called within finally:

closeWithStackSaver(Closeable toClose, Exception ex){
Exception finalException = ex;
try { toClose.close() }
catch (Exception e){
if (finalException!=null) {
LOG.error (Error closing connection);
else {finalExcpetion = e;}
}
if (finalExcpetion != null){
throw new IllegalStateException(finalException);
}
}

this can be re-used easily in every finally block where close() is called., Hi [~RPCMoritz], Can I take up this one just to start as a fresh contributor. I might just follow up with the approach discussed in the description to log the connection closure and finally throwing the actual exception with appropriate message. Will also make sure to take care of the stack trace for the exception., Sure, go right ahead - back then eventually our support partner provided a solution which was eerily similar to what I proposed here, but they failed to publish their code. I think the trickiest bit of this, is to add an Exception-throwing jdbc-connection for testing purposes. If you provide a patch, I'll happily review it - and hopefully we can get something merged., Hi [~RPCMoritz], Should I email the patch or attach it right here for the review??, Ideally create a GitHub pull request linked to this JIRA-issue, Well then, can you please add me as a contributor?, [~CobraCrowe] No, I don't have the rights in Jira to do that., [~CobraCrowe] Just added and assigned., PR: https://github.com/apache/storm/pull/2248, Thanks [~CobraCrowe], I merged into master.
Keep up the good work.]