[GitHub user HeartSaVioR opened a pull request:

    https://github.com/apache/storm/pull/1578

    STORM-1988 Kafka Offset not showing due to bad classpath

    Adding prefix and/or postfix between * just doesn't work on classpath, which I didn't recognize that.
    
    Confirmed from CentOS6 with OpenJDK 1.8.0_91 / Oracle JDK 1.8.0_77 and OSX 10.11.5 with Oracle JDK 1.8.0_66.
    
    Patch can be ported back to 1.x-branch easily.

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/HeartSaVioR/storm STORM-1988

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/storm/pull/1578.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #1578
    
----
commit 74dbb2a023fb084f216cc8fe493c6eb0cfa513b3
Author: Jungtaek Lim <kabhwan@gmail.com>
Date:   2016-07-20T10:22:25Z

    STORM-1988 Kafka Offset not showing due to bad classpath

----
, Github user harshach commented on the issue:

    https://github.com/apache/storm/pull/1578
  
    +1
, Github user ptgoetz commented on the issue:

    https://github.com/apache/storm/pull/1578
  
    +1
, Github user asfgit closed the pull request at:

    https://github.com/apache/storm/pull/1578
, [~harsha_ch] I know this is a trivial fix, but the 24hr review period for patches has not completed., [~ptgoetz] Will keep this in mind in the future. But its confusing what is the 24-hr period. Also with critical patches if we've enough +1s do we still need to wait for 24-hr period etc..
It will be great if we can document this in this page http://storm.apache.org/contribute/BYLAWS.html or here https://github.com/apache/storm/blob/master/DEVELOPER.md#pull-requests, [~harsha_ch] The bylaws are pretty clear with regard to the minimum length waiting period:

{quote}
1 day from initial patch (Note: Committers should consider allowing more time for review based on the complexity and/or impact of the patch in question.)
{quote}, [~ptgoetz] This sounds like a mutually exclusive argument in the same by-laws page

{code}
The code can be committed after the first +1
{code}
vs
{code}
1 day from initial patch (Note: Committers should consider allowing more time for review based on the complexity and/or impact of the patch in question.)
{code}

Either way waiting for 1 day for small patches doesn't make sense and also for critical patches. We did indeed merge some of the patches for releases.
I guess thats a discussion for mailing list. I'll wait for 24-hr period until we get more clarity on this policy., [~harsha_ch] IMO it's pretty clear, the minimum length applies to all actions. For critical/trivial things you can CTR it if you give an appropriate notice.]