[This is caused by a bad assumption I made here https://github.com/apache/storm/blob/master/external/storm-kafka-client/src/main/java/org/apache/storm/kafka/spout/trident/KafkaTridentSpoutEmitter.java#L161.

I assumed that the last batch metadata would only be null for the first batch, or reemits of the first batch. I forgot to account for cases where the first batch contains no tuples, because in that case we'll set the metadata for the first batch to null (see https://github.com/apache/storm/blob/master/external/storm-kafka-client/src/main/java/org/apache/storm/kafka/spout/trident/KafkaTridentSpoutEmitter.java#L125). In the following call to emitBatch, we're going to hit this line with a null lastBatchMeta https://github.com/apache/storm/blob/master/external/storm-kafka-client/src/main/java/org/apache/storm/kafka/spout/trident/KafkaTridentSpoutEmitter.java#L181. This is very likely going to happen if you use e.g. LATEST as the FirstPollOffsetStrategy, and as you observe it doesn't happen if you start at the beginning of a partition and there are messages to emit.

Let me know if you'd like to try to fix it. If not I'll be happy to give it a shot, and would appreciate if you would try out the potential fix.

, if you use opaquetrident, you must change some code that handle the condition when the lastbatch is null, I configured firstPollOffsetStrategy as FirstPollOffsetStrategy.UNCOMMITTED_EARLIEST, but the error still persists. Any suggestions to quickly fix this while creating Trident topology ?, I'm happy to provide a patched 1.x branch, you could check that out and see if the patch fixes the issue?, Here is the patched 1.x https://github.com/srdo/storm/tree/STORM-3046-1.x. You should be able to check out and build storm-kafka-client from there., [~Srdo] any plans on merging and release of this to 1.2.x?, [~aniket.alhat] I'll put up a 1.x version as soon as the PR targeting master has been reviewed and merged., Thanks [~Srdo], I merged into master.

The patch wasn't applied to 1.x-branch cleanly. Could you please raise a PR for 1.x-branch as well? Thanks in advance!, Also merged into 1.x-branch as well.]