[GitHub user kishorvpatil opened a pull request:

    https://github.com/apache/storm/pull/259

    [STORM-500] Add Spinner when UI is loading stats from nimbus

       - Adding blockingUI to show spinner signalling in-progress ajax calls.
       - When visualization is hidden, UI needs to stop making API calls for periodic updates. 

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/kishorvpatil/incubator-storm ui-loading-spinner

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/storm/pull/259.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #259
    
----
commit 9f823caaba08298c81f77d5d54aa062747b4e542
Author: Kishor Patil <kpatil@yahoo-inc.com>
Date:   2014-09-18T15:44:43Z

    Add spinner while ajax is loading stats on UI

commit 83ec8b3fa2bb00910a2285d5d0d37c52d690e76f
Author: Kishor Patil <kpatil@yahoo-inc.com>
Date:   2014-09-18T15:45:23Z

    Stop making ajax calls when visualization is hidden

----
, Github user revans2 commented on the pull request:

    https://github.com/apache/storm/pull/259#issuecomment-56062295
  
    For the most part it looks good, but the big thing we need is to have LICENSE updated to point to the new js file and indicate we are picking the MIT license option.
    
    It would also be nice if we could find a minimized version of jquery.blockUI.js, but that is fairly minor.
, Github user kishorvpatil commented on the pull request:

    https://github.com/apache/storm/pull/259#issuecomment-56134688
  
    @revans2 Thanks for the feedback. I have update LICENSE to indicate MIT license use for `jquery.blockUI.js` and using `min` version `jquery.blockUI.min.js`.
    
    Using min version, explicit setting of `$.blockUI.defaults.css` under `scripts.js` and reordering sourcing of `script.js`.
, Github user revans2 commented on the pull request:

    https://github.com/apache/storm/pull/259#issuecomment-56196424
  
    +1 looks good to me.  I'll give it a few days to see if anyone else has a comment/review before checking it in. 
, Thanks Kishor,

I pulled this into master., Github user asfgit closed the pull request at:

    https://github.com/apache/storm/pull/259
]