[Gradle test case, Hi, 

I have tracked down the offending thread pool to the field *'_exec'* of *'org.apache.storm.utils.DisruptorQueue.FlusherPool'*.

The thread pool executor is not named, it is also not daemon, it is also never shutdown.

Kind regards,
Fergus, It seems like it would be safe to change the thread pool executor to create daemon threads as this class also contains a timer which is created as daemon., GitHub user fbyrne opened a pull request:

    https://github.com/apache/storm/pull/1400

    STORM-1730 LocalCluster#shutdown() does not terminate all storm threads/thread pools.

    The thread pool executor used by the `DisruptorQueue.FlusherPool` is in a static context of the
    DisruptorQueue.  To avoid major changes to how this queues lifecycle is
    managed I added a simple fix is to create a thread pool factory which creates daemon
    threads.  The threads are now also named with the 'disruptor-flush'
    prefix to be consistent with the TimerTask.

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/fbyrne/storm master

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/storm/pull/1400.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #1400
    
----
commit 3c78314e18e21cd188cd7b8e5ae3f2143ed75cbd
Author: Fergus Byrne <fergus.byrne@gmail.com>
Date:   2016-05-05T16:32:33Z

    STORM-1730 LocalCluster#shutdown() does not terminate all storm
    threads/thread pools.
    
    The thread pool that is remaining is in a static context of the
    DisruptorQueue.  To avoid major changes to how this queues lifecycle is
    managed the fix is to create a thread pool factory which creates daemon
    threads.  The threads are now also named with the 'disruptor-flush'
    prefix to be consistent with the TimerTask.

----
, Github user fbyrne commented on the pull request:

    https://github.com/apache/storm/pull/1400#issuecomment-217830423
  
    Does a comment retrigger a build? we'll see.
, Github user kishorvpatil commented on the pull request:

    https://github.com/apache/storm/pull/1400#issuecomment-217898782
  
    @fbyrne, closing and reopening the PR or adding commit triggers the build.
, Github user harshach commented on the pull request:

    https://github.com/apache/storm/pull/1400#issuecomment-219583830
  
    @fbyrne can you please look at above comments. We would like to get this into 1.x branch as well once you address the comments.
, Github user fbyrne commented on the pull request:

    https://github.com/apache/storm/pull/1400#issuecomment-219662853
  
    Sure, that's no problem.  I haven't been able to find the Java style guide on the contribute readme.
    
    Can you point me to this or if there is an eclipse formatter configuration you can forward to me.

, Github user HeartSaVioR commented on the pull request:

    https://github.com/apache/storm/pull/1400#issuecomment-219713855
  
    @fbyrne Sorry we don't have it explicitly for Java now, we only have Clojure style guide.
    Part of the plan for Storm 2.0.0 is porting Clojure to Java. After that we would have style guide / formatter for Java.
    For now let's see style of origin code and adopt ourselves.
    What I pointed out is indentation difference between L74, L75, L79. Could you address to let indentation consistent?
, Github user asfgit closed the pull request at:

    https://github.com/apache/storm/pull/1400
, This is merged to master and 1.x-branch, but not 1.0.x-branch.

We should port back to 1.0.x-branch but I'm not sure what lowest version this will be included since we're in progress of release vote 1.0.2 RC3. So 1.0.2 or 1.0.3., if RC3 passes the vote, we can put it in 1.0.3. I wouldn't consider this issue as release breaker. , Sure. We can just merge this to 1.0.x-branch and resolve as 1.0.3, and set back to 1.0.2 if RC3 is canceled. This is what I was doing between RC2 and RC3., I also merged this to 1.0.x-branch. Not sure it can be included as 1.0.2 and 1.0.3, so I'd like to include this as 1.0.3 first, and correct if it's not.]