[Also some tests are doing wait-for-condition which really should be changed to while-timeout instead. , GitHub user revans2 opened a pull request:

    https://github.com/apache/storm/pull/508

    STORM-757: Simulated time can leak out on errors

    

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/revans2/incubator-storm STORM-757

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/storm/pull/508.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #508
    
----
commit b77efd3a7cf889cf64e8e5a996f03aadb77b2b6e
Author: Robert (Bobby) Evans <evans@yahoo-inc.com>
Date:   2015-04-06T21:06:55Z

    STORM-757: Simulated time can leak out on errors

----
, Github user ptgoetz commented on the pull request:

    https://github.com/apache/storm/pull/508#issuecomment-90307502
  
    Nice catch.
, Github user revans2 commented on the pull request:

    https://github.com/apache/storm/pull/508#issuecomment-90621201
  
    I caught it, because I had other bugs and was beating my head wondering why were the tests getting stuck instead of failing.
, Github user revans2 commented on the pull request:

    https://github.com/apache/storm/pull/508#issuecomment-90636174
  
    Wait there is a bug in my test changes :( I'll through up a fix shortly.
, Github user revans2 commented on the pull request:

    https://github.com/apache/storm/pull/508#issuecomment-90657940
  
    OK I fixed the bug I found, it should be good for a review now.
, Github user knusbaum commented on the pull request:

    https://github.com/apache/storm/pull/508#issuecomment-90665228
  
    +1
, Github user HeartSaVioR commented on the pull request:

    https://github.com/apache/storm/pull/508#issuecomment-90718587
  
    LGTM. Great!
    
    Btw, I feel it would be another chance of adopting CI (Jenkins, Travis, or anything) to catch some bugs from each PR before merge.
, Github user nathanmarz commented on the pull request:

    https://github.com/apache/storm/pull/508#issuecomment-90829000
  
    -1
    
    Why get rid of the wait-for-condition function?
, Github user HeartSaVioR commented on the pull request:

    https://github.com/apache/storm/pull/508#issuecomment-91075470
  
    @revans2 Regarding timeout, it would be better to use TEST-TIMEOUT-MS on timeout value.
    
    Just a two cents, wait-for-condition doesn't treat timeout so it could be stuck.
    So tests should use while-timeout unless wait-for-condition does take care of timeout.
    While while-timeout provides more informations on timeout, it would be better for wait-for-condition use while-timeout, too.
, Github user ptgoetz commented on the pull request:

    https://github.com/apache/storm/pull/508#issuecomment-91084410
  
    @nathanmarz To be valid, a veto (-1) must be accompanied by a justification. Can you elaborate on your objections?
    
    If you're just looking for more information, then a -0 might be more appropriate. I'm sure any Committer would seek to address your concerns before merging. Vetoes are rather heavy-handed and can be disruptive. If you feel strongly that this patch should be blocked, then you need to explain why, and be ready and willing to support or retract the veto.
, Github user revans2 commented on the pull request:

    https://github.com/apache/storm/pull/508#issuecomment-91331954
  
    @nathanmarz I removed wait-for-condition, because after updating the tests to have a timeout, like @HeartSaVioR mentioned, it was not longer used anywhere in the codebase.  If you would like me to add it back in, or add it back in with a timeout I would be happy to.  I was just trying to clean up dead code.
, Github user nathanmarz commented on the pull request:

    https://github.com/apache/storm/pull/508#issuecomment-91366300
  
    I'm still -1. You're duplicating the same code everywhere in this patch. Just keep the wait-for-condition function and add a timeout parameter. Then have a 1-arity version that defaults the timeout to 5000ms. 
, Github user revans2 commented on the pull request:

    https://github.com/apache/storm/pull/508#issuecomment-91576505
  
    @nathanmarz Thanks for the review I did like you asked and the code does look a lot cleaner.  I moved wait-for-condition into testing.clj because the while-timeout macro is rather testing specific, it throws an AssertionError and does a thread dump on timeout to help with debugging.
, Github user nathanmarz commented on the pull request:

    https://github.com/apache/storm/pull/508#issuecomment-91773263
  
    +1
, Github user asfgit closed the pull request at:

    https://github.com/apache/storm/pull/508
, Merged this into master.  Thanks for all the reviews]