[[~pshah],

I assume that you wanted to have all of the files to be apache licensed.  Please take a look at this it is breaking travis., [~revans@viaserv.com] [~pshah] I apologize. I ran the local builds with unit tests and I didn't get into this error. , Actually I'll just do it., [~sriharsha],

Not a big deal, it looks like the build has been in a bad state for a while, and it is too easy to get into the habit of ignoring the failing build instead of stopping and fixing them., GitHub user priyank5485 opened a pull request:

    https://github.com/apache/storm/pull/1607

    STORM-2021: Add missing licenses.

    

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/priyank5485/storm STORM-2021

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/storm/pull/1607.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #1607
    
----
commit 05cd5e47173814c050c52a76dbe9577a7aef8e30
Author: Priyank <pshah@hortonworks.com>
Date:   2016-08-04T17:04:31Z

    STORM-2021: Add missing licenses.

----
, Github user harshach commented on the issue:

    https://github.com/apache/storm/pull/1607
  
    @priyank5485 I think we've this patch here https://reviews.apache.org/r/50597/
, [~sriharsha] [~revans2] Sorry I missed the license in the test files. Just created a PR., Github user priyank5485 commented on the issue:

    https://github.com/apache/storm/pull/1607
  
    Closing this in favor of https://github.com/apache/storm/pull/1606/files
, Github user priyank5485 closed the pull request at:

    https://github.com/apache/storm/pull/1607
, [~harsha_ch] If you run with the rat profile enabled it will run those checks (just like travis):

{{mvn install -P rat}}, [~ptgoetz] realized that. But we should make this as default otherwise easy to miss., [~harsha_ch] We explicitly decided to turn it off by default: https://issues.apache.org/jira/browse/STORM-1467]