[I just discovered this today as well on Storm 1.0.1. We recently upgraded from .10, As far as I can tell the issue is already present in 0.10.0, [https://github.com/apache/storm/pull/2036] against branch {{1.x-branch}}, I don't have the immediate luxury to swap out storm-core and am looking to fix this in storm-kafka.  What I don't get is that this is reported at the top as runtimeexception.  Why wouldn't that cause the worker to die and restart?, The reason is in the line I linked: [https://github.com/apache/storm/blob/v1.1.0/storm-core/src/clj/org/apache/storm/daemon/executor.clj#L270] and the next two lines.

If the exceptions is derived from {{java.io.InterruptedIOException}} the 'suicide-fn' will not be called. I think this was introduced to prevent some test case from killing the process (see STORM-773). I don't think the code should be changed to fix a test, but this special case handling is there now, and in the Java port of executor.clj it was fixed by adding another special case :-(, which I copied in the Pull request.

I think will also fix it in storm-kafka on Monday, but just wanted it to be fix it in core for the sake of being thorough., Good catch on the storm-core part.  I don't know how you found that.  

For storm-kafka, https://github.com/apache/storm/blob/1.0.x-branch/external/storm-kafka/src/jvm/org/apache/storm/kafka/KafkaUtils.java#L75  I was thinking either retry with back off or raise RuntimeException which is done in other places when communicating with Kafka (https://github.com/apache/storm/blob/1.0.x-branch/external/storm-kafka/src/jvm/org/apache/storm/kafka/KafkaUtils.java#L191)  - am wondering what your thoughts are.

, This is caused by STORM-2194 not being fixed on 1.x, Not fixing it on 1.x would mean there is no stable version of Storm that could be recommended for production use with a good conscience. At least when using KafkaSpout. Right?

Is there a plan to release a version based on the master anytime soon?, We could get it fixed for 1.1.1 and release soon. There're some pull requests for storm-kafka-client, and we postponed addressing them for 1.1.0. So releasing 1.1.1 soon is a viable option., I think it should be fixed in storm-core also. Who knows where else there is a looming {{SocketTimeoutException}} in some spout implementation., Thanks [~nico.meyer], I merged into 1.x and 1.0.x branches.]