[GitHub user amontalenti opened a pull request:

    https://github.com/apache/storm/pull/533

    Add support for "error" command in ShellSpout

    Addresses JIRA issue [STORM-796](https://issues.apache.org/jira/browse/STORM-796). 
    
    The symptoms a multi-lang user will see here is that if their Spout throws an error and their multi-lang implementation sends an "error" command up to the ShellSpout, the ShellSpout will respond saying that it doesn't recognize the "error" command, and thus it will crash (while swallowing the exception thrown by the underlying multi-lang component).
    
    ShellBolt already supports the error command, and ShellSpout already has a way of reporting errors -- so this was just a matter of adding similar logic to the ShellSpout.


You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/amontalenti/storm master

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/storm/pull/533.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #533
    
----
commit 2c35cb4dec67604185d3b443a3e04a66fd4a6a6d
Author: Andrew Montalenti <andrew@parsely.com>
Date:   2015-04-23T20:41:39Z

    add support for "error" command in ShellSpout

----
, Github user HeartSaVioR commented on the pull request:

    https://github.com/apache/storm/pull/533#issuecomment-95723096
  
    LGTM.
, Fix Version/s is for marking version which version resolves it.
Current master is for 0.11.0, and if you wish to apply it to 0.10.0, it would be better to explain it should be fixed faster., [~kabhwan] no problem re: the fix version, I just picked the next unreleased version because the change seemed small enough, and it actually fixes a bug in the multi-lang protocol. Without this fix, multi-lang spouts, when they crash, do not properly report errors up to the storm worker -- instead, they cause an unrelated error in the worker., Github user ptgoetz commented on the pull request:

    https://github.com/apache/storm/pull/533#issuecomment-97610607
  
    +1
, Github user asfgit closed the pull request at:

    https://github.com/apache/storm/pull/533
, Github user ptgoetz commented on the pull request:

    https://github.com/apache/storm/pull/533#issuecomment-99924195
  
    Thanks @amontalenti. I merged this into master, 0.10.x-branch, and 0.9.x-branch.
]