[Attached proposed fix. I've clicked around a bunch on the Jekyll local server, and haven't noticed anything break. I'm not too familiar with Ruby and Google wasn't helpful, so I've just added an explicit redcarpet dependeny to the gemfile. If there's a better way to refer to https://github.com/jekyll/jekyll/blob/c7d98cae2652b2df7ebd3c60b4f8c87950760e47/Gemfile#L82 I'd like to change it., GitHub user srdo opened a pull request:

    https://github.com/apache/storm-site/pull/1

    STORM-2629: Upgrade to latest github-pages to allow Windows build

    See https://issues.apache.org/jira/browse/STORM-2629

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/srdo/storm-site STORM-2629

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/storm-site/pull/1.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #1
    
----
commit 5601e679786871cff4affd6a98e07f74c7b0a6cd
Author: Stig Rohde Døssing <stigdoessing@gmail.com>
Date:   2017-09-09T18:34:19Z

    STORM-2629: Upgrade to latest github-pages to allow Windows build

----
, Github user HeartSaVioR commented on the issue:

    https://github.com/apache/storm-site/pull/1
  
    Which pair(s) of OS and Ruby version are you trying out?
    I'm trying out the change but I'm experiencing crash on redcarpet. (redcarpet.rb has `require 'redcarpet.so'` but there's no file) macOS Sierra (10.12.6) and Ruby 2.4.1. Odd thing is that standalone command 'redcarpet' works.
, Github user srdo commented on the issue:

    https://github.com/apache/storm-site/pull/1
  
    @HeartSaVioR I've tried it out on Windows 10 and ruby 2.3.4p301. I just went and tested it on a fresh install of Ubuntu 17.04 and ruby 2.4.1p111.
    
    Did you run `bundler install` after switching to this branch?
    
    I'm wondering if the README is a little misleading, it's my understanding that people should use Bundler to update dependencies and run Jekyll, but the README doesn't mention it. 
    
    Here's the commands I ran to start the local server:
    `bundler install`
    `bundler exec jekyll serve -w`
, Github user srdo commented on the issue:

    https://github.com/apache/storm-site/pull/1
  
    @HeartSaVioR Sorry to bother you with this, but I think this PR fell through the cracks. If you get a chance sometime could you try to build the site with the commands I mentioned in the previous comment?
, Github user asfgit closed the pull request at:

    https://github.com/apache/storm-site/pull/1
, Thanks [~Srdo], I merged into asf-site.]