[GitHub user viktortnk opened a pull request:

    https://github.com/apache/storm/pull/272

    STORM-511 update startOffset in PartitionManager when submitted in fetch...

    ... request one is out of rangeWith default behaviour (KafkaConfig.useStartOffsetTimeIfOffsetOutOfRange == true) when Kafka returns the error about offset being out of range, storm.kafka.KafkaUtils.fetchMessages tries to fix offset in local scope and retry fetch request. But if there are no more messages appeared under that specified partition it will never update the PartitionManager, but keep sending tons of requests with invalid offset to Kafka broker. On both sides Storm and Kafka logs grow extremely quick during that time.

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/viktortnk/storm STORM-511-offset-fix

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/storm/pull/272.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #272
    
----
commit 95abbc501c8f29d08dcd1e6200e7ded65c41512e
Author: Viktor Taranenko <viktortnk@gmail.com>
Date:   2014-09-27T14:24:15Z

    STORM-511 update startOffset in PartitionManager when submitted in fetch request one is out of range

----
, Github user ptgoetz commented on the pull request:

    https://github.com/apache/storm/pull/272#issuecomment-60306459
  
    @viktortnk Thanks for your work on this. I made some minor changes and submitted a pull request to your repo.
    
    I confirmed that the issue is reproducible in 0.9.3-rc1, and that it is fixed with (y)our changes.
    
    I'm +1 with the suggested changes.
, Github user viktortnk commented on the pull request:

    https://github.com/apache/storm/pull/272#issuecomment-60313274
  
    Hi @ptgoetz 
    
    Thanks for helping on that. All merged
    
    Cheers
, Github user ptgoetz commented on the pull request:

    https://github.com/apache/storm/pull/272#issuecomment-60423496
  
    +1
, Merged into master. Thanks for this!, Github user asfgit closed the pull request at:

    https://github.com/apache/storm/pull/272
, Sorry keyboard shortcuts acted up and changed the assignee. Changed it back .]