[GitHub user revans2 opened a pull request:

    https://github.com/apache/storm/pull/787

    STORM-1096: Fix some issues with impersonation on the UI

    Conflicts:
    	storm-core/src/clj/backtype/storm/ui/core.clj

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/revans2/incubator-storm STORM-1096-0.10.x

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/storm/pull/787.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #787
    
----
commit b4806113a7b06a93ea737f681e966701397e539c
Author: Robert (Bobby) Evans <evans@yahoo-inc.com>
Date:   2015-10-07T21:03:38Z

    STORM-1096: Fix some issues with impersonation on the UI
    
    Conflicts:
    	storm-core/src/clj/backtype/storm/ui/core.clj

----
, GitHub user revans2 opened a pull request:

    https://github.com/apache/storm/pull/788

    STORM-1096: Fix some issues with impersonation on the UI

    

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/revans2/incubator-storm STORM-1096

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/storm/pull/788.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #788
    
----
commit 0476b92dd82e726adab200d5a77944a5f4f3883c
Author: Robert (Bobby) Evans <evans@yahoo-inc.com>
Date:   2015-10-07T21:03:38Z

    STORM-1096: Fix some issues with impersonation on the UI

----
, Github user revans2 commented on the pull request:

    https://github.com/apache/storm/pull/787#issuecomment-146548927
  
    The test failure was the intermittent kafka issue.
, Github user kishorvpatil commented on the pull request:

    https://github.com/apache/storm/pull/787#issuecomment-146558088
  
    +1. Good catch.
, Github user kishorvpatil commented on the pull request:

    https://github.com/apache/storm/pull/788#issuecomment-146558244
  
    +1
, Github user d2r commented on the pull request:

    https://github.com/apache/storm/pull/788#issuecomment-146565508
  
    +1
, Github user d2r commented on the pull request:

    https://github.com/apache/storm/pull/787#issuecomment-146566393
  
    +1
, Github user HeartSaVioR commented on the pull request:

    https://github.com/apache/storm/pull/787#issuecomment-146762852
  
    I found that I made a mistake while backporting. At least bin/storm.py should be fixed.
, Github user asfgit closed the pull request at:

    https://github.com/apache/storm/pull/788
, Github user asfgit closed the pull request at:

    https://github.com/apache/storm/pull/787
, Thanks for the reviews I merged this into master and 0.10.x-branch, [~revans2] sorry not bringing this before we merged into the repo.
Few questions around the config, 
1. we made nimbus.impersonation.authorizer as default but without any nimbus.impersonation.acl configs . This will immediately block anyone from submitting the topology except storm user.
2. configs right now requires username as key: hosts , groups as values. This is not easy to automate via deployment tools. Also every user who wants to submit should be listed in this config (correct me if I am wrong here).
3. I understand security should be closed by default . But here in this case we are just blocking everyone to submit a topology or look at topology metrics .

Ideally we should provide wildcard support and make it default or at least have that option to user. 
Wildcard should be that a given user can impersonate user x . So I can just add config like any user can impersonate user x.

The problem I am seeing here in case of Ambari we've a storm view that will send requests through Ambari proxy server. In this case it will send user "harsha" is trying to impersonate user "ambari-server1" (user x in above example). With current implementation, any user who is trying to access their topology needs to be added to the nimbus.impersonation.acl along with hostname from which they might be querying etc.. in a hosted platform this going to be harder as we keep adding users to the config.


, @revan2 any thoughts on above. This behavior seems to be inverse what we want. 
{code}
 user = storm-storm, principal = storm-storm@EXAMPLE.COM is attempting to impersonate user = ambari-server-storm
{code}
In above we should be listing ambari-server-storm in the 
{code}
nimbus.impersonation.acl:
     ambari-server-storm: // proxy user
                       users: [storm-storm, another-user] // wild-card can be used 
                       groups: [*] // should be optional
                       hosts: [*] 
{code}
if the user is allowed to impersonate ambari-server-storm in above example we should allow the principal and check if the principal (storm-storm) has access to the requested resource.
currently we check if ambari-server-storm has access to the resources . IMO current behavior doesn't seem to be right especially incase of proxy services. 
, [~sriharsha]

Sorry I have been out a lot lately and I am now just catching up.

There were a few things that went into this one pull request.

1) {{nimbus.impersonation.authorizer}} was set to {{"backtype.storm.security.auth.authorizer.ImpersonationAuthorizer"}} by default. This was done so when security is enabled it is one less config that needs to be changed when enabling security to get it to work, and to fail closed (like you mentioned)
2) {{populate-context!}} was added to make sure that the user we impersonate is always the one from the UI.
3) In the servlet callback handler we null out the "user" to try and avoid these sort of leaks again in the future.

First of all to clarify a few things.  Having impersonation locked down should not prevent someone from submitting a topology.  It prevents someone from submitting a topology as someone else (which is the entire point of this JIRA). They can still submit a topology as themselves, without impersonation.  If that does not work then we need to file a separate JIRA and fix that, because I should always be able to submit something as myself no ACL required.

I am confused about what behavior is the opposite of what we want.

From what I see if you want ambari and the UI to both work, you would set {{nimbus.impersonation.acl}} to something like

{code}
nimbus.impersonation.acl:
     ambari-server-storm: // super user
                       users: [*]
                       hosts: [*]
    ui-storm: //super user
                       users: [*]
                       hosts: ["my.nimbus.host"]
{code}

I don't really see why this is hard to automate.  If you have a cleaner way to do it I am all in favor of it, but we cannot default to allowing anyone to impersonate anyone else by default.  It is too easy for someone to shoot themselves in the foot and be completely insecure when they think thy are OK., [~revans2] Thanks for the reply.
so in your above example for the config .Current implementation does't work like that. 
Example:
Lets I say Kinit with storm user and deployed word count topology.

now I am making call to storm ui to get topology details
{code}
http://ui-daemon-host-name:8080/api/v1/topology/wordcount-1-1425844354\?doAsUser=testUSer1
{code}

In this case we need to have the following ACL in place for it to work
{code}
nimbus.impersonation.acl:
     storm: // super user
                       users: [*]
                       hosts: [*]
 
{code}

We are checking in ImpersonationAuthorizer if the ctx.realPrincipal() is in the nimbus.impersonation.acl list. So lets say if I kinitted as another user "topology-user1" . Than this user needs to be added to the list. Basically we need all the topology users to be in the list here. Otherwise the realPrincipal() ( where the topology owner's principal will be) won't be found in the ACLs

What I was asking exactly what you showed in the example above. Instead of listing the users in the ACL we should've proxy-user there and it should've list of users, hosts, groups who can impersonate that user.

It doesn't throw any issues in uploading the topology. Only issues is getting the information about topology using REST Apis. If you pass doAs even if we have the nimbus.impersonation.acl set and it passes through that authorizer it will get authorization exception through simpleACLAuthorizer because actual user(storm) is in ctx.realPrincipal and ctx.principal() contains ambari-server-storm and this user doesn't have permissions on the topology. Either we make this principal a super user than we might be getting into another issue where one user can see other users topology information if they both are in impersonation acl or we should modify the simpleACLAuthorizer to check the realPrincipal and if happens to be a owner of the topology.

I've a patch ready I'll post one in another JIRA. That probably makes it easier to discuss what I am suggesting., realPrincipal is the actual user making the thrift call. In the case of a normal UI interaction/REST call this is the UI user.
principal is the user being impersonated by the thrift call.  In the case of a normal UI interaction/REST call this is the user that authenticated with the UI ("topology-user1").

From the ImpersonationAuthorizer code we see that the key is the super user.

https://github.com/apache/storm/blob/master/storm-core/src/jvm/org/apache/storm/security/auth/authorizer/ImpersonationAuthorizer.java#L65-66
https://github.com/apache/storm/blob/master/storm-core/src/jvm/org/apache/storm/security/auth/authorizer/ImpersonationAuthorizer.java#L76

Now the next question is what happens if I try to double impersonate.  If I want to do a REST call to the UI impersonating another user.  {{?doAsUser=testUSer1}}

The DefaultHttpCredentailsPlugin will set up the impersonation

https://github.com/apache/storm/blob/master/storm-core/src/jvm/org/apache/storm/security/auth/DefaultHttpCredentialsPlugin.java#L74-L84

inside core we are checking it with ImpersonationAuthorizer, and then we pull the user out (not the real user but the user being impersonated, and pass it on to be used when the UI tries to impersonate a user)

https://github.com/apache/storm/blob/master/storm-core/src/clj/org/apache/storm/ui/core.clj#L87-L112
https://github.com/apache/storm/blob/master/storm-core/src/clj/org/apache/storm/ui/core.clj#L1063-L1065

https://github.com/apache/storm/blob/master/storm-clojure/src/clj/org/apache/storm/thrift.clj#L94

To me it looks like everything is already written how you want it to be.  There could be some bugs in there because I honestly don't use the double impersonation, but it should be working how you want it to., [~revans2]
I think the issue here is incase of a proxy server calling the UI with doAsUser param. 
Also we check impersonation twice it seems once in UI and another in nimbus
https://github.com/apache/storm/blob/master/storm-core/src/clj/org/apache/storm/ui/core.clj#L92
By adding nimbus.impersonation.authorizer in defaults we are going to generate quite a bit of logs and could be confusing for the users who are not using it in secure mode. This is already addressed in another JIRA.
I'll remove the double impersonation my side and it should be ok. Few things I would like to address is 
1. remove impersonation check on UI side. Let me know if this is necessary
2. Currently we've groups, hosts and I would like to add users section to restrict the impersonation to few users.

, [~sriharsha],

If we want to support doAsUser on the REST API then we have to have REST/UI also validate that it is OK, otherwise I can add that parameter in and pretend to be anyone through the REST API.

It is a chain of trust.  userB is pretending to be userA to the UI, so the UI in turn pretends to be userA to nimbus.  The thrift connection to nimbus from the UI loses the fact that userB is the real user and as such will never be able to properly validate that userB is allowed to impersonate userA.  If we change how the impersonation code works so that the UI can say to nimbus I am the UI but I am pretending to be userB who is pretending to be userA we could make it work.  But this would be a non-standard change as SASL does not really support that.  We could hack it in, but I prefer the way it is.

We cannot have impersonation fail open.  I will -1 anything that tries to do that.

https://github.com/apache/storm/blob/master/storm-core/src/clj/org/apache/storm/ui/core.clj#L92-L105
and 
https://github.com/apache/storm/blob/master/storm-core/src/clj/org/apache/storm/daemon/nimbus.clj#L1017-L1038

{code}
(log-warn " principal " (.realPrincipal context) " is trying to impersonate " (.principal context) " but " NIMBUS-IMPERSONATION-AUTHORIZER " has no authorizer configured. This is a potential security hole. Please see SECURITY.MD to learn how to configure an impersonation authorizer.")
{code}
{code}
(log-warn "impersonation attempt but " NIMBUS-IMPERSONATION-AUTHORIZER " has no authorizer configured. potential security risk, please see SECURITY.MD to learn how to configure impersonation authorizer.")
{code}

Some warning messages appearing in a log somewhere saying you configured security incorrectly and by the way we are printing this out because someone may have just pawned you is not enough. What is more your complaints about it being difficult to configure correctly and wanting to disable it tell me that we cannot have it off because there will be lots and lots of people who will leave it off and think that they are secure when they are not., [~revans2] Agree. It looks confusing and would be good add some comments around that.
Security is off by default and turning it on is today takes lot of steps and we are adding another step to it which is not ideal. But printing these messages when most of the users are in non-secure environment does no good to the users. Why would they need to see these messages in non-secure cluster.
Turning these log messages in secure environment makes sense if the users are not configuring impersonation authorizer., [~harsha_ch],

Then it sounds like we are trying to enforce security when it is turned off, and that is the real underlying problem., [~revans2] not sure if we are talking about the same issue :). I was pointing to having nimbus.impersonation.authorizer in defaults.yaml which seems to be confusing to the users given we print logs on every request. I don't think users will expect us to check impersonation in non-secure environments. 
Or atleast lets check on another config that indicates that the cluster is secure and than only print the logs if we want to have this as default.]