[I found this issue independently, in my local branch, which was a bit outdated. This patch still makes sense since it gets rid of five warnings that are caused by having ITridentSpout.BatchCoordinator as raw type, GitHub user hmcl opened a pull request:

    https://github.com/apache/storm/pull/1491

    STORM-1907: PartitionedTridentSpoutExecutor has incompatible types that cause ClassCastException

     - Generify on Object rather than Integer because example is broken
     - Fix TridentWordCount example to print more meaningful output

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/hmcl/storm-apache master_STORM-1907

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/storm/pull/1491.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #1491
    
----
commit aae0acbe8206f66129443d78831883226f8144c9
Author: Hugo Louro <hmclouro@gmail.com>
Date:   2016-06-16T00:49:30Z

    STORM-1907: PartitionedTridentSpoutExecutor has incompatible types that cause ClassCastException
     - Generify on Object rather than Integer because example is broken
     - Fix TridentWordCount example to print more meaningful output

----
, Github user hmcl commented on the issue:

    https://github.com/apache/storm/pull/1491
  
    This PR is related to https://github.com/apache/storm/pull/1429 but I found this issue independently, in my local branch, which was a bit outdated. This patch still makes sense since it gets rid of five warnings that are caused by having ITridentSpout.BatchCoordinator as raw type. Furthermore, it also prints more the actual word count output in the example in file `TridentWordCount`
, Github user harshach commented on the issue:

    https://github.com/apache/storm/pull/1491
  
    +1. Build failure is not related to the patch.
, Github user asfgit closed the pull request at:

    https://github.com/apache/storm/pull/1491
, Merged into master (by Harsha) and 1.x-branch (by me)]