[We were able to reproduce this outside of Trident, using a modified Exclamation topology that has two workers and parallelism of 1 on the spouts and bolts.

    Word-Spout (worker1)
              |
              V
      Exclaim 1 (worker1)
              | 
              V
      Exclaim 2 (worker2)

If the worker2 containing the downstream bolt is killed and relaunched, the upstream worker does not recognize that the connection went down, and makes no attempt to reconnect.

We are working on a fix and will submit a patch soon.   This should be a blocking issue for 0.9.3., I tested this with simple ExclamationTopology (2 workers, parallelism of 1 for each component). It  could happen in either case.  
This is due to netty client not checking for channel status and not reconnect in case of disconnect. 
I will be making a pull request soon., GitHub user kishorvpatil opened a pull request:

    https://github.com/apache/incubator-storm/pull/205

    [STORM-406] Fix for reconnect logic in netty client 

      - Check if channel ``isConnected``.
      - Reconnect if not before start of each batch.
      - Increase max-retried for netty client so that other worker get enough time to start/restart and starts accepting new netty connections.

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/kishorvpatil/incubator-storm netty-client-fix

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/incubator-storm/pull/205.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #205
    
----
commit e1e6a602e330d71410b1876ca9fb6bfc29761f35
Author: Kishor Patil <kpatil@yahoo-inc.com>
Date:   2014-07-24T19:34:38Z

    Fix netty client reconnect issue

commit 9b3a632340b66f1fe493220c0e6c22c2912e8025
Author: Kishor Patil <kpatil@yahoo-inc.com>
Date:   2014-07-24T19:36:41Z

    Increase netty max retries defaults allowing more time for other workers to come up

commit f1f5ecd92c7ea55d01163c8dbc2360466f34fd3a
Author: Kishor Patil <kpatil@yahoo-inc.com>
Date:   2014-07-24T20:49:22Z

    Increase max tries and reset local channel variable

----
, Github user revans2 commented on the pull request:

    https://github.com/apache/incubator-storm/pull/205#issuecomment-50173838
  
    That change looks simple enough.  My only concern was with us calling isConnected a lot on the channel, but looking at the code for it in 3.6.3.Final for the socketChannel it looks like it is just checking a variable, so I think it should be fine.  I am +1 on the change, but want to give some more time for others to comment/look at it.
, Thanks Kishor for fixing the issue.  Thanks Danijel for finding this and debugging it into a reproducible case.  I merged this into master., Github user asfgit closed the pull request at:

    https://github.com/apache/incubator-storm/pull/205
, GitHub user Parth-Brahmbhatt opened a pull request:

    https://github.com/apache/incubator-storm/pull/230

    STORM-406: Fix for storm CSRF vulnerability using ring-anti-forgery.

    I have tested the ui in 36.0.1985.143 and firefox-24.0. That said, I know pretty much nothing about ui , css or javascript so any comments will be helpful.

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/Parth-Brahmbhatt/incubator-storm STORM-406

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/incubator-storm/pull/230.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #230
    
----
commit 576726292a88c67aa9e9ba7563de114540487f54
Author: Parth Brahmbhatt <brahmbhatt.parth@gmail.com>
Date:   2014-08-17T21:56:27Z

    STORM-406: Fix for storm CSRF vulnerability using ring-anti-forgery.

----
, Github user harshach commented on the pull request:

    https://github.com/apache/incubator-storm/pull/230#issuecomment-52437097
  
    @Parth-Brahmbhatt looks like you used wrong jira number :) 
, Github user Parth-Brahmbhatt commented on the pull request:

    https://github.com/apache/incubator-storm/pull/230#issuecomment-52512568
  
    Changed the commit message to refer to correct jira issue number.
, Github user d2r commented on the pull request:

    https://github.com/apache/incubator-storm/pull/230#issuecomment-52525355
  
    Hi @Parth-Brahmbhatt, would you change the title of this pull request to refer to STORM-460?  It is being automatically linked to JIRA.
]