[[~revans2] Does it makes sense to allow userOperations succeed for supervisor users. 
Is it ok if  a user exists in nimbus.supervisor.users  they won't be able to submit topologies or request clusterInfo., I think there may be an assumption that the client user != supervisor user, for purposes of isolation.  We would not want JVMs running as users who could modify supervisor state files that are protected by FS permissions, e.g.

If we allowed this, we would need to be sure to deny attempts to submit a topology as the supervisor user to maintain the isolation., [~dagit] I noticed a case where my StormClient principal is "storm@domain" and my supervisors are running as user "storm" . I listed "storm" under nimbus.supervisor.users and  Storm UI uses StormClient to request ops on nimbus it will reject any operation apart from supervisor ops as the user becomes "storm"., OK. Can we add 'getClusterInfo' to the list of operations that the supervisor is allowed to do?  We just want to make sure that we don't accidentally allow launching of storm topologies by the supervisor user—that is what is really important here.

The use case makes sense, although with the default to-local plugin, I think we assume that there is a link between user names and kerberos principals.   Normally, we would never access the UI or launch a nimbus client interactively as the same user who runs the supervisor.

If there are cases where a normal (non-admin) user 'storm' exists distinct from the kerberos principal "storm@$DOMAIN", then it seems we would need a different toLocal plugin to handle the translation and also we would need to update the supervisor users list with the local value of the principal., Yes, the truth is I took a Shortcut on KerberosPrincipalToLocal.  If you look at [Hadoop|https://github.com/apache/hadoop-common/blob/trunk/hadoop-common-project/hadoop-auth/src/main/java/org/apache/hadoop/security/authentication/util/KerberosName.java] or [Zookeeper|https://github.com/apache/zookeeper/blob/trunk/src/java/main/org/apache/zookeeper/server/auth/KerberosName.java] they have code to do a proper principal to local mapping using the authtolocal rules.  If someone wants to file a JIRA and adopt the same parsing code that the two implementations share, we could get the full flexibility to work around this issue.]