[patch #1, This method is actually not used at all. We can just remove it., [~apivovarov] Do you want to update the patch with deleting this method? No point in maintaining dead code., GenericUDF is a base class to build UDFs. Some 3rd party UDFs might have bigint constants.

getConstantLongValue API was added to hive-1.2.0
I do not think it's a good idea to remove this API in 1.3.0.
Some people might built UDFs which uses getConstantLongValue already, Method is protected, so its not meant to be used outside of Hive., Protected means that the method might be used by actual UDFs.
Hive itself contains only common UDFs.
But each serious hive users/companies have their own UDFs.
it's quite possible that custom UDFs have bigint constant as a parameter.

protected API should be handled the same as public API. Once added it should not be removed.
because they both are exposed to external users
if we look at UML class diagram then we can see that
- protected API can be used for "inheritance" objects relationship
- public API is used for all objects relationship, {quote}
protected API should be handled the same as public API. Once added it should not be removed.
{quote}

+1 for not directly removing the method to maintain passivity but that statement is not completely true. The ideal approach is to deprecate the method and mention in the javadoc an alternative to use. So I think we should go ahead and just deprecate this method since it is not being used., Lets look at the following facts
- after we fix the bug the implementation will be correct.
- name of the method is also good, we do not have other method which replaces it.
- currently the method is not used in UDFs which exist in hive-exec project
- the method might be used in hive users custom UDFs

Hive is not just a product itself. Hive is an extendable platform. End-users can develop their own UDFs, Serde, etc.
The platform should provide clear and useful interfaces for external developers.

Do you still want to deprecate useful base class method with correct name and implementation just because it's not used in hive-exec itself?, {quote}
So I think we should go ahead and just deprecate this method since it is not being used.
{quote}

I don't think I worded this properly. It should be a "if" instead of "since" ;)

So my only point was that if we must remove this method, let's not remove it non-passively but deprecate it and doc accordingly so our consumers have a chance to migrate to the newer API., +1 on changes(NB), Can you +1 for fixing the bug then? Sure, we can deprecate it when new getConstantLongValue will be available., I did it in HIVE-10710. Can you review HIVE-10710 then?, The method was deleted]