[Eugene, the default process for the RELEASE_NOTES.txt is to simply mark this jira as resolved with the appropriate version number, and it will include it in the RELEASE_NOTES.txt when that's generated as part of the release process.

So, this bug can simply be marked as resolved, with fix version as 1.2.1. Right?

Is there any further documentation needed for this bug? If so, we should have a TODOC label on this page, and/or you can add it to any necessary area of the wiki yourself., Once HIVE-10986 is committed (in 1.3), Hive Metastore will use the setting from core-site.xml thus avoiding the anomaly describe in #2 above., [~leftylev] is there a Doc section that describes Hive caveats wrt Transparent Data Encryption?  This should be mentioned there (specifically for 1.2 release).  I couldn't find it., [~eugene.koifman], the only encryption doc in the Hive wiki is this section (plus Configuration Properties):

* [Setting Up HiveServer2 -- SSL Encryption | https://cwiki.apache.org/confluence/display/Hive/Setting+Up+HiveServer2#SettingUpHiveServer2-SSLEncryption] , [~ekoifman], can this go in the HiveServer2 doc or is it more general?, it applies everywhere, This can be documented in the AdminManual Configuration section "Hive Configuration Variables Used to Interact with Hadoop" -- fs.trash.interval belongs in the table of configs, and for extra visibility a small subsection could be added after the table.

* [Hive Configuration Variables Used to Interact with Hadoop | https://cwiki.apache.org/confluence/display/Hive/AdminManual+Configuration#AdminManualConfiguration-HiveConfigurationVariablesUsedtoInteractwithHadoop]

By the way, the section title "Hive Configuration Variables ..." is misleading since none of them are hive.* variables, so I recommend changing it to "Other Configuration Variables ..." or some such., A version note (or bug note) could also be included in the DROP TABLE and DROP PARTITION sections of the DDL doc:

* [DDL -- Drop Table | https://cwiki.apache.org/confluence/display/Hive/LanguageManual+DDL#LanguageManualDDL-DropTable]
* [DDL -- Drop Partitions | https://cwiki.apache.org/confluence/display/Hive/LanguageManual+DDL#LanguageManualDDL-DropPartitions], I think mentioning this in Drop Table/Partition section is a good idea, but the most critical part is that " fs.trash.interval" has to be set in core-site.xml (i.e. the hadoop config file) not any hive-site.xml or at CLI.  ]