[From the code I see, default configuration is for connecting to database is  "hive.stats.dbconnectionstring=jdbc:derby:;databaseName=TempStatsStore;create=true".When analyze command is executed, initialy PARTITION_STATS_V2 is created at HIVE JVM whereas statistics publishing is done at YarnChild. While publishing the statistics to database, directly executing inserting data into to table.Since yarn child is different jvm, it doesnot find initially created table PARTITION_STATS_V2.


, I have one doubt for analyze configuration.
bq.Is databaseName should be absolute path so that 2 JVM's can share this database.? 
If yes, its better to document in Information document.

I got correct statistics when database is shared amoung JVM's i.e "hive.stats.dbconnectionstring=jdbc:derby:;databaseName=/home/TempStatsStore;create=true" :-), There are 2 problems for analyze command.

1. JDBCStastPublisher fails to connect to database since derby jar is not in classpath.In YarnChild logs we get below exception.
{noformat}
2012-08-01 10:25:17,954 ERROR [main] org.apache.hadoop.hive.ql.stats.jdbc.JDBCStatsPublisher: Error during instantiating JDBC driver org.apache.derby.jdbc.EmbeddedDriver. 
java.lang.ClassNotFoundException: org.apache.derby.jdbc.EmbeddedDriver
	at java.net.URLClassLoader$1.run(URLClassLoader.java:202)
	at java.security.AccessController.doPrivileged(Native Method)
	at java.net.URLClassLoader.findClass(URLClassLoader.java:190)
	at java.lang.ClassLoader.loadClass(ClassLoader.java:306)
	at sun.misc.Launcher$AppClassLoader.loadClass(Launcher.java:301)
	at java.lang.ClassLoader.loadClass(ClassLoader.java:247)
	at java.lang.Class.forName0(Native Method)
	at java.lang.Class.forName(Class.java:169)
	at org.apache.hadoop.hive.ql.stats.jdbc.JDBCStatsPublisher.connect(JDBCStatsPublisher.java:69)
	at org.apache.hadoop.hive.ql.exec.TableScanOperator.publishStats(TableScanOperator.java:236)
{noformat}

>>> Above problem can be resolved by setting "hive.aux.jars.path" for derby jar.

2. JVM of Hive and YarnChild are different.So dbconnectionstring should be common location.If it is set to common location , then there is problme if the NodeManager and Hive are running in differetn machine., You can't use derby for this, since a remote daemon is required to be running which is accessible to all task nodes. Derby runs in embedded mode, so that won't work. You need mysql or orther RDBMS running as daemon and accessible from all task nodes., Also, note HIVE-4632 will simplify stats collection mechanism, so that above is no longer a requirement., Thank you Ashutosh for updating reason for issue. I agree with your comment.]