[this patch is for branch-0.13.
[~ashutoshc] can you +1? Similar to trunk patch
[~sushanth] are you release manager for 0.13.1? Can you +1 for the release?, For backports, you need an OK from RM. There is nothing to be reviewed as this code already exists in trunk and other branches. You have my +1, but that won't help you to commit, unless RM approves., Code is different from other branches due to other changes after 0.13, Since 0.13.1 is released, there are no more changes that can go in to 0.13.1. That version is now released and closed.

What's more, from reading HIVE-8295, that reads like a feature-addition rather than a bugfix. 0.13.1 already had a bar allowing only bugfixes on top of 0.13.0, so I'm not sure this meets that bar even if 0.13.1 were not yet released. Am I reading this incorrectly? Is it actually a bugfix worded like an improvement? Also, since this is a direct-sql only fix, disabling direct sql is a valid workaround for this, correct? In that case, it still doesn't meet the bar(critical bugfixes with no workaround) for 0.13.1 after the RC process started.

If we were to have a 0.13.2, and there  is community agreement on the need for it, then yes, a patch might be checked in to branch-0.13 for it, and that would be okay., This is essentially a bugfix - a workaround for the bug in some databases (Oracle, Derby). Who decides if there's 0.13.2?, The community decides if there's a 0.13.2. If there is enough need for a 0.13.2, and someone ( maybe you? :D ) wants to drive that, then we vote on it, and go through the process.

For 0.13.1, soon after 0.13.0 was released, we hit several important bugs/breakages including a CVE that made 0.13.0 essentially unusable for some usage patterns. We fixed them in 0.14 trunk, but since it would be quite some time before a new stable hive release was released, we needed to make sure that the latest stable release of hive had those bugs fixed - this was what made 0.13.1 necessary. That bar of need, of having this bug fixed in this branch so that the latest stable hive has this fix, imo, does not exist for a 0.13.2 for this bug, since 0.14 is already out. That bar of need probably exists for 0.14.1, but you already have this checked in there.

To that end, for 0.13.1, I proposed that we have a 0.13.1 as a bugfix release in the hive dev list, volunteered to be the RM for it, got a bunch of +1s, and then proceeded to roll it out. If you think that this deserves a new release, then I would invite you to suggest to the hive dev list that a 0.13.2 be rolled out, and proceed with the same process I followed for 0.13.1.

If we were going through that process though, there might be a good point for a wholesale backport of a number of other bugfixes on 0.14.x to 0.13.2 as well, if there were enough people that wanted to upgrade from 0.13.1 to 0.13.2 instead of upgrading to 0.14.1., Removing fix version tag of 0.13.1 from this jira, please feel free to add 0.13.2 when/if you get a community go-ahead for the same., I don't think this JIRA is enough justification for doing an entire release on such an old version]