[IMO its a bad idea to have {{hive.mapred.map.tasks.speculative.execution}} when {{mapred.map.tasks.speculative.execution}} already exists for governing this behavior. I know similar config exist for reduce task but that doesn't justify adding another one, because otherwise we can prefix every single MR config with hive and have a new hive config for each of them, which will be disastrous. , Further, we should encourage users to use mapred configs directly, ie encourage them to use {{mapred.reduce.tasks.speculative.execution}} instead of {{hive.mapred.reduce.tasks.speculative.execution}}, I think it is easy for people who uses hive.mapred.reduce.tasks.speculative.execution to use hive.mapred.map.tasks.speculative.execution by intuition, if we do not want to add this, can we throw at least a warning to user when they try to set hive.mapred.map.tasks.speculative.execution?, Or just deprecate hive.mapred.reduce.tasks.speculative.execution., Agree on both parts. We should throw a warning when folks try to use it saying its deprecated and will eventually be removed., Add the warnings to the patch and I will commit., so we throw deprecation warning for hive.mapred.reduce.tasks.speculative.execution and do not do anything for hive.mapred.map.tasks.speculative.execution?, Correct. Just throw deprecation warning for reduce config and don't do anything for map config., I think we should:
1) apply your patch
2) warn when hive.mapred.map.tasks.speculative.execution is set
3) warn when hive.mapred.reduce.tasks.speculative.execution is set, Disregard what I said. Follow what Ashutosh said., Adding some enum type for deprecated configs which can suggest alternative('mapred.reduce.tasks.speculative.execution' in this case) would be good.
, This one slipped through cracks. [~stayhf] Would you like to rebase it, so that it runs through Hive QA. Also, I think instead of iterating all keys of conf in handleDeprecation() method (which could be > 100s), its better just to look for couple of those which we are deprecated in conf and see if they are set. ]