[this patch includes:
- test for multithreaded execution
- fixes to SessionState.java and CliDriver.java for MT safe (and to run MT tests)

however - the test is disabled. while this seems to fix issues with session management etc. - there are bugs in metastore client code that are not resolved. i would like to file a separate jira for those.

unfortunately metastore client issues are not limited to DDLTasks only - regular table metadata fetches are also affected. (the patch allows testing of clientpositive queries without running DDL commands in MT mode - but in an extremely hacky way), Comments are inlined.

There are two major ones:
1. static LOG - we do that all over our code. Will that cause a problem or do we have to clean that up in the same way that you have done for CliDriver and SessionState.
2. This is the bigger one - I think we should just extend QTestUtil so that it can run in a multi threaded mode instead of creating another class to run those tests. We can then call QTestUtil in two modes and pass the list of tests that want it to executed in the multi threaded mode. That would be more maintainable in the long run.

Rest a few minor things like missing javadocs..
Inline Comments
ql/src/test/org/apache/hadoop/hive/ql/QTestUtil.java:687	Please add javadocs for these.
ql/src/test/org/apache/hadoop/hive/ql/TestMTQueries.java:0	This file needs javadocs.
ql/src/test/org/apache/hadoop/hive/ql/TestMTQueries.java:32	Can we pass the names into this instead of hardcoding these in the code.
ql/src/test/org/apache/hadoop/hive/ql/TestMTQueries.java:0	Also instead of a brand new test class, it is perhaps better to extend QTestUtil to run using the Runner and then run it in two modes, concurrent and serial. We would be able to avoid duplicate code and just have a single utility to test out both the concurrent and serial tests.
ql/src/test/org/apache/hadoop/hive/ql/QTestUtil.java:202	Can we create a similar array as source array for destination tables and destination files and then loop over those arrays.
ql/src/test/org/apache/hadoop/hive/ql/QTestUtil.java:391	javadocs.
ql/src/test/org/apache/hadoop/hive/ql/QTestUtil.java:391	Where is this function called from?
build-common.xml:226	why are we excluding TestMTQueries here?
cli/src/java/org/apache/hadoop/hive/cli/CliDriver.java:62	Would static log not work. If so, we have that all over the code and just fixing it here will not work.
ql/src/java/org/apache/hadoop/hive/ql/session/SessionState.java:265	javadocs for these., thx - will fix the inline comments.

static LOG: this is not a blocking issue. I am assuming that log4j itself is multithread safe. The main issue is that all log events are going to end up in the same log file - and log entries from different sessions will be interleaved without any clear headers. There's something called NDC that's apparently used widely in multi-threaded environments to put prefixes on log entries per thread (in our case session). we can use NDC interfaces from log4j - but it's more work - potentially more disruptive changes.

QTestUtil: don't understand this. today every query file is run independently in a different junit test. if QTestUtil ran all of them (either in sequence or in parallel) - this would not be possible. can u explain a bit more?, Log4j has a variable that will print the thread name. 

http://logging.apache.org/log4j/1.2/apidocs/org/apache/log4j/PatternLayout.html

%t should do it., @Joy

I meant rolling up the TestMTQueries into QTestUtil so that we just have a single tool to deal with when it comes to query testing.

%t as suggested by Edward should work for now. Later when we expand this so that a thread is able to handle multiple sessions (a requirement on JDBC) we can start exploring NDC and MDCs to log thread specific information., fixed all the inline comments and moved multithreaded query harness to QTestUtil. 

> ql/src/test/org/apache/hadoop/hive/ql/QTestUtil.java:391 Where is this function called from?
This is a temporary hack for non-DDL related metastore issues.

also - i am actually able to run TestMTqueries succesfully now. funnily all the metastore issues are not showing up. There were some more changes required:
- randomize hadoop execution directories for local mode execution (otherwise there are collisions when submitting jobs concurrently)
- fix taskfactory id to be threadlocal static
, another one after resolving Namit's changes., +1

looks good to me.

Zheng can you checkin..., HIVE-77. Thread safe query execution. (Joydeep through zshao)
Committed revision 723699.
]