[Thing is, I've actually set tez.counters.max=16000 on the Hive command line. I can also see in the Tez logs, that the counters are set to 16000 during the dag execution.

The log messages in the Jira description (including the line where MAX_COUNTERS=1200) is from my hive.log.  So it seems like when we're trying to fetch the counters after execution, that tez.counters.max is somehow not set in the DagClient's configuration.  I suspect the TezSessionState's conf is coming from the SessionState's configuration, which might be getting initialized with a blank config from SessionState.getSessionConf()., is this triggered by the {{hive.tez.exec.print.summary}} ?, Yes, it is triggered by hive.tez.exec.print.summary. At first I was getting LimitExceededExceptions during Dag execution, at which point I added "--hiveconf tez.counters.max=16000" to my Hive command line. Now the error has moved from Dag execution to the Hive client, when it's trying to fetch the counters to print the summary., Actually looking a bit more into this, it looks like Limits.ensureInitialized() is defaulting to an empty configuration, resulting in COUNTERS_MAX being set to the default of 1200. I see that there is a Limits.setConfiguration() that we could use to initialize the configuration being used, but the Limits class is listed as @InterfaceAudience.Private.  [~sseth], any recommendations on how best to set the counter limits - is this something that should be handled in Tez?, Attaching workaround patch to skip printing of summary info if we fail to fetch the counters, rather than failing the entire query., [~jdere] - I think the Tez client does need to make this call to setup the Configuration correctly. We do this for the AM and the executing task - which is why it works. Could you please open a Tez jira for this ?
Also, Limits is making use of Configuration instead of TezConfiguration for default initialization, which implies changes to tez-site on the local node won't be picked up., 

{color:green}Overall{color}: +1 all checks pass

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12746194/HIVE-11303.1.patch

{color:green}SUCCESS:{color} +1 9228 tests passed

Test results: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/4675/testReport
Console output: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/4675/console
Test logs: http://ec2-174-129-184-35.compute-1.amazonaws.com/logs/PreCommit-HIVE-TRUNK-Build-4675/

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12746194 - PreCommit-HIVE-TRUNK-Build, [~jdere]: +1 LGTM.
, Committed to master/branch-1]