[Just realized the dynamic partition creation part was refactored to DynamicPartitionFileWriterContainer.java.

Moved the commit logic for each generated dynamic partition directory to FileOutputCommitterContainer.java. Also add the clean up code to remove the attempt directories when the task is failed/abandoned. , Hi,

I like this change - it's simple and simplifies the flow to outputCommitter nicely. (This will need testing to verify that it works, and probably the full suite of e2e tests as well to verify that it continues to work from HCatStorer, but it's a good change.)

That said, in its current form, this patch will not work, I think - not without one more change to the FileOutputCommitterContainer - simply put, FileOutputCommitterContainer.needsTaskCommit() currently returns false if it detects that dynamic partitioning has been used (since it assumes that the recordwriter already did it). With your change, it will need to be updated to return true. Apart from that, this looks good to me. If you update your patch and set it to patch-available, we can have the tests run on it., Thanks for reviewing this, Sush. Selina has a similar fix for this on 0.12. We'll be running some tests with speculative-execution enabled. We'll report back if anything turns up.

(I wish there were a deterministic way to test this. :/), You are right, I forgot set it to true for FileOutputCommitterContainer.needsTaskCommit().I have updated the patch and in this patch I also removed some lines we do not need anymore. 

Thanks for reviewing this!, 

{color:red}Overall{color}: -1 at least one tests failed

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12665172/HIVE-7803.2.patch

{color:red}ERROR:{color} -1 due to 2 failed/errored test(s), 6127 tests executed
*Failed tests:*
{noformat}
org.apache.hadoop.hive.cli.TestCliDriver.testCliDriver_udaf_histogram_numeric
org.apache.hadoop.hive.cli.TestMiniTezCliDriver.testCliDriver_dynpart_sort_opt_vectorization
{noformat}

Test results: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/554/testReport
Console output: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/554/console
Test logs: http://ec2-174-129-184-35.compute-1.amazonaws.com/logs/PreCommit-HIVE-TRUNK-Build-554/

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
Tests exited with: TestsFailedException: 2 tests failed
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12665172, The test failures seem not related to this patch. Saw the same failures for HIVE-7890. , (Closing as duplicate without committing, since this functionality is subsumed and improved by HIVE-8394)]