[+1, 

{color:green}Overall{color}: +1 all checks pass

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12686790/HIVE-9086.1.patch

{color:green}SUCCESS:{color} +1 7566 tests passed

Test results: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/2828/testReport
Console output: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/2828/console
Test logs: http://ec2-174-129-184-35.compute-1.amazonaws.com/logs/PreCommit-HIVE-TRUNK-Build-2828/

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12686790 - PreCommit-HIVE-TRUNK-Build, Doc note:  Uh oh, I documented this prematurely (for HIVE-7100).  But did I get it right, except for the jira attibution and release number?

* [DDL -- Drop Partitions | https://cwiki.apache.org/confluence/display/Hive/LanguageManual+DDL#LanguageManualDDL-DropPartitions], [~leftylev] As I read the documentation, I'd expect that this would work:
{code}
ALTER TABLE <table> DROP PURGE PARTITION (partition=blah);
{code}

The patch as implemented looks like the syntax would be:
{code}
ALTER TABLE <table> DROP PARTITION (<part>=<val>) PURGE;
{code}

I'm not sure if we want the patch to match to documentation or vice versa, but seems like they do not match.
, Thanks for the review [~timd112]. The documentation should match the patch but not until the patch gets committed.  So I'll revert the doc changes and use the patch syntax when the time comes., The way it is documented seems to be more in line with how the DROP TABLE syntax is formatted, which is why I brought it up.  We've applied the patch (along with HIVE-9083) and it seems to be working as expected.  I just wanted to validate (to whatever extent possible) that the patch syntax is going to be the syntax going forward before we update our scripts.  , [~mithun], do you want me to check in the patch as is or are you planning to make changes based on above comments?, @[~ekoifman]: I'd like to keep the grammar as it is, if that's acceptable. We'll adjust the documentation accordingly.

I'm not quite done rebasing HIVE-9083 (that this patch depends on), so we'll have to wait a tad before checking this in.
(/CaptainObvious), FWIW, I prefer the syntax from the patch.  I think it reads more cleanly.  , bq.  FWIW, I prefer the syntax from the patch. I think it reads more cleanly.

Agreed, "DROP PURGE PARTITION" is harder to understand than "DROP PARTITION PURGE".  The IF EXISTS option doesn't have the same natural language problem.

But it's confusing to put PURGE after PARTITION in the ALTER statement (separate from IF EXISTS) while the DROP TABLE statement puts it next to IF EXISTS.

*  Would the DROP TABLE syntax be better if it were "DROP TABLE IF EXISTS table_name PURGE"?  But that breaks backward compatibility (PURGE was added in 0.14.0).
*  Should the syntax of both statements be changed to tolerate either placement of PURGE?, Could we get a summary on the disagreement here? If the syntax for table is adding PURGE after table name, we should be adding PURGE after partition spec just to be consistent., Judging from [the patch|https://issues.apache.org/jira/secure/attachment/12670435/HIVE-7100.11.patch#file-12], HIVE-7100 added the "drop-table-purge" functionality to read thus:

{code:sql}
DROP TABLE IF EXISTS my_doomed_table PURGE;
{code}

The current "alter table drop partitions" reads as follows:

{code:sql}
ALTER TABLE my_doomed_table DROP IF EXISTS PARTITION (part_key = "sayonara") IGNORE PROTECTION;
{code}

HIVE-9086 extends HIVE-7100's purge-functionality to partitions, and suggests that the {{PURGE}} keyword go at the end, thus:

{code:sql}
ALTER TABLE my_doomed_table DROP IF EXISTS PARTITION (part_key = "sayonara") IGNORE PROTECTION PURGE;
{code}

Should {{PURGE}} sit before/after {{IF EXISTS}} or after {{IGNORE PROTECTION}}?

We can't break backward compatibility, so we shouldn't be changing what we released in 0.14., {quote}
HIVE-7100 added the "drop-table-purge" functionality to read thus:

DROP TABLE IF EXISTS my_doomed_table PURGE;
{quote}

Cool, then the doc is wrong in two places but the syntax is consistent for DROP TABLE and DROP PARTITION.  Thanks!  I'll wait for the dust to settle before fixing the doc.

* [DropTable | https://cwiki.apache.org/confluence/display/Hive/LanguageManual+DDL#LanguageManualDDL-DropTable]
* [Drop Partitions | https://cwiki.apache.org/confluence/display/Hive/LanguageManual+DDL#LanguageManualDDL-DropPartitions], Done rebasing HIVE-9083. It turns out HIVE-9086 doesn't need rebasing., I like {{PURGE}} at the end too. AFAICS reading the thread, all other commenters favored that syntax as well (which is same as in patch). I think we should go ahead with the patch., Doc note:  When documenting this, remember the new table property auto.purge introduced in HIVE-9118., Committed to trunk.  Thanks [~mithun] for the contribution, Doc note:  The documentation has been revised (please review).

* [LanguageManual DDL -- Drop Partitions | https://cwiki.apache.org/confluence/display/Hive/LanguageManual+DDL#LanguageManualDDL-DropPartitions], This issue has been fixed and released as part of the 1.2.0 release. If you find an issue which seems to be related to this one, please create a new jira and link this one with new jira.]