[or just use recent DataNucleus (3.0Mx) which, by default, omits checks on OSGi dependencies.

PS. if having such issues with third party software i'd expect people to go to that third-party software and register an issue there to be able to turn something off etc, rather than rely on that projects developers to just happen across issues like this in a web trawl., @Andy: Has the DataNucleus 3.0 release gone final yet? If not, do you have any idea when this will happen? Is there any chance that this fix will be backported to the 2.x series?, Looks like we could also set datanucleus.plugin.pluginRegistryBundleCheck=NONE in HiveConf and hive-default.xml.template:

From http://www.datanucleus.org/products/datanucleus/persistence_properties.html:
{noformat}
datanucleus.plugin.pluginRegistryBundleCheck
Description	 Defines what happens when plugin bundles are found and are duplicated
Range of Values	 EXCEPTION | LOG | NONE
{noformat}
, @Zhenxiao: Please see if setting datanucleus.plugin.pluginRegistryBundleCheck=NONE fixes this problem. If it does, please prepare a patch. Thanks!, @Carl: I set datanucleus.plugin.pluginRegistryBundleCheck=NONE in both HiveConf.java and hive-default.xml. The error message is still there for the first cmd in Cli. I am checking other possible solutions to fix it., Setting datanucleus.plugin.pluginRegistryBundleCheck has no effect of this bug.

According to: 
http://www.datanucleus.org/products/datanucleus/persistence_properties.html

datanucleus.plugin.pluginRegistryBundleCheck
Description	 Defines what happens when plugin bundles are found and are duplicated
Range of Values	 EXCEPTION | LOG | NONE

Seems this is set to whether LOG, EXCEPTION, or NONE if the plugin bundles are found and are duplicated. If it is not found/unresolved, ERROR still shows up in the first CLI command.

Also tested setting it to be EXCEPTION. No exception at all, the same error message., This should have been fixed via HIVE-3632 Feel free to reopen if you can still reproduce., This issue has been fixed and released as part of 0.12 release. If you find further issues, please create a new jira and link it to this one.]