[added a fix for number of jobs also, The patch has a few bug fixes:

1. The total number of jobs were counted wrongly, which made it very difficult to debug (specially big union queries).
2. The job name for a query was incorrect, , which made it very difficult to debug (specially big union queries).

These two are fixed in Driver.java

3. Union plans were very complex and inefficient - since the unions were not getting merged - the simple fix to to merge 
them in the SemanticAnalyzer - no need to check anything, union schema should be the same.

4. No special case for ReduceSink followed by Union -- the fix is in GenMRRedSink3


Added a bunch of new tests


, It seems that the new test results print out the GroupByOperator after ReduceOutputOperator in the "Map Operator Tree", while it is already printed out in the "Reduce Operator Tree:" section.

{code}
+              Reduce Output Operator
+                key expressions:
+                      expr: 0
+                      type: string
+                sort order: +
+                Map-reduce partition columns:
+                      expr: 0
+                      type: string
+                tag: -1
+                value expressions:
+                      expr: 1
+                      type: bigint
+                Group By Operator
+                  aggregations:
+                        expr: count(VALUE.0)
+                  keys:
+                        expr: KEY.0
+                        type: string
+                  mode: mergepartial
+                  Select Operator
+                    expressions:
+                          expr: 0
+                          type: string
+                          expr: 1
+                          type: bigint
+                    File Output Operator
+                      compressed: false
+                      GlobalTableId: 0
+                      table:
+                          input format: org.apache.hadoop.mapred.TextInputFormat
+                          output format: org.apache.hadoop.hive.ql.io.IgnoreKeyTextOutputFormat
+        /data/users/njain/hive1/hive/build/ql/tmp/58586108/201879798.10003 
{code}
, that is because of map-side aggregation, Zheng pointed out another unrelated bug in the code for explain. The kids of reduce sink was not made null for all dependent tasks, so only explain plans
of top level tasks were correct.

Although, the reduce sink operator would ignore the kids, so there is no runtime bug, fixed explain plan bug and updated a bunch of log files, Thanks Namit., Looks like this patch cause two unit tests to fail: 
org.apache.hadoop.hive.cli.TestCliDriver.testCliDriver_union10
org.apache.hadoop.hive.cli.TestCliDriver.testCliDriver_union12

http://hudson.zones.apache.org/hudson/job/Hive-trunk-h0.19/lastBuild/testReport/, I will look into this, I created HIVE-397 to track the test fixing]