[Hmm .. this doesn't happen on my environment (or in the precommit jobs). Can you confirm if this happens to you on maven 3.3 as well?, Hi [~vihangk1] ,

Tested with maven 3.3.3, with Hive git commit *7765e90aad44747860b3c1adbe8a4857d864912d*

{code}
~/Workspace/tmp/apache-maven-3.3.3/bin/mvn -version
Apache Maven 3.3.3 (7994120775791599e205a5524ec3e0dfe41d4a06; 2015-04-22T19:57:37+08:00)
Maven home: /Users/zhengshuai.peng/Workspace/tmp/apache-maven-3.3.3
Java version: 1.8.0_192, vendor: Oracle Corporation
Java home: /Library/Java/JavaVirtualMachines/jdk1.8.0_192.jdk/Contents/Home/jre
Default locale: en_CN, platform encoding: UTF-8
OS name: "mac os x", version: "10.13.6", arch: "x86_64", family: "mac"
{code}

But there is still the same error when building with maven 3.3.3.

The maven build debug log has been attached, please have a look, thanks.
 , Yes I've hit this error for awhile now.  Uploading a patch that seems to solve it for me.  Though I wasn't following so not sure why it was set on purpose to gnu before., It is interesting to note that in packaging/pom.xml has {{<tarLongFileMode>gnu</tarLongFileMode>}}. Perhaps it was copied from the packaging/pom.xml to standalone-metastore module., I also came across this issue today. Opened HIVE-20800 without noticing this ticket. Thanks Vihang.

Here's what I found:

[https://maven.apache.org/plugins/maven-assembly-plugin/faq.html#tarFileModes]

We do need to make sure it's "posix" since it's better than "gnu". And we need the change for packaging/pom.xml as well.

 , Hi [~szehon] can you update the packaging/pom.xml as well? Rest looks good to me. Thanks!, Hey Vihang for some reason when I just change it on packaging/pom.xml like that it gives an error 
[ERROR] Failed to execute goal org.apache.maven.plugins:maven-assembly-plugin:2.3:single (assemble) on project hive-packaging: Failed to create assembly: Error creating assembly archive bin: posix is not a legal value for this attribute -> [Help 1]

I need to debug it further., So the problem was the top-level packaging was using an old version of maven assembly before posix was even supported.  This latest patch builds but also upgrade the maven.assembly.plugin to the same one used in standalone-metastore., Thanks for the fix. LGTM +1, Committed to master, thanks Vihang for the review]