[HIVE-4485.1.patch - initial patch. Makes null string configurable. test needs fixing/improvement
, Making null string configurable is probably over engineering at this point. 
HIVE-4485.2.patch - Simpler patch that does not make it configurable.
, Hive 0.11.0 was released with the current behavior (nulls printed as "NULL"), so any changes we make at this point need to be configurable (using Beeline's 'set!' command), and should default to the current behavior.
, bq. Hive 0.11.0 was released with the current behavior (nulls printed as "NULL")
[~cwsteinbach] I want to clarify that this is about beeline and beeline currently prints nulls as emtpy strings. I agree that switching this would be a backward incompatible change. But I think it is important to distinguish between empty strings and null for obvious reasons.

I think this is a general problem - Hive has undesirable defaults in some cases and changing those would break backward compatibility. I think we should give the users (specially new users), the option of using the more sensible but backward incompatible configuration defaults. I will open a new jira for that.
, [~thejas] I'm fine with changing the default behavior in the next release as long as we document the change in the release notes and provide a configuration option that allows users to revert back to the old behavior., HIVE-4485.3.patch - patch with behavior in release notes, 4.patch - fixes whilespace issues, adds missing BooleanCompletor.java file, +1, 

{color:green}Overall{color}: +1 all checks pass

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12615928/HIVE-4485.4.patch

{color:green}SUCCESS:{color} +1 4740 tests passed

Test results: http://bigtop01.cloudera.org:8080/job/PreCommit-HIVE-Build/463/testReport
Console output: http://bigtop01.cloudera.org:8080/job/PreCommit-HIVE-Build/463/console

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12615928, Patch committed to trunk. Thanks for the review Ashutosh!
]