[ORC
The FloatTreeReader.nextVector reads the first float as:
-35664.76
and stores it into the DoubleColumnVector.vector (double[]) where it displays as:
-35664.76171875
And, FloatTreeReader.nextVector reads the second float as:
29497.34
and stores it into the DoubleColumnVector.vector (double[]) where it displays as:
29497.33984375
For the query looking at the original data type float, the RecordReaderImpl.nextFloat casts the DoubleColumnVector.vector entry to float and sets the FloatWritable. The values -35664.76 and 29497.34 reappear.
For the 2nd query after changing the data type to double, the RecordReaderImpl.nextDouble just stores the DoubleColumnVector.vector entry in the DoubleWritable. The values with more digits -35664.76171875 and 29497.33984375 are returned.
--------------
TEXTFILE
The float values are stored as text fields "-35664.76" and "29497.34" and there is no conversion because we are using a table. There is just a new interpretation of the field.
The first query reads those fields as float and the second query after changing the data type to double reads the text fields as double., (Comment from Gunther):

I've tried it in java and found the same behavior.

{noformat}
    float f = 29497.34f;
    System.out.println(f);
    System.out.println((double)f);
{noformat}

yields

{noformat}
29497.34
29497.33984375
{noformat}

On the other hand I'm pretty sure 29497.34 can be represented as double (as happens with text).
,  think this is part of the float madness.
I'm concluding that TEXTFILE format tables are not a good gold standard for what needs to be produced.
For Schema Evolution, I think that when there is a data type conversion the gold standard for ORC is CAST.
If you take the TEXTFILE table with float data type and do a "select cast(f as double) from test_text;" you will get:
-35664.76171875
29497.33984375
but after the column is changed to double a plain select * will produce:
-35664.76
29497.34
And, because there is no history that the file was written as float there is no hope of fixing this problem., "Works as Designed"]