[Sun,

The issue is related to HIVE-6013. Harish and I debated about this change so you can put all the blame on me.

We decided to go this path because:
1. We had a user who was trying to import about 50,000 tables from existing databases that contained all kinds of strange characters in column names.
2. The new behavior is consistent with SQL standards
3. Most Hive users did not know about the regex feature and did not use it.
4. Other databases allow .* as part of the column name.

It's worthwhile for others to give their opinion on this. Personally I think the breaking change is better in the long run. Can you give more detail about why you favor the old path? Is it because of Shark compatibility? Something else?, [~cartershanklin] Thanks for your explanation. I happened to use REGEX columns to shorten several queries. I can do a one-shot change to not use it, since the community have not opposed to this breaking of backward compatibility. Could you update the documentation to reflect the new behavior?, [~sunrui] I hit this today and found following references useful:

# https://cwiki.apache.org/confluence/display/Hive/LanguageManual+DDL#LanguageManualDDL-AlterColumn
# https://issues.apache.org/jira/secure/attachment/12618321/QuotedIdentifier.html

In short the functionality is still there but you need to set hive.support.quoted.identifiers to none to get the pre-0.13 behavior. I was able to run my query after
{code:actionscript}
hive> set hive.support.quoted.identifiers=none;
{code}

My query was something like:
{code:actionscript}
hive> select `(col1|col2|col3)?+.+` from testTable1;
{code}
, Basically this doesn't seem to be an issue but it would help if we clarify this in [Select documentation|https://cwiki.apache.org/confluence/display/Hive/LanguageManual+Select] as well . , I added information about this to the bullet list after the SELECT syntax (same as for Create Table) and gave version information in the section "REGEX Column Specification":

* [Select Syntax | https://cwiki.apache.org/confluence/display/Hive/LanguageManual+Select#LanguageManualSelect-SelectSyntax]
* [REGEX Column Specification | https://cwiki.apache.org/confluence/display/Hive/LanguageManual+Select#LanguageManualSelect-REGEXColumnSpecification], Thank you [~leftylev]. Marking this "Resolved/Not a problem"]