[This is the current solution. 
1) Before setting up the class path environment variable, find the list of JARs in the “test-classpath” and copy all of them to a <test jar> folder from various folders. This is done in a task "shortenclasspath". That means, all the required JARs will be in a single folder.
2) Include the “<test jar>*” in the class path to reduce the class path size.
3) Set the environment variable, -1 for the following reasons:

* In the near future we're going to stop manually constructing the classpath and let Ivy (or maybe even Maven or Gradle) do it for us. When this happens this change will break.
* This problem can be avoided in the first place by ensuring that the root of Hive's source directory is <= 11 characters.
, I want to add that a better place for a patch like this is Ant's JUnit task. That way everyone automatically benefits from the fix without having to gunk up their build files with special case logic and bespoke Ant tasks. Based on the prevalence of this problem I'm kind of surprised that someone hasn't already done this., Thanks for your comments, Carl. 

We attached this patch, because unit tests currently fail on Windows and we are looking for a short term solution to help unblock Windows development. The root issue is that the current logic of adding all JARS individually to the CLASSPATH easily breaks on Windows. We have had several people run into this issue and it is a pain point. 

Could you tell us how near term is the fix to automatically build the CLASSPATH, as you pointed out that in the near future we are going to stop manually constructing the CLASSPATH?

This failure is currently specific to unit tests. The limit 12 characters is just a rough estimation because different projects use different numbers of JARS. Tomorrow we could add more JARS to the CLASSPATH as the project grows and even an 11 character enlistment wouldn’t be good enough. Also for custom Hive deployments it is possible that we need to add other JARS to the CLASSPATH (such as SERDEs etc). The patch attached can make the Hive unit tests work well currently. 

Could you clarify a little bit more about your proposal? Is using lvy or Maven in the near future going to solve this problem automatically, or you want a more generic solution to this kind of problem (now or after Ivy is used to construct the CLASSPATH)?
]