[[~ashutoshc] and [~alangates], this is the followup ticket to track the oracle and mysql schema initialization problem for trunk (0.14). Thanks!, This patch adds hive-txn-schema-0.14 scripts, which are all identical to hive-txn-schema-0.13 scripts, but they are added for completeness.  The transaction tables are also added to the hive-schema-0.14 scripts.

[~damien.carol], please review this patch as I changed the transaction tables for postgres to lower case so that they would work without requiring quotes in TxnHandler/CompactionTxnHandler.  I can't reproduce your errors (my version of postgres doesn't seem to care about upper/lower case), so I wanted to have you check it before I commit this.

, [~alangates] I will test it on Monday 2014-10-13 but at first sight LGTM., NO PRECOMMIT TESTS, [~alangates] Could you add quotes to identifiers in the postgres scripts. This way, the lowercase identifiers are explicit?, So what is now:
{code}
CREATE TABLE txns (
  txn_id bigint PRIMARY KEY,
  txn_state char(1) NOT NULL,
  txn_started bigint NOT NULL,
  txn_last_heartbeat bigint NOT NULL,
  txn_user varchar(128) NOT NULL,
  txn_host varchar(128) NOT NULL
);
{code}
would instead look like
{code}
CREATE TABLE 'txns' (
  'txn_id' bigint PRIMARY KEY,
  'txn_state' char(1) NOT NULL,
  'txn_started' bigint NOT NULL,
  'txn_last_heartbeat' bigint NOT NULL,
  'txn_user' varchar(128) NOT NULL,
  'txn_host' varchar(128) NOT NULL
);
{code}

Is that right?, [~alangates] I think we should use char {{"}} like in the others upgrade scripts of the metastore.
{code:sql}
CREATE TABLE "BUCKETING_COLS" (
"SD_ID" bigint NOT NULL,
"BUCKET_COL_NAME" character varying(256) DEFAULT NULL::character varying,
"INTEGER_IDX" bigint NOT NULL
);
{code}

Link here https://github.com/apache/hive/blob/trunk/metastore/scripts/upgrade/postgres/hive-schema-0.14.0.postgres.sql#L22, A new version of the patch that quotes postgres table and field names., For all DBs (except for MS-SQL) there are changes in schema file as well new txn-schema file. But for, MS-SQL there are no additions in existing schema file. Was it intentional ? 
Looks good otherwise., All the txn tables are already in the hive-schema-0.14.0.mssql.sql.  I don't know why.  But that's why I didn't add them., oh, ok. +1, +1 for .14. This looks like it should go into that branch too., Patch 2 committed to trunk and branch 0.14.  Thanks Ashutosh for the review and Damien for your help on the patch., FYI this breaks svn merge patches. Can you look at HIVE-8668?, This has been fixed in 0.14 release. Please open new jira if you see any issues.
]