[[~owen.omalley] So the pom.xml updates are straightforward. For the HMS schema upgrade, should it include an upgrade sql scripts from both 2.2.0 and 2.3.0 releases, or just 2.3.0? What if there are 2.4.0, 2.5.0 ... releases in the future? , This should be committed after 16301., Attaching the changes for pom.xml files and the HMS schema files., Patch has been uploaded to the reviewboard (https://reviews.apache.org/r/58114), 

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12861483/HIVE-16316.patch

{color:red}ERROR:{color} -1 due to no test(s) being added or modified.

{color:red}ERROR:{color} -1 due to 2 failed/errored test(s), 10544 tests executed
*Failed tests:*
{noformat}
org.apache.hadoop.hive.cli.TestMiniLlapLocalCliDriver.testCliDriver[vector_if_expr] (batchId=141)
org.apache.hive.hcatalog.api.TestHCatClient.testTransportFailure (batchId=172)
{noformat}

Test results: https://builds.apache.org/job/PreCommit-HIVE-Build/4494/testReport
Console output: https://builds.apache.org/job/PreCommit-HIVE-Build/4494/console
Test logs: http://104.198.109.242/logs/PreCommit-HIVE-Build-4494/

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.TestCheckPhase
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
Tests exited with: TestsFailedException: 2 tests failed
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12861483 - PreCommit-HIVE-Build, Test failures are unrelated. [~pxiong] [~owen.omalley] could you take a quick look so I could commit this? Thanks, The change looks good to me. +1. 

There is one pom.xml testutils/ptest2/pom.xml which always uses version 1.0 and the version is not updated. Since it's internal test, I guess it's OK to just keep as 1.0., Fix has been committed to master. master branch is now designated to be "3.0.0" release. Thanks for the review [~aihuaxu], hello guys, i saw 
{code}
15	2.2.0-to-2.3.0	15	2.2.0-to-3.0.0
{code}
May i ask why you replace 2.2.0-to-2.3.0  with 2.2.0-to-3.0.0? I think we should add a new entry 2.3.0-to-3.0.0 rather than replace it.

, [~pxiong] Thanks for the review. That was my first comment in this jira.
I am not quite sure what the tentative release schedule is for 2.3 and 3.0. But this is similar to what was done when branch-1 was used for 1.3 and 1.2 in the process of being released and master then was 2.0 release. {{branch-1}} had scripts for migrating 1.2-to-1.3 and {{master}} had scripts for migrating 1.2-to-2.0. Hope this makes sense. We could adjust it in the future as we get closer to release dates., I didn't notice that during the code review. Not sure how typically we handle branch version upstream. 2.3 and later 2.x  technically should be considered as minor release from 2.2 and shouldn't involve schema change? , The 2 scenarios to consider are 
1) Hive 3.0 is released before Hive 2.3. Correct if if I am wrong, I think we are covered in this case because the upgrade path would be 2.2.0 --> 3.0.0. We have all the scripts in place for this upgrade.
2) Hive 3.0 is release after Hive 2.3. Where or not there are real schema changes between 2.3 and 3.0, there will always be a change to update the version in the VERSION table. So when 2.3 is released, we will need to update the master to include scripts to upgrade from 2.3 to 3.0. The reason for deferring this change is 2-fold. a) there may never be a 2.3 release. or b) Hive 2.4 or 2.5 might even be released before Hive 3.0 in which case we have to have scripts for upgrade from the latest release.

Does this make sense? Thanks, [~ngangam], 1. will not happen. 2. There will be a 2.2 and a 2.3 for sure. If you take a look at the upgrade.order.derby, you will see that they are upgraded one step by one step. Thus we should have
{code}
2.2.0-to-2.3.0
2.3.0-to-3.0.0
{code}

rather than
{code}
2.2.0-to-3.0.0
{code}

Could u correct it? Right now it is blocking some development from [~wzheng]. Thanks., if we are going to have 2.4 or 2.5. we can always replace 3.0 with 2.4 or 2.5. But we need to do the upgrade one by one., [~pxiong] Thanks for the clarification on the release schedule. I will attach a follow-on patch to make 2.3 the earlier release., Add-on patch to change the upgrade path from 2.2 --> 3.0 to 2.2 --> 2.3 --> 3.0.
[~pxiong] [~aihuaxu] Could you please review? Thanks, [~wzheng], can u apply this patch and see if it works in your scenario? thanks., [~ngangam] The addendum patch looks good. Thanks for the quick fix. Can you commit it?, [~wzheng] Thanks for the review. I have committed the fix to master. , Hive 3.0.0 has been released so closing this jira.]