[Patch Attached., Looks good. Will commit if tests pass., Can I drop a late comment in....

-            outStream.writeBytes(tbl.getTTable().toString());
+            outStream.writeBytes(tbl.getTTable().toString().replaceAll("\n", "<LF>").replaceAll("\t", "<TAB>"));

We should do this in a uniform format. There are lots of non printable characters we use US UnitSeparator for example

http://web.cs.mun.ca/~michael/c/ascii-table.html
Why not output in the same format the create table would specify?

{noformat}
 FIELDS TERMINATED BY '\054' " +
        " LINES TERMINATED BY '\012' " );
{noformat}, Edward - 

I made this suggested change and it did not work.  For the LF, the output still breaks and two fetches have to be done to get the extended plan.  The 054 did not display anything.  

I also tried escaping the backslash and just a 054 and 012 were printed.  Would you prefer that notation ?   054 and 012 with no \

Thanks
-Matt

, Matt,

It is a tough call. 

I believe you can issue
{noformat}
 FIELDS TERMINATED BY ',' " +
{noformat}

As well as 
{noformat}
 FIELDS TERMINATED BY '\054' " +
{noformat}

in a create table statement. It is stored as its ascii/unicode value. Hive will restrict delimiters over ascii 128 I believe. 

If someone is issuing 'show tables' showing them '054' as opposed to a ',' might be a pain, as they will need an ascii table to figure out what the delimiter is'.  However I think showing them the octal/hex/decimal is the best way as the ouput is consistent. 

We also can do <LF> but we should do replacements for all non-printable characters. 


I think 054 is fine, but maybe someone wants to chime in and speak about what the delimiters could be down the road. Guys?, blocker for 0.5, All -

Do we have a decision on what you want the output to show ?  A few different ideas were being thrown around.

I would rather replace only characters that would break the output ( tab, \n ) with something meaningful vs, as Edward stated, always showing the octal representation which would require an ascii table to figure out what the delimiter is.  If something is | ( pipe ) delimited, I always need to look it up when that is a printable character.

I'll wait for feedback from the FB team and make the changes.

Thanks., We should be consistent across different fields.

serialization.format=9,line.delim= ,field.delim= 

We should use the same format for all of them. We can choose the decimal format for all of them. Since it is a existing problem, this need not be a blocker for 0.5

]