[[~ashutoshc] I haven't digged deeply into it. But can this be supported?, If you set {{hive.groupby.orderby.position.alias}} to true then query doesnt make sense. It effectively mean do GBY on avg column. So, throwing exception is indeed correct here., I have done some digging into this and following is what I have found:

Consider:

select col1, sum(col2) from t group by 1;

There are multiple ways on how above can be interpreted. When I read the standard, AFAICT  constant literal is not allowed in group by expression, so this should throw an error. However, testing this on different DBs I found different behavior.

Oracle & SQL server throws error for this.​ However, MySQL & Postgres assumes 1 in gby clause refers to position 1 in select list, so they translate this effectively into:
select col1, sum(col2) from t group by col1;

Another interpretation for this is assume its group by on constant, meaning there is one group for full table.

Hive of course has a config variable using which you can get either behavior meaning different result set with different value of config variable.

Other variant for this is:

select  sum(col2) from t group by 1;

MySQL & Postgres throws error for this consistent with their above interpretation. SQL Server also throws error for this. However, Oracle magically interprets this as group by on constant.

Yet another variant:

select 1 from t group by 1;

For this one MySQL, Postgres & Oracle can execute the query. SQL Server throws error.

So, it seems only SQL Server is compliant with standard and other DBs do different things depending on context.
I am wondering whether Hive should change its default behavior being consistent with standard and start throwing exception whenever there it encounters a constant literal in group by expression. Of course, their will be a config to get back old behavior. Thoughts?, Removing 2.1.0 target. Please feel free to commit to branch-2.1 anyway and fix for 2.1.0 if this happens before the release., use  "order by 1" as your test case.    you'll get the same error.

I should mention this is hive v2.1.0

{code}
[dwrdevnn1:10001] hive> select count(*), date_key FROM Raw_logs.fact_tracking_datekey_by_hour group by date_key order by 1 desc;
Fri Jul 29 15:47:06 2016 - Thrift::API::HiveClient2::execute: Error while compiling statement: FAILED: SemanticException [Error 10128]: Line 1:7 Not yet supported place for UDAF 'count'; HQL was: "select count(*), date_key FROM Raw_logs.fact_tracking_datekey_by_hour group by date_key order by 1 desc"
{code}

and yes "hive.groupby.orderby.position.alias=true"

thoughts?
]