[categorizing..

I am not sure if this is a bug. All our identifiers are restricted to not start with _ so that we can handle the character set names. So any column name or table name beginning with an _ would lead to a parse error. Is that what you are getting? Can you upload the error string and then mark this as an improvement as opposed to a bug., from being able to handle any thrift DDL point of view, we should probably fix this as thrift allows it.  but, as Ashish points out, we may not need to expose it.
, incidentally, this is the offending code:

{code}
--- src/contrib/hive/serde/src/java/org/apache/hadoop/hive/serde2/dynamic_type/thrift_grammar.jjt       (revision 132500)
+++ src/contrib/hive/serde/src/java/org/apache/hadoop/hive/serde2/dynamic_type/thrift_grammar.jjt       (working copy)
@@ -163,7 +163,7 @@
 |
 <tok_double_constant:   ["+","-"](<DIGIT>)*"."(<DIGIT>)+(["e","E"](["+","-"])?(<DIGIT>)+)?>
 |
-<IDENTIFIER: <LETTER>(<LETTER>|<DIGIT>|"."|"_")*>
+<IDENTIFIER: (<LETTER>|<DIGIT>|"."|"_")*>
 |
 <#LETTER: (["a"-"z", "A"-"Z" ]) >
 |

{code}, This is the change I put in a previous comment + changing one of the test cases to name a variable _hello. everything else is generated code.
, ant test passes.
, +1

looks good. I also made sure that the failing test in service passes with this fix., It seems that these rules only allow identifier to start with a letter or an _ while Hive.g also allows Digits. Can we change it to allow identifiers that start with digit as well., new patch also allows ids to start with a digit
, +1

 Looks good.

(Though Raghu pointed out that most SQL dialects have identifiers starting with non numeric) - but we should be fine with this., Allowing identifiers starting with number will introduce ambiguity to the language if later we allow 1e10 to be a number.

I think the old patch that does not allow numbers is better. What do you think?
, agreed but then we should open another JIRA to change Hive.g, no?, Ashish: Hive.g allows Letter/Digit but not '_'. Is that what we want? Let's decide what we want here (so we know which patch to take). We can change Hive.g in another jira if needed.

Identifier
    :
    (Letter | Digit) (Letter | Digit | '_')*
    | '`' (Letter | Digit) (Letter | Digit | '_')* '`'
    ;

, Lets do that in a separate JIRA.
, Committed revision 724555.
HIVE-93.txt 2008-12-02 03:14 PM Pete Wyckoff 33 kb , HIVE-93. Dynamic serde to handle _-prefixed column names in DDL. (Pete Wyckoff through zshao)]