[[~hagleitn] & [~vikram.dixit], could you comment? I am trying to get the big picture to determine what the right fix should be. Thanks., [~pala] can you let us know what is the scenario here? Do you mean to say that you have a single hs2 session that multiple queries are concurrently being fired to? How are you doing that? Does this work in mapreduce? Any light on this matter would be useful for identifying the issue., Yes, single HS2 session that receive multiple queries. I can do that by using the Cloudera Hue UI for Hadoop. Basically i open multiple tabs after logging in -  and submit queries concurrently. Internally, it submits the queries to HS2 thrift interface using the same session id header/cookie, and HS2 uses the same session state for both queries, and hit this issue.

Yes this works in mapreduce. Each query, despite being in the same HS2 session, are submitted as different MR application to YARN naturally, because there is no notion of application reuse for MR. For Tez, on the other hand, a Tez application is tied to HS2 session and an attempt to reuse the Tez application is done (and fails in this case)., [~vikram.dixit], [~pala] I see how this can happen now. In tez only one DAG is allowed to run at a time. MR subverts this issue by just launching multiple jobs when such a parallel submission is done. However, this change is not easy to do in case of tez right now and we need to have a design to support concurrency at this level. I am exploring some options with the tez folks and will get back to you on this., [~vikram.dixit], did anything come out of this?, Queries within the same session should execute serially. Hue should open a new session when you use a new tab. Each tab can be considered a script where queries run sequentially. Otherwise how can I guarantee that a query creating a temporary table and the one following it that reads the temporary table are processed in order? Are we depending on UI tabs for that? The previous MR behavior seems to be a bug., Hi,

Is there any progress on this one? Or at least some plans when this could be solved?

Thanks!, [~pala] hi, any progress or workaround on this issue? I'm facing exactly the same scenario as described here.]