[Implementation of schema DB version check., cc [~prasadm], [~brett_s_r] The hive.metastore.schema.verification is false by default. If you set it to true, then you need to create the schema using the metastore schema script or [schema tool|https://cwiki.apache.org/confluence/display/Hive/Hive+Schema+Tool]. The very purpose of the schema consistency check is to avoid accidental corruption of the metastore schema.
, Thanks Prasad your comments.

I notice now that in {{hive-default.xml.template}} for 0.12, {{hive.metastore.schema.verification}} equals {{true}} (this is the config I copied, and how I arrived at this problem), whereas for trunk it has been added as default {{false}}.  The {{<description>}} however is incorrect for trunk, is still claims:

{quote}
True: Verify that version information stored in metastore matches with one from Hive jars.  Also disable automatic
schema migration attempt. Users are required to manully migrate schema after Hive upgrade which ensures
proper metastore schema migration. (Default)
{quote}

... that True is Default.

Is that intentional?  For 0.12 installations (only) that happen to deploy the default config, the metastore schema version will be checked, but for 0.13 and onwards if you deploy the default config, you need to explicitly enable the check?

I don't see how when creating a first-time/default/Derby metastore database, it can be considered incompatible with the current runtime version which is creating it.  We can't corrupt a metastore which doesn't exits.  So it feels like a bug to me, but I agree that the severity is less now that the property is default {{false}} on trunk.  That said, I do wonder how many folks will benefit from the new version-check enhancement, if they copy the default config - next time they upgrade the check likely won't be active., ah ok, The code default is false and the hive-default.xml.template setting on trunk is also false. Looks this change didn't make it to 0.12
You don't need to explicitly enable this check for normal hive functionality. This is an optional feature to safeguard metastore consistency.

Hive wouldn't know if you are accessing/creating the metastore for first time or using an existing older metastore. The dataNucleus ORM layer and Derby's autocreate database makes it transparent to Hive. Hence with schema.verification setting Hive turns off dataNuclues's settings to automatically create/alter the underlying tables and compares the version stored in the metastore DB with the expected version in the code. The schema upgrade could be complex and might involve updating data as well as schema (eg Hive 0.7 to 0.8). In such cases the auto upgrade would end up with corrupt/inconsistent metastore.

The check is optional mainly due to the out of box experience as well as testing impact of Hive and other downstream products. Please feel free to log a ticket to make it true by default.
, Thanks.  I think I'll make sure that I have this setting set to false, then ignore it for now.  Please resolve this issue if you consider it invalid in the context of the setting now defaulting to false on trunk., Doc issues:  *hive.metastore.schema.verification* needs to be changed in HiveConf.java to remove (Default) at the end of the description for True -- this error was in the description from the start in Hive 0.12.0, although the actual default setting was always false.

In the wiki, the description is correct in Configuration Properties but incorrect in the Metastore Admin doc (compare Hive Schema Tool's first section).  Both sections need revision to clarify which Hive property settings implicitly create or alter the existing schema.

* [Configuration Properties -- hive.metastore.schema.verification | https://cwiki.apache.org/confluence/display/Hive/Configuration+Properties#ConfigurationProperties-hive.metastore.schema.verification]
* [Metastore Administration -- Metastore Schema Consistency and Upgrades | https://cwiki.apache.org/confluence/display/Hive/AdminManual+MetastoreAdmin#AdminManualMetastoreAdmin-MetastoreSchemaConsistencyandUpgrades]
* [Hive Schema Tool -- Metastore Schema Verification | https://cwiki.apache.org/confluence/display/Hive/Hive+Schema+Tool#HiveSchemaTool-MetastoreSchemaVerification]

Can someone help with this?]