[Hi [~vgarg] Do these test work for you locally?, In order to increase the timeout value I will have to update the ptest server. Once you merge the patch in master branch I can update the ptestServer. I will need a restart of Ptest server though. I may affect a few patches (not the whole queue but a few patches) which are in the ptest queue., [~vihangk1] I haven't tried running these locally yet. I assumed it will time out for me locally since my system doesn't have the same parallelism or resources as jenkin server.
Let me know if I should first try running these tests locally, if not I can push the patch to master., Atleast in case of {{TestDbNotificationListener}} it should not time-out. Its a very light weight test if I remember correctly. Running them locally just to rule out if they are not really hanging would be good., This batch seems to run together. 

 

2018-05-11 20:30:43,169 DEBUG [TestExecutor] ExecutionPhase.execute:96 PBatch: UnitTestBatch [name=247_UTBatch_itests__hcatalog-unit_6_tests, id=247, moduleName=itests/hcatalog-unit, batchSize=6, isParallel=true, testList=[TestPigHBaseStorageHandler, TestHCatClientNotification, TestHCatHiveThriftCompatibility, TestSequenceFileReadWrite, TestHCatHiveCompatibility, TestDbNotificationListener]]

 

Can you try running them together is they really timeout? It may be the case of one of these tests is long running for some reason., In case of TestNonCatCallsWithCatalog it runs in this batch.

UnitTestBatch [name=217_UTBatch_standalone-metastore_20_tests, id=217, moduleName=standalone-metastore, batchSize=20, isParallel=true, testList=[TestMetastoreSchemaTool, TestNonCatCallsWithCatalog, TestMetaStoreSchemaFactory, TestRetryingHMSHandler, TestAdminUser, TestJSONMessageDeserializer, TestCatalogNonDefaultSvr, TestObjectStoreInitRetry, TestMetaStoreUtils, TestHdfsUtils, TestHiveMetaStoreSchemaMethods, TestOldSchema, TestCachedStore, TestCatalogCaching, TestDeadline, TestMetaStoreListenersError, TestMetaStoreEventListenerOnlyOnCommit, TestMetaStoreSchemaInfo, TestMarkPartition, TestMetaStoreInitListener]], Thanks for the suggest [~vihangk1]. Running locally helped me figure out the culprit test (TestSequenceFileReadWrite). I have uploaded a patch disabling it. Lets see what modules are still timing out., Cool .. Junit provides {{@Ignore}} annotation which can also take in some documentation. So may be using {{@Ignore("Disabling this test. Check HIVE-19506 for more details")}} would be better to keep track in the future instead of commenting the {{@Test}} annotation., [~vihangk1] Thanks for suggestion. I uploaded a new patch with @Ignore. Can you look into it and do +1 if you think this is ok? Getting this in master should speed up ptests and help clearing up the queue., +1 btw, you don't need to comment the {{@Ignore}} annotation. Please feel free to merge the patch., [~vgarg], I think we do not need to wait for ptest run to merge this one since the tests are just timing out.

I believe {{TestNegativeCliDriver}} may have another test timing out, but you can commit in different batches and just add the commit IDs to this issue to speed up the resolution., Pushed this to master., Found negative tests which are causing time out (HIVE-19516), This jira is resolved and released with Hive 3.0 If you find an issue with it, please create a new jira.]