[Assigning component., A first attempt at a patch for this issue. Please review and point me in the right direction. Since I haven't worked much with Hive I'm having trouble seeing how the different components work together. It seems like there are two places where the data in a dropped table can be deleted, once in RWTable.java and one in HiveMetaStoreClient.java. Any reason for this duplication?
What role does the different *Store objects in the metastore java dir have?

This patch does not make sure that a partition drop doesn't delete the original data. Shall I open up a new issue for that?, thx! Patch looks pretty good.

Couple of concerns:
- i think we can just have one version of the isExternal command. The ql/.../Table.java has a metastore.api.Table object - and we can have an isExternal definition over that which can be shared in both places.
- other concern is that the isExternal setting is being checked by the client side code. it seems to me that the server side should be enforcing this setting (otherwise any thrift client can come and delete data based on the thrift api regardless of the external setting). So we should (as a safety measure) be enforcing this check in HiveMetaStore.java:drop_table as well (regardless of the delete_data setting.)

regarding RWTable versus HiveMetaStoreClient - sorry for all the confusion. The thing is that there are two implementations of the MetaStore available - one db backed which is the new one that we use normally. There is an old one that's file based and RWTable is used by that one (AFAIK)., I've updated the patch to do all the checks server side as suggested, much cleaner.
The reason I didn't override the deleteData boolean in the previous patch is that I thought it might be useful if someone wanted to force delete an external table for whatever reason. It's probably better to be safe then sorry though.
I left in the changes in RWTable, but I assume those file based metastore will be removed eventually? It would help reduce confusion. Perhaps open a ticket for it?, +1. looks good.

Ashish or Zheng - can you please commit this?, Applied the patch. Rerunning the test now. Will commit both internally and in apache., Committed. svn revision 723124., HIVE-86. Drop table should not delete data for external tables.
(Johan Oskarsson through zshao)
]