[The use case is Hive-Pig-Hive.
HCatLoader automatically sets hcat.data.tiny.small.int.promotion=true as that is required by Pig. HCatStorer did the opposite for no good reason. Since Pig doesn't evaluate each statement separately, the Storer action clobbered Loader action (the context that contains the configuration is shared). I changed Storer not to do that., 

{color:red}Overall{color}: -1 at least one tests failed

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12636106/HIVE-6724.patch

{color:red}ERROR:{color} -1 due to 1 failed/errored test(s), 5444 tests executed
*Failed tests:*
{noformat}
org.apache.hadoop.hive.cli.TestMinimrCliDriver.testCliDriver_bucketmapjoin6
{noformat}

Test results: http://bigtop01.cloudera.org:8080/job/PreCommit-HIVE-Build/1940/testReport
Console output: http://bigtop01.cloudera.org:8080/job/PreCommit-HIVE-Build/1940/console

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
Tests exited with: TestsFailedException: 1 tests failed
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12636106, the patch is HCatalog only chang - the error above is not related., +1, HCatStorer should definitely not be force-setting the promotions to false, that changes behaviour in cases where it was previously set to true. This is especially a problem since HCatContext winds up being shared across a pig job, and will affect further read attempts., Committed to trunk. Thanks, Eugene.

Also, re-setting fix version as 0.14, as fix version tracks the version the patch has already been committed to. [~rhbutani] will be the one to backport to 0.13 after he's satisfied with it, and he can set it to 0.13., Spoke to [~rhbutani], he's okay with me committing to 0.13 as well, will do so, and mark the fix version to 0.13 once that happens., Committed to 0.13 as well. Thanks, Eugene!, This has been fixed in 0.14 release. Please open new jira if you see any issues.
]