[The app logs appear to be for the AMs.
Can you download the full application logs for Tez or MR apps? (via yarn logs ... command).
If they don't have anything for the problematic container (e.g. containerId=container_1475850791417_0105_01_000002, nodeId=datanode06.bigdata.fr:60737), it might be possible to go the node and try to find container log directory to see its output, Hi [~sershe],
The "yarn logs" command doesn't return the logs as you can see below.
{noformat}
[root@namenode01 ~]# yarn logs -applicationId application_1475850791417_0105
/Products/YARN/logs/hdfs/logs/application_1475850791417_0105 does not exist.
Log aggregation has not completed or is not enabled.
{noformat}
So I decided to dig into the logs manually. I found interesting things on both datanode05 and datanode06. The error "255" appears regularly, I think this is the cause of the container crash.

I uploaded the relevant part of the logs., Looks like some setup issue... can you enable debug logging to see this line: 
{noformat}
LOG.debug("initApplication: " + Arrays.toString(commandArray));
{noformat}
Is HADOOP_YARN_HOME set for the container?
Is yarn.nodemanager.linux-container-executor.path set to something non-default?
Otherwise, is there a file under Yarn home called bin/container-executor?, Which logs do you need in DEBUG mode? (Hadoop, Hive)
I added the hive-site.xml to help.
The HADOOP_YARN_HOME env variable is properly set on every datanode. I checked.
There is no "yarn.nodemanager.linux-container-executor.path" property set on any of Hadoop configuration files. The default value must be used.
Yes, bin/container-executor is under Yarn home. Is that wrong?, HADOOP logs. No, container-executor should be there, that is correct. This is what is (presumably) executed by the command that fails, assuming HADOOP_YARN_HOME is set and yarn.nodemanager.linux-container-executor.path doesn't override it - so, I wanted to double-check that the file is there., I added DEBUG container logs. 

I don't see a line equal to:
{noformat}
LOG.debug("initApplication: " + Arrays.toString(commandArray));
{noformat}, Nothing new here?]