[Need to do the following after applying the patch:

1. ant package in trunk (couldnt get rid of this step)
2. ant model-jar in metastore directory
3. ant gen-test in ql directory
4. ant eclipse-files in trunk (in addition to classpath, project, settings this cmd also generates two launch configurations in trunk)

Then, in eclipse, file->import->General->Existing Projects Into Workspace->Select root directory (point to trunk)

This should import the project and the launch configurations. You can look for launch configurations by checking:
Run->Run Configurations->JUnit. There should be two configurations TestCliDriver, and TestHive (metastore tests).

Then, you should be able to run all the unit tests by Run->Run.

I had to remove a whole bunch of extraneous @Overrides because  eclipse complained about them for me. These overrides were extraneous since they were specified for methods in classes which were just implementing interfaces and not really extending classes which had those same methods., patch available, One more thing. All the unit tests for TestCliDriver are not passing - 7 failures out of 128 tests. Some are because TestSerde.jar is not in the path - I am trying to fix that. Others because the tests dont clean up after themselves - example input16.q fails saying table input16 already exists., The patch seems to delete the contents of

eclipse-templates/.externalToolBuilders/Hive_Ant_Builder.launch

Can you check that?, fixed patch to not change Hive_Ant_Builder.launch. But we wont be using this builder for hadoop-17. We will be using the java builder for hadoop 17. This will allow us to step through code. So, for each of the ant commands above use -Dhadoop.version="0.17.2.1" option to pull in hadoop-17.



, .classpath
classpathentry excluding="test/|test/|java/|gen-java/|test/" kind="src" path="serde/src"/>
--> what is this excluding for?

Users can create launch configurations for other tests by changing the class name in the following line in .launch files
<stringAttribute key="org.eclipse.jdt.launching.MAIN_TYPE" value="org.apache.hadoop.hive.ql.metadata.TestHive"/>

@Override is not an issue for default eclipse configuration. I think your changed your configuration which is causing the @Override warnings. I think you removed comment for getDatabases() function along with the @override

why is ant package is needed when gen-test depends on test-init as well? , @overrides caused errors - not warnings. That's the reason I had to get rid of them. I didnt change any eclipse configuration (I have eclipse 3.4.1).

the classpathentry existed earlier. I am not sure what it does. Should probably remove it.

I could not get rid of ant package since there was no way for me to directly call ant install-hadoopcore in trunk/build.xml. That would require us to refactor build-common.xml and other */build.xml files which is a bigger change.

Will add the comment back to getDatabases., I was able to import the project using this patch (this is very useful), however I got the following errors:

1. There is a duplicate entry for serde/src/gen-java in the .classpath files - this gives a build error in eclipse
2. The build is looking for hadoopcore/hadoop-0.17.2.1 - in the checked in files we should probably have this as 0.19. (I was able to get rid of the build issues once I did ant package -Dhadoop.version="0.17.2.1"

I think without fixing 1 this will not build in eclipse.

Also for the hadoop version, we can potentially do the following in the .classpath file so that it brings in the correct version.

Using 

@HADOOPVER@ in .classpath similar to how we use @PROJECT@ in .project

and then add the following in <root>/build.xml

<filter token="HADOOPVER" value="${hadoop.version}"/>

after the token for PROJECT

I do see the test configurations... This looks great..

However, when I try to run say the TestCliDriver configuration it seems to give me an error 

"Input type of the launch configuration does not exist".

Also while running TestHive I get the following:

"The archive: /hive_local_ws3/build/metastore/metastore_model.jar which is referenced by the classpath, does not exist."

even though the jar is there (I checked it).
, For the issues with test launch configurations, you might need to refresh the project or restart eclipse. these problems might go away., 1. fixed duplicate serde entries
2. using hadoop.version in the classpath - defaults to 0.19.

And as prasad mentioned, try either refreshing the project or just restarting eclipse to get the launch configurations to work.

Note that its currently not possible  to get eclipse to run junit tests for anything other than hadoop-17 because of the deprecated validateInput call. We should try and make it such only hadoop-17 would require code preprocessing and later hadoop versions work without preprocessing., something is wrong with the new patch. It seems to be missing a bunch of things frrom the previous patch., Missed including the @Override fixes. Replaced the patch with the fixed patch., I am still getting the following error:

Description	Resource	Path	Location	Type
Project 'hive_local_ws3' is missing required source folder: 'jdbc/src/java'	hive_local_ws3		Build path	Build Path Problem
Project 'hive_local_ws3' is missing required source folder: 'jdbc/src/test'	hive_local_ws3		Build path	Build Path Problem
The project cannot be built until build path errors are resolved	hive_local_ws3		Unknown	Java Problem
, Now that hive-48 has been committed, can you update your tree and try the same patch again?, Now it does not show me the two launch configurations. They seem to be missing from the patch., more git grief. uploaded new patch, +1

Works for me now.
, I just committed this. Thanks Raghu.]