[Use registry to identify if rule has been fired before., [~ashutoshc] The new Join node needs to be registered as opposed to the old one.
, Nice, let me see if I include this into testing., [~jpullokkaran] suggested to do costing within the rule which makes sense, since this makes sure that rule mutates the plan only when it needs to, making it robust against the Planner idiosyncrasies. , [~ashutoshc], what happens if you discard a transformation because locally it has a bigger cost, but it could lead to a better plan after applying more transformations? It seems wrong that the decision is taken by the rule; instead it should be taken by the planner. What do you think?, Yup, currently we have kept this rule isolated from other rules, since we didn't want to have plan space grow for Hep Planner since it has scalability issue. This patch doesn't change that. Both before and after this patch, we are making a cost based decision for before and after applying this particular transformation. It is just shifting logic from HepPlanner::applyTransformationResults() to within the rule to avoid HePlanner::applyRules() go in infinite loop. When we test out HepPlanner scalability properly we can enable this rule to be fired in rule collections so that we can give a globally optimal plan., [~ashutoshc], makes sense, +1

Do you think I should close HIVE-12508 as duplicate, or do those changes make still sense to avoid the call to {{areColumnsUnique}} till we fix CALCITE-794?, I am not sure of impact of CALCITE-794 [~gopalv] may test this patch out to see if he still sees that issue. If it still is the issue than we may need HIVE-12508 in addition to this patch. We can keep that open as we test this more., 

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12773990/HIVE-12503.1.patch

{color:green}SUCCESS:{color} +1 due to 1 test(s) being added or modified.

{color:red}ERROR:{color} -1 due to 3 failed/errored test(s), 9864 tests executed
*Failed tests:*
{noformat}
TestHWISessionManager - did not produce a TEST-*.xml file
org.apache.hadoop.hive.cli.TestNegativeCliDriver.testNegativeCliDriver_authorization_uri_import
org.apache.hive.jdbc.TestSSL.testSSLVersion
{noformat}

Test results: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/6130/testReport
Console output: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/6130/console
Test logs: http://ec2-174-129-184-35.compute-1.amazonaws.com/logs/PreCommit-HIVE-TRUNK-Build-6130/

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.TestCheckPhase
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
Tests exited with: TestsFailedException: 3 tests failed
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12773990 - PreCommit-HIVE-TRUNK-Build, Pushed to master.]