[The .gitignore files were added in HIVE-1188 in order to resolve a test NPE that occurs when using Git., A minor correction on the description. The related HIVE JIRA is HIVE-1464 rather than HIVE-1463. The last comment is copied as follows:

8<---------------------------------
i think i found why it's happening.
these lines in build-common.xml:

<copy todir="${test.data.dir}">
<fileset dir="${test.src.data.dir}">
<exclude name="**/.svn"/>
</fileset>
</copy>

are copying .gitignore to test/data/warehouse/src

it remains there after this. the reason this is happening now is that 'cleanup()' happens via metadata commands - and there are no tables in metadata at the beginning of the test. so nothing gets deleted. then a whole bunch of 'load data' commands are executed - which also don't delete old stuff.

after this - earlier each test would call cleanup() again - which would delete the entire directory. but now this is not done anymore. so the .gitignore stays there.

lots of ways of fixing this - but this whole data/warehouse dir and then copying it recursively is totally unnecessary i think. i will file a separate jira.
, I think copying ${test.src.data.dir} to ${test.data.dir} is not necessary. The only use may be to create the target directory test/data/warehouse? 

For now, should we just exclude the .gitignore file in addition to .svn? The test/data/warehouse/* will be removed after the test finished. So it won't affect git I think. 
, - get rid of data/warehouse - totally unnecessary
- get rid of recursive copy of data/ into test/data - again unnecessary
- convert references to test/data/conf into data/conf

in addition:
- i removed a whole bunch of 'DROP TABLE' statements from the clientpositive and clientnegative queries. these are not required anymore given that the test harness cleans out test side effects
- output changes because of the above.

between this and 1464 - i think the total test time has gone down by 30 min or so if not more. still too much, but some improvement .., Great! I'll take a look., The test on -Dhadoop.version=0.20.0 failed. Partituclarly TestHBaseCliDriver and TestHBaseMinimrCliDriver failed. Can you take a look?, taking a look., looks like the hbase tests also failed because of 1464 (or something since then) - they fail against trunk., there was a bug in the 1464 patch (something that i had intended to take out but forgot). this fixes things:

> --- ql/src/test/org/apache/hadoop/hive/ql/QTestUtil.java  (revision 966856)
> +++ ql/src/test/org/apache/hadoop/hive/ql/QTestUtil.java  (working copy)
> @@ -528,7 +528,7 @@
>        createSources();
>      }
>  
> -    CliSessionState ss = new CliSessionState(new HiveConf(Driver.class));
> +    CliSessionState ss = new CliSessionState(conf);
>      assert ss != null;
>      ss.in = System.in;
>  

i haven't run the full tests - but the hbase-handler tests do pass., I'm testing it right now., Committed. Thanks Joydeep!, thanks for reviewing/committing and sorry for all the trouble.]