[Attaching task log., Per my testing, this is actually working currently. From code-reading, I was initially convinced there was a bug, but it does seem to properly initialize hbase delegation tokens for read and write jobs, from hive and hcatalog, but it currently works for me.

I ran the following:
To create the table:
{noformat}
CREATE TABLE sushhbdata(rowkey STRING, pageviews STRING, bytes STRING);

LOAD DATA LOCAL INPATH 'sushhbdata' INTO TABLE sushhbdata;

CREATE TABLE IF NOT EXISTS sushpagecounts_hbase (rowkey STRING, pageviews STRING, bytes STRING)
STORED BY 'org.apache.hadoop.hive.hbase.HBaseStorageHandler'
WITH SERDEPROPERTIES ('hbase.columns.mapping' = ':key,f:c1,f:c2')
TBLPROPERTIES ('hbase.table.name' = 'sushpagecounts');
{noformat}

To insert data into the table:
{noformat}
set hive.execution.engine=mr;

FROM sushhbdata INSERT INTO TABLE sushpagecounts_hbase SELECT * where rowkey like 'EN%';
{noformat}

For the actual data, I just randomly generated strings of varying length in all caps, there were quite a few that began with "EN".

(Note that I set the execution engine to mr because there is another unrelated tez issue that blocks it currently if you don't set it,  and I think Gunther or Sergei are trying to fix that. And I don't need aux jars either for our current hive commandline.)

I have a patch I'd suggest up for this anyway to make life a little easier for those who read this section of code in the future.

Could you please verify?, I'm not sure I understand the enhancement of flipping the input/output logic, but the comment helps clarify things a bit. Will take this for a spin in a few., This works, +1. Thanks for digging in., Thanks!

The reason I flipped the input/output logic was because hive executes the input part "always". HCat will execute input if input and output if output. For HCat, thus, it makes no difference whether we check for input or output. For hive, it has no concept of input and output, and thus executes a "default", which is the same as input, so it felt like it was a bit cleaner to treat output as a special case which defaulted to false, rather than to treat input as a selector that defaulted to true. I'm still not completely happy about it, to be honest., +1, I'm canceling this patch because I feel there is still more code cleanup requried here to make things more obvious, and code cleanup is now the point of this patch, since the original reported issue is working without this patch. HIVE-6915 fixes adding delegation token for Tez, and in doing so, opens up questions on whether how it's done currently is working because it happens-to-work, or because that's the way it's supposed to, and I'm leaning towards the former., Closing as "Not a problem" without any commits, since the reworking is eventually unnecessary - and all this adds is really comments, and the tez-side issues are solved elsewhere.]