[Both DDL statements in the description work fine in Beeline in Hive 0.13 and earlier., Since Hive 0.14, Beeline supports multiple commands separated by ";" in a single line passed in via -f or -e, which break the case with ";" in sql query. 
This JIRA is to provide an escape "\" to the ";' in query, so that it will behave same as CLI., Since the ";" is being used to delimit commands in a single line in Beeline, it should be able to be escaped when it is not used as a delimiter. This patch provides "\" as the escape to it like that in CLI., Patch was uploaded to https://reviews.apache.org/r/35907/ and requested for review. Thanks in advance., For unknown reason, the precommit test did not run. Reattach the patch to kick off the build., Can we find out how CLI is escaping? I feel a little uncomfortable the way we are processing multiple command lines using split by ";" and then manually fixing the escaping problem. Ideally, we should add a grammar that can handle this., 

{color:green}Overall{color}: +1 all checks pass

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12742137/HIVE-11100.patch

{color:green}SUCCESS:{color} +1 9032 tests passed

Test results: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/4399/testReport
Console output: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/4399/console
Test logs: http://ec2-174-129-184-35.compute-1.amazonaws.com/logs/PreCommit-HIVE-TRUNK-Build-4399/

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12742137 - PreCommit-HIVE-TRUNK-Build, [~xuefuz] CLI uses ";" to terminate a command, or delimit multiple commands in a single line. If ";" is used in a query, it has to be escaped with "\". 
Beeline uses ";" to terminate a command, HIVE-9877 enhanced Beeline to support multiple commands separated by ";" in a single line, this JIRA adds the support that ";" in a query could be escaped by "\".
So both JIRAs are trying to make Beeline more compatible to CLI in term of the use of ";". Actually their implementations are also similar., Okay. +1, Committed to master and branch-1. Thanks, Chaoyu., Hey [~ctang.ma] [~xuefuz], wondering if you realized that this is backward compatible for connect strings that involve semicolon, for example connecting to security or dynamic service discovery?

eg, beeline -u 'jdbc:hive2://localhost:10000/default;principal=hive/host@realm'
beeline -u "jdbc:hive2://localhost:2181/\;serviceDiscoveryMode=zooKeeper\;zooKeeperNamespace=hiveserver2", When I forgot to escape the semi-colon, there was an unhelpful NPE on Beeline startup., What makes ';' start appearing in the connection string and did that happen before this one? Since ';' is reserved for query terminator, it seems reasonable to require escaping it all the time., Yea see my examples, dynamic service discovery, kerberos.  

I think requiring in connect string will break backward compatibility with other tools, for example oozie, not to mention some user scripts.

I think escaping in regular queries is fine, but for the ! commands it may make less sense, what do you think?, yes, maybe for the !command, ";" should not be interpreted as a terminator, so it is not needed for escaped. But how these !commands are used with -e and -f?, So basically beeline -u 'jdbcstring' somehow translates to running !connect 'jdbcstring', that's what I saw., Does this need to be documented in the wiki?  (If so, please add a TODOC1.3 label.), I think that it is most likely a regression from recent HIVE-11640., The fix to the issue has been provided in HIVE-12259. 
[~leftylev], since HIVE-11640 was only committed to 2.0.0 dev branch, we do not need to document the issue for other branches. Thanks, Okay, thanks [~ctang.ma].]