[Franklin, can you create a review request? That's much easier to comment. Two comments here: 

 1) in dynamic partition inserts, a subquery corresponding to a partition is created only if there is a row that should be inserted into that partition, which means the directory should not be empty. If the directory is empty, most likely there is a bug there and we should fix that bug instead. 
 2) the function Utilities.getFileStatusRecurse() is quite expensive. We should avoid using it and use cached results (it's called somewhere else before). , refactor to use one call to Utilities.getFileStatusRecurse(), 
-----------------------------------------------------------
This is an automatically generated e-mail. To reply, visit:
https://reviews.apache.org/r/1442/
-----------------------------------------------------------

Review request for hive, Ning Zhang and Siying Dong.


Summary
-------

There are some conditions under which partition descriptions are created in memory and committed to the metastore despite there being no intermediate or final finals in that directory (due to dynamic partitioning).
In this change, a check is done to only call loadPartitions that have files in them.


This addresses bug HIVE-2360.
    https://issues.apache.org/jira/browse/HIVE-2360


Diffs
-----

  trunk/ql/src/java/org/apache/hadoop/hive/ql/metadata/Hive.java 1155968 

Diff: https://reviews.apache.org/r/1442/diff


Testing
-------

Unit tests pass


Thanks,

Franklin

, Franklin finished his internship and left. We should find another one to finish the task., The patch (https://issues.apache.org/jira/secure/attachment/12489913/hive-2360.2.patch) passes all the unit tests., Integrated in Hive-trunk-h0.21 #1035 (See [https://builds.apache.org/job/Hive-trunk-h0.21/1035/])
    HIVE-2360 create dynamic partition if and only if intermediate source has files (Franklin Hu, Kaushik Lakshminarayanan via Siying Dong)

sdong : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1188989
Files : 
* /hive/trunk/ql/src/java/org/apache/hadoop/hive/ql/metadata/Hive.java
]