[In the dumping files attached, *-1-* and *-2-* means PST and non-PST timezone, respectively., Since ZLIB mode is platform dependent, it'd better to switch to platform independent one like SNAPPY., Made a patch to be reviewed., [~leftylev] can you document this to let users know ZLIB mode is not portable? Thanks!, Can anyone do a quick review? Thanks many!, When you say not portable, do you mean that an ORC file with zlib compression created on Linux cannot be read correctly on Windows? Or is the data readable between platforms, just that the size of the files is different when created on Linux vs Windows?, Its not a good idea to change the default encoding just for file size change., The wiki has a few places this could be mentioned:

* [ORC -- Compression | https://cwiki.apache.org/confluence/display/Hive/LanguageManual+ORC#LanguageManualORC-Compression]
* orc.compress table property in [ORC -- HiveQLSyntax | https://cwiki.apache.org/confluence/display/Hive/LanguageManual+ORC#LanguageManualORC-HiveQLSyntax]
* [hive.exec.orc.default.compress in Configuration Properties | https://cwiki.apache.org/confluence/display/Hive/Configuration+Properties#ConfigurationProperties-hive.exec.orc.default.compress]
* no ORC discussion, just Gzip & Bzip2 for TextFile (doc needs updating):  [Compressed Data Storage | https://cwiki.apache.org/confluence/display/Hive/CompressedStorage], Zlib uses the java.util.zip.* libraries (not the libhadoop.so implementation).

If you are suggesting that the JDK internals do not match between Linux & Windows - can you file an  OpenJDK bug for this?, [~xiaobingo], if you want me to do the documentation then I'll need a clearer description of what should be documented.  "ZLIB mode is not portable" doesn't seem adequate, but the other snippets of information in these comments leave me slightly confused.

For starters, which platforms _does_ ZLIB work on?  (Even before that, I'd like a complete list of platforms that Hive runs on for the Getting Started wikidoc -- see HIVE-7444.), bq. For starters, which platforms does ZLIB work on?

All platforms supported by OpenJDK 1.6 and later - we use [java.util.zip.Deflater|http://docs.oracle.com/javase/6/docs/api/java/util/zip/Deflater.html]

JDK implementation guarantees {{RFC 1950/1951}} compatibility across all platforms., Thanks all for comments. After deep investigation, ZLIB mode actually works fine for both platform if qtest output is exact same on both. There are other reasons led to output diff, which will be tracked by other JIRA. I'd mark this as invalid., _Just to be sure:_  So no documentation is needed?, Thanks [~leftylev], no docs need to be addressed.]