[Something seems weird here - looking at the code, it looks like the current code, where it simply casts to Date should be the right way to do this, since it should have called .getPrimitiveJavaObject() on the PrimitiveObjectInspector to get this object, and DateObjectInspector.getPrimitiveJavaObject() should have returned a Date. However, clearly, from your stack trace, you're getting a string. I'll dig into this and update as I find more., What storage format are you using for the table in question? (i.e. is it Text, RCFile, ORC, something else?), ORC, I'm currently unable to reproduce this issue on hive-1.2 and pig-0.14.0, where I get the following:
In hive:
{noformat}

hive> create table tdate(a string, b date) stored as orc;
OK
Time taken: 0.151 seconds
hive> create table tsource(a string, b string) stored as orc;
OK
Time taken: 0.057 seconds
hive> insert into table tsource values ("abc", "2015-02-28");
...
OK
Time taken: 19.875 seconds
hive> select * from tsource;
OK
abc	2015-02-28
Time taken: 0.143 seconds, Fetched: 1 row(s)
hive> select a, cast(b as date) from tsource;
OK
abc	2015-02-28
Time taken: 0.092 seconds, Fetched: 1 row(s)
hive> insert into table tdate select a, cast(b as date) from tsource;
...
OK
Time taken: 20.672 seconds
hive> select * from tdate;
OK
abc	2015-02-28
Time taken: 0.051 seconds, Fetched: 1 row(s)
hive> describe tdate;
OK
a                   	string              	                    
b                   	date                	                    
Time taken: 0.293 seconds, Fetched: 2 row(s)
{noformat}

In pig:
{noformat}
grunt> A = load 'tdate' using org.apache.hive.hcatalog.pig.HCatLoader(); 
grunt> describe A;   
2015-07-22 15:42:26,367 [main] INFO  org.apache.hadoop.conf.Configuration.deprecation - fs.default.name is deprecated. Instead, use fs.defaultFS
A: {a: chararray,b: datetime}
grunt> dump A;
...
(abc,2015-02-28T00:00:00.000-08:00)
grunt>
{noformat}

, Also, unit tests exist since the introduction of DATE capability that have tested date interop between hive and pig through HCatalog, and that still succeeds for me when I try running them on hive 0.13.1.

Could you please show me what hive commands and pig commands you're running to recreate this issue?, I no longer have access to the system where this was an issue. This was about 9 months ago and we ended up working around it by just using Strings.

I don't remember anything more -  sorry I didn't write down instructions to reproduce when I created this., No worries - sorry I didn't try experimenting on this earlier. :)

Hopefully this means that this bug was squished in the meanwhile somewhere between 0.13.1 and 1.2 and does not exist any longer., Actually, after finding a 0.13.1 VM, I'm able to reproduce this. In 1.2, however, I am not. So something changed along the way to fix this. I can dig further to figure out what the problem was that made it not work in 0.13.1.

In addition, this problem exists with both orc and text formats in 0.13.1., On digging further, my issues in the 0.13.1 vm were a different issue from the one reported here, and was related to pig's jodatime being an older library than needed. It was solved by adding a joda-time-2.1.jar to PIG_CLASSPATH, and setting PIG_USER_CLASSPATH_FIRST so that it picked it up first. At this point, I am not able to reproduce this issue with 0.13.1 either.

, Resolving as "Not a problem" as of branch-1.2, since this problem is not reproducible in the newer releases of hive., (Actually, maybe "not a problem" is an incorrect status, since it would indicate that the report is accurate, but working as designed. Reopening to close it again.), Closed as "Cannot reproduce", Removing fix version 1.2.2]