[We found partition pruning would incorrectly prune some partitions the MR job needs by running a sql like below

{noformat} 
select user_id 
from
(
  select 
    cast(key as int) as user_id,
    case when (value like 'aaa%' or value like 'vvv%') 
      then 1 
      else 0 
      end as tag_student
  from src3
) sub
where sub.tag_student > 0;
{noformat}

The patch should fix this problem., PredicatePushDown will push the predicate  sub.tag_student > 0 down following TableScanOperator. When  partition pruning ,  try to iterate all partitions , the filter condition is :
case when (null or null)
then 1
else 0 
> 0
The case when return 0, so all partitions are pruned., Binlijin,
It will be good to also include a test case in the patch for regression purposes., Ashutosh Chauhan, I add a test case in hive-2497.2.patch.
Because I use a version does not have PartitionConditionRemover, having PartitionConditionRemover and not having PartitionConditionRemover the situation is different, so the test case is not the one in above Description., Binlijin,
Is problem reproducible on a)trunk b) 0.8 branch? Is your patch targeted for 0.7 branch?, Ashutosh Chauhan,
the problem is reproducible on trunk, 0.8 branch, 0.7 branch that set hive.optimize.ppd=true;
the patch is for the version that uses PredicatePushDown and PartitionPruner, so 0.7 branch, 0.8 branch, and trunk they all can use the patch., reviewing right now, +1, Committed. Thanks binlijin, Integrated in Hive-trunk-h0.21 #1032 (See [https://builds.apache.org/job/Hive-trunk-h0.21/1032/])
    HIVE-2497 partition pruning prune some right partition under specific conditions
(binlijin via namit)

- begin *PUBLIC* platform impact section -
Bugzilla: #
- end platform impact -

namit : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1188507
Files : 
* /hive/trunk/ql/src/java/org/apache/hadoop/hive/ql/optimizer/ppr/ExprProcFactory.java
* /hive/trunk/ql/src/test/queries/clientpositive/ppr_allchildsarenull.q
* /hive/trunk/ql/src/test/results/clientpositive/ppr_allchildsarenull.q.out
]