[My example is not good enough as we can put all join clauses into sub query and create one alias the the whole joins. This could be a workaround, however, join of multiple sub query may have the described problem., 
you should email the hive-users list for stuff like this instead of creating a JIRA.

SELECT should come before the FROM not after, try this:

{code}
SELECT t1.ip, t1.country
FROM (
SELECT ip, country, count(1) AS total 
FROM eventlog 
WHERE prt_date=20091022 
GROUP BY ip, country
) t1 
JOIN bot_ip t2 
ON t1.ip=t2.ip
WHERE t1.total>0;
{code}
, Dear Awadallah,

I don't mean to be rude, but please be a bit more logical. Hive should complains something about syntax error, if my query had some, rather than throwing a NullPointerException as you can see in my case. There must be a bug in the query parsing process of Hive. And since this stuff is not about query syntax but a bug, I cannot think of any user-mailing list that is better than firing a Jira ticket.

Your suggested query is perfectly correct and is in ANSI form, mine follows Hive-specific syntax thus it's also valid. Except that both will fail because of the same bug. If you have similar environment as I described in the ticket, just try yours and mine and see how Hive behaves.

Anyway, thanks for your quick response.

Nhan, I tried your query (with a little change of using different tables/columns) and it works on trunk. Most probably it is already been fixed in 0.4.1 rc2. Can you try that or trunk?, Dear Zhang,

The query surely works with trunk code as I wrote it when I used Hadoop v0.19.2 with Hive trunk. However, I need to switch to Hadoop 0.20.1 to maximize processing performance but I then couldn't start Hive trunk anymore. Someone suggested that Hive 0.4 works with the new Hadoop, thus I switched both software.

I've also tried 0.4.1rc2 as you suggested but the bug is still there :( 

Btw, If you happen to know how to make Hive code from trunk to work with Hadoop v0.20.1 in multinode cluster, please kindly show me the necessary configuration.

Thanks, Nhan, branch 0.4 is using an old partition pruner which produced a lot of problems.

Hive trunk moved to a new partition pruner so we would prefer our users to migrate to trunk from branch 0.4 if they see such problems. I hope we can cut a 0.5 branch towards the end of Nov.

I've opened HIVE-923 for Hive trunk's compatibility with Hadoop 0.20.1 release.
As described in HIVE-923, Hadoop branch 0.20, or any 0.20 releases after 19/Oct/09 should not have any problems with Hive trunk.

I will fix HIVE-923 right now.
, Dear Zheng,

With the new code from trunk, my problem is now solved. Thanks a lot for fixing this.

Nhan., Hello everybody,
I've met a similar problem.
https://issues.apache.org/jira/browse/HIVE-1922?page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel&focusedCommentId=12985101#action_12985101
Could someone please help me to check if it's a version problem too?

Thanks,, I am out of office on a business trip and will be slower than usual in
responding to emails. If this is urgent then please call my cell phone
(or send an sms), otherwise I will reply to your email when I get
back.

Thanks for your patience,

-- amr
, Thanks, Amr.
I've solved the problem, but I ran into some other alias problems.
I will update it in 1922 later.]