[A suggestion: Search through your ant test output to look for nonzero values of "Failures:" or "Errors:". That will tell you which test class(es) failed. Suppose you find that TestCliDriver failed. Then look at the file TEST-org.apache.hadoop.hive.cli.TestCliDriver.xml to identify which specific test case(s) failed. (I don't remember the exact location of the file, but you can find it somewhere under build.)

Not sure if this is related, but when I ran ant test on trunk on my Mac OS X, 2 test cases failed because they called sed, and OS X's sed behaved differently than Linux's sed. I had to change the test cases a little for them to pass (not committed yet).
, @Steven thanks for the comment. When a build is successful I would it expect it to complete, and then provide a report of which test cases failed. You can then use that to debug each test case individually in eclipse. This is at least the way it works with the Hadoop build. With this Hive build, it appears the actual build is crashing as it never gets to the point where the build completes and it provides the ant build report. I would expect for an official Hive release for the build to at least complete without crashing, even if there are one or two test cases that fail. 

Does your build on OS/X actually complete and you see the build report? i.e.  You are not seeing this failure message?
/home/hive/hive-0.5.0-build/hive-0.5.0-dev/build.xml:151: The following error occurred while executing this line:
/home/hive/hive-0.5.0-build/hive-0.5.0-dev/build.xml:91: The following error occurred while executing this line:
/home/hive/hive-0.5.0-build/hive-0.5.0-dev/build-common.xml:327: Tests failed!, I ran ant package and ant test as 2 separate commands. The former succeeded, the latter failed. The last few output lines of my ant test are:

    [junit] Done query: wrong_distinct2.q
    [junit] Tests run: 31, Failures: 0, Errors: 0, Time elapsed: 340.872 sec
    [junit] Running org.apache.hadoop.hive.ql.tool.TestLineageInfo
    [junit] Tests run: 5, Failures: 0, Errors: 0, Time elapsed: 0.498 sec
    [junit] Running org.apache.hadoop.hive.ql.udf.TestUDFDateAdd
    [junit] Tests run: 2, Failures: 0, Errors: 0, Time elapsed: 0.264 sec
    [junit] Running org.apache.hadoop.hive.ql.udf.TestUDFDateDiff
    [junit] Tests run: 1, Failures: 0, Errors: 0, Time elapsed: 0.214 sec
    [junit] Running org.apache.hadoop.hive.ql.udf.TestUDFDateSub
    [junit] Tests run: 2, Failures: 0, Errors: 0, Time elapsed: 0.147 sec

BUILD FAILED
/Users/swong/dev/svn/asf/hadoop/hive/trunk/build.xml:168: The following error occurred while executing this line:
/Users/swong/dev/svn/asf/hadoop/hive/trunk/build.xml:105: The following error occurred while executing this line:
/Users/swong/dev/svn/asf/hadoop/hive/trunk/build-common.xml:446: Tests failed!

Total time: 190 minutes 53 seconds
, @Steven Many thanks for taking the time to reproduce the error ! I greatly appreciate it.

I ran the ant targets individually and like yourself, the "package" and "tar" targets works just fine for me also. I am also seeing the failure occurring in the "test" target. I did a bit more digging and ran the dependency targets for "test" (clean-test and jar) and they completed successfully as well. This leaves me to believe that the build failure is occurring with the <iterate target="test"/> command below:

  <target name="test"
          depends="clean-test,jar"
          description="Run tests">
    <iterate target="test"/>
    <iterate-cpp target="test"/>
  </target>, @Stephen I just looked at the saved output of my past ant runs. It hardly took any time. :)

Ant test will fail if any test case fails.
, I finally have this working. Apparently, the src tree from the Release TAR is what does not build. i.e. the tarball you get from "Hive Downloads". If you go ahead and do an svn checkout of "http://svn.apache.org/repos/asf/hadoop/hive/tags/release-0.5.0/" it will build. For the record, I was using ANT 1.8.1 and SUN JDK 1.6.14 

I'm going to leave this open as there is still an issue as the Tarball is clearly different to the tagged release.]