[With the patch the string representation are valid json strings. That makes it easy to parse them .
I will create a patch to track converting them into proper jdbc complex types.
, HIVE-4252.2.patch rebased on HIVE-4269, requires that to be applied first. , reviewboard link https://reviews.apache.org/r/10211/, It will be good to check if sql standard provides any guideline for string representation of complex type. Or implementations are free to choose their own. For example I ran a quick test against postgres for arrays and its different than what we do.
{code}
CREATE TABLE sal_emp (
    name            text,
    pay_by_quarter  integer[]
);

INSERT INTO sal_emp
    VALUES ('Bill',
    '{10000, 10000, 10000, 10000}');

SELECT * FROM sal_emp;
 name  |      pay_by_quarter       
-------+---------------------------
 Bill  | {10000,10000,10000,10000}
{code}, Table B-6 "Use of ResultSet getter Methods to Retrieve JDBC Data Types" in jdbc 3(&4) spec shows what datatypes support getString(), and Array and Struct are not one of those. Ie, we have leeway here. There is also not much pattern to be followed here, as we don't have many databases supporting these types (eq mysql and sql server don't).
I think having json strings is useful for being able to parse the strings back to types.

btw, the current jdbc driver implementation returns strings for the complex types, if you do a ResultSetMetadata.getColumnType(int) on column that is actually of hive map/struct/array type, it returns the String type . 
Ideally, we should add support for returning real array and struct types. I am not sure how map type should be handled, maybe json string would remain the workaround.


, I see. If spec doesn't mandate it one way or the other, than sticking to what cli already does is best, since than hive will be consistent. And json format which cli uses is a good format as it makes parsing back and forth easier. 
+1 will commit if tests pass., Committed to trunk. Thanks, Thejas!, Integrated in Hive-trunk-h0.21 #2043 (See [https://builds.apache.org/job/Hive-trunk-h0.21/2043/])
    HIVE-4252 : hiveserver2 string representation of complex types are inconsistent with cli (Thejas Nair via Ashutosh Chauhan) (Revision 1464049)

     Result = FAILURE
hashutosh : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1464049
Files : 
* /hive/trunk/jdbc/src/test/org/apache/hive/jdbc/TestJdbcDriver2.java
* /hive/trunk/service/src/java/org/apache/hive/service/cli/operation/SQLOperation.java
, Integrated in Hive-trunk-hadoop2 #138 (See [https://builds.apache.org/job/Hive-trunk-hadoop2/138/])
    HIVE-4252 : hiveserver2 string representation of complex types are inconsistent with cli (Thejas Nair via Ashutosh Chauhan) (Revision 1464049)

     Result = FAILURE
hashutosh : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1464049
Files : 
* /hive/trunk/jdbc/src/test/org/apache/hive/jdbc/TestJdbcDriver2.java
* /hive/trunk/service/src/java/org/apache/hive/service/cli/operation/SQLOperation.java
]