[This is a script change used to run tests in parallel. , Does {{script_broken_pipe1.q}} pass in parallel mode? I've been looking at HIVE-3084 for a couple hours now and am curious if parallel mode casuses it to complete successfully. It passes when run by itself, but regularly fails as part of the full test suite., It ran fine for me, The tests testDatabaseLocation and testSynchronized are failing for all test classes that extend TestHiveMetaStore when I try to run the script.

I'm running in a Linux environment using the .hive_ptest.conf in the description., https://reviews.facebook.net/D3585
, I added some comments to the review. Thanks., Do the 'parallel' tests still require a shared NFS mount? A while back someone told me I did not need NFS anymore because hadoop 'give me Big Datas'.  Really though this shared NFS mount destroys the utility of this toolkit for me., Right now, the tests does require a shared mount if you want to run on multiple machines.
This is good, if we dont want to compile across all the machines.

Having said that, I am also planning to use it on my machine only, and this should still help to finish the tests in about 1.5 hours.
In that case, I was able to use local disk on my machine.

This can be further optimized. Some of them are:

1. Run the other tests in parallel with TestCliDriver and TestNegativeCliDriver
2. Run the tests that need super-user privilege in parallel with TestCliDriver and TestNegativeCliDriver

Filed https://issues.apache.org/jira/browse/HIVE-3111 for that., https://reviews.facebook.net/D3585, @Carl, I had a question about ant very-clean package.
That takes a very long time (~20 min.) since we are downloading so many jar files.

Won't it be better to not populate hive*jar in ivy in our local builds ?
Then, ant clean package can run much faster.

Or, what is the downside of removing '*hive*.jar' from .ivy2 and then running ant clean package.
Other jars rarely change, but this saves ~10 min. in compile time. , https://reviews.facebook.net/D3585
, @Namit

bq. Won't it be better to not populate hive*jar in ivy in our local builds?

I don't think we can do that and also continue to list inter-subproject dependencies in the ivy.xml files. The basic reason why this doesn't work correctly for Hive is that the build is still not using Ivy correctly. More specifically, we're manually specifying the order in which subprojects are built instead of letting Ivy determine the order through dependency analysis.

bq. Or, what is the downside of removing 'hive.jar' from .ivy2 and then running ant clean package.

The main downside is that the user may have configured ivy.cache.dir to be something other than ~/.ivy2, so to be sure that you're deleting the right files you have to get the value of ${ivy.cache.dir} (which didn't seem that straightforward the last time I looked at it: http://ant.apache.org/ivy/history/2.0.0/use/cleancache.html).
, @Namit: I filed two followup tickets: HIVE-3116 and HIVE-3117. Thanks., https://reviews.facebook.net/D3585, +1

, Committed. Thanks Shuai, Integrated in Hive-trunk-h0.21 #1482 (See [https://builds.apache.org/job/Hive-trunk-h0.21/1482/])
    HIVE-3085 make parallel tests work
(Shuai Ding via namit) (Revision 1349398)

     Result = SUCCESS
namit : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1349398
Files : 
* /hive/trunk/testutils/ptest/hivetest.py
, @Carl, isn't there a problem in having hive*jar in ~/ivy2 ?
I am not sure, but will it create a problem if I am trying to compile 2 different versions of hive on my machine concurrently ?, @Namit: Yeah, I think it's a problem, but the changes made in HIVE-3092 should insulate us from it. You'll turn up a bunch of links if you try searching for "ivy concurrent build". However, I also think it's possible to work around this problem by publishing the Hive JARs to a filesystem repository that's local to each build, and then making sure that this local repository takes precedence in the list of resolvers in ivy/ivysettings.xml., Integrated in Hive-trunk-hadoop2 #54 (See [https://builds.apache.org/job/Hive-trunk-hadoop2/54/])
    HIVE-3085 make parallel tests work
(Shuai Ding via namit) (Revision 1349398)

     Result = ABORTED
namit : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1349398
Files : 
* /hive/trunk/testutils/ptest/hivetest.py
, This issue is fixed and released as part of 0.10.0 release. If you find an issue which seems to be related to this one, please create a new jira and link this one with new jira.]