[Attached branch 0.9 and trunk patches., Branch 0.9:
https://reviews.facebook.net/D6885

Trunk:
https://reviews.facebook.net/D6891, Added patch for branch-0.10, branch-0.10 requires HIVE-3384., branch-0.9 and trunk require HIVE-3789, Note that this patch requires HIVE-3789 for branch-0.9 and trunk and HIVE-3384 for branch-0.10.

Please apply this patch to all three versions., Chris,
I think underlying problem is HIVE-3840. Once we fix that (via which null binary columns will be printed as NULL instead of null) this problem should go away. Right ?, Now that HIVE-3840 is fixed. Is this still a problem?, I think HIVE-3630 and HIVE-3840 are dealing with two different issues: HIVE-3840 is about inconsistency of null vs NULL, while HIVE-3630 about an internal error causing a result diff of empty string vs NULL.

With patch in HIVE-3840, the test fails with the following diff:
    [junit] 36c36
    [junit] < NULL              NULL    NULL    NULL
    [junit] ---
    [junit] > NULL      NULL    NULL    NULL    NULL
    [junit] 184c184
    [junit] < NULL              NULL    NULL    NULL    A       AB      ABC     ABC     A       AB      ABC     ABC     B       BC      BC      BC      C       C       C       C               C       C       C       C       B       BC      BC      BC      A       AB      ABC     ABC
    [junit] ---
    [junit] > NULL      NULL    NULL    NULL    NULL    A       AB      ABC     ABC     A       AB      ABC     ABC     B       BC      BC      BC      C       C       C       C               C       C       C       C       B       BC      BC      BC      A       AB      ABC     ABC

Compare it with the original diff in JDK7:
    [junit] 36c36
    [junit] < NULL              NULL    NULL    NULL
    [junit] ---
    [junit] > NULL      NULL    NULL    NULL    NULL
    [junit] 184c184
    [junit] < NULL              NULL    NULL    NULL    A       AB      ABC     ABC     A       AB      ABC     ABC     B       BC      BC      BC      C       C       C       C               C       C       C       C       B       BC      BC      BC      A       AB      ABC     ABC
    [junit] ---
    [junit] > NULL      NULL    NULL    NULL    NULL    A       AB      ABC     ABC     A       AB      ABC     ABC     B       BC      BC      BC      C       C       C       C               C       C       C       C       B       BC      BC      BC      A       AB      ABC     ABC

Please note that there is no "null" in the result any more, thanks to the patch in HIVE-3840.

With patch in HIVE-3630, the test passes.

In fact, with JDK7, more test failures are observed because of output ordering, probably due to the iterator behaviour difference introduced in JDK7, same cause as HIVE-3630.



, Xuefu, I don't follow your last comment. It seems this test is now passing on JDK7 and this JIRA can be resolved, is that what you are saying?, [~brocknoland] No. I meant HIVE-3630 is needed to allow JDK7 to pass. HIVE-3840 addresses a different issue. The patch here probably needs to rebase because of changes introduced by HIVE-3840., [~xuefuz] udf_substr.q does not fail on JDK7 for me. I think we can close this., [~brocknoland] Okay. Feel free to close it if it's no longer reproducible. It was there a couple months back., I am unable to reproduce despite repeated efforts. It seems something else fixed this therefore I am marking resolved. Please re-open if required., Sorry for jumping into the discussion late. Feel free to close this if it is no longer reproducible ([~ashutoshc]] thought that would be the case after HIVE-3840).]