[Hi [~szehon], could you help me check it in? Thank you!, Hi Ferdinand, thanks for the patch, are you sure the name is 'ferd' and not the new one you requested 'xuf'?  I thought it should be the apache userid and not jira userid.  [~leftylev] for confirmation?

And also would you mind adding the others as well?

[~dongc] : dongc
[~hsubramaniyan] : hari
[~jxiang] : jxiang
[~spena] : spena

Hope I didnt miss anyone.

, Yes, it should be the Apache userid.  We need to add a statement about that on the web page, or change the column headers from "username" to "Apache username" for all three tables.  Better yet, both -- the introduction should explain that email can be sent to <username>@apache.org while column headers remind updaters to give Apache usernames.

Sorry about the feature creep, but could the patch do that too?, Just realized I missed some more committers (seems website hasn't been updated for some time), [~apivovarov], [~mmccline] [~mithun], can you guys also reply with your informations for the website  

I dont think we need to block this patch upon that, but if we get replies, we can add them in too if its not too much work for completeness., Alexander Pivovarov: apivovarov, Also organization?, http://fostercitylab.crabdance.com/, Thanks, is the organization link text "Foster City Hadoop Lab LLC"?, I'd prefer to keep organization field blank... If it is required then put "Foster City Hadoop Lab LLC"., [~Ferd] Thanks for creating the jira and thanks [~szehon] for cc-ing the missing people. Here are my details :
Name  - Hari Sankar Sivarama Subramaniyan
Apache ID - harisankar
Organization - Hortonworks

Thanks
Hari, Add the original file for review. Please help me check whether the information is correct., [~Ferd] Can you please change my apache id from hari to harisankar in the patch.

Thanks
Hari

, Thank you very much [~Ferd], sorry for getting [~hsubramaniyan]'s username mixed up., I have updated the file, please check. Thank you!, I have updated the file, please check. Thank you!, I have updated the file, please check. Thank you!, I have updated the file, please check. Thank you!, [~Ferd], thanks, my details are correct in patch 2.
, [~Ferd] Thanks for adding me. My details are correct., [~Ferd], thanks for adding me. My details are right too., +1 thanks, My details are correct. Thank you Ferdinand!, [~szehon], thank you for checking with me. My details seem in order.  Cheers. +1., Thanks [~szehon] for your review. 
I have committed to the trunk and the page(http://hive.apache.org/people.html ) has been updated., [~Ferd] and [~szehon] I was trying to use Apache bookmarklet to edit http://hive.apache.org/people.html to add my name to the committer list, but I was not able to. Interestingly, I did not see the names Ferdinand added by his patch when I clicked the [Edit] on the page that CMS brought up. I was following the instructions in https://cms.apache.org/hive/ and using ASF CMS link from https://cms.apache.org/hive/, which I think is the recommended way to add the name. I am not sure what caused this discrepancy between CMS edit page and production page?
[~Ferd] Did you use build_site.pl script to add these names? I have attached a patch for myself. Could you review it and help to commit that for me? Thanks., No, I didn't use that script to add names. I committed to the https://svn.apache.org/repos/asf/hive/cms/trunk and check it through the staging page. +1 for the patch., Did you go through process steps as list in https://cwiki.apache.org/confluence/display/Hive/How+to+edit+the+website? or just svn commit the patch and that is all?, I didn't build site since my changes are not big. You can see your changes through staging page. If it looks OK, you can publish it., [~ctang.ma], your patch should go on a new JIRA issue.  Here are some newer examples of how it's done:  HIVE-10281, HIVE-11584.

[~sushanth] might want to team up with you on this, because he needs to move his name from the committer list to the PMC., Thanks. [~leftylev] Seems that I have to open a new JIRA for that.]