[fixed minimr test mode.

enabled a couple of queries to always run (additionally) in minimr mode (like hbase-handler tests) when running standard tests. we should probably expand this to a larger number of queries (especially those requiring multiple reducers). i don't have good insight into this part - if people have ideas - we can expand the list easily., +1.  Last time I talked to Ning about this, my take was that we should be able to re-run any subset of tests in either mode (without needing test codegen for it), but for now we can just get things working again this way.

Some candidates for existing tests to add in to the minimr suite:

jsichi-mac:clientpositive jsichi$ grep reducer *.q
bucket1.q:set hive.exec.reducers.max = 200;
bucket2.q:set hive.exec.reducers.max = 1;
bucket3.q:set hive.exec.reducers.max = 1;
bucket4.q:set hive.exec.reducers.max = 1;
bucketmapjoin6.q:set hive.exec.reducers.max=1;
disable_merge_for_bucketing.q:set hive.exec.reducers.max = 1;
reduce_deduplicate.q:set hive.exec.reducers.max = 1;
sample10.q:set hive.exec.reducers.max=4;
smb_mapjoin_6.q:set hive.exec.reducers.max = 1;
smb_mapjoin_7.q:set hive.exec.reducers.max = 1;
smb_mapjoin_8.q:set hive.exec.reducers.max = 1;
smb_mapjoin_8.q:set hive.exec.reducers.max = 1;
udaf_percentile_approx.q:set hive.exec.reducers.max=4
, i am running through the above qfiles and see what executes successfully on minimr (because many dont).

one concern is the length of the tests. i think we need to divide our tests into a short and long regression. otherwise development cycle is severely impacted if everything has to be tested on every iteration., with modified list of minimr tests:

+  <property name="minimr.query.files" value="input16_cc.q,scriptfile1.q,bucket1.q,bucket2.q,bucket3.q,bucket4.q,bucketmapjoin6.q,disable_merge_for_bucketing.q,reduce_deduplicate.q,smb_mapjoin_6.q,smb_mapjoin_7.q,join1.q,groupby2.q"/>                                                                                       

i took the ones that worked from John's list. also added a couple of tests that had 'add jar' and 'add file' commands (since their interaction with real cluster is quite different).


, Yeah, shortreg/longreg split would be good.  The challenge is to keep longreg healthy since breakages don't get caught with every checkin, so we'll need

(a) automation to run it constantly and report failures
(b) people to actually fix failures in a timely fashion
, small change - fix 0.20 version match to pick the right jetty version. , can someone review/commit this? i don't think i am going to make more changes to this.

will work on long regression framework separately., I will take a look, The tests in miniMR will run twice, and the log files may get over-written.
They should be excluded from non-miniMR., - added exclude tests - minimr tests are excluded from regular clientpositive tests
- did some subtle changes in how fs.default.name and mapred.job.tracker are specified to allow testing against external hadoop clusters, +1

Running tests now - will file a new jira for the ability to run unit tests in parallel in miniMr mode, there's already a jira on running tests in parallel. i think i can cover it there itself., Committed. Thanks Joy]