[[~brocknoland] and [~xuefuz]: I was talking to Yin Huai about this issue and he suggested I pinged you on this, especially on how it affects HUE UX as mentioned above. , It seems reasonable to me that these flags kicks in only for CTAS, or other queries that resulting a new table. In other words, the functionality of merging small files for a table should be applied to table (upon request) rather than coming in effect for any query that touches the table. I think what is missing is a new command/query something like "MERGE FILES FOR TABLE table_name". This might be further automated in a scheduled fashion in HiveServer2. Of course, the scope is much larger., Thanks Xuefu for the quick response! A few questions/comments:
1. Could you elaborate on why you think it makes sense to only merge small files for queries resulting in a new table? Alternatively, what are the issues for supporting these properties for regular queries? I'd love to have this support for regular queries, unless there's a strong reason against it.
2. If indeed these properties are designed only for queries resulting in a new table, then we should mention that in the documentation. Currently it's misleading - it sounds like they'd work for regular queries as well.
3. The main pain point here is that users won't know that there are many output files until AFTER the query is run. Imagine analysts who don't know these details and HUE is the only query interface for them. It's frustrating and time consuming to run a long-running query in Hue, only to find out they can't get the results b/c HUE times out trying to read these many small files, and so they'll have to run the query again as CTAS. Having a table just so they could download the result seems to be an overkill.
4. Do you have a suggestion for the aforementioned HUE issue? Hue starts timing out when the query results in thousands of small output files. This is a major pain point for our analysts today., [~ericchu30] I guess my above comments was a little off the topic. I thought the problem you mentioned was about too many small files for a table (which my comments above was mostly about) but now I realized that the problem is about a query resulting too many tables. Thanks for your clarifications.

The two problems are different yet seemingly related. I'm wondering if the problem #2 (too many small files from a query) is root caused by problem #1 (too many small files for a table). I cannot image a case of that (besides too many mappers or reducers), but appreciate if you can share your case.

If the answer is yes, then the proposal that I outlined above may prevent problem #2 from happening. If no, then it may makes sense to have both. For information only, HIVE-439, which originally introduced the merge feature, seems targeting only at small files from mappers, no mentioning either this is for query result or table files. However, the comments did mention about movetask, which may be related to the code you saw.

For the Hue issue you mentioned, I'd think that getting rid of the small files one way or the other seems reasonable.  , [~xuefu.wang@kodak.com] We notice that the problem occurs when a query results in too many files; however, this happens b/c the table has too many (but not necessarily small) files. Most of the queries that have this problem are regular SELECT FROM WHERE queries (no GROUP BY) that don't have reducers. Some of our tables have hundreds of GBs per partition; the biggest one has TBs of data per partition. It's not uncommon to see queries with thousands or tens of thousands of mappers, but no reducers. 

We are looking at other ways to mitigate this problem. What you suggest - merging files in a partition - is certainly something we are considering. Meanwhile, I want to consider supporting these properties for queries without a move task. Specifically, what are the reasons that we didn't support these properties for queries without a move tasks? And if we want to do do, what considerations should we make? We'd be willing to work on this, but we probably will need some guidance from domain experts. Thanks!, For problem you are describing {code} alter table T partition (p1='v1') concatenate; {code} is best solution. see ql/src/test/queries/clientpositive/alter_merge.q for more examples., Thanks [~ashutoshc] for pointing out the concatenate command. However, I think the ability to merge files for a table partition is orthogonal to supporting hive.merge.mapfiles, hive.merge.mapredfiles, and hive.merge.smallfiles.avgsize for "regular" queries (i.e., that don't result in a new table). Even if we have the optimal number of files at input for each partition, users querying over a large number of partitions with just SELECT FROM WHERE clauses will result in a large number of small output files, and there will be negative sides effects such as Hue timeout, the next job will have a large number of mappers, etc.

Can someone explain why the properties are supported only for queries with move tasks? Was it just a matter of scoping, or is there some reason that makes this inappropriate for queries without a move task? We are considering adding this support on our own and would like to get some insights on the original design considerations. Thanks!

, [~ericchu30] Merging or concatenating files for a table/partition makes more sense in that the table/partition will likely be used over and over again. On the other hand, merging small files resulted from a query that are not permanently stored, while helping your case,  brings extra cost on the query execution, which is probably not a good idea for every query. If we choose to selectively, then the challenge is to know when to merge the result.

If the user has a better idea, then we can extend the Hive syntax to provide a construct such as "SELECTM col1, col2 FROM table1",  but from your description, the users may not have that sense. They will not know until the query fails. "Select and merge" approach is close to your workaround of a temp table, right?

Having too many partitions pose many challenges including the problem you're facing. I'd suggest you revisit your partition strategy and try to reduce the number of partitions that a query would involve., [~xuefuz] Regarding when to merge, isn't that precisely what hive.merge.mapfiles, hive.merge.mapredfiles, and hive.merge.smallfiles.avgsize are for? I never propose to merge files for every query. Rather, I'm proposing to honor these properties for queries without move tasks as well. Users won't need to decide when to merge; it'd be decided based on the configuration and the avg output file size, just like queries that result in a new table.
, I don't think because an external tool (Hue) is failing to read data because of too many files, its Hive's responsibility to compact files. Hue should be fixed not to time out while reading too many files., [~ericchu30] I got what you're saying. However, I'm not sure if these properties are enough for queries that generates small files. To say one thing, a query generating two small files is different from one that generates thousands, but we may not want to spawn a job to merge two small files, while it (merging two files) may be acceptable for files for a table. Thus, I'm not totally convinced that these properties are equally applicable to the scenarios you described.

I agree  with Ashutosh's comment in general. However, if the same problem also occurs to other clients such as JDBC, or compacting for their lives much easier, then it might make sense to fix it in Hive. Still, I am not convinced that we can reuse the above mentioned properties for such a purpose., Good point [~xuefuz]. For the case of map-only jobs, we are considering to check that the following are true
1. hconf.getBoolVar(ConfVars.HIVEMERGEMAPFILES)
2. currWork.getReduceWork() == null
3. currWork.getMapWork().getNumMapTasks() > [threshold], where [threshold] could be some configurable value. We have observed that Hue starts to time out when number of output files > 2000.

As for Ashutosh's comment, we could increase the limit on the timeout but it won't completely solve the problem. We're talking about thousands to tens of thousands of output files from a single query. Even if it doesn't timeout, it'll take a noticeably long time to download the result, and UX will be horrible. , Hi [~xuefuz] and [~ashutoshc], it turns out this issues not only affects Hue but also HIVE CLI - in that results won't show up in CLI until more than a minute has passed with timeout error for connection to nodes.

I'm trying to make the change myself in GenMRFileSink1.java to support a new property that when it's turned on, Hive will merge files for a regular (i.e., without mvTask), map-only job that uses more than X mappers (another property). I'm wondering if and how we could find out the number of mappers that will be used for that job when we are at that stage of the optimization. I want to set chDir to true when this number is greater than some threshold set via a new property.  I notice that currWork.getMapWork().getNumMapTasks() actually returns null. Can you give me some pointers?]