[
I upgraded the fix to work with Hive 0.3. Would be great if a couple of folks can try this under cygwin and let me know if it works fine. It shouldn't affect non-windows installations, and for windows installations it will change the relevant paths/dirs using  cygpath (I added the fix to all services: cli.sh, hwi.sh, hiveserver.sh, and lineage.sh), Thanks for the patch Amr. Like you I am a PC user as well. Will try it out.

Sometime back I do remember seeing some email on the hadoop mailing list that they are going to deprecate support on cygwin. Don't know if that is true or not...

Also you should try coLinux (it is a very lightweight linux vm that runs on windows). I have been able to do all my hive development on the FC7 image with that.

, Moving to 0.3.1 as 0.3.0 is released, I tried this but it does not seem to work with auxilary jars. I get the following error

bash-3.2$ hive/bin/hive
java.net.URISyntaxException: Illegal character in scheme name at index 4: file;c:/Users/Ashish/dev/hive/hive/auxlib/fbhive_hooks.jar

AUX_PARAM has URIs in it so cygpath will probably cause problems there. The cygpath code for AUX_PARAMS needs to go at all the places where aux params are getting created from file names as opposed to at the end. I think that should fix this issue.

, @Ashish, sorry for delay replying and thanks for testing. I thought I tracked down all of the path params, I will take a closer look at AUX_PARAMS next week and submit another patch.

 -- amr
, Since there's been no activity on this ticket for a while I suggest we move it to 0.3.2 so that 0.3.1 can be released., @Ashish

Can't believe it has been two months already, but please find a new patch attached (HIVE-344-v2.patch). 

I think I tracked down all places where AUX_PARAM and AUX_CLASSPATH get set. 

Please give a try and let me know.

Cheers,

-- amr
, Thanks Amr. Will try it out today.
, ashish, worked?, The first tests seem to be ok. Will do a bit more today and checkin if it works. I have one question though about the patch. The cygpath thingy is done in the cli.sh and lineage.sh files after HIVE_LIB is used. Should it not be before HIVE_LIB is used?, unfortunately HIVE_LIB is checked for validity inside these files using normal bash commands, so the cygpath translation for HIVE_LIB has to be done this late as opposed to in the main hive script (otherwise the verification in sub-scripts would fail).
, I am having problems with show tables.

hive> show tables;
FAILED: Error in metadata: javax.jdo.JDODataStoreException: Exception thrown performing schema operation : Add classes to Catalog "", Schema "APP"
NestedThrowables:
java.sql.SQLNonTransientConnectionException: No current connection.
FAILED: Execution Error, return code 1 from org.apache.hadoop.hive.ql.exec.DDLTask

Prasad can you comment on this?
, Got it working. Looks all good to me.

+1

Will  checkin once the unit tests pass.
, committed. Thanks Amr!!, what was the problem?, Hi
I've installed hadoop-0.19.2 and hive under cygwin
am trying to follow the tutorial http://wiki.apache.org/hadoop/Hive/GettingStarted#Downloading_and_building
everything is working fine in the tutorial until I tried to execute an sql stmt 
after performing following settings
hive>SET mapred.job.tracker=myhost.mycompany.com:50030;
hive>SET -v ;
then I get "Number of reduce tasks is set to 0 since there's no reduce operator"
first does the patch apply to this error
am a new to linux, how to apply the patch
isn't worth to work with co-linux?
thankx]