[Currently from TableScanOp we publish statistics to JobTracker with aggrKey as counter group name, actual statistics type (numRows etc) as counter and value of statistics as counter value. We can simply use partition spec as counter group name, statistics as counter name and then we need not to do invoke stats aggregation from hive client when query finishes. This has following advantages:
* Client don't need to do any aggregation. After retrieving statistics from JobTracker (via JobClient) it can directly add them to metastore.
* It lowers memory footprint on JobTracker, since instead of having counters per task per partition, it will have counters per partition only., Unfinished patch illustrating the idea. More work needs to be done. [~navis] Can you take a look to finish this off, if you have time?, Working patch with attached testcase. Need to clean-up to remove logging and need to do more testing., Attached wrong patch. Now with test-case., Getting closer. Trigger Hive QA to see if this introduces any failures., 

{color:red}Overall{color}: -1 at least one tests failed

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12617026/HIVE-5916.3.patch

{color:red}ERROR:{color} -1 due to 1 failed/errored test(s), 4456 tests executed
*Failed tests:*
{noformat}
org.apache.hadoop.hive.cli.TestCliDriver.testCliDriver_decimal_udf
{noformat}

Test results: http://bigtop01.cloudera.org:8080/job/PreCommit-HIVE-Build/514/testReport
Console output: http://bigtop01.cloudera.org:8080/job/PreCommit-HIVE-Build/514/console

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
Tests exited with: TestsFailedException: 1 tests failed
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12617026, Patch is ready for review. 
[~navis] Major change in this patch is it changes the aggKey such that no aggregation is required on client side in StatsTask. This also shortens the key so that it won't run into limits. Now we just use dbName.TblName/p1=v1/ instead of long elaborate filesystem paths. This patch also lowers the number of unique counters required. Earlier they were num of Partitions * number of Tasks * number of Stats, now we just use num of Partitions * num of Tasks. 
This will conflict with HIVE-5936 in major fashion. Since, it has bunch of additional improvements, do you think it makes sense to get this one in first., Review request at https://reviews.apache.org/r/16026/, nit: formats. except that, +1, Thanks, Navis for review. Updated patch with review comments. Also, fixed many whitespace changes., Hopefully, Hive QA will pick this up., 

{color:green}Overall{color}: +1 all checks pass

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12617112/HIVE-5916.5.patch

{color:green}SUCCESS:{color} +1 4457 tests passed

Test results: http://bigtop01.cloudera.org:8080/job/PreCommit-HIVE-Build/526/testReport
Console output: http://bigtop01.cloudera.org:8080/job/PreCommit-HIVE-Build/526/console

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12617112, Committed to trunk. Thanks, Navis for review.]