[HiveDatabaseMetadata.getCatalogs() currently returns the list of databases/schemas defined in the metastore, which is incorrect. In fact, HiveDatabaseMetadata.getSchemas() should return this information, and getCatalogs() should return an empty result set. Hive currently doesn't implement the concept of a catalog, and instead borrowed MySQL's convention of using both DATABASE and SCHEMA to identify the same class of catalog objects that allow you to partition your tables into separate namespaces.

This blurb (http://stackoverflow.com/questions/7942520/relationship-between-catalog-schema-user-and-database-instance) probably does a better job of summarizing these relationships:

{quote}
In MySQL:

* server instance == catalog == set of schemas managed by same execution engine
* schema == database == a namespace within the server where tables are stored
* user == named account, who can connect to server and use objects in database or in other dbs
* to identify any object you need (schema name + object name)
{quote}
, +1

We have implemented the following and will be happy to contribute the patch.

{code}
DatabaseMetaData::getCatalogs()  ==>  return EMPTY ResultSet

DatabaseMetaData::getSchemas()  ==>  return HiveInterface::get_all_databases()

DatabaseMetaData::getTables(...)  ==>  Always ignore catalog argument.
{code} 



, @Richard: That would be great! Can you please attach your patch? Thanks., patch attached., Looks fine to me overall. A few minor comments/suggestions
- getSchemaTerm() should return "schema"
- getCatalogTerm() should return ""
- I think it would be helpful to rename the getTableCatalog() in JdbcColumn and JdbcTable classes
, Thanks Prasad. Attaching patch to address comments., @Richard: Please post a code review request on reviews.apache.org. Thanks., @Carl: code review request is posted. Should the request be automatically posted to the jira?, @Richard: Sorry for the slow response. Unfortunately the code review link does not get automatically posted to JIRA. Can you please paste the link here? Thanks., I posted review request here: https://reviews.apache.org/r/5490/, does this mean that getTables will work correctly now when NULL is provided for the catalog and schema parameters?

we found in 0.8, 0.9 and 0.10 etc that it is not default context for catalog/schema and returns nothing. 

an application is forced to work around this by parsing the connection URL and stripping any db info provided or a default name.
, Looking at the current code (trunk post 0.13) it looks like it has already changed similar to what is suggested in this patch.  Not exactly though.  I'll move the JIRA from patch available to open.  [~cwsteinbach], [~rding], do you want to close this as duplicate?, This was fixed as part of HIVE-2935 (HS2 implementation)]