[this patch will correctly convert hive map type (consistent with Pig map), 

{color:green}Overall{color}: +1 all checks pass

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12637609/HIVE-6783.1.patch.txt

{color:green}SUCCESS:{color} +1 5503 tests passed

Test results: http://bigtop01.cloudera.org:8080/job/PreCommit-HIVE-Build/2031/testReport
Console output: http://bigtop01.cloudera.org:8080/job/PreCommit-HIVE-Build/2031/console

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12637609, Hi,

The patch has tabs where as Hive requires two spaces. Can you fix that and then put a Review Board item up? (reviews.apache.org)

FYI [~jcoffey] [~xuefuz], FYI [~szehon], remove tab and clean up some format, https://reviews.apache.org/r/19825/, 

{color:red}Overall{color}: -1 at least one tests failed

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12637662/HIVE-6783.4.patch.txt

{color:red}ERROR:{color} -1 due to 1 failed/errored test(s), 5503 tests executed
*Failed tests:*
{noformat}
org.apache.hive.jdbc.TestJdbcDriver2.testNewConnectionConfiguration
{noformat}

Test results: http://bigtop01.cloudera.org:8080/job/PreCommit-HIVE-Build/2036/testReport
Console output: http://bigtop01.cloudera.org:8080/job/PreCommit-HIVE-Build/2036/console

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
Tests exited with: TestsFailedException: 1 tests failed
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12637662, Hmm, why formatting code would cause one previously passed test to fail. The failure is related to jdbc, which is unrelated at all.

Is that transient error?, Hi Tongjie yea it looks like a transient error, a few pre commit builds around that time also failed with same failure.

About this patch, my question is, will it affect backward compatibility of reading existing stored maps in hive-parquet?, I think it should be backward compatible, I am able to read existing stored maps with this fix., Thanks, that is my only concern to not break existing stored maps, I'm ok if thats the case.  Although I wonder, it would seem pig should be able to read hive's maps if that is the case, because we are using pig's schema now to read?  Or is there some difference there?
, The fix presented in this jira is to tag map type with the appropriate OriginalType.

The reason hive is backward compatible is that when parquet-hive converts parquet fields map.key and map.value back to hive map column, it does not check MAP_KEY_VALUE OriginalType.  Also, the equals method of GroupType does not check OriginalType at all, hence hive_schema and pig_schema shown in description section are treated as equal (the only different is OriginalType).

However, parquet-pig's PigSchemaConverter checks to make sure map's OriginalType is of correct type, hence it breaks when it reads Hive's map.

With the fix, pig now can read hive's map since hive converts it right.
, Thanks looks good to me.  + [~brocknoland], [~xuefuz], +1, Patch committed to trunk. Thanks to Tongjie for the contribution.

BTW, it seems that you're not in the contributor list so I'm not able to assign this JIRA to your credit. You might request this on dev email list., Hi [~rhbutani], the Parquet community is wondering if this can be also in 0.13.1, or some release of 0.13?  That would be helpful , as this fixes parquet format compatibility between hive and pig.  Thanks., (Btw, to be explicit, this has been accepted for inclusion in 0.13.1, and will be part of it), This jira has been fixed as part of 0.13.1 release. If you find further issues, please create a new jira and link it to this one.
]