[This issue is a clone of a prior jira : HIVE-6633, which modified it for org.apache.hcatalog.* classes, which got removed as deprecated classes were pruned out. So, we effectively need to add that change back in, to org.apache.hive.hcatalog.* classes., I modified the original HIVE-6633 patch to put the changes in the right place, under apache/hive.  This is a new patch for those changes based directly off the current hive trunk., [~sushanth], please have a look and +1/commit if you think it's ready. Thanks! , 

{color:red}Overall{color}: -1 at least one tests failed

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12665374/hive-7901.01.patch

{color:red}ERROR:{color} -1 due to 2 failed/errored test(s), 6127 tests executed
*Failed tests:*
{noformat}
org.apache.hive.hcatalog.pig.TestHCatLoader.testReadDataPrimitiveTypes
org.apache.hive.service.TestHS2ImpersonationWithRemoteMS.testImpersonation
{noformat}

Test results: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/564/testReport
Console output: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/564/console
Test logs: http://ec2-174-129-184-35.compute-1.amazonaws.com/logs/PreCommit-HIVE-TRUNK-Build-564/

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
Tests exited with: TestsFailedException: 2 tests failed
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12665374, +1, looks good to me, thanks for the update, Eric.

Also, while one of the tests that failed is a TestHCatLoader failure, it does not seem to be caused by this patch., Thanks, [~sushanth]. Will you commit this or do you want me to do it? -Eric, I've committed it, but JIRA was having issues that prevented me from
marking as resolved.


-- 
CONFIDENTIALITY NOTICE
NOTICE: This message is intended for the use of the individual or entity to 
which it is addressed and may contain information that is confidential, 
privileged and exempt from disclosure under applicable law. If the reader 
of this message is not the intended recipient, you are hereby notified that 
any printing, copying, dissemination, distribution, disclosure or 
forwarding of this communication is strictly prohibited. If you have 
received this communication in error, please contact the sender immediately 
and delete it from your system. Thank You.
, Okay, thanks, Committed to trunk. Thanks, Eric!, This has been fixed in 0.14 release. Please open new jira if you see any issues.
]