[The patch is being requested for review on https://reviews.apache.org/r/31825/ , thanks in advance.
It is to enhance Beeline to be able to run multiple commands from a line which is passed in via beeline console, -e or -f. In addition, it also fixes an NPE when reading command from a file (via -f) if that line of command is not terminated by ";", Not sure why the precommit build was not kicked off. Resubmit patch to trigger the build., 

{color:green}Overall{color}: +1 all checks pass

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12703684/HIVE-9877.patch

{color:green}SUCCESS:{color} +1 7613 tests passed

Test results: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/2989/testReport
Console output: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/2989/console
Test logs: http://ec2-174-129-184-35.compute-1.amazonaws.com/logs/PreCommit-HIVE-TRUNK-Build-2989/

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12703684 - PreCommit-HIVE-TRUNK-Build, +1, Committed to trunk. Thanks, Chaoyu., Doc note:  This needs to be documented for 1.2.0 in Beeline Command Options.

* [HiveServer2 Clients -- Beeline Command Options | https://cwiki.apache.org/confluence/display/Hive/HiveServer2+Clients#HiveServer2Clients-BeelineCommandOptions], I only took a cursory look at the patch but isn't this the same as HIVE-7348 which was closed without implementing the change?

Just splitting on semicolon is not a good option at least for "-e" (and probably for -f as well). If this is what this patch does and the arguments from the other issue are still valid I'd be in favor of reverting this patch for now., [~lars_francke] Thanks for raising the issue in HIVE-7348. Actually I am thinking it differently based on the following facts:
1. Hive CLI supports multiple queries separated by ";" in one line (either via -e or -f), but it does not support the case (having ";" in middle of query itself) as described in HIVE-7348. This patch is mainly to make Beeline more compatible with CLI and facilitate CLI users to migrate to Beeline which I believe is what we are advocating.
2. MySQL -e works similar to Hive CLI, but it also does not support the case like that HIVE-7348.
3. Compared to cases that users use CLI oneline of multiple commands (either via -e or -f), I think the one in HIVE-7348 should much rare. I do not think we should give away an improvement benefiting more cases for a less likely one. Maybe we should file a Beeline RFE to cover the case in HIVE-7348., Thanks [~ctang.ma]. I see your points and while I disagree with the conclusion I won't argue the change. I just wanted to raise it in case you weren't aware of the previous discussions. Let's keep it the way it is now., This issue has been fixed and released as part of the 1.2.0 release. If you find an issue which seems to be related to this one, please create a new jira and link this one with new jira.]