[Followup for HIVE-417.
, Example:

create table `_t`(`_i` int, `_j` int);
create index x on table `_t`(`_j`) as 'compact' with deferred rebuild;
alter index x on `_t` rebuild;

gives

FAILED: Parse Error: line 1:48 mismatched input ',' expecting CharSetLiteral in character string literal

To see why, look at org.apache.hadoop.hive.ql.index.compact.CompactIndexHandler, method getIndexBuilderMapRedTask.  It constructs an internal SQL statement (INSERT) which populates the index table structure.  However, it neglects to quote the table/column names, leading to invalid syntax.  (Hive uses backticks to quote identifiers with special characters--I think this currently only applies to leading underscores, but later we'll support arbitrary identifiers.)

HiveUtils.unparseIdentifier should be used for quoting.
, Russell, please reassign to the actual owner., Patch for 1501, I've added a patch that should solve the issue.

In terms of tests, is a simple test (of the kind John described in his earlier comment) sufficient?, Yes, a simple test such as the one above should be good enough., Adding a patch for 1501 that also includes tests., String indexCols = MetaStoreUtils.getColumnNamesFromFieldSchema(indexField);
indexCols is a column list, like:
col1, col2,col3
After the change, it should be `col1`, `col2`, `col3`...

So the whole command should be like:
INSERT OVERWRITE TABLE `table_name`
PARTITION (...)
SELECT `col1`, `col2`, `col3`..., `INPUT__FILE__NAME`,  collect_set (`BLOCK__OFFSET__INSIDE__FILE`)
FROM `base_table` 
...
GROUP BY `col1`, `col2`, `col3`..., `INPUT__FILE__NAME`
, Adding a new patch for 1501 that parses the index columns correctly., Can you update the testcase to use an index on a compound key so that this case gets coverage?
, Adding a new patch with a new test case for an index with multiple keys., +1.  Will commit when tests pass., Oops, I have to retract my +1.

The patch doesn't compile with "ant package".  The reason is that code in metastore is not allowed to depend on code in ql.

If you were compiling with Eclipse, it may have allowed this, but before submitting your patch, make sure it compiles from the command line with "ant package".

The solution is to move this method from MetastoreUtils to HiveUtils.
, Moved function from MetaStoreUtils to HiveUtils., Whitespace nitpicks:

* MetaStoreUtils.java no longer has any changes, so it should not be in the patch at all

* , * HiveUtils.getUnparsedColumnNamesFromFieldSchema has an extra line of whitespace in between the Javadoc and the method declaration.

(If you're using Eclipse for editing, it's easy to end up with extraneous whitespace.), (Other than those, this one should be ready to go.), Added a new patch with formatting fixes., +1 on the latest.  Will commit when tests pass.
, Committed.  Thanks Skye!
]