[[~nemon]. that is interesting finding. Could u also record how much time did we spend on HiveRelFieldTrimmer in CBO on case and put them in the 3rd column? Thanks., ||queries||CBO_total_time||CBO_time_in_SelectOP||
|q27|	266.494|80.5 |     
|q7	|   328.259|98.8 |
|q68|	369.159|105 |
|q46|	392.777|91.75|

I just run a few of them because of time limit. The time spent in selectOP is calculated by adding up total times spent for selectOP  in one executor ,and then divide number of cores.(4 in my case).
Also,I have run q46 without projection pruning.And total time is 266.226,time spent in selectOP is 0.125 seconds., [~nemon], thanks for your data. I am bit confused for the CBO_time_in_SelectOP that you mentioned... What i would like to see is how much time did we spend on compiling the query (I mean the time spent on the application of HiveRelFieldTrimmer). For example, for q27, the time difference is 251-160=91. If the time spent on the application of HiveRelFieldTrimmer is around 90s, then that means we should improve the compilation. Otherwise if the time spent on the application of HiveRelFieldTrimmer is around 1-5s, then that means the difference comes from somewhere else rather than compilation.. Thanks., [~pxiong]  Sorry for the misleading. Performance degradation is at run time(an application run on YARN),not compile time.
HiveRelFieldTrimmer adds a projection rel node above table scan.The projection node then compiled to select operator in hive.
That's why I record the time spent in select operator during run time., A preliminary analysis:
Hive has a built in column pruner, and column pruning has been pushed down to InputFormat layer.
CBO adds an projection above table scan,which is very costly especially when doing projection before join.
Join can filter out a lot of rows in most cases of TPCDS., The motivation of this jira ticket is that ,I found that query46 was lower with CBO on than off, while the join order is the same. ( I changed the join order in SQL manually when CBO is off.)
After comparing these two query plans,the major difference is the select operator introduced by CBO's projection pruning.
]