[+1, [~jcamachorodriguez] Given that HIVE-12503 fixes this we shouldn't be running into this issue any more., [~jpullokkaran], wouldn't it be safer to add this fix too till CALCITE-794 is fixed? Otherwise, I will close it as duplicate., Can we run in to CALCITE-794 with HIVE-12503 patch?
My understanding is CALCITE-794 is not an issue with meta data systems itself rather its an issue when rule fires repeatedly on the same node.
, The issue was (if I recall well) that you end up with cycles in the planning graph (between equivalent sets of expressions) and then a metadata provider can fire up indefinitely.

But I guess that as currently we execute this rule in isolation in Hive, and we know this rule will not produce cycles, we could close it as the metadata provider will never fire up indefinitely., I am not completely sure of my sentence above:

{quote}...as currently we execute this rule in isolation in Hive, and we know this rule will not produce cycles, we could close it as the metadata provider will never fire up indefinitely.{quote}

I need to understand better the issue on the Calcite side. I think this rule, even when run in isolation, could create cycles depending on the plan, and these cycles could lead to the problem retrieving the metadata., 

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12774065/HIVE-12508.patch

{color:red}ERROR:{color} -1 due to no test(s) being added or modified.

{color:red}ERROR:{color} -1 due to 4 failed/errored test(s), 9864 tests executed
*Failed tests:*
{noformat}
TestHWISessionManager - did not produce a TEST-*.xml file
org.apache.hadoop.hive.cli.TestNegativeCliDriver.testNegativeCliDriver_authorization_uri_import
org.apache.hadoop.hive.metastore.txn.TestCompactionTxnHandler.testRevokeTimedOutWorkers
org.apache.hive.jdbc.TestSSL.testSSLVersion
{noformat}

Test results: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/6138/testReport
Console output: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/6138/console
Test logs: http://ec2-174-129-184-35.compute-1.amazonaws.com/logs/PreCommit-HIVE-TRUNK-Build-6138/

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.TestCheckPhase
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
Tests exited with: TestsFailedException: 4 tests failed
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12774065 - PreCommit-HIVE-TRUNK-Build, Should this be committed meanwhile, before CALCITE issue is resolved? Follow-up JIRA can be created to account for the latter., [~sershe], HIVE-12503 seems to have solved the issue, thus I will close it as duplicate.]