[It accepts regex expressions..

select `.*(your-alphanumerics)` from table;, we can provide extra verification for the syntax of select statement to address the issue raised. This would provide an appropriate error message to the user if the syntax is wrong. I have made a change in my local source code which accomplishes this proposed solution . I have attached a screen shot "Hive_bug_3141_resolution.pdf" for reference., Made change in CliDriver.java to make a check on the syntax of select statement.Please do a code review.
The attached screen shot "Hive_bug_3141_resolution.pdf" shows how the select query works after the patch done in my local., Made change in CliDriver.java to make an extra check on the syntax of select statement.
The attached screen shot "Hive_bug_3141_resolution.pdf" shows how the select query works after the patch done in my local, Can you add negative test for the scenarios you mentioned ?, Hi Namit,
Both positive and negative tests are included in the attachment "Hive_bug_3141_resolution.pdf". Please let me know if I am missing any specific scenario?
thanks
, @Ajesh, can you add some tests in ql/src/test/queries/clientnegative

Look at the various .q files present there.

More details at
https://cwiki.apache.org/Hive/developerguide.html#DeveloperGuide-Unittestsanddebugging, Adding q file and q.out file for negative test., Adding q file and q.out file for negative test, Ajesh, can you provide a single patch containing all the changes.
And can you use https://cwiki.apache.org/Hive/phabricatorcodereview.html to create a review ?
It is very easy to review., Adding all changes in a single patch file. HIVE-3141.2.patch.txt, Hi Namit,
I have added all the changes in a single patch file, HIVE-3141.2.patch.txt.
Please do a review. Because of some software installation limitations, I am not able to install the required software for using Phabricator.So I am not able to create a review for the patch., @Ajesh: Can you please try using the reviews.apache.org site instead? This site does not require you to install any client-side components. Thanks., Thanks Carl
I have added review request in reviews.apache.org.
Please find the link for the same  https://reviews.apache.org/r/6919/, Syntax checks like this don't belong in CliDriver because other clients (e.g. Thrift) bypass this logic. We should either modify the grammar to find problems like this, or else do the same check in the SemanticAnalyzer., Parsing is done in org.apache.hadoop.hive.ql.parse.HiveParser.java. But source code for this file is not available in hadoop distribution.

Another option is to modify parse() method in ParseDriver.java to add extra verification for the syntax .All the services like cli,hiveserver uses this method for parsing.  Let me know your comments., HiveParser.java is autogenerated by ANTLR using the Hive grammar file located here:

ql/src/java/org/apache/hadoop/hive/ql/parse/Hive.g

bq. Another option is to modify parse() method in ParseDriver.java to add extra verification for the syntax .All the services like cli,hiveserver uses this method for parsing. Let me know your comments.

The right place for this check is probably somewhere in the SemanticAnalyzer class. Please take a look at this, and in particular pay attention to the places where SemanticExceptions are thrown., Hi Carl, 
when we execute 'select' query , it is not invoking SemanticAnalyzer.class.
Let me know if I am missing something in my analysis., Hi Carl
when we execute 'select' query , it is not invoking SemanticAnalyzer.class. Let me know if I can go ahead with modifying parse() method in ParseDriver.java.]