[Patch submitted via phabricator., https://reviews.facebook.net/D10599, Mrrrgn requested code review of "HIVE-4427 [jira] SemanticAnalyzer throws OFFLINE_TABLE_OR_PARTITION exceptions with null context.".

Reviewers: JIRA

Removed unnecessary table.isOffline check happening outside of SemanticAnalyzer.validate() to fix null hook contexts and allow custom offline error messages (via hooks) at a partition level.

In SemanticAnalyzer offline tables throw a SemanticException before validate() is called.  This is unnecessary, since all appropriate checks are run within the validate method, and is a bug because it throws exceptions with a null context (preventing custom offline error messages via hooks).

TEST PLAN
  Modified a SemanticAnalyzerHook to dump the line number or SemanticAnalyazer.java where an Exception was thrown.  When calling an offline partition in an offline table, before my changes, exceptions were thrown outside of the validate() method.  After my changes exceptions were thrown from within
  the validate method.  To further verify that the exceptions were correct, I dumped the error message and context to verfity that the exception messages were of type OFFLINE_TABLE_OR_PARTITION and that the HookContext was not null.  After my changes proper errors were indeed thrown, with appropriate contexts.

REVISION DETAIL
  https://reviews.facebook.net/D10599

AFFECTED FILES
  ql/src/java/org/apache/hadoop/hive/ql/parse/SemanticAnalyzer.java

MANAGE HERALD RULES
  https://reviews.facebook.net/herald/view/differential/

WHY DID I GET THIS EMAIL?
  https://reviews.facebook.net/herald/transcript/25359/

To: JIRA, Mrrrgn
, kevinwilfong has commented on the revision "HIVE-4427 [jira] SemanticAnalyzer throws OFFLINE_TABLE_OR_PARTITION exceptions with null context.".

  It looks like the revision that added this code did not add a proper testcase for it, based on what the comments say it's trying to achieve.

  http://svn.apache.org/viewvc?view=revision&revision=982476

  Could you add a testcase where you attempt to select from an offline table with no partitions or where all partitions are filtered and verify it fails rather than returning no results?

REVISION DETAIL
  https://reviews.facebook.net/D10599

To: JIRA, kevinwilfong, sindheeraj, Mrrrgn
, Mrrrgn has commented on the revision "HIVE-4427 [jira] SemanticAnalyzer throws OFFLINE_TABLE_OR_PARTITION exceptions with null context.".

  @kevinwilfong, Sorry about the lack of a test.  I'll submit another diff after I've written one.  :)

REVISION DETAIL
  https://reviews.facebook.net/D10599

To: JIRA, kevinwilfong, sindheeraj, Mrrrgn
, [~mrrrgn] Feel free to mark jira as Patch Available, once you have added the test case.]