[I think this patch needs to be updated, it's not applying cleanly for me on trunk currently.

However, that said, one more fix is required for this patch - it brings in yammer which brings in a second version of slf4j, which causes two slf4j jars present in the hive/lib directory, which causes other commands like pig --useHCatalog to fail as an integration point.

It needs the yammer dependency in hbase-handler/ivy.xml additionally patched as follows:

{noformat}
-    <dependency org="com.yammer.metrics" name="metrics-core" rev="${metrics-core.version}"/>
+    <dependency org="com.yammer.metrics" name="metrics-core" rev="${metrics-core.version}">
+      <exclude org="org.slf4j" module="slf4j-api"/><!--causes a dual slf4j presence otherwise-->
+    </dependency>
{noformat}
, Rebased and updated as suggested by [~sushanth]. Thanks for the feedback!, Latest stable hbase version according to hbase.apache.org is 0.94.6.1 Shall we update to that ?, [~ashutoshc], that's a good idea. Let me update and test the patch., Upgrade to 0.94.6.1, Couple of comments:

* protobuf jar is already pulled in via ql. I think we don't need to declare it here. Transitive dependency should take care of it.
* file:// vs file:/// whats the reason for that? Can you test this on windows? I remember last time we had trouble with hbase integration on windows for which this thing was related., bq. protobuf jar is already pulled in via ql. I think we don't need to declare it here. Transitive dependency should take care of it.

Done.

bq. file:// vs file:/// whats the reason for that? Can you test this on windows? I remember last time we had trouble with hbase integration on windows for which this thing was related.

You need the three slashes especially on windows. The RFCs require "///" (two for the authority, one to separate host from path). When you don't have a host that leaves "file:///<path>". On unix you typically get away with two, but on windows ("C:...") you need the third.
, +1 will commit if tests pass., Committed to trunk. Thanks, Gunther!, Integrated in Hive-trunk-hadoop2 #170 (See [https://builds.apache.org/job/Hive-trunk-hadoop2/170/])
    HIVE-3861 : Upgrade hbase dependency to 0.94 (Gunther Hagleitner via Ashutosh Chauhan) (Revision 1470568)

     Result = FAILURE
hashutosh : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1470568
Files : 
* /hive/trunk/hbase-handler/ivy.xml
* /hive/trunk/hbase-handler/src/test/org/apache/hadoop/hive/hbase/HBaseTestSetup.java
* /hive/trunk/ivy/libraries.properties
, Integrated in Hive-trunk-h0.21 #2075 (See [https://builds.apache.org/job/Hive-trunk-h0.21/2075/])
    HIVE-3861 : Upgrade hbase dependency to 0.94 (Gunther Hagleitner via Ashutosh Chauhan) (Revision 1470568)

     Result = FAILURE
hashutosh : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1470568
Files : 
* /hive/trunk/hbase-handler/ivy.xml
* /hive/trunk/hbase-handler/src/test/org/apache/hadoop/hive/hbase/HBaseTestSetup.java
* /hive/trunk/ivy/libraries.properties
]