[This patch does a number of things:
# I removed all verbage from the LICENSE file that relates only to things that are part of the binary distribution.  That is the top level LICENSE file is now relevant only for the source release.
# I created a licenses directory where I placed copies of all the licenses for jars included in Hive's binary distribution.  I also placed a NOTICE file in that directory to handle "weak copyleft" licenses such as Mozilla and CDDL, per the instructions at https://www.apache.org/legal/resolved.html
# I changed the binary distribution to include the contents of the new licenses directory.
# I put a notes file in the licenses directory explaining anything I didn't think was obvious.  This will not be distributed with the binary distribution but is intended to guide future committers who are trying to figure out this licenses maze., NO PRECOMMIT TESTS, Forgot to write out contents of the note file before creating the previous patch., Comments:
* We should remove the Jersey, Microsoft, and Dell lines from the NOTICE file. None of them are required. Microsoft and Dell contributed the code directly to the project and Jersey isn't part of the source release.
* I'd suggest using the groupId from the Maven coordinates for each jar (ie. co.cask.tephra instead of tephra) so that it is unambiguous which software is intended.
* Repeating the entire license for each package seems excessive.  I'd think a single copy of each license and a file saying which component uses which license.
* How did you generate the list of dependencies to include?
* I'd propose renaming the "licenses" directory to "binary-package-licenses" since they only impact binary distributions.
* Although it is *really* slow, I'd suggest documenting "mvn project-info-reports:dependencies" as a very useful tool to generate the report for binary licensing., Revisions to previous comments:
* Ok, I reconsidered and like the current license file per referenced library. Largely because the copyright notices are often incorporated in the license.
* You should probably create a NOTICE file for the binary releases, even if it is the template one., bq. We should remove the Jersey, Microsoft, and Dell lines from the NOTICE file. None of them are required. Microsoft and Dell contributed the code directly to the project and Jersey isn't part of the source release.
Done

bq. I'd suggest using the groupId from the Maven coordinates for each jar (ie. co.cask.tephra instead of tephra) so that it is unambiguous which software is intended.
Done.  See binary-package-licenses/README for notes on how I chose the names, since in some cases a license covered a single jar and in some it covered a whole group.

bq. How did you generate the list of dependencies to include?
I looked through the binary release and made sure I had a license for every jar in the package.

bq. I'd propose renaming the "licenses" directory to "binary-package-licenses" since they only impact binary distributions.
Done.

bq. You should probably create a NOTICE file for the binary releases, even if it is the template one.
There's already a NOTICE file in the binary-package-licenses directory, with some non-standard stuff in there.  Were you suggesting something else?
, +1 This looks good and is an improvement over the current ones., Patch committed, Hello [~alangates] and [~owen.omalley], sorry to trouble you. With this patch, when i run 
{code}
mvn clean apache-rat:check
{code}
on master (or 2.3 branch)
I got the following errors:
{code}
17 Unknown Licenses

*******************************

Unapproved licenses:

  binary-package-licenses/asm-LICENSE
  binary-package-licenses/com.google.protobuf-LICENSE
  binary-package-licenses/com.ibm.icu.icu4j-LICENSE
  binary-package-licenses/com.sun.jersey-LICENSE
  binary-package-licenses/com.thoughtworks.paranamer-LICENSE
  binary-package-licenses/javax.transaction.transaction-api-LICENSE
  binary-package-licenses/javolution-LICENSE
  binary-package-licenses/jline-LICENSE
  binary-package-licenses/org.abego.treelayout.core-LICENSE
  binary-package-licenses/org.antlr-LICENSE
  binary-package-licenses/org.antlr.antlr4-LICENSE
  binary-package-licenses/org.antlr.stringtemplate-LICENSE
  binary-package-licenses/org.codehaus.janino-LICENSE
  binary-package-licenses/org.jamon.jamon-runtime-LICENSE
  binary-package-licenses/org.json-LICENSE
  binary-package-licenses/org.mozilla.rhino-LICENSE
  binary-package-licenses/sqlline-LICENSE

*******************************
{code}

Right now this is blocking 2.3 release. (I believe it will block 2.2 as well as it makes rat check broken).

Shall we revert this patch or do something else? Thanks!, All related JIRAs closed., [~alangates], i tried master and 2.3 just now. However ,the same problem still remains..., Ah, I forgot to modify RAT to tell it not to pay attention to these.  I'll open a separate issue for that., Created HIVE-16504 to deal with the rat issue.]