[This is either a bug in the documentation or the actual windowing logic is broken. 

Excluding the windowing clauses avoid the error:

hive> SELECT a, LEAD(a) OVER (PARTITION BY b ORDER BY C) FROM lag_test;

Using LAST_VALUE instead of LEAD avoids the error:

hive> SELECT a, LAST_VALUE(a) OVER (PARTITION BY b ORDER BY C ROWS BETWEEN CURRENT ROW AND 1 FOLLOWING) FROM lag_test;

But haven't been able to get the LEAD/LAG to work when specifying the windowing clause. The results using LEAD/LAG without the windowing clause are what I needed. The documentation through me off., Yes Lead/Lag invocations don't support a  Window.
The following functions are supported in the Over clause, but don't support a Window:
- the Ranking functions: Rank, NTile, DenseRank, CumeDist, PercentRank
- Lead and Lag functions.
, The wikidoc says this: 

{quote}
OVER with a window specification. Windows can be defined separately in a WINDOW clause. Window specifications support these standard options:
{code}
ROWS ((CURRENT ROW) | (UNBOUNDED | [num]) PRECEDING) AND (UNBOUNDED | [num]) FOLLOWING
{code}{quote}

Is that wrong?  I added [~rhbutani]'s information after that, but might have mangled the concept so please review.

Quick ref:

* [LanguageManual -- Windowing and Analytics | https://cwiki.apache.org/confluence/display/Hive/LanguageManual+WindowingAndAnalytics]
, It appears to be bad documentation. With LAG/LEAD, use parameters in the function instead.

For example, the following appears to work correctly:

LAG(my_field, 1, 0) OVER (ORDER BY b) AS lag_1_month_ago,
LAG(my_field, 12, 0) OVER (ORDER BY b) AS lag_12_months_ago, The documentation for LEAD and LAG still needs to be reviewed and improved (with syntax details):

* [Windowing and Analytics Functions | https://cwiki.apache.org/confluence/display/Hive/LanguageManual+WindowingAndAnalytics]
** [Enhancements to Hive QL | https://cwiki.apache.org/confluence/display/Hive/LanguageManual+WindowingAndAnalytics#LanguageManualWindowingAndAnalytics-EnhancementstoHiveQL]
** [LEAD using default 1 row lead and not specifying default value | https://cwiki.apache.org/confluence/display/Hive/LanguageManual+WindowingAndAnalytics#LanguageManualWindowingAndAnalytics-LEADusingdefault1rowleadandnotspecifyingdefaultvalue]
** [LAG specifying a lag of 3 rows and default value of 0 | https://cwiki.apache.org/confluence/display/Hive/LanguageManual+WindowingAndAnalytics#LanguageManualWindowingAndAnalytics-LAGspecifyingalagof3rowsanddefaultvalueof0]

Once that is done, this JIRA issue can be closed.]