[The 2nd issue is by design. Having partitions like that for Hive is not supported for regular tables.
It's assumed that data is managed by Hive and so Hive deletes the directory when it's dropped... for the case where Hive should not manage the data, an external table should be used.
The first one does look like it could be a bug for external tables, but again for regular tables such a use case is not supported., I have heard about users taking advantage of having multiple partitions pointing to the same location. For example with a table that is partitioned by date it is common to create an extra partition called 'latest' and point it to another partition's location and change the location once new partitions are introduced.
I feel that considering this pattern is used in production it should be guaranteed that the queries on these partition return consistent results. i.e. the listing of partitions shouldn't show a partition that actually doesn't exist anymore., Hive metadata is source of truth for managed tables... in fact recently Hive is moving even further in that direction (such as with ACID, where what is on disk doesn't matter for metadata at all, and only ACID state in metastore matters; or with stats-based queries, where Hive assumes for managed tables that all data changes are made thru Hive, and can be accounted for to update or at least invalidate the stats).
There are features that cover various scenarios like the ones you mention (e.g. views, materialized views, or finally external tables where Hive makes no assumptions about data).
Pointing partitions to the same directory is simply not supported, and it generally works only by accident - i.e. as long as deletes are not involved; it could perhaps be supported, but it needs to be done as an explicit feature (symlink partitions?). Even comparing the JIRA description to the "latest" partition use case, for example, shows semantic discrepancy - for the j=1 and j=2 example, you want the same directory to be read twice for sum(), but if you have a "latest" partition you wouldn't want it double counted with the actual date partition. So there needs to be some explicit semantics that Hive needs to be aware of, for this to work.

cc [~ashutoshc] for more context., Thanks for your explanation [~sershe]!
 I have the feeling that since people use this technique in production it would make sense to start a conversation of how to make this supported in some way even if it's an abuse of the available functionalities. And I would also include dropping these special partitions in this conversation. If it ends up as a feature request it's totally fine for me.


 +Showing data when multiple partitions share the same location:+
 Here I see 2 approaches:

1) Show the same data as many times as the number of partitions we have pointing on that location. In addition, a sum() should also take this multiplication into account. 

2) Show a particular line of data only once no matter how many partitions share this same data. sum() should also follow this approach. It's also an interesting question which partition should we pick in this case to show e.g. for a 'select *'. I have no preference here other than making this deterministic.

 

+Dropping partitons when multiple partitions share the same location+

Here I think it's fine to drop the folder for the partition. Comparing to the current behaviour my only ask here would be to don't show the other partitions pointing to the deleted folder to appear as valid partitions e.g. when a 'show partitions' is invoked or any other system asks the list of valid partitions.

 

What do you think, does this make sense?, When you drop a partition like this it would also be an option to show an error to the user saying that the partition can't be dropped as that would also affect other partitions.]