[Attaching patch., +1 (non-binding)
Looks good me, Another non-binding +1 .
(do non-binding +1's add up :) )
, We shouldn't let people instantiate malformed HiveConnection objects. Please make the HiveConnection constructor private and add static builder methods to HiveConnection (e.g. HiveConnection.newConnection(String url, Properties info)) that validate the input URL and return null if it's invalid. Please also relocated acceptsURL() to HiveConnection and make it private. Thanks., bq. Please also relocated acceptsURL() to HiveConnection and make it private
acceptsURL is part of the java.sql.Driver interface, so it is needed in HiveDriver

bq. We shouldn't let people instantiate malformed HiveConnection objects. Please make the HiveConnection constructor private and add static builder methods to HiveConnection
This change does not makes that possible . When users try to create it using Driver.connect(url,info), they will get a null value.
HiveConnection created using constructor directly will also throw an exception. To prevent users from creating/using HiveConnection directly, we should make that class package private. I think we should do that for all the Hive* subclasses of the java.sql.* classes. But that change is not directly related to this issue.
 , [~cwsteinbach] Thejas is right about acceptsURL as part of the java.sql.Driver interface. I also prefer the simple change to fix this simple issue, and leave the package visibility changes to another JIRA. What do you think?, Sounds good to me. +1.

I don't have access to a build farm so I'll leave the testing and commit work to someone else., marking as patch available, so that it gets to the attention of other committers.
, running test, Passed all tests except TestSemanticAnalysis in hcatalog but it's not related with this patch., Committed to trunk. Thanks Richard Ding for authoring and Carl Steinbach for a review, This issue has been fixed and released as part of 0.12 release. If you find further issues, please create a new jira and link it to this one., Broken by fix for HIVE-4802.  Issue reopened as HIVE-6363.]