[ping, Whew, this has been waiting a long long time.  I'll get to it right after HIVE-6586 (HiveConf.java fixes), which is needed for the 0.14.0 release.

Thanks for reminding me, [~eugene.koifman]., Done:  *templeton.hadoop.queue.name* is documented in the wiki here:

* [WebHCat Configuration -- Configuration Variables | https://cwiki.apache.org/confluence/display/Hive/WebHCat+Configure#WebHCatConfigure-ConfigurationVariables]

But while doing this I noticed a few other issues.

# These are not documented in the wiki:
#*   templeton.python
#*   templeton.sqoop.path
#*   templeton.mapper.memory.mb
# These are not documented but their defaults suggest they're 0.14.0 additions, so presumably they'll be documented for another JIRA ticket:
#*   templeton.hive.home
#*   templeton.hcat.home
# These are documented and exist in AppConfig.java, but they aren't in webhcat-default.xml:
#*   templeton.kerberos.secret
#*   templeton.kerberos.principal
#*   templeton.kerberos.keytab
# These still have 0.11.0 defaults in webhcat-default.xml:
#*   templeton.pig.path
#*   templeton.hive.path
# For templeton.controller.mr.child.opts, webhcat-default.xml has more information than the wikidoc's simple description:  "Java options to be passed to WebHCat controller map task."  Should the wiki include the extra information?
#*     The default value of mapreduce child "-Xmx" (heap memory limit)
        might be close to what is allowed for a map task.
        Even if templeton  controller map task does not need much 
        memory, the jvm (with -server option?)
        allocates the max memory when it starts. This along with the 
        memory used by pig/hive client it starts can end up exceeding
        the max memory configured to be allowed for a map task
        Use this option to set -Xmx to lower value

Some of those might be non-issues.  Do we need a new JIRA ticket for any of them?, 1. sqoop requires doc in general: tracked in HIVE-6940 - it would be good to document this
2. these are not new - these have been there always I believe
3. these are needed only if you are configuring secure env, i.e. there are no useful defaults
4. we usually update these to current version in the release branch once it's cut
, Adding TODOC14 label just as a reminder that the defaults for *templeton.pig.path* & *templeton.hive.path* still need to be updated in webhcat-default.xml.  This could go in a separate JIRA ticket, but keeping it with the discussion seems like a good idea.

In today's branch-0.14, *templeton.pig.path* & *templeton.hive.path* values have obsolete version numbers in these files (excluding old xml doc files):

* hcatalog/webhcat/svr/src/main/config/webhcat-default.xml
* hcatalog/src/test/e2e/templeton/deployAndTest.pl

Otherwise, this ticket can be closed because *templeton.hadoop.queue.name* has been documented in the WebHCat Configuration wikidoc (see link two comments back)., HIVE-8807 will fix the obsolete default values.]