[This seems to happen because we use the same SessionState class the cli is using which is now including some temporary output files and history file references.
It's rather trivial to remove the SessionState from the jdbc driver to make it work again (just tried this a few minutes ago). We currently have a JdbcSessionState which extends the SessonState but I don't see a need for the JdbcSessionState either. It seems to be there as a placeholder but is not actually used. , Removing SessionState so the jdbc works correctly on windows., https://reviews.apache.org/r/513/, Bennie, do you know what changes in SessionState causes JDBC failed on Windows? 

We recently committed HIVE-818 which changes HiveServer and some behavior on how to pass End-of-file from the server side to the client side. Previously server just send an empty string and now server throws an HiveServerException with ErrorCode = 0. I think that may be the reason. Can you try your test case with and without HIVE-818 to verify?, Yes it was this code block:

      try {
        File tmpFile = File.createTempFile(sessionID, ".pipeout", tmpDir);
        tmpFile.deleteOnExit();
        startSs.setTmpOutputFile(tmpFile);
      } catch (IOException e) {
        throw new RuntimeException(e);
      }

So you are correct it's related to changes from HIVE-818., I think the problem is that the tmpDir by default is /tmp/<user.name>/, specified by hive.querylog.location. Bennie, I think if you set hive.querylog.location to be something like 'c:\' on Windows, it should work. Can you try that?

The JdbcSessionState was introduced in the very first version of the JDBC driver (HIVE-48). It is not used but I guess the reason for it to be able to set session level states for the JDBC connection. I'm OK removing it, but not sure about others' opinion., Yes setting hive.querylog.location makes it work.

At the very least we should remove the "extends SessionState" since it introduces a link to the hive server code which makes no sense at this point in time. However I have a preference for removing it all together since it currently adds no value.  On the jdbc side I would expect the HiveConnection to hold the state which it is actually doing right now.

, Sounds reasonable to me. 

Raghu, what do you think?, New patch because of merge from HIVE-1815., New patch because of changes from HIVE-2062, Any chance in getting this committed :) This is rather annoying for windows users., +1. Will commit if tests pass., Committed to trunk and 0.7.1. Thanks Bennie!]