[hey - i think this is worth fixing even though the workaround is clear. just looks kind of silly and is trivial to fix., trying to avoid the wrath of the Ashish, Thanks soooooooooo much!!, what is the work around exactly? OVERWRITE?, correct solution for HIVE-718 should fix this issue as well or make it unsupported., Including a patch that renames the staging files if it's noticed that they're in conflict with pre-existing files., Hi Kirk,

Thanks for the contribution. Can you add a simple test case with your patch?

Ashish, Cancelling the patch because of a missing test case. Krik, would be great if you can resubmit with the test case. Otherwise the code looks fine to me.

Ashish, Here is a resubmission of the patch with a CLI-based unit test.

Let me know what else needs to be addressed.

Thanks!, Patch attached., Looks good - I will start the tests, svn patch, The code changes looked good, but the patch does not compile - mostly simple errors due to the new trunk code.

Also, it would be better to have a test like this:


drop table tst_src1;
create table tst_src1 like src1;
load data local inpath '../data/files/kv1.txt' into table tst_src1 ;
select count(1) from tst_src1;
load data local inpath '../data/files/kv1.txt' into table tst_src1 ;
select count(1) from tst_src1;
drop table tst_src1;



We should not change src1, Namit - is there a DDL command to list the files inside the location? It would be great to see the renamed file show up in a describe extended tst_src1 or something.

Also - do you want *me* to make the changes or someone else?, Please go ahead make the change. 
And it will be perfect if you can upload a svn compatible patch (can be applied cleanly with "patch -p0 <" in a svn checkout)., @Kirk, please go ahead and make the change.

Yongqiang was just trying to get an svn compatible patch from your patch, Patch based against latest trunk from SVN., v3 of patch includes Namit's suggested test case and rebased against SVN trunk., +1, Committed. Thanks Kirk, Hello Namit/Kirk/He Yongqiang,

I was evaluating this defect, but it seems it is incomplete(falling short) of its cause.
It should also work fine for queries like

LOAD DATA INPATH './kv2.txt' INTO TABLE tst_src1;

But unfortunately :-( it is failing, giving null pointer exception in copyFiles() method [Hive.java]. I tested it against Hive0.7 snapshot of the latest build.

The difference between the query present in the test case and the one I mentioned   is the Path from which kv2.txt is fetched, the source path in former is a hdfs temp directory(say /tmp/hive-root/2097947077/10000 under which kv2.txt is present) whereas in the later it is a hdfs file which is being actually referred. 

So the changes i.e. renaming done by checkPaths() method to avoid conflict is not visible outside it's scope ;i.e. not detected by fs.listStatus() where in actual the renamed file(say /user/root/kv2.txt_copy_1) is moved to tst_src1 warehouse (say /user/hive/warehouse/tst_src1).

Kindly confirm, so that I can raise a new bug or re-open the existing one., @Mohit: Please open a new ticket for this issue. Thanks., This is very closely related to, but not the same as, HIVE-1996. This bug specifically pertains to {{LOCAL}} files while HIVE-1996 is for non-{{LOCAL}} files.]