[[~vikram.dixit] I'd like to get this into 0.14, as it produces wrong results.  I should have a patch in a few hours., This patch moves the encoding of the transaction information from runInternal to compile., previously, locks were acquired 1st, then valid transaction list computed.
Now the order is reversed.  So now it's possible that txn list is computed, then a new txn (on a resource in in this TX) runs, then locks are acquired.  I think, strictly speaking this is a race condition - for example a compactor run may sneak in here.  Does this seem like an issue? 

Does hive cache query plans?  If so, it will need to be invalidated when valid txn list changes, bq. So now it's possible that txn list is computed...
If another txn runs between when a query generates its txn list and when it acquires locks that's fine because this txn won't see the results of that txn.  I think this is more reasonable then having the query wait and generate its txn state after locks, because that makes the results of the query variable based on when locks are obtained instead of when it is submitted.

(Note that this issue exists no matter what.  Even once locks are acquired it may take some time for the engine (Tez or MR) to submit the job.  Also, once we support cross query transactions we'll have multiple queries where we are acquiring new sets of locks.)

If the compactor runs between when the query gets its txn list and when it obtains locks we should still be fine.  By definition the compactor does not change the set of valid data.  Some txns listed as aborted in the query's list may now be removed from the file, but that's not a problem.

Have I missed anything?

bq. Does hive cache query plans? 
Not at the moment., +1 for 0.14, You are right.

+1, 

{color:green}Overall{color}: +1 all checks pass

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12672115/HIVE-8311.patch

{color:green}SUCCESS:{color} +1 6379 tests passed

Test results: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/1062/testReport
Console output: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/1062/console
Test logs: http://ec2-174-129-184-35.compute-1.amazonaws.com/logs/PreCommit-HIVE-TRUNK-Build-1062/

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12672115, Patch checked into trunk and branch.  Thanks Eugene for the review., This has been fixed in 0.14 release. Please open new jira if you see any issues.
]