[Attaching patch since arc diff isn't working for me

--
tundra:hive sush$ arc diff --jira HIVE-3221 
Exception
Parse Exception: Expected a hunk header, like 'Index: /path/to/file.ext' (svn), 'Property changes on: /path/to/file.ext' (svn properties), 'commit 59bcc3ad6775562f845953cf01624225' (git show), 'diff --git' (git diff), or '--- filename' (unified diff).

   >>>        1   
--, Now getting a new arc error on starting anew:

--
tundra:hive sush$ arc diff --jira HIVE-3221 
PHP Fatal error:  Call to undefined method ArcanistGitAPI::amendGitHeadCommit() in /Users/sush/dev/hive.git/.arc_jira_lib/arcanist/ArcJIRAConfiguration.php on line 169

Fatal error: Call to undefined method ArcanistGitAPI::amendGitHeadCommit() in /Users/sush/dev/hive.git/.arc_jira_lib/arcanist/ArcJIRAConfiguration.php on line 169
--

Still, the patch attached has a unit test and is a fairly straightforward patch. Hopefully it can be reviewed easily., Can you please give an example of a query that would cause this?, Also have you considered the column alias is _c not _col, we can possibly determine this from HiveConf
, Can you address Edward's comments ?, I don't have a specific query that can trigger off the top of my head - looking at ql.parse.SemanticAnalyzer indicates that this problem could occur when formulating a union plan. 

Essentially, reading "_col12" maps to "2" because it only reads the last character.

The sequence of events that led to my encountering this issue is in HCATALOG-436 when testing with the JsonSerDe (any named-column based format, really) and having more than 10 columns. I wanted to read an internal column name(as generated by a CTAS operation) and be able to figure out position and noticed that there are a pair of functions in HiveConf for exactly this purpose : getPositionFromInternalName and getColumnInternalName.

--

As to the case of having a column alias being "_c" and not "_col", HiveConf.java seems to indicate a hardcoded "_col" in getColumnInternalName, so I retained that. Do you have any cases where it's "_c" ?

Thanks!, +1. Looks good. Will commit if tests pass., Committed to trunk. Thanks, Sushanth!, Ashutosh. I did not want to see this issue get committed without a positive or negative test. We have a fix but no test coverage., @Ed,
There is a unit test in the patch which fails without the fix., Integrated in Hive-trunk-h0.21 #1558 (See [https://builds.apache.org/job/Hive-trunk-h0.21/1558/])
    HIVE-3221 : HiveConf.getPositionFromInternalName does not support more than sinle digit column numbers (Sushanth Sowmyan via Ashutosh Chauhan) (Revision 1364038)

     Result = FAILURE
hashutosh : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1364038
Files : 
* /hive/trunk/common/src/java/org/apache/hadoop/hive/conf/HiveConf.java
* /hive/trunk/common/src/test/org/apache/hadoop/hive/conf/TestHiveConf.java
, Integrated in Hive-trunk-hadoop2 #54 (See [https://builds.apache.org/job/Hive-trunk-hadoop2/54/])
    HIVE-3221 : HiveConf.getPositionFromInternalName does not support more than sinle digit column numbers (Sushanth Sowmyan via Ashutosh Chauhan) (Revision 1364038)

     Result = ABORTED
hashutosh : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1364038
Files : 
* /hive/trunk/common/src/java/org/apache/hadoop/hive/conf/HiveConf.java
* /hive/trunk/common/src/test/org/apache/hadoop/hive/conf/TestHiveConf.java
, This issue is fixed and released as part of 0.10.0 release. If you find an issue which seems to be related to this one, please create a new jira and link this one with new jira.]