[FYI [~jcoffey] [~xuefuz] [~szehon], This patch involves deleting file and adding new files (mv),  and there is no instruction to delete/add if using git in https://cwiki.apache.org/confluence/display/Hive/HowToContribute; however my patch is using git diff, if that does not work, I will resubmit a patch using svn.

https://reviews.apache.org/r/19896/, Shouldn't need to use svn for that, you can try 'git add'/ 'git rm'.  

I left couple comments on the rb for consideration.  Also when you are ready, click 'submit patch' to trigger the pre commit test., In my opinion, it is better to change the javastringobjectinspector's Ctor to protected , so we can keep all the parquet inspector in the same package.

Also it would be good to add a q-test for this case. You can write one following the example of "parquet_create.q" and then generate and verify the result using the following command (maven version) on your q-test file: [https://cwiki.apache.org/confluence/display/Hive/HiveDeveloperFAQ#HiveDeveloperFAQ-HowdoupdatetheoutputofaCliDrivertestcase?|https://cwiki.apache.org/confluence/display/Hive/HiveDeveloperFAQ#HiveDeveloperFAQ-HowdoupdatetheoutputofaCliDrivertestcase?], If we change javastringobjectinspector's Ctor to be protected, that should work fine for 0.13.   But when we backport this jira to parquet-hive, it will break unless we also make the same change in hive 0.12 and hive 0.10, right?
, Yea thats right, do you think it would be a huge issue though if its a hive 0.13 only fix?, The only issue I see is that parquet-hive cannot backport this jira., OK I'm not a huge fan of moving that inspector to a unnatural place because it will be stuck like that going forward in hive, but we can let others also chime in.  

If its really important to support for earlier hive, maybe one option is to back-port a different version of the patch into parquet?, If we can be flexible by back-porting a different version of the patch into parquet-hive, that would be great!

I like to keep parquet related stuff in parquet package as well., When I add a qtest, I realized that this bug is resolved with this patch in hive-trunk. But it is still a bug in Hive-0.11 now.

Digging a little bit, I found that when Partition SerDe and Table SerDe are different, hive 0.11 would try to convert object inspector as long as they are not equals; however, in hive-trunk (0.13 or 0.14), if output ObjectInspector's all fields are all settable, there is no conversion happening, hence the bug presented in this jira does not show in hive-trunk any more.

However, I do think that ParquetStringInspector should be subclass of JavaStringObjectInspector, so that Hive 0.11 would have no problem as well.

related Hive Jiras:

HIVE-5202
HIVE-5394

------------------- HIVE-trunk (0.13, 0.14 etc) code snippet for ObjectInspectorConverters -------------------------
    // 1. If equalsCheck is true and the inputOI is the same as the outputOI OR
    // 2. If the outputOI has all fields settable, return it
    if ((equalsCheck && inputOI.equals(outputOI)) ||
        ObjectInspectorUtils.hasAllFieldsSettable(outputOI, oiSettableProperties) == true) {
      return outputOI;
    }   

------------------- HIVE-0.11 code snippet for ObjectInspectorConverters -------------------------
    // If the inputOI is the same as the outputOI, just return it
    if (inputOI.equals(outputOI)) {
      return outputOI;
    }   , In my previous comment, I mean that this bug is not reproducible in hive trunk due to patches from HIVE-5202 and HIVE-5394.

But the patch introduced in this Jira is still an enhancement.

Btw, how can I edit my own previous comment once submitted?, add a new qtest, 

{color:green}Overall{color}: +1 all checks pass

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12638885/HIVE-6785.2.patch.txt

{color:green}SUCCESS:{color} +1 5549 tests passed

Test results: http://bigtop01.cloudera.org:8080/job/PreCommit-HIVE-Build/2153/testReport
Console output: http://bigtop01.cloudera.org:8080/job/PreCommit-HIVE-Build/2153/console

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12638885, +1 (non-binding) , thanks for adding the q-test and address comments.

FYI [~brocknoland], Hi,

LGTM except I see we are using the parquet... class names when creating a table, which are soon to be removed., Good catch Brock, I missed that., Hi [~brocknoland], 

are you suggesting using:

ALTER TABLE parquet_mixed_fileformat SET FILEFORMAT PARQUET;  ( after I execute this statement, the table become "not found")

instead of:

ALTER TABLE parquet_mixed_fileformat set SERDE 'parquet.hive.serde.ParquetHiveSerDe';
ALTER TABLE parquet_mixed_fileformat
     SET FILEFORMAT
     INPUTFORMAT 'parquet.hive.DeprecatedParquetInputFormat'
     OUTPUTFORMAT 'parquet.hive.DeprecatedParquetOutputFormat';

Please advise., Hi Tonjie, these are deprecated now and will be removed.  See the discussion on HIVE-6757, for the current state.

Use 'org.apache.hadoop.hive.ql.io.parquet.serde.ParquetHiveSerDe',
'org.apache.hadoop.hive.ql.io.parquet.MapredParquetInputFormat',
'org.apache.hadoop.hive.ql.io.parquet.MapredParquetOutputFormat', replace deprecated parquet class., 

{color:red}Overall{color}: -1 at least one tests failed

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12639834/HIVE-6785.3.patch

{color:red}ERROR:{color} -1 due to 3 failed/errored test(s), 5615 tests executed
*Failed tests:*
{noformat}
org.apache.hadoop.hive.cli.TestMinimrCliDriver.testCliDriver_infer_bucket_sort_dyn_part
org.apache.hadoop.hive.cli.TestMinimrCliDriver.testCliDriver_reduce_deduplicate
org.apache.hadoop.hive.cli.TestMinimrCliDriver.testCliDriver_schemeAuthority2
{noformat}

Test results: http://bigtop01.cloudera.org:8080/job/PreCommit-HIVE-Build/2221/testReport
Console output: http://bigtop01.cloudera.org:8080/job/PreCommit-HIVE-Build/2221/console

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
Tests exited with: TestsFailedException: 3 tests failed
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12639834, [~szehon], are those failure transient? the new patch only changes the parquet class, which has nothing to do with these test cases., Yea, it doesnt look related to this patch., Looked at the new patch, looks fine with me, +1 (non-binding) +  [~brocknoland] , +1, Committed to trunk! Thank you for the contribution!

Thank you Szehon for the review!, This has been fixed in 0.14 release. Please open new jira if you see any issues.
]