[I think the trunk version has no such problems.
trunk has unzipped this jars and repack them into hive-exec.jar.
[~caofangkun] IMHO, you can use "grep -nC5 unzip ql/build.xml" to look into the logic.
And you can put mysql-jdbc-connector.jar in the HIVE_AUX_JARS_PATH.
For these reasons, shall we mark this issue "Won't Fix"?, HIVE-3393  brought in  Jackson library, but not repack the new four jackson*.jar into hive-exec-*.jar , Yes, I think a repack is necessary., Add patch, Only jackson-core-asl-1.8.8.jar
 and  jackson-mapper-asl-1.8.8.jar
need to be packed in., I just upgraded to hive 0.10 and I had to but these in the auxlib. 

We REALLY need to start using jar jar here. The bigger hive-exec gets the more painful its gets to build udfs. In particular if a udf or input format uses jackson the target library needs to match the version. This is already a problem because things like apache-commons get built into hive-exec . So if ANY other project you are trying to use leverages commons you are forced to use hive's version in some cases., +1, Committed to trunk. Thanks, caofangkun!, Integrated in Hive-trunk-hadoop2 #223 (See [https://builds.apache.org/job/Hive-trunk-hadoop2/223/])
    HIVE-4562 : HIVE3393 brought in Jackson library,and these four jars should be packed into hive-exec.jar (caofangkun via Ashutosh Chauhan) (Revision 1488744)

     Result = ABORTED
hashutosh : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1488744
Files : 
* /hive/trunk/ql/build.xml
, Integrated in Hive-trunk-h0.21 #2126 (See [https://builds.apache.org/job/Hive-trunk-h0.21/2126/])
    HIVE-4562 : HIVE3393 brought in Jackson library,and these four jars should be packed into hive-exec.jar (caofangkun via Ashutosh Chauhan) (Revision 1488744)

     Result = FAILURE
hashutosh : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1488744
Files : 
* /hive/trunk/ql/build.xml
, This issue has been fixed and released as part of 0.12 release. If you find further issues, please create a new jira and link it to this one.]