[This is a patch for HIVE-2011 and HIVE-2010:

* Change the name of the upgrade scripts from 'upgrade-x.y.z.<dbname>.sql' to 'upgrade-x.y.z-to-a.b.c.<dbname>.sql'
* Splits the contents of the upgrade-x.y.z.<dbname>.sql files into individual SQL files corresponding to each Hive ticket.
* Fixes HIVE-2011 by rearranging the order of DDL statements in 004-HIVE-1364.<dbname>.sql
, I gave this one a try using MySQL.  First, I started with an 0.6 build and got it to autocreate a schema there.  (I don't know of a way to force creation of all tables, so the schema was incomplete.)

Then I applied this patch to 0.7, built there, and ran the upgrade script.  It failed because the PARTS table hadn't been created in 0.6 (I had only created an unpartitioned table there).  This is fine; the only part which could be improved is that the script did not stop after the errors, so the tail looks like this:

{noformat}
...
Query OK, 0 rows affected (0.00 sec)

ERROR 1005 (HY000): Can't create table './jsichi_hive_upgrade_test/PART_PRIVS.frm' (errno: 150)
ERROR 1005 (HY000): Can't create table './jsichi_hive_upgrade_test/PART_COL_PRIVS.frm' (errno: 150)
+---------------------------------------------------------+
|                                                         |
+---------------------------------------------------------+
| Finished upgrading MetaStore schema from 0.6.0 to 0.7.0 | 
+---------------------------------------------------------+
1 row in set, 1 warning (0.00 sec)
{noformat}

Should we change the README instructions to use something which will abort on exception?  Otherwise, for an error in the middle of a long upgrade sequence, the administrator might miss it and think all was well.
, Updated the patch with more extensive instructions and official schemas for Hive 0.3.0 through 0.7.0
, HIVE-2011.3.patch.txt: 

* Fixed errors in Derby schema scripts caused by accidentally picking up wrong DataNucleus (and wrong IdentifierFactory) during original schema generation run.
* Added a couple usage notes to the Derby and MySQL READMEs related to the ij and mysqldump utilities.

Testing:
# Created Derby and MySQL schemas for 0.3.0 through 0.7.0 by starting Hive with autoCreateSchema=true.
# Applied hive-schema-x.y.z.xxx.sql scripts to each of the previously created DBs. Verified that these scripts complete without error, and that the resulting DB schemas contain all tables.
# Applied the upgrade scripts to validated 0.5.0 and 0.6.0 DBs for Derby and MySQL, and verified that all scripts complete without error.
# Validated the upgraded DBs by running Hive against the upgraded DB schema with datanucleus.autoCreateSchema=false and datanucleus.validateSchema=true


, @Carl, I ran hive-schema-0.6.0.mysql.sql and two of the tablenames (dbs and types) came out in lowercase; they should be ALLCAPS.

{noformat}
mysql> show tables;
+-------------------------+
| Tables_in_jvs_metastore |
+-------------------------+
| BUCKETING_COLS          | 
| COLUMNS                 | 
| PARTITIONS              | 
| PARTITION_KEYS          | 
| PARTITION_KEY_VALS      | 
| PARTITION_PARAMS        | 
| SDS                     | 
| SD_PARAMS               | 
| SERDES                  | 
| SERDE_PARAMS            | 
| SORT_COLS               | 
| TABLE_PARAMS            | 
| TBLS                    | 
| TYPE_FIELDS             | 
| dbs                     | 
| types                   | 
+-------------------------+
{noformat}
, HIVE-2011.4.patch.txt:

* Fix capitalization of table names in MySQL schema dumps.

@John: I created these schemas using DataNucleus's schematool utility. I think this capitalization issue is actually a bug in DataNucleus.
, HIVE-2011.5.patch.txt:

* Backout whitespace changes to package.jdo (not sure how those slipped in...)
, The latest patch still has lowercase in all of the REFERENCES clauses, e.g.

{noformat}
  CONSTRAINT `SDS_FK1` FOREIGN KEY (`SERDE_ID`) REFERENCES `serdes` (`SERDE_ID`)
{noformat}

This causes inserts to fail.
, Ugh. HFS+'s case insensitivity bites me again: http://dev.mysql.com/doc/refman/5.0/en/identifier-case-sensitivity.html

I'm making the changes right now. Sorry for the inconvenience.
, HIVE-2011.6.patch.txt:

* Fix identifier capitalization issues in MySQL schema scripts.
, Review request: https://reviews.apache.org/r/471/
, Committed to branch and trunk.  Thanks Carl!

p.s. ship it!
]