[This doesn't apply to trunk.  It needs to be rebased.  (specifically TestDriverCurl.pm), There should be some JavaDoc (either on ListDelegator or StatusDelegator) that has a few lines about the design:
What is being tracked for parent job (presumably LauchMapper?), what (if anything) is tracked for child job(s).
While not strictly related to this bug, there should be some comments on what will happen if a user (StatusDelegator) asks for a status of a job he doesn't own.

There are no new tests in this patch.  Is this covered by existing tests?

TempletonControllerJob has
if (childid != null) {                                                                                                                                             
+                JobState childState = new JobState(childid, conf);                                                                                                               
+                childState.setParent(jobid.toString());                                                                                                                          
+                state.close();                                                                                                                                                   
+                state.addChild(childid);                                                                                                                                         
+              }

why is state.close() before state.addChild ?

DeleteDelegaor 
has "String childid = state.getChildId();" which is unused.
Also, wouldn't make sense to wrap killJob() in a try/catch inside the loop so that we cancel as many child tasks as possible?

ListDelegator
JobState state = null;  - this variable is never used and thus it and the try/finally is unused



, Also, StatusDelegator#makeStatus() should be package scoped., with this patch (and one from HIVE-5540) applied I get 1 FAILED and 1 ABORTED test.  test_harnesss_1381798977 has details., Addressing Eugene's review comments., Comments on HIVE-5510-2.patch
build.xml changes concurrency from 5/5 to 1/1.  Why?

TempletonControllerJob.Watcher.run()
This records all child IDs in the parent as a list.  Makes sense.
This also creates a JobState for each child task.  What is purpose of this?
We never (AFAIK) get any notifications from Hadoop when a subtask completes.  When is this JobState (for child task) ever updated?  If not, then why create it?  Conversely, maybe it would be useful to track the state of child task, but I think that would require more changes like registering a callback with JobTracker for each child task that we find.  Don't know whether this is really useful.

DeleteDelegator
it uses System.err for logging.  Why not log4j which will be in webhcat.log with WARN log level

JobState:
getChildId() is never used
, bq. build.xml changes concurrency from 5/5 to 1/1. Why?
That's unintended. Will remove it

bq. TempletonControllerJob.Watcher.run()
bq. This also creates a JobState for each child task. What is purpose of this?
Just for each child know its parent.
bq. We never (AFAIK) get any notifications from Hadoop when a subtask completes. When is this JobState (for child task) ever updated? If not, then why create it? Conversely, maybe it would be useful to track the state of child task, but I think that would require more changes like registering a callback with JobTracker for each child task that we find. Don't know whether this is really useful.
Only the parent field for each each child job is meaningful, we don't track other changes for the child job

bq. DeleteDelegator
bq. it uses System.err for logging. Why not log4j which will be in webhcat.log with WARN log level
Yes, we should, will change.

bq. JobState:
bq. getChildId() is never used
This is used by StatusDelegator. Actually getChildren is never used, but it is there for a while, I don't want to remove it in this patch., if you search the 2nd patch for getChildId, it shows up in 2 places both of which are removed.  So if you apply the patch to current trunk and look for usages of this method, I don't see any., Yes, you are right. And setChildren/setChildren too. Removing all those unused methods., HIVE-5510-4.patch resync with trunk., Patch committed to trunk., This bug fix is documented in the wiki here:

* [GET Jobs -- Curl Command (fields) | https://cwiki.apache.org/confluence/display/Hive/WebHCat+Reference+Jobs#WebHCatReferenceJobs-CurlCommand(fields)]
* [GET Jobs -- JSON Output (fields, Hive 0.12.0 and later) | https://cwiki.apache.org/confluence/display/Hive/WebHCat+Reference+Jobs#WebHCatReferenceJobs-JSONOutput(fields,Hive0.12.0andlater)], [~leftylev] the 1st example (under "JSON Output (fields)") seems to be of the behavior before the bug fix - isn't likely to confuse users.  Should the example be of 'correct' output?
[~daijy] Does that make sense to you?, You're right, and I was confused -- I thought the first example was for Hive 0.11 and earlier, but GET jobs was introduced in Hive 0.12 so why do we even have that section?

Similarly, in "JSON Output (fields, Hive 0.12.0 and later)" the version information isn't needed because the new behavior of the fields parameter came in the same release as GET jobs.

Recommendations:

# Delete the Bug Fix box after the curl command.
# Delete the entire "JSON Output (fields)" section.
# Rename "JSON Output (fields, Hive 0.12.0 and later)" to "JSON Output (fields)".
# Rename the version box "Bug in Hive 0.12" or some such.
# Delete the first sentence in the version box.

* [Curl Command (fields) | https://cwiki.apache.org/confluence/display/Hive/WebHCat+Reference+Jobs#WebHCatReferenceJobs-CurlCommand(fields)]
* [JSON Output (fields) | https://cwiki.apache.org/confluence/display/Hive/WebHCat+Reference+Jobs#WebHCatReferenceJobs-JSONOutput(fields)]
* [JSON Output (fields, Hive 0.12.0 and later) | https://cwiki.apache.org/confluence/display/Hive/WebHCat+Reference+Jobs#WebHCatReferenceJobs-JSONOutput(fields,Hive0.12.0andlater)], I revised the GET jobs wikidoc according to the recommendations in the previous comment:

* [Curl Command and JSON Output (fields) | https://cwiki.apache.org/confluence/display/Hive/WebHCat+Reference+Jobs#WebHCatReferenceJobs-CurlCommand(fields)]]