[

{color:red}Overall{color}: -1 at least one tests failed

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12654371/HIVE-7342.1.patch

{color:red}ERROR:{color} -1 due to 3 failed/errored test(s), 5702 tests executed
*Failed tests:*
{noformat}
org.apache.hadoop.hive.cli.TestMiniTezCliDriver.testCliDriver_dynpart_sort_optimization
org.apache.hadoop.hive.cli.TestMinimrCliDriver.testCliDriver_root_dir_external_table
org.apache.hive.jdbc.miniHS2.TestHiveServer2.testConnection
{noformat}

Test results: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-Build/703/testReport
Console output: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-Build/703/console
Test logs: http://ec2-174-129-184-35.compute-1.amazonaws.com/logs/PreCommit-HIVE-Build-703/

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
Tests exited with: TestsFailedException: 3 tests failed
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12654371, Just trying to understand which apps will load which configs:

- HiveCLI, remote metastore: hive-site
- HiveCLI, embedded metastore: hive-site, metastore-site
- Beeline, embedded mode: hive-site, hiveserver2-site, metastore-site (if embedded metastore)
- Beeline, remote mode: ?
- Metastore Server: hive-site, metastore-site
- HiveServer2, remote metastore (I've heard this is not a recommended configuration?): hive-site, hiveserver2-site
- HiveServer2, embedded metastore: hive-site, metastore-site, hiveserver2-site
, Yes, you are right about the configs used.  The server side config will be also be used when the server is used in an embedded mode.

Regarding: Beeline, remote mode:  - no hive*xml is used in this mode.

, +1, does this have effect on HCatCLI, HCat and WebHCat?  , bq. does this have effect on HCatCLI, HCat and WebHCat?
In remote metatstore mode, there would not be any impact. If embedded metastore is used with any of the above,and hivemeastore-site.xml is in conf dir (or classpath in general), it will add that config as well (overriding any existing params that are redefined).

cc [~sushanth], HCatCLI should mimic HiveCLI in behaviour. WebHCat uses HCatCLI to perform HCat operations if I remember correctly.

HCatIF/HCatOF were designed with an expectation of a remote metastore, but if it behaves the way you suggest, then that's appropriate.

That said, I will admit to having some worries about what happens when a parameter is specified in multiple configs, and what the resolution order winds up being. I would like to look through this patch as well., [~sushanth] Thanks for prompting me to take a closer look at the precedence! I found an issue, here is the updated patch.

HIVE-7342.2.patch - With earlier patch hivemetastore-site.xml would take precedence over hiveserver2-site.xml if embedded metastore is used with hiveserver2, as metastore-site.xml was getting added later. 
With this change HiveConf initialization itself would check if embedded metastore is used and load the hivemetastore-site.xml. This way the order of adding the resources to the Configuration always remains the same.

Patch also adds tests for both embedded and remote metastore mode. 

The order of predendence (later one takes precedence) : 
hive-site.xml -> hivemetastore-site.xml -> hiveserver2-site.xml -> HiveConf.ConfVars set through system properties (same as ones set through -hiveconf cmdline params), 

{color:red}Overall{color}: -1 at least one tests failed

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12655084/HIVE-7342.2.patch

{color:red}ERROR:{color} -1 due to 2 failed/errored test(s), 5721 tests executed
*Failed tests:*
{noformat}
org.apache.hadoop.hive.cli.TestMinimrCliDriver.testCliDriver_schemeAuthority
org.apache.hive.jdbc.miniHS2.TestHiveServer2.testConnection
{noformat}

Test results: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-Build/739/testReport
Console output: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-Build/739/console
Test logs: http://ec2-174-129-184-35.compute-1.amazonaws.com/logs/PreCommit-HIVE-Build-739/

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
Tests exited with: TestsFailedException: 2 tests failed
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12655084, I'm +1 on the .2.patch.

Having said that, I also wanted to bring up one more possible corner case that seems to exist, one that I do not think needs solving(at least not right away - might be worth opening a follow up to declare if a confvar can be overridden by a conf or not), but one that exists anyway.

Consider the case of a hive client, that loads a hive-site.xml, and finds that the metastore uris parameter is blank. Thus, it expects that it is a local metastore operation, and thus, loads hivemetastore-site.xml. In this config, however, say the uris parameter is not blank. Then, at connect time, that hive client will act upon the uris value, which tells it that it is not a local metastore, and connects out to the referred url. However, this hive client has now loaded the metastore conf for other parameters, while still being a remote client that talks to a metastore., Good point. I will add note in release note saying that hive-site.xml should be used to set hive.metastore.uris , as that is what is used to determine if the metastore is going to be used in remote vs embedded mode.
, [~thejas] The patch look fine to me.
Just wondering if it would make sense to further split the metastore config into client (or base) and server. There are common configs like setugi, enableSasl etc that need to be in sync on both client and server. If those are available in a common file, it will be less prone to incompatible configs. The server will load both base and server specific configs, the client will only load the base config.
, bq. The server will load both base and server specific configs, the client will only load the base config.
hive-site.xml is the base config file. It gets loaded by clients and servers. So it would be the right place for such config parameters.

, [~prasadm]
Added a note about that in release note section, so that it can be included in documentation as well.
, I guess treating hive-site as base file should be sufficient. It's unlikely that you will have variety of metastore setups (embedded and remote, or secure and unsecure) in a single deployment. Thanks for updating the release notes!

+1
, Patch committed to trunk.
Thanks for the reviews Jason, Sushanth and Prasad!
, I missed adding some files to svn as part of my first commit, added them now.
, This has been fixed in 0.14 release. Please open new jira if you see any issues.
, Added doc in https://cwiki.apache.org/confluence/display/Hive/AdminManual+Configuration#AdminManualConfiguration-ConfiguringHive
, Is any HCatalog documentation needed?

* [Sushanth's comment above:  "HCatCLI should mimic HiveCLI in behaviour." | https://issues.apache.org/jira/browse/HIVE-7342?focusedCommentId=14055620&page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel#comment-14055620]
* [HCatalog CLI | https://cwiki.apache.org/confluence/display/Hive/HCatalog+CLIhttps://cwiki.apache.org/confluence/display/Hive/HCatalog+CLI], I think the documentation in main hive configuration section is sufficient. There is no separate configuration section in hcat cli document.
, Okay, thanks Thejas.]