[I think the observation is correct, but I think it would be nice to create a test case for this if it's easy., I'd love to but I have no idea how. It's at least three levels deep in the call stack and I have no idea what the code does.

Apparently there are no unit tests to cover this to begin with. One should have been added with HIVE-8168 I guess.

Any ideas?, Oh, and thanks for the confirmation :), My bad. Thats my mistake. There are q file tests for stats annotation but even with that its hard to exactly reproduce many cases. This recently happened with HIVE-8549 as well. These issues crops up when running TPCDS queries and with higher scale factors (200,1000, 3000). Since operator tree will be different when stats are different (ex: mapjoin vs shuffle join) its hard to replicate these test cases with small datasets we have. I have a TPCDS scale 1 factor on my localbox but even with that many issues weren't reproducible. But yeah this if condition is my mistake.

+1, 

{color:red}Overall{color}: -1 at least one tests failed

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12676654/HIVE-8576.1.patch

{color:red}ERROR:{color} -1 due to 2 failed/errored test(s), 6578 tests executed
*Failed tests:*
{noformat}
org.apache.hadoop.hive.cli.TestCliDriver.testCliDriver_annotate_stats_join_pkfk
org.apache.hive.minikdc.TestJdbcWithMiniKdc.testNegativeTokenAuth
{noformat}

Test results: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/1418/testReport
Console output: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/1418/console
Test logs: http://ec2-174-129-184-35.compute-1.amazonaws.com/logs/PreCommit-HIVE-TRUNK-Build-1418/

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
Tests exited with: TestsFailedException: 2 tests failed
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12676654 - PreCommit-HIVE-TRUNK-Build, I don't think the test failures are related to the patch., Since its a trivial patch which doesn't affect other tests. I will get this committed soon. Yes. The test failure is not related. Its fixed in latest trunk., [~vikram.dixit] Can we get this in 0.14?, +1 for 0.14, Committed to trunk and branch-0.14. Thanks [~lars_francke] for the patch!, This has been fixed in 0.14 release. Please open new jira if you see any issues.
]