[Really? What should it be? Any why? How does this apply to deployments outside yours? , Edward, at Yahoo!, we run the thrift server as a standalone metastore server, and there the problem can be handled. The solution is still under investigation but here is the flow of the directory creations and permission settings:
1) Have the real warehouse directory owned by the hive-thrift-server user and let that have 755 permissions.
2) Have a temp warehouse directory for staging the creation of tables/databases, and let that have 777 permissions.
3) When a user issues a create_table/database command, the hive-thrift-server creates the corresponding directory in the temp location. This operation happens as the user in question and the directory ends up getting owned by the user.
4) The hive-thrift-server then moves the directory to the real warehouse directory. This operation is done as the hive-thrift-server user.Since the temp directory has 777 permissions, and the real warehouse directory is owned by the hive-thrift-server user, the move will succeed.

With all the work that has been done in mostly HIVE-1842 & HIVE-1696, the above seems possible.

Granted, this won't work when hive runs in the fat-client mode. So, most likely, we will make the above be based on whether metastore is running in the local mode or not (hive.metastore.local config).

Makes sense ?, Ok thanks that clears it up. This only effects those using hive-server and fat client is exempt. This should not be very difficult. Hive always works in side effect files and then does moves as the last step. So your technique to do elsewhere and then copy in and chown makes sense. +1, Apart from permissions of warehouse dir, ownership of warehouse dir also needs to be fixed. On a fresh install, warehouse directory doesn't get created while metastore server is starting and first client doing any filesystem operation ends up being its owner. We already have checkForDefaultDb(), we similarly need checkForWarehouseDir().]