[The files hive/site/publish/docs/hcat_r0.5.0/readerwriter.html & hive/site/publish/docs/hcat_r0.5.0/readerwriter.pdf should be replaced by the attached html & pdf files.

These new files end with a link to https://svn.apache.org/repos/asf/hive/trunk/hcatalog/core/src/test/java/org/apache/hcatalog/data/TestReaderWriter.java, replacing the previous link to the incubator.  The copyrights in the footers are revised to 2012-2013.

HIVE-4543.1.patch probably isn't useful -- it covers the html & pdf files but only gives the html changes, not the pdf changes.  HIVE-4543.2.patch just covers the html file, in case anyone wants to apply a patch instead of replacing the html file directly., Replace readerwriter.html and readerwriter.pdf in the HCatalog 0.5 docs on the Hive website., Lefty, the change looks good.  But could you please attach the changed .xml file rather than the .html and .pdf files.  Then I can rebuild the docs from that and check in the changes., Here's the changed readerwriter.xml file., A patch version of the changes., Patch _3 checked in.  Thanks Lefty., Integrated in Hive-trunk-hadoop2 #217 (See [https://builds.apache.org/job/Hive-trunk-hadoop2/217/])
    HIVE-4543 Broken link in HCat doc (Reader and Writer Interfaces) (Lefty Leverenz via gates) (Revision 1487654)

     Result = FAILURE
gates : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1487654
Files : 
* /hive/trunk/hcatalog/src/docs/src/documentation/content/xdocs/readerwriter.xml
, Integrated in Hive-trunk-h0.21 #2124 (See [https://builds.apache.org/job/Hive-trunk-h0.21/2124/])
    HIVE-4543 Broken link in HCat doc (Reader and Writer Interfaces) (Lefty Leverenz via gates) (Revision 1487654)

     Result = FAILURE
gates : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1487654
Files : 
* /hive/trunk/hcatalog/src/docs/src/documentation/content/xdocs/readerwriter.xml
, This issue has been fixed and released as part of 0.12 release. If you find further issues, please create a new jira and link it to this one.]