[jdk 9 support is not there yet... see the umbrella:  HIVE-17632
the biggest blocker issues are some hadoop patch; and make tez build/work with jdk9 also - after those we might start building hive....I've had a branch somewhere which had some fixes for hive
https://github.com/kgyrtkirk/hive/tree/jdk9-trial, if you can narrow it down; you might report it to the maven guys...you might have probably found an issue with maven's support of jdk9 ; but please try to use the latest maven / plugins / etc...because they are also constantly improving jdk9 support :D, This works with java 9 deployed as following:

C:\dev\java

standing on this directory

C:\dev\git\hadoop\hive\standalone-metastore\target\classes

with package.jdo

under same

java -classpath C:\dev\git\hadoop\hive\standalone-metastore\target\classes;C:\Users\hadoop\.m2\repository\org\datanucleus\datanucleus-core\5.1.7\datanucleus-core-5.1.7.jar;C:\Users\hadoop\.m2\repository\org\datanucleus\datanucleus-rdbms\5.1.6\datanucleus-rdbms-5.1.6.jar;C:\Users\hadoop\.m2\repository\org\datanucleus\javax.jdo\3.2.0-m8\javax.jdo-3.2.0-m8.jar;C:\Users\hadoop\.m2\repository\org\datanucleus\datanucleus-api-jdo\5.1.4\datanucleus-api-jdo-5.1.4.jar org.datanucleus.enhancer.DataNucleusEnhancer -v -api JDO C:\dev\git\hadoop\hive\standalone-metastore\target\classes\org\apache\hadoop\hive\metastore\model\MDatabase.class

DataNucleusEnhancer version 5.1.6 ( latest release in the repository ) invoked manually works without issues, too. In other words, as far as code / tool goes, enhancer works. Takes a bit of an effort to learn the infrastructure to get to the details. Feel free to take over at any time, since I can be pulled into something else at any moment. For the moment assigning to self., After adjusting a few details to complete switch to Java 9 had to modify parent pom.xml.
 # add dependency to javax.annotation-api
 # switch to javac compiler, At the moment I can only make it work by replacing standalone-metastore pom.xml datanucleus-maven-plugin block. I have attached changed pom.xml with name standalone-metastore.pom.xml.working.

********

Initial thought was to incrementally change property of current plugin datanucleus-maven-plugin

<metadataIncludes>${project.build.directory}/classes/org/apache/hadoop/hive/metastore/model/*.class</metadataIncludes>

but at the moment it either doesn't work, or maven incorrectly reports no work done, message reads:

"[WARNING] No files to run DataNucleus tool 'org.datanucleus.enhancer.DataNucleusEnhancer'"

Thought not ideal, it works, so, I am unblocked. I will resolve / close the bug and leave it to your looks whether to pick up the change or troubleshoot further, leave it as it is., I will assign to Zoltan so that this does not get lost.

Zoltan, I will try to branch and push with pull request. If I don't have "write" will try to ping. Hope it helps.

-- cheers, Thank you [~Miron1] for your investigation, and I'm happy that it works for you!
It seems to me that the most important change would be the update of the datanucleus 5 ; I think that could be probably done right now....[~Miron1] If you are intrested, just submit a patch for that :)]