[[~hagleitn] [~sseth] fyi, [~sseth] [~hagleitn] [~gopalv] fyi https://reviews.apache.org/r/38783/, Will test later to see if it works... also need to see if MiniTez passes, Looks like HiveQA never picked this up... trying again with the same patch., 

{color:red}Overall{color}: -1 at least one tests failed

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12764069/HIVE-11969.01.patch

{color:red}ERROR:{color} -1 due to 3 failed/errored test(s), 9646 tests executed
*Failed tests:*
{noformat}
org.apache.hadoop.hive.cli.TestCliDriver.testCliDriver_vector_groupby_reduce
org.apache.hadoop.hive.cli.TestMiniTezCliDriver.testCliDriver_vector_groupby_reduce
org.apache.hive.hcatalog.api.TestHCatClient.testTableSchemaPropagation
{noformat}

Test results: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/5451/testReport
Console output: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/5451/console
Test logs: http://ec2-174-129-184-35.compute-1.amazonaws.com/logs/PreCommit-HIVE-TRUNK-Build-5451/

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
Tests exited with: TestsFailedException: 3 tests failed
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12764069 - PreCommit-HIVE-TRUNK-Build, Seems to work as intended on cluster. [~sseth] can you take a look? Esp. wrt the right part of init being async., How is this going to work with with container prewarm? If you do that async that actually defeats the purpose of it. 

Also in general I think this is a bad idea, because you're just covering up that there's no capacity to run queries and it makes the code more complicated because it has to handle async start. The first query you run will now hang and it will just be less clear to the user what goes on. If the connection establishment hangs you go look for capacity, if query hangs you don't know if query is slow, if cluster is busy etc.

I think for instance the establishment of the connection shot up recently which was due to Tez + ATS interaction. With this it's much harder to find such things.

A better way to let folks do what you suggest is to connect through beeline and configure HS2 to run a pool. That way AM and shell are decoupled and you're not paying the overhead in the first query., Container prewarm remains part of the init so it's not affected.
The CLI startup should be decoupled from Tez session startup because not all queries use Tez; user can do number of operations like set/describe/create/explain/..., or even just take time typing a query, before the session is even needed. There are also stats queries and local fetches that don't require the session.
If the query hangs, it will be visible that the query has not started. IMHO it is actually better because you can then check the state of the cluster to see what's going on.
, I can add CLI output to the method that will indicate that session is starting when the query waits for it., With the patch - prewarm is moving into the async initialization. However I don't think that completely defeats the purpose of prewarm. Containers will still be started in the background if cluster capacity is available. The user query can get delayed though while it waits for the prewarm to complete.

IMHO, adding a log to the CLI indicating that a query is waiting for cluster resources is better than blocking the entire CLI from starting up. Also, as always, a configuration to fallback to current behaviour - which in this case would be disabled by default. Pre-warm as it exists today, would run with this set appropriately., Updated, Forgot to add the config flag, will do in next iteration, Hmm, that was a wrong patch, Tested the recent patch on cluster, clogging the nodes with spurious llap processes :)
The CLI looks like the attached while the corresponding Tez app is submitted but not running. When I stopped the llap cluster, the query started running.
I could run queries (such as "use database") without Tez AM (see OK above the query start).
Query also compiled without waiting for AM.


!Screen Shot 2015-10-02 at 14.23.17 .png!


, [~sershe]: LGTM - +1.

Minor comment on the isOpenOrOpening() - can you split that up into 2 different functions, so that the isOpen() does not change.

That allows the if(isOpening()) to cancel the future & the isOpen() to close the session., Will do that... but that is actually dangerous for future use, since it's easy to introduce the same bug that the original patch had - call isOpen() and then open if false., Updated patch., 

{color:red}Overall{color}: -1 at least one tests failed

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12765062/HIVE-11969.04.patch

{color:green}SUCCESS:{color} +1 due to 1 test(s) being added or modified.

{color:red}ERROR:{color} -1 due to 3 failed/errored test(s), 9652 tests executed
*Failed tests:*
{noformat}
org.apache.hive.hcatalog.api.TestHCatClient.testTableSchemaPropagation
org.apache.hive.jdbc.TestJdbcWithLocalClusterSpark.testTempTable
org.apache.hive.jdbc.TestSSL.testSSLVersion
{noformat}

Test results: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/5540/testReport
Console output: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/5540/console
Test logs: http://ec2-174-129-184-35.compute-1.amazonaws.com/logs/PreCommit-HIVE-TRUNK-Build-5540/

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.TestCheckPhase
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
Tests exited with: TestsFailedException: 3 tests failed
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12765062 - PreCommit-HIVE-TRUNK-Build, committed to master, It's a simple backport to branch-1; should we do that?]