[Only the 'hive' client is affected. In beeline, this seems to work fine., As I know, Cloudera 5.3.3 is Hive 13.1 and does not support alter_table_with_cascade. Alter table .. Cascade (HIVE-8839) is in Hive 1.1 and the alter_table_with_cascade is a new HMS API. I wonder if it is the problem from your mixing of the Cloudera5.3.3 with Hive 1.1? Could you detail more about how you did?, [~dwatzke] I wonder if you are still having the problem. If yes, could you let me know the details of your cluster setting and reproduce steps? Thanks, Hello. Yes, nothing has changed and we still have this problem. We're running a 120-node cluster on CentOS 6.6. We use MRv1 by default and we're currently experimenting with YARN.

We've installed Hive 1.1.0, linked our relevant cloudera hadoop config files into the hive's conf dir:
lrwxrwxrwx 1 root root     28 Apr 24 10:33 core-site.xml -> /etc/hive/conf/core-site.xml
lrwxrwxrwx 1 root root     28 Apr 24 10:33 hadoop-env.sh -> /etc/hive/conf/hadoop-env.sh
lrwxrwxrwx 1 root root     28 Apr 24 10:33 hdfs-site.xml -> /etc/hive/conf/hdfs-site.xml
lrwxrwxrwx 1 root root     26 Apr 24 10:33 hive-env.sh -> /etc/hive/conf/hive-env.sh
lrwxrwxrwx 1 root root     28 Apr 24 10:33 hive-site.xml -> /etc/hive/conf/hive-site.xml
lrwxrwxrwx 1 root root     31 Mar 15 13:09 log4j.properties -> /etc/hive/conf/log4j.properties
lrwxrwxrwx 1 root root     30 Apr 24 10:33 mapred-site.xml -> /etc/hive/conf/mapred-site.xml

and then we launched it, forcing it to use YARN like so:

HADOOP_CONF_DIR=/etc/hadoop/conf.cloudera.yarn YARN_CONF_DIR=/etc/hadoop/conf.cloudera.yarn /opt/hive-1.1.0/bin/hive

then I ran these queries:

CREATE TABLE test_change (a int, b int, c int);
ALTER TABLE test_change CHANGE a a1 INT;

The second one failed as described.

Then I tried to launch the beeline client like so:

HADOOP_CONF_DIR=/etc/hadoop/conf.cloudera.yarn YARN_CONF_DIR=/etc/hadoop/conf.cloudera.yarn /opt/hive-1.1.0/bin/beeline -u jdbc:hive2://

and the ALTER query worked fine now.

Can you please try it out with Hive CLI 1.1.0 (using YARN) to see if you can reproduce it as well? It really seems like some kind of regression, as this works fine in Hive 1.0.0.

Thanks., Are you using local or remote HMS? If it is remote HMS, have you upgraded your HMS accordingly and restart it? To me, it looks more like API mismatching issue between versions instead of regression or MR1/Yarn issue, You're right, I haven't done that. Thanks for the tip. I don't have time right now to test it out but let's close this bug and I'll reopen it in case it doesn't help - but it will ;)]