[The description doesn't seem describing the problem clearly. What's the symptom of the problem and how is it releated to CliDriver shutdown?, [~xuefuz]. thanks for your attention. The problem can be better understood if you can take a look at my patch. So, when CliDriver tries to shutdown, it tries to drop all the tables that are created during q test. In this case, it iterates through all the tables in db.getAllTables() in QTestUtil.java and try to drop every one of them. Let's assume there are two tables, A, an original table, and index_A, which is an index table created based on A. If index_A comes before A in the iteration, there is no problem, because L674 in QTestUtil.java will skip it and later when A is dropped, index_A is dropped as well. However, If A comes before index_A in the iteration, A will be dropped and index_A is dropped as well, later, it will not find index_A and throw InvalidTableException. That is the symptom of the problem and why it is related to CliDriver shutdown. Thanks., Got it. Thanks for the explanation., 

{color:red}Overall{color}: -1 at least one tests failed

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12756342/HIVE-11846.01.patch

{color:red}ERROR:{color} -1 due to 3 failed/errored test(s), 9447 tests executed
*Failed tests:*
{noformat}
org.apache.hive.hcatalog.api.TestHCatClient.testTableSchemaPropagation
org.apache.hive.hcatalog.hbase.TestPigHBaseStorageHandler.org.apache.hive.hcatalog.hbase.TestPigHBaseStorageHandler
org.apache.hive.hcatalog.streaming.TestStreaming.testEndpointConnection
{noformat}

Test results: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/5312/testReport
Console output: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/5312/console
Test logs: http://ec2-174-129-184-35.compute-1.amazonaws.com/logs/PreCommit-HIVE-TRUNK-Build-5312/

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
Tests exited with: TestsFailedException: 3 tests failed
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12756342 - PreCommit-HIVE-TRUNK-Build, The failed tests are unrelated and when I ran them on my laptop, all of them passed. As it is a rather simple patch, [~ashutoshc], [~jpullokkaran], [~xuefuz], could any of you review the patch? Thanks., +1 LGTM, pushed to master, thanks [~ashutoshc] for the review!, Could you please update affected versions as well as fix versions? Thanks., Should this issue be backported to branch-1? It looks like a bug.]