[Looks like this method Configuration.unset was added in hadoop 1.2 .
Not sure if Configuration.set(null) can be used in place of unset. 

From the patch, it looks like a workaround would be to set "fs.permissions.umask-mode"  to a value (say "022") in configuration (in hive-site.xml , hdfs-site or core-site).  I just realized that this is a new parameter name in hadoop 2.x and does not exist in hadoop 1.x (at least not in hadoop 1.2). So setting this fs.permissions.umask-mode=022 will not have any side effects. AFAIK, that codepath is actually needed only if you have multiple subdirs in scratch dir that need to be created . So if you are using the default scratch dir in hive {noformat}/tmp/hive-${username} {noformat} then this workaround would be safe.

, I haven't tested this workaround, please update jira if it worked for you.

Patches to hive are also welcome.
, [~thejas] 
Configuration.set(null) does not work:
{noformat}
[main]: ERROR ql.Driver: FAILED: NullPointerException null
java.lang.NullPointerException
	at java.util.Hashtable.put(Hashtable.java:394)
	at java.util.Properties.setProperty(Properties.java:143)
	at org.apache.hadoop.conf.Configuration.set(Configuration.java:438)
	at org.apache.hadoop.hive.ql.exec.Utilities.createDirsWithPermission(Utilities.java:3417)
{noformat}

I workarounded it simply by removing the line of code:) I haven't test your WA.

Seems shims should be used to abstract such difference across Hadoop versions.
, After changes in HIVE-7001, you would see this with pre hadoop 1.2 versions, only if hive.server2.enable.doAs=true (and ofcourse you are running the query through HS2). I hope to get HIVE-7001 into hive 0.13.1 .

The workaround for those versions while using that combination would be to set fs.permissions.umask-mode as described above (Verified that this works).
ie. add this in hive-site.xml -

{code}
  <property>
    <name>fs.permissions.umask-mode</name>
    <value>022</value>
    <description> Setting a value for fs.permissions.umask-mode to work around issue in HIVE-6962.
 It has no impact in hadoop 1.x line on hdfs operations.
    </description>
  </property>
{code}, As mentioned above, JDBC through HS2 still has this issue. I workaround it by catching the exception:
        try {
          conf.unset("fs.permissions.umask-mode");
        } catch (NoSuchMethodError e) {
        }
Could this be a fix?, Please not that with Hive 0.13.1 the workaround that I proposed above should work. (setting fs.permissions.umask-mode to some value).

Yes, catching NoSuchMethodError as you suggest could be a fix. But it would be better to do such version specific logic in the shims. ie, add a HadoopShims functions for this, and do the catch only in Hadoop20SShims.
]