[Here's a patch to avoid value de-serialization where not needed in case of inner join.

In my microbenchmark, where I was map-joining a big table, with a small table, this brought the task execution time down from 15seconds to 10seconds on about 3 million records on the big table, the second table being very small and the output is small too. Note that you won't see this much of an improvement for non-selective inner joins.

If folks are interested, I'll try productionizing the benchmark., Patch upmerged to the latest trunk., Hey Vinod,

You are missing the piece of code required for outer joins. Near the if (!noOuterJoin), I recommend that you keep the previous code and set the jionNeeded flag to true when noOuterJoin = false.

Basically:
{noformat}
            if (!noOuterJoin) {
              joinNeeded = true;
              storage[pos] = dummyObjVectors[pos];
            } else {
              storage[pos] = emptyList;
            }

{noformat}, [~vinodkv] If this patch is still relevant. Can you respond to [~vikram.dixit] comments and update the patch as appropriate?, Latest patch addressing Vikram's comments.

Created review board request at https://reviews.apache.org/r/10323/., A comment on RB., Yes, the clearing of the row should happen independent of row-generation. Attaching updated patch addressing the review comment., +1 will commit if tests pass., Committed to trunk. Thanks, Vinod!, Integrated in Hive-trunk-hadoop2 #162 (See [https://builds.apache.org/job/Hive-trunk-hadoop2/162/])
    HIVE-4105 : Hive MapJoinOperator unnecessarily deserializes values for all join-keys (Vinod KV via Ashutosh Chauhan) (Revision 1468433)

     Result = FAILURE
hashutosh : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1468433
Files : 
* /hive/trunk/ql/src/java/org/apache/hadoop/hive/ql/exec/MapJoinOperator.java
, Integrated in Hive-trunk-h0.21 #2067 (See [https://builds.apache.org/job/Hive-trunk-h0.21/2067/])
    HIVE-4105 : Hive MapJoinOperator unnecessarily deserializes values for all join-keys (Vinod KV via Ashutosh Chauhan) (Revision 1468433)

     Result = FAILURE
hashutosh : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1468433
Files : 
* /hive/trunk/ql/src/java/org/apache/hadoop/hive/ql/exec/MapJoinOperator.java
]