[This looks very similar to HIVE-8030. I'm looking at the current code and all the ArrayList creations are guarded by null checks. Are you sure that you are using Hive 0.13.1? The line numbers don't seem to match up either., Hi Lars,

I have updated it. Now line numbers should match up. Please let me know the method to resolve it.

Thanks!!, I had a typo in my comment from yesterday. I meant that it looks very similar to HIVE-2069.

Here's the code as of version 0.13.1: https://github.com/apache/hive/blob/release-0.13.1/jdbc/src/java/org/apache/hadoop/hive/jdbc/HiveMetaDataResultSet.java#L32

As you can see there's no ArrayList at line 32 and even if there were all of them are guarded by null checks.

Are you 100% sure you are using Hive 0.13.1?, Yes, I'm using hive-0.13.1., I'm sorry but those numbers don't match up. See for yourself in the link above what's going on in line 32 in release 0.13.1.

It instead matches up perfectly with what was available in version 0.7.1 and before: https://github.com/apache/hive/blob/release-0.7.1/jdbc/src/java/org/apache/hadoop/hive/jdbc/HiveMetaDataResultSet.java

The other line numbers don't match up either. Could you paste more information for example about your classpath? I'm relatively certain that somehow you are not using a vanilla 0.13.1 release. Maybe Pentaho messes something up., Hi Lars,

Please see attached snapshots. Database connection is ok but when trying to
retrieve schema using transformation job the error comes same as
(HIVE-8030).

*Thanks & Regards,*
Shiv Prakash Singh
Mobile.: +91-7042116839

On Wed, Sep 10, 2014 at 2:52 AM, Lars Francke (JIRA) <jira@apache.org>

, Renamed attached file: 'Screenshot from 2014-09-15 01:57:41.png' to 'Screenshot from 2014-09-15 01_57_41.png' because it contained invalid character(s)., Renamed attached file: 'Screenshot from 2014-09-15 01:58:41.png' to 'Screenshot from 2014-09-15 01_58_41.png' because it contained invalid character(s)., Renamed attached file: 'Screenshot from 2014-09-15 01:59:18.png' to 'Screenshot from 2014-09-15 01_59_18.png' because it contained invalid character(s)., Renamed attached file: 'Screenshot from 2014-09-15 02:00:38.png' to 'Screenshot from 2014-09-15 02_00_38.png' because it contained invalid character(s)., [~shivps3003] Are you using the right jdbc driver? The link you point to is the code for the driver that was supposed to work with HiveServer v1. Here is the correct source code: https://github.com/apache/hive/blob/release-0.13.1/jdbc/src/java/org/apache/hive/jdbc/HiveMetaDataResultSet.java, [~shivps3003] Apparently it's fixed by HIVE-2069 in hive-0.8.0. You should update your JDBC driver, too.]