[[~xuefuz] [~thejas] :
Please take a look about this small bug. Thanks., [~sjtufighter] Thanks for looking into this.
However, the idea behind StorageBasedAuthorization is to control/limit what the user can do to metadata, based on the permissions the user has on the storage (file system). 
Checking for permissions on the warehouse base directory helps to restrict the set of people who can create new databases.
This is similar to other checks, here are some examples -
 # For creation of a table , the db dir permissions would be checked, even if the table being created is an external table.
 # For creation of a partition in a table, the table dir permission is checked even if the new partition has a location outside the table directory.

This patch would take away a access control that is enforced by StorageBasedAuthorization.

, [~thejas] Thanks for your detailed clarification.
However, if user has write permission on the external path which is used in creating external database, this check mechanism maybe a little inappropriate. User should own the right to create database in path which user owns write permission such as his own dir. How about checking the destination path of external database directly? In production environment, creating external database in permission dir is relative common.
Thanks., 

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12767983/HIVE-12231.01.patch

{color:red}ERROR:{color} -1 due to no test(s) being added or modified.

{color:red}ERROR:{color} -1 due to 5 failed/errored test(s), 9700 tests executed
*Failed tests:*
{noformat}
org.apache.hadoop.hive.cli.TestCliDriver.testCliDriver_index_bitmap_auto_partitioned
org.apache.hadoop.hive.ql.io.orc.TestColumnStatistics.testHasNull
org.apache.hadoop.hive.ql.io.orc.TestJsonFileDump.testJsonDump
org.apache.hive.hcatalog.api.TestHCatClient.testTableSchemaPropagation
org.apache.hive.jdbc.TestSSL.testSSLVersion
{noformat}

Test results: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/5744/testReport
Console output: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/5744/console
Test logs: http://ec2-174-129-184-35.compute-1.amazonaws.com/logs/PreCommit-HIVE-TRUNK-Build-5744/

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.TestCheckPhase
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
Tests exited with: TestsFailedException: 5 tests failed
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12767983 - PreCommit-HIVE-TRUNK-Build, [~sjtufighter]
Unfortunately there is no other way to restrict creation of databases if the cluster admin wants to. This is certainly a flexibility that storagebasedauthorization lacks. However, we can't change that behavior as many admins would be relying on this to control who gets to create a new database. 

A workaround is to have admin create a database for such users, and allow them to create external tables instead of external databases.
If you strongly see a need for being able to create external databases without having permissions on the warehouse directory, it should be through a configuration setting for StorageBasedAuthorization. Please make sure that there is test coverage for both config being enabled and disabled.
, [~thejas] Many thanks for your detailed explaination.]