[

{color:green}Overall{color}: +1 all checks pass

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12749726/HIVE-11515.1.patch.txt

{color:green}SUCCESS:{color} +1 9348 tests passed

Test results: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/4916/testReport
Console output: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/4916/console
Test logs: http://ec2-174-129-184-35.compute-1.amazonaws.com/logs/PreCommit-HIVE-TRUNK-Build-4916/

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12749726 - PreCommit-HIVE-TRUNK-Build, Thanks [~navis]. [~wzheng]/[~sseth] can you help me review this - you know the code too?, [~navis] - Do you have more details on how the query fails in the situations where you see this occur ? Is there an exception or does the query hang or some other manifestation ?

I think the patch is primarily moving the registerForVertexNotifications into the constructor - which is fine. However, the condition where an event is received before registering for vertex success notifications is already handled in checkForSourceCompletion
{code}
int expectedEvents = numExpectedEventsPerSource.get(name).getValue();
    if (expectedEvents < 0) {
      // Expected events not updated yet - vertex SUCCESS notification not received.
      return;
    } else {
{code}

Even if all the events were to come in before registering for the notification, when prune is finally called - and a notification is received, these events will be processed.

On the Tez side, it makes sure to send in events only after the Initializer has been constructed - that's the HiveSplitGenerator., [~sseth] Sorry for delay. 
I've seen this a month ago in PoC scenario sometimes and desperately made this patch in a hurry. After applying it, those things gone and I just forget it (there was so many issues). So I cannot remember what was the exact problem, but it seemed "query hang" situation I guess. Sorry for my vague description., [~navis] - I think the patch is good to go in except for the log line, which should be an error.

However, I don't see this fixing an issue - I believe the condition mentioned is already handled. Up to you if you want to commit this., [~sseth] If it's already fixed, seemed not need to commit this. Thanks!]