[Review request on https://reviews.apache.org/r/11793/, One option was to use username like foo@bar.com ie, append domain name with username, since only thing patch does is append domain to username. Not saying this is a better approach, but thought you may have already tried this. Did that result in any issue?, [~ashutoshc] Thanks for the feedback.
yes, the mangled name (eg foo@bar) works as far as the authentication is concerned. In that case, HiveServer sees the user name as foo@bar instead of foo. That makes supporting things like bridging LDAP authentication with kerberos impersonation hard. This is a pretty common usecase to have hiveserver2 as a gateway to connect secure hadoop using a non-kerberos authentication mechanism. Due to this username format, you can't make it work with Active Directory.
Besides it a minor usability issue ..., +1, Committed to trunk. Thanks, Prasad!, Thanks Ashutosh!, There's email thread regarding LDAP auth for openldap..

http://osdir.com/ml/general/2013-08/msg42378.html

Essentially, if baseDN isn't set, then the bind string is formed as follows:

 // setup the security principal
String bindDN;
if (baseDN != null) {
       bindDN = "uid=" + user + "," + baseDN;
} else {
       bindDN = user;
} 

There should be some configuration, allowing people to customize this bind string, for example use cn= instead of uid=.

Can provide a patch if wanted.., This issue has been fixed and released as part of 0.12 release. If you find further issues, please create a new jira and link it to this one., Doc note:  This adds configuration parameter *hive.server2.authentication.ldap.Domain* to HiveConf.java.  It is documented in the wiki here:

* [Configuration Properties -- hive.server2.authentication.ldap.Domain | https://cwiki.apache.org/confluence/display/Hive/Configuration+Properties#ConfigurationProperties-hive.server2.authentication.ldap.Domain]
* [Setting Up HiveServer2 -- Configuration | https://cwiki.apache.org/confluence/display/Hive/Setting+Up+HiveServer2#SettingUpHiveServer2-Configuration]]