[[~daijy] [~alangates] can you please take a look?
, Looks like zk config is invalid somewhere... there are two different quorums logged. I wonder how it even works?, That's because config management for HBase metastore is terrible and involves a static and a threadlocal.
So first the test inits the static and one proper threadlocal.
Then some other random thread inits its own threadlocal with its own unrelated conf (for everyone) and sets its threadlocal to incorrect value., Here's a hacky fix for tests for now. Root problem needs to be addressed in a separate JIRA., [~alangates] can you please review?, 

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12766454/HIVE-12167.patch

{color:red}ERROR:{color} -1 due to no test(s) being added or modified.

{color:red}ERROR:{color} -1 due to 2 failed/errored test(s), 9683 tests executed
*Failed tests:*
{noformat}
org.apache.hive.hcatalog.api.TestHCatClient.testTableSchemaPropagation
org.apache.hive.jdbc.TestSSL.testSSLVersion
{noformat}

Test results: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/5645/testReport
Console output: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/5645/console
Test logs: http://ec2-174-129-184-35.compute-1.amazonaws.com/logs/PreCommit-HIVE-TRUNK-Build-5645/

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.TestCheckPhase
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
Tests exited with: TestsFailedException: 2 tests failed
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12766454 - PreCommit-HIVE-TRUNK-Build, This change doesn't look like what we want.  The intent of that getInstance(Configuration) method is to make sure conf is set for HBaseStore.  This will circumvent that.  

Why does this fix the issue anyway?, Because HBaseStore and/or StatsCache pass different config to it which overrides the correct config set by the test setup. This prevents it from overriding in the tests if already set.
, Btw I filed a separate JIRA for the static. getInstance(Config) will not actually return the correct HBaseStore if someone already called it with a different config. It will set the config, then return the existing instance... then, different threads might get the instances with new config :), It seems that HIVE-12170 aims to fix this correctly, so why put in a piece meal fix here, that I don't think will result in the correct behavior?, Well, HIVE-12170 doesn't have a patch :), Does now :).  I move we close this as duplicate., Sure]