[What's the thinking here?  We want to make sure this thread dies if the client dies., If the threads in this pool are the only ones left, I assume it's OK to let the VM exit.  In practice I'd only expect this to happen in test scenarios., 

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12828877/HIVE-14779.patch

{color:red}ERROR:{color} -1 due to no test(s) being added or modified.

{color:red}ERROR:{color} -1 due to 7 failed/errored test(s), 10561 tests executed
*Failed tests:*
{noformat}
org.apache.hadoop.hive.cli.TestCliDriver.testCliDriver[acid_mapjoin]
org.apache.hadoop.hive.cli.TestCliDriver.testCliDriver[ctas]
org.apache.hadoop.hive.cli.TestCliDriver.testCliDriver[vector_join_part_col_char]
org.apache.hadoop.hive.cli.TestMiniLlapCliDriver.testCliDriver[acid_bucket_pruning]
org.apache.hadoop.hive.cli.TestMiniTezCliDriver.testCliDriver[explainuser_3]
org.apache.hadoop.hive.metastore.TestMetaStoreMetrics.testMetaDataCounts
org.apache.hive.jdbc.TestJdbcWithMiniHS2.testAddJarConstructorUnCaching
{noformat}

Test results: https://builds.apache.org/job/PreCommit-HIVE-MASTER-Build/1213/testReport
Console output: https://builds.apache.org/job/PreCommit-HIVE-MASTER-Build/1213/console
Test logs: http://ec2-204-236-174-241.us-west-1.compute.amazonaws.com/logs/PreCommit-HIVE-MASTER-Build-1213/

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.TestCheckPhase
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
Tests exited with: TestsFailedException: 7 tests failed
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12828877 - PreCommit-HIVE-MASTER-Build, I'm sorry, I'm still confused.  What I want to make sure is that when a particular client dies, the heartbeat stops.  Once you switch the heartbeat to a daemon thread I'm not sure how that happens.  Can you explain how that will work?, SessionState.close() -> HiveTxnManager.closeTxnManager() -> stopHeartbeat()

Are you worried that making these threads daemon threads changes current behavior?


, What if the client never calls SessionState.close because the thread dies or hangs?, If the client is something like CLI, then if VM crashes - all threads go away.
If the client thread just hangs forever, there is no way to know that the client died - as long as hearbeat is done in a separate thread (wherever it is) it will go on.

For HS2, the Sessions are cleaned up automatically when client goes away.  There are several variables that can be configured to define what "goes away" mean.  Depending on how the client connects, it may be immediate (TCP connection broken) or based on inactivity period for HTTP based connections.  cc [~thejas]

, Ok, so I agree this doesn't make the situation any worse, and in fact makes it better since it will avoid the situation where everything dies but the heartbeat thread and that thread keeps the VM alive and keeps heartbeating.  At some point in the future I do think we should solve the issue where a hanging CLI client could hang the system., +1, see comments above., Thanks Alan for the review]