[Siying can you create a review request? 

I've a couple of comments as well: 
 1) comment in line 387 is not complete
 2) comments in line 388-389: can you give an example in which case all input alias are sampled by syntax but it actually cannot be sampled?
 3) line 391: if we want to mimic the old estimation algorithm it seems we shouldn't + bytesPerReducer here? It is added in line 399 right?  , for 2) the possibility that it can't be sampled is more likely to be the case that CombineHiveInputformat.getSplits() finally calls super.getSplits() for some reasons. In those cases, the data are not sampled at all. 
Another possible is that, for example, two alias of the MapReduce job include the same directory. We can't sample it then.

For 1) and 3), I think about it more. I'll remove the extra bytesPerReducer added. The worst case is that we run one less reducer. Shouldn't be so bad., review board:

https://reviews.apache.org/r/685/, 
-----------------------------------------------------------
This is an automatically generated e-mail. To reply, visit:
https://reviews.apache.org/r/685/
-----------------------------------------------------------

Review request for hive, Ning Zhang and namit jain.


Summary
-------

Now number of reducers of block sampling is not modified, so that queries like:
select c from tab tablesample(1 percent) group by c;
can generate huge number of reducers although the input is sampled to be small.
We need to shrink number of reducers to make block sampling more useful.
Since now number of reducers are determined before get splits, the way to do it probably is not clean enough, but we can do a good guess.


This addresses bug HIVE-2146.
    https://issues.apache.org/jira/browse/HIVE-2146


Diffs
-----

  trunk/ql/src/java/org/apache/hadoop/hive/ql/exec/MapRedTask.java 1098885 

Diff: https://reviews.apache.org/r/685/diff


Testing
-------


Thanks,

Siying

, +1. Will commit if tests pass., Committed. Thanks Siying!, Integrated in Hive-trunk-h0.20 #712 (See [https://builds.apache.org/hudson/job/Hive-trunk-h0.20/712/])
    ]