[[~richarddu], this is current limitation of Hive. Hive does NOT support unicode. If you are willing to work on this new feature, I would be happy to review it. Thanks., OK.I'd like to submit the patch., I choose the Top 10 popular languages from :
https://en.wikipedia.org/wiki/List_of_languages_by_number_of_native_speakers, [~richarddu], thanks a lot for your prompt patch and investigation. The lexer change sounds good to me. However, could you add more test cases? (1) Because you now extend the lexer, I guess other identifiers, e.g., column name itself can also use the unicode. For example, can u test "select 行1 from test limit 10;" (2) Other than junit test, could you add more q tests? For example, "select a as 行1 from test a join test b where a.行1= b.a", etc. Because this is a significant change to Hive, we need much more tests. Thanks., OK.I'd like to do more tests.
BTW, should I add more tests including semantic analysis which may require the unicode support of metastore?, Yes, of course. We need to test this as complete as possible. Thanks., @[~pxiong] 
I've got a problem about metastore.
The table name is checked in MetaStoreUtils.validateName() and the table name must match "[\\w_/]".
If the table name could be unicode, the code here may be modifed or removed.
What's your option about it ?, [~richarddu], yes, you need to change that to support unicode. I have done a similar change before. Could you please refer to HIVE-11699, take a look and do some investigation and estimate how much change you may need to make? Thanks., Add patch, Unicode support without itests results., add itests results && itests passed, The method here: https://cwiki.apache.org/confluence/display/Hive/HiveDeveloperFAQ#HiveDeveloperFAQ-Testing
does not work in my environment. I've tried many times to generate the result file but failed. And mvn command with  "-Phadoop-2" option works in the end., [~richarddu], I saw your new patch. It seems that you plan to support unicode in column name and also table names, right? If so, that means you go beyond your previous plan to support unicode alias in select-clause only, which is a good thing but you also need more test cases. (1) Shall we first create two sub-tasks, one for supporting unicode in table names and another one for supporting unicode in column names? We can then do it one by one.
(2) Could you add a configuration in HiveConf.java to control the support of unicode in table/column names? (3) Could you please follow what I did in HIVE-11699 for special_character_in_tabnames_1.q and special_character_in_tabnames_2.q and create your own test cases for unicode in table names? (4) Could you go to reviews.apache.org and create the view request for me? Thanks., Yes.As is discussed above, I'm trying to support unicode in Database/tableName/columnName, comment and so on.
(1)That sounds good. But the source code may change just one time, and the rest may be the test only.
(2)(3)(4)OK, I will.
Thanks so much for your help., Please make sure to test this change on all the metastore database backends, e.g. the mysql db script still has the stuff like this:
{noformat}
`TBL_NAME` varchar(128) CHARACTER SET latin1 COLLATE latin1_bin DEFAULT NULL,
{noformat}
This will probably need to change and would need an upgrade script, [~sershe], thanks for your comments. I guess [~richarddu] is using a similar method as I used for special character name, i.e., encoding the special characters (unicode characters). Thus, we may not need to touch the metastore backend. But we will take your comments into consideration for sure. , [~sershe]],[~pxiong]
I've checked the code and found that the script need to be changed. The DDLTask passes the table/column names to metastore backends directly, and the metastore stores the unicode characters into mysql then. Latin1 will cause disorder. I'll change it and do more tests.
Thanks for your comments., [~a092cc], thanks for your patch. However, as we previously discussed, you may also need to change the script in the metastore as you can see from the previous comments from [~sershe] and [~richarddu], [#Pengcheng Xiong], in fact  [#Sergey Shelukhin] and [#richard du] meant support unicode for table names and column names, in my case, I plan to support unicode alias in select-clause only,  so i think scirpt in the metastore needn't be changed?]