[The default template file will be generated from HiveConf.java after HIVE-6037 commits, so don't bother updating the template.  The HiveConf.java comments for hive.server2.authentication.pam.services will be moved into the parameter definition and then go into the template file.

If you want to revise the parameter description before HIVE-6037 commits, I suggest adding a JIRA comment on HIVE-6037 asking [~navis] to make the change in his patch.  After it commits, you can just revise HiveConf.java directly., You could update the parameter description in a release note, either here or on HIVE-6466 (or both).  The wiki needs to be updated here:

* [Setting Up HiveServer2:  Authentication/Security Configuration |https://cwiki.apache.org/confluence/display/Hive/Setting+Up+HiveServer2#SettingUpHiveServer2-Authentication/SecurityConfiguration]

(Eventually HiveServer2 configuration parameters will be documented in Configuration Properties, but they're not there yet.), [~thejas] [~leftylev] I've added release notes to HIVE-6466 and attached a patch to modify hive-default. I don't have wiki privileges yet :(, Added release notes to original jira, Reopened the issue as the patch never got applied.

[~rhbutani] This just modifies the template file. I think there is not point in a precommit run for this., Okay, so this seems to be going in as part of HIVE-6887. I'll close this jira., [~vaibhavgumashta] documented this in the wiki here:

* [Setting Up HiveServer2 - Pluggable Authentication Modules |https://cwiki.apache.org/confluence/display/Hive/Setting+Up+HiveServer2#SettingUpHiveServer2-PluggableAuthenticationModules(PAM)], All the HiveServer2 configs are now documented in the wiki in Configuration Properties:

* [Configuration Properties -- HiveServer2 |https://cwiki.apache.org/confluence/display/Hive/Configuration+Properties#ConfigurationProperties-HiveServer2]
* [hive.server2.authentication |https://cwiki.apache.org/confluence/display/Hive/Configuration+Properties#ConfigurationProperties-hive.server2.authentication]
* [hive.server2.authentication.pam.services |https://cwiki.apache.org/confluence/display/Hive/Configuration+Properties#ConfigurationProperties-hive.server2.authentication.pam.services]]