[hive.472.1.patch adds the check of RCFile.

If we get more and more FileFormats, we may need a more elegant method to do the check., Assigned., Thanks, Ashish.
This bug will cause insert overwrite into table XXX select YYY from table_rcfile not work.

btw, once Hive-460 is resolved, i will start working on Hive-461. Before that, i would like to do some profiling, trying to find some optimization, taking a look at the hive's index and join(especially with small files)., @Yongqiang: I think this is a good time to move the checkFileFormat code from the utility to the InputFileFormat class. What do you think?, Yes. It will be better if we can move this method out. But it has some problem since hive does not have its own InputFormat definition. 
The input formats hive uses right now are mainly from hadoop core, such as SequenceFileInputFormat, IgnoreKeyFileInputFormat etc. And we can not add a validInput() to hadoop's input format classes.
One option is to create another class hierarchy (InputFormatChecker) in Hive parallized with FileFomat.
Another option is to keep the FileFormat's checkInputFormat, and check whether the input format argument has a method "hiveValidInput". If find one, use it. And if not use the old logic in HiveFormatUtils. , 1) added a new interface InputFormatChecker
2) added a new SequenceFileInputFormatChecker implementing the newly added checker interface
3) let RCFileInputFormat implement the newly added checker interface

It seems 'ant test' can not successfully run with currently truck. So I did not run this patch on my local machine., Update a new patch, which passed tests in my local. The previous one has a null pointer exception., The changes look good but there are some tabs  - can you remove them and I will merge it in, I use eclipse as the work env, and use two spaces instead of tabs., load_wrong_fileformat.q


The above test is failing, Namit, thanks for pointing the error query. I should throw an exception if a mismatch occured.
And the new patch added in two more testcases. , +1

The changes look good - I will merge if the tests pass, All the new tests are failing for me - you need to debug them
, Sorry, my fault. the previous patch does not include changes for MoveTask. I use the same workspace working on hive-472 and hive-560, and forgot to add MoveTask in the patch.
Please try the new one hive-472-2009-06-24.patch.  Again, sorry for taking your time on the wrong patch.
I think in order to reduce committer's time for reviewing and testing wrong patches( like the previous wrong one), we may need to let hudson to pick the patch and do the test., no problems - will commit if the tests pass, Committed. Thanks Yongqiang.]