[Talked with Eugene. 
Also checked with the current Hive master code with the unit test, "TestTxnCommands2#testNonAcidToAcidConversion1".
 
1.  Currently Hive.moveAcidFiles() does not move a "_orc_acid_version" file. This static method is called by the MoveTask for the Hive 
   session of th.
   I.e., FileSinkOperator at map reduce task creates such a file but the MoveTask does not move the file to the final destination dir.

2. The intention for creating a "_orc_acid_version" file is to handle the case where we have multiple versions of ACID file formats.
   I.e., in that case, we need format version info somewhere either in the Metastore or in the directory. 

   As Eugene indicated, currently for ACID tables, inserter/deleters create delta directories independently and readers read relevant dirs without conflicts
   with writers via Snapshot isolation. So there can be cases to have multiple versions of delta directories per partition or table directory since 
   compactors are not sync with writers. So in this case, one "_orc_acid_version" file may be needed per delta dir. 

3. Possibly like the case of micromanaged tables,  we can remove the steps to create directories in a staging are and to perform MoveTask to 
   move the delta and base directories along with orc_acid_version file(s) to a final destination. 

Thus based on 3 and 4, I think we can lower the priority of this jira since the fix of this jira (moving such a file to final destination) 
may not be used at all for HDP 3.0., This is the layout that {{Hive.moveAcidFiles()}} sees.  It loses {{_orc_acid_version}}
{noformat}
HW13943:ql ekoifman$ tree target/tmp/org.apache.hadoop.hive.ql.TestTxnCommands-1518470371936/warehouse/nonacidorctbl/.hive-staging_hive_2018-02-12_13-26-08_544_7812499075009504959-1/-ext-10000/
target/tmp/org.apache.hadoop.hive.ql.TestTxnCommands-1518470371936/warehouse/nonacidorctbl/.hive-staging_hive_2018-02-12_13-26-08_544_7812499075009504959-1/-ext-10000/
├── 000000_0
│   └── _orc_acid_version
└── 000001_0
    ├── _orc_acid_version
    └── delta_0000016_0000016_0000
        └── bucket_00001

3 directories, 3 files
HW13943:ql ekoifman$ 
{noformat}

, included in HIVE-18659, Hive 3.0.0 has been released so closing this jira.]