[Review request:

https://reviews.apache.org/r/1017/, 
-----------------------------------------------------------
This is an automatically generated e-mail. To reply, visit:
https://reviews.apache.org/r/1017/
-----------------------------------------------------------

Review request for hive.


Summary
-------

Fix compression parameters for FileSinkOperator


This addresses bug HIVE-2266.
    https://issues.apache.org/jira/browse/HIVE-2266


Diffs
-----

  ql/src/java/org/apache/hadoop/hive/ql/io/HiveFileFormatUtils.java 404c4d3 
  ql/src/java/org/apache/hadoop/hive/ql/optimizer/GenMRFileSink1.java 092a5cd 
  ql/src/java/org/apache/hadoop/hive/ql/parse/SemanticAnalyzer.java 8fe5984 

Diff: https://reviews.apache.org/r/1017/diff


Testing
-------


Thanks,

Vaibhav

, @Vaibav: Is this patch ready for review? If so, please attach the patch to this ticket and click "Submit Patch". Thanks., Carl, I have attached the patch., @Vaibhav: The changes look good, but it needs a test. Is it feasible to add something to TestCliDriver? Thanks., @Vaibhav: The compress.q test passes even without your patch in place. Can you please supply a testcase that fails without your patch?, Hi Carl

The patch fixes compression which means that there is a difference in file size only.

Besides the file size will differ on different platforms. Hence there is no way to test this except for manual test.

This test case executes the new code and makes sure that it works.

Sent from my phone.

----- Reply message -----
From: "Carl Steinbach (JIRA)" <jira@apache.org>
Date: Fri, Aug 26, 2011 6:13 pm
Subject: [jira] [Updated] (HIVE-2266) Fix compression parameters
To: "Aggarwal, Vaibhav" <vaggarw@amazon.com>


     [ https://issues.apache.org/jira/browse/HIVE-2266?page=com.atlassian.jira.plugin.system.issuetabpanels:all-tabpanel ]

Carl Steinbach updated HIVE-2266:
---------------------------------

    Status: Open  (was: Patch Available)

@Vaibhav: The compress.q test passes even without your patch in place. Can you please supply a testcase that fails without your patch?


--
This message is automatically generated by JIRA.
For more information on JIRA, see: http://www.atlassian.com/software/jira


, bq. Besides the file size will differ on different platforms.

Really? Which platforms are you talking about? Can you tell me how to reproduce this interesting behavior?

bq. This test case executes the new code and makes sure that it works.

How exactly does it verify that the new code works? How do you even know that your new code is getting exercised during the execution of this testcase?
, This patch attempts to fix a bug in the existing functionality in two ways:

1. In HiveFileFormatUtils.java, wrong jobconf is getting passed which is clear from the context.

2. In other cases the compression parameters are not getting set.

The only difference this patch produces from the current behavior is smaller file sizes on file system. I am not sure how to write a hive query which can verify difference in file sizes. Do you have any ideas which can help me add some quick tests for this? The current test executes though the code checking that it does not result in any Exception or Error. It does not compare file size.


> Really? Which platforms are you talking about? Can you tell me how to reproduce this interesting behavior?

Hadoop loads native compression libraries. I believe that they are platform dependent hence I do not assume that they always have same compression ratio. Please correct me if I am wrong here.

In any case I think this is a broken existing functionality in Hive which we should fix., bq. Hadoop loads native compression libraries. I believe that they are platform dependent hence I do not assume that they always have same compression ratio. Please correct me if I am wrong here.

Compression is based on standard algorithms, which is platform independent. The native code is platform-dependent cause of the library references it has.]