[[~sseth] I thought this can't happen. The Tez API was supposed to guarantee delivery of events before completion. Should I open a Tez issue?, I'll take a look. Assuming this was run with Tez 0.7 snapshot ?, [~gopalv] said that it was on tez 0.7., This is not limited to LLAP. Assigning to myself - to change the handling of vertex success / init events., Patch to handle out of order events. Also initializes the pruner during Input construction - so that events don't show up before the pruner is initialized. Adds a bunch of tests.

[~hagleitn], [~vikram.dixit] - please review., 

{color:red}Overall{color}: -1 at least one tests failed

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12707029/HIVE-9976.1.patch

{color:red}ERROR:{color} -1 due to 1 failed/errored test(s), 8347 tests executed
*Failed tests:*
{noformat}
org.apache.hadoop.hive.cli.TestMinimrCliDriver.testCliDriver_schemeAuthority
{noformat}

Test results: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/3139/testReport
Console output: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/3139/console
Test logs: http://ec2-174-129-184-35.compute-1.amazonaws.com/logs/PreCommit-HIVE-TRUNK-Build-3139/

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
Tests exited with: TestsFailedException: 1 tests failed
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12707029 - PreCommit-HIVE-TRUNK-Build, Not your fault - but there are 2 paths through HiveSplitGenerator. The class is used once without calling init and once being properly init'd. The reason is that some other code needs to use the "group splits" method. Since you've moved init to the constr now, this has gotten even uglier. Could you move the split grouper methods to a separate util class (static) and leave the pruner to just prune.

Also - I think you've moved the initialization of the dynamic pruner to the constr of the input initializer, in order to not miss any events. Can you add a comment to the code explaining this?

Very cool to see a real unit test  :-) thanks., i see you've fixed calling close consistently on the data input stream. maybe use try{}finally there?, it seems you're setting numexpectedevents to 0 first and then turn around and call decrement. Why not just set to -1? Also - why atomic integers? as far as i can tell all access to these maps is synchronized., does it make sense to make initialize in the pruner private now? (can't be used to init anymore - only from the constr). Also, the parameters aren't used anymore, right?, other than the above looks good to me. like the extra comments and conditions you've put in!, Thanks for the review. Updated patch with comments addressed, and some more changes.

bq. Not your fault - but there are 2 paths through HiveSplitGenerator.
Moved the methods into SplitGrouper. There's a static cache in there which seems a little strange. Will create a follow up jira to investigate this. For now I've changed that to a ConcurrentMap since split generation can run in parallel.

bq. i see you've fixed calling close consistently on the data input stream. maybe use try{}finally there?
Fixed. There was a bug with some of the other conditions which I'd changed. Fixed that as well.

bq. it seems you're setting numexpectedevents to 0 first and then turn around and call decrement. Why not just set to -1? Also - why atomic integers? as far as i can tell all access to these maps is synchronized.
numExpectedEvents is decremented for each column for which a source will send events. That's used to track total number of expected events from that source. Added a comment for this.
Moved from AtomicIntegers to MutableInt - this was just to avoid re-inserting the Integer into the map, and not for thread safety.

bq. does it make sense to make initialize in the pruner private now? (can't be used to init anymore - only from the constr). Also, the parameters aren't used anymore, right?
Done, along with some other methods.
, +1, 

{color:green}Overall{color}: +1 all checks pass

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12707303/HIVE-9976.2.patch

{color:green}SUCCESS:{color} +1 8347 tests passed

Test results: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/3159/testReport
Console output: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/3159/console
Test logs: http://ec2-174-129-184-35.compute-1.amazonaws.com/logs/PreCommit-HIVE-TRUNK-Build-3159/

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12707303 - PreCommit-HIVE-TRUNK-Build, Committed to trunk. Thanks [~sseth]!, This issue has been fixed and released as part of the 1.2.0 release. If you find an issue which seems to be related to this one, please create a new jira and link this one with new jira.]