[Could u paste the sql file in the JIRA?, the 4 sql files in TPCx-BB v1.2, The comments should begin with "--" without any spaces. For example, this one has problem
{code}
INSERT INTO TABLE ${hiveconf:RESULT_TABLE}
SELECT SUM(pagecount) / COUNT(*)
FROM
(
  FROM
  (
    SELECT *
    FROM ${hiveconf:TEMP_TABLE1} sessions
    DISTRIBUTE BY sessionid SORT BY sessionid, tstamp, wp_type --required by "abandonment analysis script"
  ) distributedSessions
  REDUCE 
    wp_type,
    --tstamp, --already sorted by time-stamp
    sessionid --but we still need the sessionid within the script to identify session boundaries

    -- script requires input tuples to be grouped by sessionid and ordered by timestamp ascending.
    -- output one tuple: <pagecount> if a session's shopping cart is abandoned, else: nothing
    USING 'python q4_abandonedShoppingCarts.py'
    AS (pagecount BIGINT)
) abandonedShoppingCartsPageCountsPerSession
;
{code}
, Hi [~pxiong], can you point out where is the problem? if this's the cause, why previous Hive(commit: ac68aed) is ok?, found that the root cause is the special characters in the comment of sql file. But why should Hive parse the comment?, Hive does not parse the comment. If you want to use comment, you should use "--" at the beginning of the line., Hi experts,

We also got same issue in Hive 2.X but it didn't happen in Hive 1.6. This is a regression bug. The issue happened when Hive comments which includes special chars (e.g., single quotes) inlined in SQL statement like below example:
{code:java}
INSERT INTO TABLE RESULT_TABLE
SELECT SUM(pagecount) / COUNT(*)
FROM
(
  FROM
  (
    SELECT *
    FROM TEMP_TABLE1 sessions -- why single quotes' is not allowed in here
    DISTRIBUTE BY sessionid SORT BY sessionid, tstamp, wp_type
  )
;
{code}
 

 , hi [~jameszhouyi], as i said in the previous thread,  if you want to use comment, you should use "--" at the beginning of a line rather than in the middle of a line., Hi [~pxiong]
Thank you for your response.  I am confused why it have the diff in Hive 1.x vs Hive 2.x. I meant that if the same Hive SQL can successfully run on Hive 1.x , it should run on Hive 2.0 instead of reporting error to user... It seem to be a Hive issue.]