[Patch 1 documents the need for hive-site.xml to be in the CLASSPATH of the JDBC client when configuring Hive on a secure cluster.

The information is added to the administration doc for setting up JDBC, which was converted from wiki format to xml.

The patch adds one doc file and modifies two auxiliary files: 

* docs/xdocs/admin_manual/hivejdbc.xml is the source doc for Hive JDBC setup.

* project.xml adds a menu item for the JDBC setup doc, fixes a misnamed menu item (DDL, not DML), adds a link to the javadocs, and changes the capitalization of a few menu items.

* site.vsl removes menu indentation and changes the copyright year to 2012 in HTML footers., The patch converts the wiki page [Hive JDBC Interface|https://cwiki.apache.org/confluence/display/Hive/HiveJDBCInterface] to xml and adds a one-sentence section for secure cluster setup: 

* Hive JDBC Driver
** Integration with Pentaho
** Integration with SQuirrel SQL Client
* Hive JDBC Client
** JDBC Client Setup for a Secure Cluster
\\ To configure Hive on a secure cluster, add the directory containing hive-site.xml to the CLASSPATH of the JDBC client.
, I think better place to document the need of hive-site.xml in classpath is https://cwiki.apache.org/confluence/display/Hive/HiveClient which should also be in xdocs. Hive Jdbc interface wiki page we can leave as it is., Agreed.  I'll submit a new patch., Patch 2 replaces patch 1, documenting JDBC client configuration for secure clusters in the "Hive Client" doc (converted from wiki).

Auxiliary files site.vsl and project.xml fix the copyright year and menu., Patch 2 documents the need for hive-site.xml to be in the CLASSPATH of the JDBC client when configuring Hive on a secure cluster.

This information is added to a "Hive Client" doc, which was converted from the wiki.

The patch adds one doc file and modifies two auxiliary files:

* docs/xdocs/hiveclient.xml is the source doc for Hive client setup

* project.xml adds a menu item for the client setup doc, fixes a misnamed menu item (DDL, not DML), adds a link to the javadocs, and changes the capitalization of a few menu items

* site.vsl removes menu indentation and changes the copyright year to 2013 in HTML footers, The [Hive Client wiki|https://cwiki.apache.org/confluence/display/Hive/HiveClient#HiveClient-JDBCClientSetupforaSecureCluster] contains this information, and the xdocs are gone so there's no need to commit the patch., Also the [HiveServer2 JDBC client|https://cwiki.apache.org/confluence/display/Hive/HiveServer2+Clients#HiveServer2Clients-JDBCClientSetupforaSecureCluster] steps are available on wiki., This was put into the wiki.]