[I haven't done a whole bunch of testing yet, but I did try to replace the following libraries:
1. datanucleus-core-2.0.3.jar -> datanucleus-core-2.2.5.jar
2. datanucleus-rdbms-2.0.3.jar -> datanucleus-rdbms-2.2.4.jar

This has met with a modicum of success, in that code such as "pt < '2'" does indeed work. (Mind you, the testing I did was on HCatalog, not on Hive-proper, but it still applies.)

I know this has been discussed before, but I'd like to bring this back to the table: Could we please consider having Hive-Metastore depend on a less dated set of JDO libraries?, @Mithun,
Good finding. We can definitely upgrade the jdo libs. If all our tests pass, then certainly it makes sense to do so, given that there is atleast one bug (this jira) which will be fixed by it. There is some work for it already going on at HIVE-2084 for this. But, looks like Carl hit failures there. Also, if we are upgrading we should try to go to 3.0.1 instead of 2.x series., @Mithun,

How did you change these jars? did you replace them after you compiled or did you replace them before build time?

If I change the ivy cache, here is what I get-[datanucleusenhancer] Exception in thread "main" java.lang.NoSuchMethodError: org.datanucleus.metadata.AbstractMemberMetaData.getJdoFieldFlag()B
[datanucleusenhancer] 	at org.datanucleus.enhancer.asm.JdoMethodAdapter.visitFieldInsn(JdoMethodAdapter.java:104)
[datanucleusenhancer] 	at org.objectweb.asm.ClassReader.accept(Unknown Source)
[datanucleusenhancer] 	at org.objectweb.asm.ClassReader.accept(Unknown Source)
[datanucleusenhancer] 	at org.datanucleus.enhancer.asm.ASMClassEnhancer.enhance(ASMClassEnhancer.java:388)
[datanucleusenhancer] 	at org.datanucleus.enhancer.DataNucleusEnhancer.enhanceClass(DataNucleusEnhancer.java:1035)
[datanucleusenhancer] 	at org.datanucleus.enhancer.DataNucleusEnhancer.enhance(DataNucleusEnhancer.java:609)
[datanucleusenhancer] 	at org.datanucleus.enhancer.DataNucleusEnhancer.main(DataNucleusEnhancer.java:1316)
, We replace them after the build.
, Hmm, unfortunately it didnt work for me, I am not at hive0.9 yet, that might be one of the reason. Anyway, for those who want take jar injection path -http://www.datanucleus.org/servlet/jira/browse/NUCJDOQUERY-4, I ran into this today too and, in addition to updating the two jars Thomas mentioned, also had to update:

https://github.com/apache/hive/blob/trunk/metastore/src/model/package.jdo#L49

In our hive tables the column is named "COMMENT" - not "FCOMMENT". Without updating datanucleus things work fine, but this change is required when updating jars. I don't understand why the change in behavior yet though., I tried reproducing this after HIVE-3632 and cannot. Therefore I think we can mark it resolved.]