[You know I am not sure exactly why/when this is true. I have a serde not hard coded in serde-utils that does not require columns to be defined. But yes we should get rid of the hard codes. (the class mentions something about lazy-loading as well in the comments), It's not the case that this static list is the only way for a table to be columnist the avro deserializer does not add itself to the list and still can do this. I just created a protobuf serde that does this as well and is not in the list. Still jot exactly sure why anything needs to be listed here., Hi Edward, 

Any plan to publish your protobuf serde anytime soon? We want to use Hive serde to access our protobuf data and it'd be nice if we can use the new serde.

Thanks,
Feng
, We did open source the support. Will add it to hive trunk when I get a chance.
https://github.com/edwardcapriolo/hive-protobuf, Thanks Edward, That's very helpful!

Is it possible to separate the ObjectorInspector logic from the Deserializer? We use a different data format but the ObjectInspector logic should be mostly the same.

Also, similar to the ThriftDeserializer, can we make the Deserializer take a writable and return the encoded object? Right now the implementation assumed the input is a pair, which could be wrapped in another layer.


 , @Feng I started out looking at how the thrift deserializer worked but I was really unable to get a handle for the changes that would be required. The reason we created the Pair class is it is very annoying when hive drops the key, as people tend to write data there for sorting. We can easily factor out the reflection pieces into common base classes., Cool. I guess our use case is kind of different from yours. We already have a ProtobufDeserializer in Elephantbird, which is currently using the ReflectionObjectInspector and thus getting a different set of fields from the original protobuf def. Since Elephantbird already extracts the field names from the protobuf objects, for the time being we will just write an OI on top of it, and replace it when the Hive ProtbobufDeserializer is finalized.

Thanks,
Feng, I member looking at elephant bird aupport. Iirc it required the user to generate an addition class . I took this approach because I wanted hive to work with the protobuf class directly. I also figured that somehow the reflection inspector would have something that did not work the way I wanted so coding the entire piece from scratch was very attractive to me. If your data is in a different format you can likely reuse almost all of the code, you just have to customize the input format.]