[Attached a diff for this issue here https://reviews.facebook.net/D3633, @Kevin: Please see my comments on phabricator. Thanks., On a related note, what happens if you create a managed table and modify it's location to point to the storage location of another managed table? Will Hive let you do this, and if so, can you use this trick to delete someone else's table data?, If you have permissions to write to that storage location I would imagine so, but that's an issue with/without this patch.  There is certainly nothing in Hive that prevents two tables from sharing a location., Responded to comments on phabricator., +1
, Will commit if tests pass., Committed to trunk. Thanks Kevin!, Integrated in Hive-trunk-hadoop2 #54 (See [https://builds.apache.org/job/Hive-trunk-hadoop2/54/])
    HIVE-3134 Drop table/index/database can result in orphaned locations
(Kevin Wilfong via Carl Steinbach)

Summary:
Today when a managed table has a partition with a location which is not a subdirectory of the table's location, when the table is dropped the partition's data is not deleted from HDFS, resulting in an orphaned directory (the data exists but nothing points to it).

The same applies to dropping a database with cascade and a table has a location outside the database.

I think it is safe to assume managed tables/partitions own the directories they point to, so we should clean these up.

Test Plan: Added test cases to verify that the directories which would be orphaned are cleaned up by drop table/index/database.

Reviewers: JIRA, njain, cwsteinbach

Reviewed By: cwsteinbach

Differential Revision: https://reviews.facebook.net/D3633 (Revision 1351174)

     Result = ABORTED
cws : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1351174
Files : 
* /hive/trunk/metastore/src/java/org/apache/hadoop/hive/metastore/HiveMetaStore.java
* /hive/trunk/metastore/src/java/org/apache/hadoop/hive/metastore/ObjectStore.java
* /hive/trunk/ql/src/test/queries/clientpositive/drop_database_removes_partition_dirs.q
* /hive/trunk/ql/src/test/queries/clientpositive/drop_index_removes_partition_dirs.q
* /hive/trunk/ql/src/test/queries/clientpositive/drop_table_removes_partition_dirs.q
* /hive/trunk/ql/src/test/results/clientpositive/drop_database_removes_partition_dirs.q.out
* /hive/trunk/ql/src/test/results/clientpositive/drop_index_removes_partition_dirs.q.out
* /hive/trunk/ql/src/test/results/clientpositive/drop_table_removes_partition_dirs.q.out
, This issue is fixed and released as part of 0.10.0 release. If you find an issue which seems to be related to this one, please create a new jira and link this one with new jira.]