[Need code review. , when SemanticAnalyzer check union plan, it use getCommonClassForUnionAll, but when evaluate union operator it uses getCommonClass. The inconsistency cause some queries with multiple union all on date type column can pass the analyzer but fail with HiveException: Incompatible types at execute time.
Fixed by use new updateForUnionAll method which use getCommonClassForUnionAll to update column for union operator., This looks fine to me.  Only style feedback is please follow the common style convention in GenericUDFUtils, like put parenthesis for if {...} else {...}, and also put a space after if.  And the method name capitalization should be updatePriv, although I would suggest renaming it to avoid confusion (when I first read it, I thought its updating the privilege).

To be honest I'm not the expert of union, I wonder if [~jdere], [~navis] would have any further comment?  If not, +1 after these changes, pending the test., fixes after review, Thanks [~szehon], I attached the new patch following your review advice, I also submit a review request for the jira:
https://reviews.apache.org/r/26763/, need review, Fixed code style after review, need code review, Fixed code style after review, Thanks Yongzhi, +1 pending tests, unless others who know more about this area have comments., Don't know much about the history why there was getCommonClass/ForComparison/ForUnion.  Looks like getCommonClassForUnionAll() was added in HIVE-2901, and getCommonClassForComparison() added in HIVE-608. Might be possible to merge them all, but they each have some slight differences which may change existing behavior.
I think the changes look good., 

{color:red}Overall{color}: -1 at least one tests failed

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12675081/HIVE-8448.4.patch

{color:red}ERROR:{color} -1 due to 6 failed/errored test(s), 6560 tests executed
*Failed tests:*
{noformat}
org.apache.hadoop.hive.cli.TestHBaseCliDriver.testCliDriver_hbase_custom_key
org.apache.hadoop.hive.cli.TestHBaseCliDriver.testCliDriver_hbase_custom_key2
org.apache.hadoop.hive.cli.TestHBaseCliDriver.testCliDriver_hbase_custom_key3
org.apache.hive.beeline.TestSchemaTool.testSchemaInit
org.apache.hive.beeline.TestSchemaTool.testSchemaUpgrade
org.apache.hive.minikdc.TestMiniHiveKdc.testLogin
{noformat}

Test results: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/1293/testReport
Console output: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/1293/console
Test logs: http://ec2-174-129-184-35.compute-1.amazonaws.com/logs/PreCommit-HIVE-TRUNK-Build-1293/

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
Tests exited with: TestsFailedException: 6 tests failed
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12675081
 - PreCommit-HIVE-TRUNK-Build, [~szehon] and [~jdere], I checked the failure tests. 2 of them are new ones, but it related to login so it should not be caused by the change.
The rest of the failures are aged more than 2 days, and do not have union operations in the queries. So I think the all the test failures
are not related to the change.
Thanks., Makes sense.  Committed to trunk, thanks Yongzhi for the contribution and Jason for additional review !]