[I cleaned some of the related dead code in HIVE-7008 Seems like contrib/ still has some of it left., Hi Ashutosh, 
 Thanks for responding. It seems that a class RecordTestObj.java in /build/ql/test/classes  uses the org.apache.hadoop.record. Hadoop has decided to revert the change in HADOOP-10474 at the present moment.
Viraj, The move of org.apache.hadoop.record.* classes to the hadoop-streaming jar and the subsequent removal of some of those classes (HADOOP-10474 and HADOOP-10485, respectively) have been reverted from Hadoop's branch-2.  Note that these changes are still in Hadoop trunk, and they will be part of Hadoop 3.x and subsequent releases.  This gives users the Hadoop 2.x release to realize these classes are deprecated and a chance to migrate to an alternative (e.g.: Avro).
, 

{color:red}Overall{color}: -1 at least one tests failed

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12646695/HIVE-7077.patch

{color:red}ERROR:{color} -1 due to 9 failed/errored test(s), 5463 tests executed
*Failed tests:*
{noformat}
org.apache.hadoop.hive.cli.TestCliDriver.testCliDriver_parquet_decimal1
org.apache.hadoop.hive.cli.TestCliDriver.testCliDriver_subquery_views
org.apache.hadoop.hive.cli.TestMinimrCliDriver.testCliDriver_root_dir_external_table
org.apache.hadoop.hive.cli.TestNegativeCliDriver.testNegativeCliDriver_authorization_ctas
org.apache.hive.hcatalog.pig.TestOrcHCatLoader.testReadDataPrimitiveTypes
org.apache.hive.hcatalog.pig.TestOrcHCatPigStorer.testWriteDecimal
org.apache.hive.hcatalog.pig.TestOrcHCatPigStorer.testWriteDecimalX
org.apache.hive.hcatalog.pig.TestOrcHCatPigStorer.testWriteDecimalXY
org.apache.hive.jdbc.miniHS2.TestHiveServer2.testConnection
{noformat}

Test results: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-Build/296/testReport
Console output: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-Build/296/console
Test logs: http://ec2-174-129-184-35.compute-1.amazonaws.com/logs/PreCommit-HIVE-Build-296/

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
Tests exited with: TestsFailedException: 9 tests failed
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12646695, Test failures are unrelated. Patch is ready for review., I've never used Record or RecordOutput before. But would it be safe to remove that in hive? Sill the most of clusters are based on hadoop-1(at least in my experience)., I think so. Patch just removes one of the type supported in TypedBytesSerDe, which lived in Hadoop code base but is deprecated for long time. TypedBytesSerDe itself is in contrib/ module (not in proper hive itself). TypedBytesSerDe is written mostly to be used with transform feature (less comonly used feature of Hive these days). 
So, patch is essentially removing a deprecated type from a serde from a contrib module which is used with a rarely used feature. Seems to me there will hardly be any users for it. If there are any users at all, they can still use this serde from previous release if they desire to do so., +1, Committed to trunk., This has been fixed in 0.14 release. Please open new jira if you see any issues.
]