[
I dont see any list bucketing here.
testtable is a normal table - not stored as sub-directories.

Are you saying this problem exists in hive trunk ?, Yes, per my test. 

We can double confirm.

Sent from my iPhone


, If this a problem, this is a blocker for 0.10 - ccing [~ashutoshc], I take the latest code from trunk "svn info" ... "Revision: 1413914" and I can reproduce the problem.

Yes, the problem's in trunk., Gang,
I fail to see a bug here. You didn't show how you created the srcpart, but I assume you did similar to following: 
{code}
create table srcpart (key string, value string) partitioned by (ds string, hr string);
load data local inpath '/home/ashutosh/workspace/hive/data/files/kv1.txt' overwrite into table srcpart partition (ds='2008-04-08', hr='11');
load data local inpath '/home/ashutosh/workspace/hive/data/files/kv1.txt' overwrite into table srcpart partition (ds='2008-04-08', hr='12');
load data local inpath '/home/ashutosh/workspace/hive/data/files/kv1.txt' overwrite into table srcpart partition (ds='2008-04-09', hr='11');
load data local inpath '/home/ashutosh/workspace/hive/data/files/kv1.txt' overwrite into table srcpart partition (ds='2008-04-09', hr='12');
{code}

If so, in your insert statement, you are going to select all the rows from srcpart corresponding to ds=2008-04-08 which includes rows corresponding to both hr=11 and hr=12 and then insert into testtable in partition ds='2008-04-08', hr='11'. This implies rows corresponding to hr=12 in srcpart will be in hr=11 in testtable. Then if you are going to do select key, value from testtable where ds='2008-04-08' and hr='11' and key = "484"; you will get two rows since hr='11' in testable has rows from hr='12' also of srcpart. This is expected. This is how partitioning has always worked in Hive. To be doubly sure, I also checked on hive-0.9, it has same behavior. 
Though, I agree it is bit confusing., Hi Ashutosh,

Yes, you are right. srcpart is created via QTestUitl.java createSources method. I read the code and see it's created in the way you describe.

Yes, it's not bug but the way test case is written together with how we populate srcpart.

Yeah, a little confusing.

thank you for digging into it and finding out. thanks

Gang]