[I can take a look at this [~sershe], Assigned to you. Thanks for looking at it!, Hi [~sershe] .. Can you give an example? I am seeing it happening in the master branch as well. Is this issue specific to 1.2.1 or master too? Do you know a branch where this is not happening?, Looks good to me. [~xuefuz] would you be the expert on beeline? Do you also want to take a look?, Adding [~ctang.ma] for the review as well since he recently worked on query cancelation on the Driver side., 

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12851228/HIVE-15626.01.patch

{color:red}ERROR:{color} -1 due to no test(s) being added or modified.

{color:red}ERROR:{color} -1 due to 4 failed/errored test(s), 10227 tests executed
*Failed tests:*
{noformat}
TestDerbyConnector - did not produce a TEST-*.xml file (likely timed out) (batchId=235)
org.apache.hadoop.hive.cli.TestEncryptedHDFSCliDriver.testCliDriver[encryption_join_with_different_encryption_keys] (batchId=159)
org.apache.hadoop.hive.cli.TestMiniLlapLocalCliDriver.testCliDriver[vector_varchar_simple] (batchId=153)
org.apache.hadoop.hive.llap.daemon.impl.TestTaskExecutorService.testWaitQueuePreemption (batchId=277)
{noformat}

Test results: https://builds.apache.org/job/PreCommit-HIVE-Build/3398/testReport
Console output: https://builds.apache.org/job/PreCommit-HIVE-Build/3398/console
Test logs: http://104.198.109.242/logs/PreCommit-HIVE-Build-3398/

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.TestCheckPhase
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
Tests exited with: TestsFailedException: 4 tests failed
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12851228 - PreCommit-HIVE-Build, [~vihangk1] When I worked on HIVE-14799 and did manual beeline ctrl-c tests on Linux, I never had the problem in canceling a query running in HS2. The Beeline shutdown in response to Ctrl-C closes the socket, which could trigger the event handler of HS2 ThriftServer to close the session, therefore canceling/closing all queries run on this session when hive.server2.close.session.on.disconnect is enabled.
The stmt.cancel() in the patch can ensure that the query is cancelled under some circumstances, though the query might have already been or anyway will be cancelled through the session closing. Have you been able to reproduce the issue reported here? , The CLI behavior used to be to cancel the query and NOT exit the CLI until the 2nd ctrl-c. I was wondering if as part of making beeline CLI-compatible before removing CLI, we could preserve this useful behavior. Esp. since connecting with beeline after it exits often involves extra steps compared to CLI, so it's a pain., I see, thanks [~sershe] for the clarification., I think the addition to beeline behavior with the patch is it doesn't exit the shell only since it was already cancelling the query as an effect of closing of the socket. 

I did this manual test before and after the patch

Before: Ctrl+c exits the shell (it also cancels the query if you look into the HS2 logs)

{noformat}
0: jdbc:hive2://vihang-mbp.local:10000/defaul> select * from likes join names on likes.id = names.id;
WARNING: Hive-on-MR is deprecated in Hive 2 and may not be available in the future versions. Consider using a different execution engine (i.e. tez, spark) or using Hive 1.X releases.
vihang-MBP:bin vihang$
{noformat}

After:
{noformat}
0: jdbc:hive2://vihang-mbp.local:10000/defaul> select * from likes join names on likes.id = names.id;
WARNING: Hive-on-MR is deprecated in Hive 2 and may not be available in the future versions. Consider using a different execution engine (i.e. tez, spark) or using Hive 1.X releases.
Interrupting... Please be patient this may take some time.
Error: Query was cancelled (state=01000,code=0)
0: jdbc:hive2://vihang-mbp.local:10000/defaul>
{noformat}
, Patch looks good, +1., Thanks for the review [~ctang.ma], Updated the subject., Committed to 2.2.0. Thanks [~vihangk1] for the patch., Thanks [~ctang.ma] and [~sershe] for the review. Does this need to be committed in 1.2 branch as well?, Should this change of behavior be documented in the wiki?, Thanks [~leftylev] for reminding. Yes, I think this should be documented. I will update the wiki and post a comment here once done so that you can review., [~vihangk1] Branch 1.2 is for maintenance releases of 1.2.x release, so it should be used only for critical bug fixes. Branch-1 is where improvements/features like this one would go, so that it can be part of a 1.3.0 release.
However, the state of unit tests in branch-1 seemed quite bad last I saw. I think that would need a cleanup before we can add patches there. Without that, its hard to say if new patches are breaking something.

, Thanks [~thejas] for the information. I am okay with this patch not being committed to branch-1. Sergey mentioned 1.2 when the JIRA was created and hence I thought of including this patch in branch-1. I agree, lets stabilize branch-1 first before adding new patches., Hi [~leftylev] I updated the BeeLine wiki which documents this behavior https://cwiki.apache.org/confluence/display/Hive/HiveServer2+Clients#HiveServer2Clients-Cancellingthequery

Please let me know if you need any changes in the text. THanks!, Thanks for the doc, [~vihangk1].  I made a few minor edits, including changing the capitalization which breaks your link above.  Here's the new link:

* [HiveServer2 Clients -- Cancelling the Query | https://cwiki.apache.org/confluence/display/Hive/HiveServer2+Clients#HiveServer2Clients-CancellingtheQuery]]