[There is a conflict when applying hive-1183.diff to branch-0.5.
Can you generate a patch for branch-0.5?, This is caused by HIVE-978. We added the ${version} to the jar/war filenames.
Is there anything additional that we need to do?

, Patch against 5 branch, Build file was looking for war in build/ not build/hwi. Error message printed wrong path causing confusion. Added commented out description of variable since war finding logic has changed recently., Thanks Edward.

1. Shall we show a message that the user should set hiveconf {{hive.hwi.war.file}} if the war file is not found?

2. See HIVE-1183.showidea.diff. We can use "filterset" to change the file content when copying. This can help users get started without any manual changes to the conf file.

What do you think?
, It should never be the case that this file is not found. We should not need userspace checking as this was a buildfile *nd code error. , What do you think about HIVE-1183.showidea.diff then?
, hive-1183.showidea.diff is fine by me.  I am away from my normal setup on business so I do not have the tools to patch this up right now. If anyone else wants to that is fine by me. All I care is that HWI starts out of the box :) , This is the patch for both trunk and branch-0.5., +1

will commit if the tests pass, committed in 0.5 and trunk. Thanks Zheng, 
I assumed we were going to merge to the two patches. Zheng's work at finding the patch is good, but notice the FileNotFound is not displaying the correct var....So I will open another ticket on that.
, The wiki had given "$\{HIVE_HOME\}/lib/hive_hwi.war" as the default for *hive.hwi.war.file* (note the underscore) so I changed it to  "$\{HIVE_HOME\}/lib/hive-hwi-<version>.war" in the Hive Web Interface doc and gave both defaults with version information in the Configuration Properties doc.

* [Hive Web Interface -- Configuration | https://cwiki.apache.org/confluence/display/Hive/HiveWebInterface#HiveWebInterface-Configuration]
* [Configuration Properties -- Hive Web Interface | https://cwiki.apache.org/confluence/display/Hive/Configuration+Properties#ConfigurationProperties-HiveWebInterface(HWI)]]