[Configurations set by "set" command is not propagated to JobConf for MR job. It's just used inside of hive.

In above case you mentioned, value of "mapreduce.jobtracker.split.metainfo.maxsize" applied to hadoop is 10M(default) which is 1/10 of your expectation. If you change mapred-site.xml, it would not occur.

I also think there should be a way to change properties of JobConf. But some permission things should be preceded before that., Hey Navis,

While raising that maxsize value is a workaround, if Hive is still storing dupe locations post MAPREDUCE-2021, it must be fixed.

I'm not very well versed with Hive's implementation of CombineFileInputFormat to tell if it is fixed for sure, as the getSplits(…) method seems to be highly overridden. But from what I've read briefly, this should already be fixed in Hive runtimes that use 0.22 or above releases, via MAPREDUCE-2021.

If you agree, we can close this., You're right. This should be fixed.

https://reviews.facebook.net/D4899, +1. Will commit if tests pass., @Navis: Please attach a copy of the patch to this ticket. Thanks., Committed to trunk. Thanks Navis!, Integrated in Hive-trunk-h0.21 #1659 (See [https://builds.apache.org/job/Hive-trunk-h0.21/1659/])
    HIVE-3387. Meta data file size exceeds limit (Navis Ryu via cws) (Revision 1382600)

     Result = FAILURE
cws : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1382600
Files : 
* /hive/trunk/shims/src/0.20/java/org/apache/hadoop/hive/shims/Hadoop20Shims.java
* /hive/trunk/shims/src/common-secure/java/org/apache/hadoop/hive/shims/HadoopShimsSecure.java
, Integrated in Hive-trunk-hadoop2 #54 (See [https://builds.apache.org/job/Hive-trunk-hadoop2/54/])
    HIVE-3387. Meta data file size exceeds limit (Navis Ryu via cws) (Revision 1382600)

     Result = ABORTED
cws : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1382600
Files : 
* /hive/trunk/shims/src/0.20/java/org/apache/hadoop/hive/shims/Hadoop20Shims.java
* /hive/trunk/shims/src/common-secure/java/org/apache/hadoop/hive/shims/HadoopShimsSecure.java
, This issue is fixed and released as part of 0.10.0 release. If you find an issue which seems to be related to this one, please create a new jira and link this one with new jira., Adding this comment to make this easier to find, the error message is below. 

java.io.IOException: Split metadata size exceeded 10000000. ]