[My colleague, [~esteban], pointed out that the SQL92 standard (http://www.contrib.andrew.cmu.edu/~shadow/sql/sql1992.txt, 8.2  <comparison predicate>) qualifies this thought and that Hive does have a bug., Would it make more sense to support the SQL comparison semantics using new char data types, so that we don't break existing behavior for strings? I've created HIVE-4844., This issue is causing real-world problems. We hit this with our product in building a SQL-H connector.
Facebook has patched this internally.
Why is it not out in the community or a Hive conf parm that is settable?, Making this configurable may be difficult:  suppose you have a join with ON clause comparing 2 strings and the join is a hash join.  This setting would affect how hash table is built/probed (depending on how one chooses to implement this) and any other operator that relies on hashing.  Predicate pushdown and index building/usage could be affected.

I've see DBs that ignore trailing white space and some that do not.  I've also seen some that are case sensitive and some that are not.  (Unfortunately I don't have a complete list, SQL server is insensitive, for example) , The ISO-SQL standard is very clear as to what a vendor may choose to do re blank padding semantics. Similarly, how operations such as min, max, distinct etc operate on a variable length character type. Persons simply comparing to another RDBMS need to compare what ISO states, where it allows 'vendor implementation' and to see what a given vendor claims.

For example, if you were to use Postgres and other vendors derived from it. You will find various differences with respect to 

length( char (n) ) vs varchar(n)
group by
min
distinct/union ....

To some persons trailing spaces are of no interest and they may assume that one general string type will 'ignore' spaces. Others may state to their business application that trailing spaces are significant. That is distinct from what a given standard states or perhaps what a vendor chooses to implement irrespective of any given standard.

It would help either way if the Hive QL documentation could be improved to state intent of a given construct/feature.

]