[Modified Eclipse .classpath file to include missing libs. For some reason I'm unable to assign this bug to myself., Question about this issue - how are you launching the CLI from within eclipse?, After importing the hive project as described in hive's README.txt, expand the package navigator and scroll to the bottom. Then right click on HiveCLI.launch and 'Run as' HiveCLI.

P.S.: Could you tell me how to assign this JIRA to myself? Thanks., Have added you to the contributors so you should be able to assign things to yourself now.

Thx., +1. Looks good to me. I think in future we should move all the lib dependencies in the eclipse files to come from build/dist/lib as that will help us migrate more stuff over to ivy.

Will run tests and commit once the tests pass., I was thinking to move everything that came from ivy to build lib. I see the benefit, but I saw this technique adding more copies and moves into the ant process. Try different approaches. I  found none of them were better then the next. All involved doing more work hear and less there, or changing this classpath insteasd of putting a file into X folder. I was kinda confused on the "best way" to handle that. I would be interested to swee what you come up with., 1 copy is anyway done from lib to dist/lib for these jars. If we go directly to ivy we would copy things from the ivy cache to dist/lib. So the number of copies in the build process
would remain the same, no? There is of course the first time overhead of downloading these jars from their repos to the ivy cache., +1 Can someone with the necessary bits please commit this? Thanks!, 
{quote}
1 copy is anyway done from lib to dist/lib for these jars. If we go directly to ivy we would copy things from the ivy cache to dist/lib. So the number of copies in the build process
would remain the same, no? There is of course the first time overhead of downloading these jars from their repos to the ivy cache.
{quote}

I follow what you are thinking. Currently the code I did takes specifc jars from metastore ivy dowloads. We could probably have ivy download directly to build/lib. I just think we should watch to make sure many unneeded jars do not appear., Committed. Thanks Vinithra!!
]