[This seems to be coming from a static block in Task that calls PTFUtils.makeTransient -- [~ashutoshc]/[~rhbutani], could you please look to see if this is necessary?, (Also tagging [~vikram.dixit] because this is a bug introduced in 0.14, so should ideally be fixed in 0.14), How come this class isn't present? Are you not adding hive-metastore to the required jars?, bq.  How come this class isn't present? Are you not adding hive-metastore to the required jars?

Hive-metastore is always packaged as part of the oozie hive sharelib.   This issue is seen intermittently.   This could be related to localization of jars, the claaspath jar or some thing within hive that triggers an indeterminate class loading order.   That said, [~rhbutani], [~ashutoshc] also looked into this and think that this exception block is not needed and can/need to be removed since the introduction of the new serialization facility used., I couldn't make a environment to test but runtime class like Task should not have reference to classes in metastore. Attached patch is just for it (not intended for a fix)., [~navis] Your patch is useful, as you noted we dont want to have metastore classes being referenced in Task classes. So, we should get this in regardless of oozie problem. 
But, I also wonder whats the need for that static block, anyway. Field is already marked transient, which Kryo will already respect. For javaXML, even if its get serialized, it should not be a problem, its just a boolean. Shall we get rid of static block too?, In the meanwhile, running HiveQA to check for any failures., 

{color:red}Overall{color}: -1 at least one tests failed

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12678152/HIVE-8646.1.patch.txt

{color:red}ERROR:{color} -1 due to 3 failed/errored test(s), 6608 tests executed
*Failed tests:*
{noformat}
org.apache.hadoop.hive.cli.TestCliDriver.testCliDriver_transform_acid
org.apache.hadoop.hive.cli.TestMiniTezCliDriver.testCliDriver_optimize_nullscan
org.apache.hive.minikdc.TestJdbcWithMiniKdc.testNegativeTokenAuth
{noformat}

Test results: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/1564/testReport
Console output: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/1564/console
Test logs: http://ec2-174-129-184-35.compute-1.amazonaws.com/logs/PreCommit-HIVE-TRUNK-Build-1564/

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
Tests exited with: TestsFailedException: 3 tests failed
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12678152 - PreCommit-HIVE-TRUNK-Build, I think we should just go with Navis' patch for now. Since he removed the FieldSchema reference there's a good chance this resolves the oozie issue. [~venkatnrangan] can test once it's in. The problem with "it's just a boolean" is that we clone tasks a lot and there might be weird side effects of removing the block. +1 for trunk and branch., Test failures are unrelated. (ran acid test locally - passed, the other two I've seen failing in the past)., Committed to trunk and branch. [~venkatnrangan] please verify. If this is still an issue we need a repro to move forward., This has been fixed in 0.14 release. Please open new jira if you see any issues.
]