[uploaded patch against 0.17 hive code
(hive code available at http://mirror.facebook.com/facebook/hive/), uploaded a patch for CliDriver for hadoop trunk, Hi Jeremy,

Thanks a bunch for the patch. 

One comment though - it would be great if the patch is able to pass all the empty lines around to the parser for debuggability purposes. Otherwise, it will be impossible for the users to figure out where the error happened in a statement. 

you bring up a good point about processLine calling the trim function. We should move that to the checks in processCmd and not trim the line in processLine and we should pass the command as is to qp.run(cmd) call in processCmd.

What do think?, The patch looks good except for trimming that Ashish pointed out. there is some code in CliDriver.main() which does similar thing but little differently. Could you make the two uniform so that multi-line query behaves the same both from a file and from command line?, also, mysql client assume that a newline is a word break. so 'select\n* from tabA;' is a valid query in mysql but not in the code above or in main() function. I think we do want to make it as similar to mysql client as possible., proposed new patch for 0.17:
- supports comments properly (lines started with "--")
- keeps empty lines etc... so error position is closer to reality, easier to debug.
- shows the number of line offset in the INFO log to ease debugging of the error position (not very pretty implementation but it helps)
- some cleanup, Prasad, I don't observe the issue with something like 'select\n* tabl;'
I do all the time this in my hql files without problems.
do you have an actual example?, oh the problem i mentioned only if you are using interactive shell. so first line enter select and on second prompt enter a.* from tabA a;, your example is actually working for me in 0.17.3, at least with the patched version.
I remember observing something similar when using 0.19, but only for some time. But I was changing the code and playing with multiple combinaisons of hive/hadoop versions at the time. can you try the new patch?, Hi Jeremy,

Couple of issues
1) Should line 166 be in inside the if (m.matches()) condition?
2) line 185: i think if loop gets executed even if the last line doesn't end with a ';'
3) I think processLine should be used instead of processCmd. Otherwise the code can't handle cmds like 'select a.* from tabA a; select \nb.* from tabB b'
4) also, could you update the patch with new code available for 0.17. There have been some changes that make the commands case insensitive.

It will be good if you can make similar changes to code that handles interactive commands (in main()). If not we can do that in a separate JIRA as well. , +1

Jeremy, the patch looks good to me. Thanks for the contribution.

One thing though.

1. The latest patch is generated from the directory that contains CliDriver.java so I think the hadoop QA will fail as it expects the patch to be generated from the root of the source tree.

Prasad,

is your issue resolved?
, yeah, my issue is resolved but see the comments above., Simplified the fix for this in order to address prasad's concerns.

I have tested this to a limited extent inside fb. However, without getting the test harness in place for cli tests, I am not able to add unit tests for this at this time. (I think we should get the test harness for the cli in place as soon as possible - I tried to do it in QTestUtil but the changes there are more involved than what I would have liked to put in this transaction)

Incidentally, the fix here mimics what QTestUtils.java does for calling the internal cli driver for its test (The issue is that there is no test harness for bin/hive scripts).

Please review and provide any feedback., +1, The patch didn't pass unit tests.

    [junit] 08/12/09 16:42:57 ERROR ql.Driver: FAILED: Parse Error: line 0:-1 cannot recognize input '<EOF>'

    [junit] org.apache.hadoop.hive.ql.parse.ParseException: line 0:-1 cannot recognize input '<EOF>'

    [junit]     at org.apache.hadoop.hive.ql.parse.ParseDriver.parse(ParseDriver.java:258)
    [junit]     at org.apache.hadoop.hive.ql.Driver.run(Driver.java:163)
    [junit]     at org.apache.hadoop.hive.cli.CliDriver.processCmd(CliDriver.java:174)
, I am checking into this., Just want to confirm that you are not seeing this in the negative tests. The negative tests do generate this on the ant output though they finally report that the tests passed. Which particular test is failing?, Resubmitting after fixing the test run and capturing new logs., +1, Committed revision 725472., HIVE-47. CLI to support multiline queries from an input file.
(Ashish through zshao)
]