[FYI [~jcoffey] [~xuefuz], I'll investigate., the patch was developed against this commit: b05004a863b09cbe5f4b734c5474092f328f0c41

unit tests and qtests run fine against this commit.

the latest commit (as of today): 1a3608d8b1f8cf41e9ba2fc7e9bacdecf271bb92

Appears to have broken qtests (none will run) and so I can't verify the patch specific qtest.  Unit tests, however, execute without error., Credit should be given to Remy Pecqueur <r.pecqueur@criteo.com>, Hi, for aggregator functions we saw the issue as well and I made a fix in HIVE-6477, I guess it is the same fix.

, Hi Justin, I think this version of the fix looks more complete than mine, let's go with this one if it works.  

But just some comments.  Which version of the branch did you create the branch from?  There are some late changes that added new output to all q.out file in HIVE-5958, and this might need to regenerate based on that.  

Also does the query need a "sort by" after "group by" to guarantee deterministic result of the q.out file?  Thanks., Sorry, I meant "order by"., Hi Szehon, I worked off of the trunk on this.  We are applying cleanly to the latest commit and unit tests pass, but our qtest fails after the commit for #HIVE-5958.  qtests for parquet_create.q work just fine though.

We're digging into it., Oh, and we don't appear to need the order by for deterministic tests, but I have added it and will submit an updated patch with it (once we have gotten to the bottom of these failures).

btw are your qtests passing in #HIVE-6477?, Updated patch with working unit and qtests applicable to trunk commit: 6010e22bd24d5004990c63f0aeb232d75693dd94 (#HIVE-5954), Hmm, I applied your patch on trunk, and new test (parquet_types) still fails for me with missing output due to HIVE-5958.  Let's see how pre-commit tests go.  Yea my tests pass pre-commit test in HIVE-6477, I had added regeneration of output.

Other than that, +1 (non-binding).  Thanks for doing order-by, from my experience its useful for group by, as each group goes to one reducer, and no guarantee from MR framework that they wont run in parallel.

, Quick comment on the code change:

Hive doesn't throw runtime exception when the data isn't right. In terms of error handling, Hive returns null for data errors, including data-out-of-bound as in this case., 

{color:red}Overall{color}: -1 at least one tests failed

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12630955/HIVE-6414.2.patch

{color:red}ERROR:{color} -1 due to 2 failed/errored test(s), 5196 tests executed
*Failed tests:*
{noformat}
org.apache.hadoop.hive.cli.TestCliDriver.testCliDriver_parquet_types
org.apache.hadoop.hive.cli.TestMinimrCliDriver.testCliDriver_auto_sortmerge_join_16
{noformat}

Test results: http://bigtop01.cloudera.org:8080/job/PreCommit-HIVE-Build/1491/testReport
Console output: http://bigtop01.cloudera.org:8080/job/PreCommit-HIVE-Build/1491/console

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
Tests exited with: TestsFailedException: 2 tests failed
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12630955, [~xuefuz] ok will recheck qtest and resubmit with nulls and not exceptions.  I wasn't sure what the behavior should be in the case of an overflow., Update patch based on comments from Xuefu., Hi Justin, thanks for taking care of it.  Do you want resubmit the patch for testing for this issue?  There had been an issue where the pre-commit test queue got lost., +1 to the patch #3., Re-submitting the patch, on behalf of Justin, to retrigger the pre-commit test., 

{color:red}Overall{color}: -1 at least one tests failed

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12633208/HIVE-6414.3.patch

{color:red}ERROR:{color} -1 due to 4 failed/errored test(s), 5371 tests executed
*Failed tests:*
{noformat}
org.apache.hadoop.hive.cli.TestMinimrCliDriver.testCliDriver_bucket_num_reducers
org.apache.hive.beeline.TestSchemaTool.testSchemaInit
org.apache.hive.beeline.TestSchemaTool.testSchemaUpgrade
org.apache.hive.service.cli.TestEmbeddedThriftBinaryCLIService.testExecuteStatementAsync
{noformat}

Test results: http://bigtop01.cloudera.org:8080/job/PreCommit-HIVE-Build/1641/testReport
Console output: http://bigtop01.cloudera.org:8080/job/PreCommit-HIVE-Build/1641/console

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
Tests exited with: TestsFailedException: 4 tests failed
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12633208, hello, I don't think these are related to the patch, so resubmitting for retesting., TestMinimrCliDriver.testCliDriver_bucket_num_reducers is flaky. Other failures are appearing in other test runs as well., Patch committed to trunk. Thanks to Justin for the contribution., ported to 0.13 branch]