[added generated test code path as well, +1
Looks good.


How do we add the test setup?, since this is eclipse template file, there isn't any needed for tests, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12389767/hadoop-4092-2.patch
  against trunk revision 694562.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 7 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 core tests.  The patch passed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3258/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3258/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3258/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch/3258/console

This message is automatically generated., I just committed this. Thanks Prasad!, Dhruba, as you can see, contrib got a -1.  If you look at the console it's because the eclipse jars in the eclipse classpath are different from what test-patch.sh see's in the lib directory.

Please revert this.  The patch should also include a fix to test-patch.sh., FYI, until this patch is reverted, all patches will get a -1 in the contrib component.

, Oops, I looked at the test results and saw that all tests were passing. Did not look at the console output. , Change reverted., Integrated in Hadoop-trunk #605 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-trunk/605/]), Please mark it as a blocker for 0.19 if required, See hive-203]