[CBO shouldn't kick in this case since there is nothing to optimize.
[~pxiong] Could you take a look?, [~ekoifman], could you try again on the latest trunk? I was not able to reproduce it.
with CBO enabled, the first time I run insert and I put a break point at   _selectStar 
(currently 3865) and examine _out_rwsch.rslvMap
{code}
values__tmp__table__1{(tmp_values_col1,_col0: string)(tmp_values_col2,_col1: string)} 
{code}
The query failed, but I did see "values__tmp__table__1" rather than null.
{code}
FAILED: NullPointerException null
{code}
If I run the same insert again, I will see
{code}
values__tmp__table__2{(tmp_values_col1,_col0: string)(tmp_values_col2,_col1: string)} 
{code}
I still can not see "null"., [~ekoifman], could you try again on the latest trunk? I was not able to reproduce it.
with CBO enabled, the first time I run insert and I put a break point at   _selectStar 
(currently 3865) and examine _out_rwsch.rslvMap
{code}
values__tmp__table__1{(tmp_values_col1,_col0: string)(tmp_values_col2,_col1: string)} 
{code}
The query failed, but I did see "values__tmp__table__1" rather than null.
{code}
FAILED: NullPointerException null
{code}
If I run the same insert again, I will see
{code}
values__tmp__table__2{(tmp_values_col1,_col0: string)(tmp_values_col2,_col1: string)} 
{code}
I still can not see "null"., [~pxiong], I did see this on latest trunk.  I saw this issue many times, it's very consistently reproducible.  If the stack trace of the NPE matches HIVE-10828  you can apply the patch in that bug.  It is not necessary to reproduce the issue.  The NPE happens later in the processing., [~ekoifman], I assume that we are focusing on the RowResolver rather than the NPE? So I should be able to reproduce that without HIVE-10828 patch? And we are talking about the null that you found in
{code}
{null={values__tmp__table__1.tmp_values_col1=_col0: string, values__tmp__table__1.tmp_values_col2=_col1: string}}
{code}?
If that is the case, I tried many times, but I can not reproduce that......., yes that's correct.  Are you running the test case exactly as in bug description? (with both properties set), Yes, I set the properties as you mentioned and follow the instructions step by step. Thanks., For top most project we use fully qualified col names as col aliases.
Hive seems to miss table aliases in RR for this case.

This shouldn't cause a problem since top level table alias shouldn't have any consumers., This issue will go away once return path is completed]