[cc [~vihangk1] fyi, this also affects Parquet, Thanks for reporting [~sershe] and letting me know. I can take a stab at this if no-one else is planning to work on this., Hey, I was planning to work on it, but not for a while (after some other bugs), so feel free if you want to.
My thinking after looking at the row converters was that the actual changes for most types are simple and insignificant (varchar lengths is one), so the change would be mostly wiring. It should be easy to add a separate VRB converter rather than trying to shoehorn this into VectorDeserializeRow or OI converters, since both of these deal with rows (row->row or row->VRB). All the necessary schema and stuff are available in VectorMapOperator - it is already used for the non-native-VRB case.
Then making sure it doesn't apply to cases that do their own conversion (the only one right now is ORC) is another small wiring issue. 
, ConvertTreeReader stuff actually looks perfect for VRBs in this case. However it's in ORC project and tied to TreeReader interface which is not ideal... trying to see if it might be possible to reuse it as is.
Other options include refactoring in ORC (that will delay this a lot) or copying the relevant parts to Hive and removing TreeReader/ORC dependency there; then as the next step refactoring ORC to make actual CV->CV conversions reusable and switching to those, or even moving them to storage-api, Actually, trying this now on master I can no longer repro with Parquet in q files; I think I could repro on the cluster recently.
It seems to get the table schema correctly in the q file and/or master run, but then it fails with a different error when converting a float column to int (UnsupportedOperationException when trying to read int).

Summary of results on master in q files: parquet returns correct length for varchar but throws on float->int; ORC with or w/o LLAP IO returns correct lengths but nulls out some values for float->int; text w/o LLAP IO returns all values correctly; text with LLAP IO returns incorrect lengths and also throws on float->int col., Ok I was finally able to return to this.
Looks like it's a much bigger change than I expected.

I included the test that returns different results for different cases and in fact fails in LLAP IO with either ORC or text...
I cannot repro the issue with Parquet anymore, at least not for these conversions.

For now I won't be working on this anymore... I think ConvertTreeReader-s conversion aspects need to be moved from ORC to Hive, since they should not be ORC specific. Or at least conversion logic should be refactored to be reusable in wider range of cases. cc [~mmccline]]