[Attached the patch, This is great work. The larger problem becomes how are we going to unit test these things and ensure they stay working. Also I think we are talking the wrong approach on this. Rather then making the actual problem better we are making it works. I am -1 on this approach.

Java has tools to build tar and zip files. We should be re-writing these tools in Java rather then writing hooks to do everything the wrong way twice., I agree with Ed. Pure java based solution is more desirable then a platform specific tools like tar or cabarc. Apache already has one such library which could be used http://commons.apache.org/compress/, We should also avoid forking shells, and doing things like IF (WINDOWS) unless it is unavoidable. In all these windows fixes we can clean some technical debt., Thanks Edward, Ashutosh, It is a good suggestion. In fact, I prefer the platform independent code but I targeted to minimize the number of changes in my initial patches to get it working on Windows and avoid any regressions on UNIX. Let me explore the option to use code based archiving too. Is it ok if we address this in follow-up jira?

Thanks, If you think you need a follow up Jira please create one, but as this issue is concerned: Do not worry about minimizing the changes. Typically we make large changes rather then a series of smaller ones. This is because the review and test process takes a fair amount of time. That being said it is better to do the changes once correctly. Sometimes there is a good reason that we are doing something round-about like forking a process but many times (including this time as far as I can tell) the code should be changed drastically., JAVA based archiving & compression using apache common compression library (commons-compress-1.4.1.jar).  

Note: All unit tests are passing but CLI tests are taking little bit extra time. It seems to be a small perf hit because of JAVA vs Native tools.
, Attached the patch with JAVA based archiving & compression using apache common compression library (commons-compress-1.4.1.jar). 

Note: All unit tests are passing but CLI tests are taking little bit extra time. It seems to be a small perf hit because of JAVA vs Native tools.
, @Kanna: Please submit a review request on reviews.apache.org. Thanks., Thanks Carl. I submitted the review request.

, Review request: https://reviews.apache.org/r/5474/
, When you say small performance hit. What are the numbers you are seeing? I am going to play with the feature review later today., Thanks Edward, My initial observation is It took approximately 235 seconds extra time to complete the full test run on my unix test box. Is there any specific test case that I can run and capture the numbers with/without my changes?, The unit tests usually run multiple hours, if this patch adds less then 5 minutes this is not a big deal., +1 . Will commit

The surface time of tests swings so dramatically the performance of tar is not an issue. In fact a test I did ran faster with your patch then without.

{noformat}
  [junit] diff -a /home/edward/hive/trunk/build/ql/test/logs/clientpositive/timestamp_lazy.q.out /home/edward/hive/trunk/ql/src/test/results/clientpositive/timestamp_lazy.q.out
    [junit] Done query: timestamp_lazy.q elapsedTime=32s


    [junit] diff -a /home/edward/hive/trunk/build/ql/test/logs/clientpositive/timestamp_lazy.q.out /home/edward/hive/trunk/ql/src/test/results/clientpositive/timestamp_lazy.q.out
    [junit] Done query: timestamp_lazy.q elapsedTime=38s
{noformat}, Thanks! Windows support here we come., Thanks Edward., Integrated in Hive-trunk-h0.21 #1506 (See [https://builds.apache.org/job/Hive-trunk-h0.21/1506/])
    HIVE-3128 Use commons-compress instead of forking tar process (Kanna Karanam via egc) (Revision 1353044)

     Result = FAILURE
ecapriolo : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1353044
Files : 
* /hive/trunk/common/ivy.xml
* /hive/trunk/common/src/java/org/apache/hadoop/hive/common/FileUtils.java
* /hive/trunk/ivy/libraries.properties
, Hi Edward - It looks like a random failure not related to these changes. Please let me know if you see something that I am missing.
Thanks, Unrelated all is well., Integrated in Hive-trunk-h0.21 #1515 (See [https://builds.apache.org/job/Hive-trunk-h0.21/1515/])
    HIVE-3180 Fix Eclipse classpath template broken in HIVE-3128. Carl Steinbach (via egc) (Revision 1354187)

     Result = FAILURE
ecapriolo : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1354187
Files : 
* /hive/trunk/eclipse-templates/.classpath
, Integrated in Hive-trunk-h0.21 #1567 (See [https://builds.apache.org/job/Hive-trunk-h0.21/1567/])
    HIVE-3295. HIVE-3128 introduced bug causing dynamic partitioning to fail. (kevinwilfong reviewed by njain, ashutoshc) (Revision 1365460)

     Result = FAILURE
kevinwilfong : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1365460
Files : 
* /hive/trunk/common/src/java/org/apache/hadoop/hive/common/CompressionUtils.java
* /hive/trunk/common/src/java/org/apache/hadoop/hive/common/FileUtils.java
* /hive/trunk/ql/src/java/org/apache/hadoop/hive/ql/exec/ExecDriver.java
, Integrated in Hive-trunk-hadoop2 #54 (See [https://builds.apache.org/job/Hive-trunk-hadoop2/54/])
    HIVE-3295. HIVE-3128 introduced bug causing dynamic partitioning to fail. (kevinwilfong reviewed by njain, ashutoshc) (Revision 1365460)
HIVE-3180 Fix Eclipse classpath template broken in HIVE-3128. Carl Steinbach (via egc) (Revision 1354187)
HIVE-3128 Use commons-compress instead of forking tar process (Kanna Karanam via egc) (Revision 1353044)

     Result = ABORTED
kevinwilfong : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1365460
Files : 
* /hive/trunk/common/src/java/org/apache/hadoop/hive/common/CompressionUtils.java
* /hive/trunk/common/src/java/org/apache/hadoop/hive/common/FileUtils.java
* /hive/trunk/ql/src/java/org/apache/hadoop/hive/ql/exec/ExecDriver.java

ecapriolo : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1354187
Files : 
* /hive/trunk/eclipse-templates/.classpath

ecapriolo : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1353044
Files : 
* /hive/trunk/common/ivy.xml
* /hive/trunk/common/src/java/org/apache/hadoop/hive/common/FileUtils.java
* /hive/trunk/ivy/libraries.properties
, This issue is fixed and released as part of 0.10.0 release. If you find an issue which seems to be related to this one, please create a new jira and link this one with new jira.]