[The same bug is found on hive 0.7.1 as well, This seems to be because the we don't check if the comment is null before we add it. Then, later, when we're trying to write out using thrift, thrift throws the NPE when it tries to read from parameters and tries to write out as-is. The following fixes this error:


--- ql/src/java/org/apache/hadoop/hive/ql/metadata/Hive.java	(revision 1347150)
+++ ql/src/java/org/apache/hadoop/hive/ql/metadata/Hive.java	(working copy)
@@ -709,7 +709,10 @@
 
       Index indexDesc = new Index(indexName, indexHandlerClass, dbName, tableName, time, time, indexTblName,
           storageDescriptor, params, deferredRebuild);
-      indexDesc.getParameters().put("comment", indexComment);
+      if (indexComment != null)
+      {
+        indexDesc.getParameters().put("comment", indexComment);
+      }
 
       if (idxProps != null)
       {
, Sample code that demonstrates bug:

{code}
drop table if exists missing_ddl_3;
drop index if exists missing_ddl_3_index on missing_ddl_3;
create table missing_ddl_3(name string, age int, gpa double);
insert overwrite table missing_ddl_3 select name, age, gpa from studenttab10k;
create index missing_ddl_3_index on table missing_ddl_3(name) as 'COMPACT' WITH DEFERRED REBUILD;
alter index missing_ddl_3_index on missing_ddl_3 rebuild;
{code}

This will fail at the create index time itself(ignoring the rebuild)., @Sushanth,
Reason it happens only in thrift client-server mode and your suggested fix of null-checking strongly hints to me that thrift layer is not able to handle nulls very well. This is  kind of surprise to me as I thought thrift can handle nulls. I think there is a value in figuring out if this really is the case and file a bug with thrift project since it looks like this may bite us again in future., Ashutosh, digging a bit more into thrift sources, this is what I find:

http://svn.apache.org/repos/asf/thrift/trunk/lib/java/src/org/apache/thrift/protocol/TBinaryProtocol.java

If you look at the method writeString there, it does not check for null, it calls str.getBytes(). So as of thrift trunk, this does not work. I'm not sure if that's intentional on thrift's part (to maximize speed by minimizing checks) and something to fix on hive's side, or something to fix on thrift's side.

In the meanwhile, I've added a testcase for this bug in the RemoteHiveMetaStore, I'm updating the patch now., Hmm, actually, the problem does go deeper than that. We'd have the same issue if a user were to set one of the parameter values as null. We'd fix this issue by this patch, but only to hit it again with other user code., Thanks, Sushanth for digging in. I have created THRIFT-1625 to get response from thrift devs. Thats what my worry is if thrift can't handle nulls cleanly then we have to litter our codebase with null-checks everywhere., Linking with thrift issue., This thread makes for interesting reading, and refers to the same issue:

http://www.mail-archive.com/thrift-dev@incubator.apache.org/msg01185.html, Fixed as a part of HIVE-3722, khorgath has abandoned the revision "HIVE-2800 [jira] NPE in "create index" without comment clause in external metastore".

  Same change implemented by HIVE-3722, redundant now.

REVISION DETAIL
  https://reviews.facebook.net/D3519

To: JIRA, ashutoshc, khorgath
, This issue is fixed and released as part of 0.10.0 release. If you find an issue which seems to be related to this one, please create a new jira and link this one with new jira.]