[Implements the API in a simplest possible way, SARG evaluation is done in metastore but still with full deserialization. Phase 2 (separate JIRA) will include storing only necessary data in separate CF in HBase to avoid deserialization and pave the way for phase 3 where we can push this to HBase filter. Given that filters are right now min-max only we can even get rid of ORC dependency and use standard HBase filters, but it will make pushdown difficult for future improvement, need to talk to Gopal and Owen/Prasanth before doing that.

This is a patch on top of umpteen other patches that are not committed, in particular HIVE-11553 and HIVE-11705, maybe others. Patch management is becoming PITA.

[~alangates] can you review? :) This particular patch is not super urgent., Rebased the patch on master, [~sushanth] [~alangates] can you take a look?
https://reviews.apache.org/r/39026/, +cc [~mithun] who was interested in this sort of api a while back., [~thejas] Sushanth suggested pinging you :), This patch will need a slight modification. If we send stripe boundaries in the PPD result, we don't need to return the footer at all. The rest can be reviewed., Updated patch; added a protobuf struct to return selected stripes; that way footer does not need to be returned to split generation, it can use this minimal structure directly. Metastore.java is generated code, [~mithun] reviews welcome ;), The rebased patch. [~alangates] [~thejas] [~daijy] can you please review?, Some comments posted to review board.  

Also a question around Metastore.java.  Why did you start a whole new protocol buffer class?  And why is the resulting Java code in the patch but not the protobuf file?, Future work is handled by HIVE-12051 (pushing into HBase).
As for proto file, it's out of the patch cause I forgot to git add it :) it's in 02 patch, will add it back.
The reason for a separate file is because it doesn't fit existing files, it's not directly an ORC structure, and not specific to HBase metastore (at least in theory)., 

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12766915/HIVE-11676.04.patch

{color:green}SUCCESS:{color} +1 due to 1 test(s) being added or modified.

{color:red}ERROR:{color} -1 due to 2 failed/errored test(s), 9694 tests executed
*Failed tests:*
{noformat}
org.apache.hive.hcatalog.api.TestHCatClient.testTableSchemaPropagation
org.apache.hive.jdbc.TestSSL.testSSLVersion
{noformat}

Test results: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/5670/testReport
Console output: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/5670/console
Test logs: http://ec2-174-129-184-35.compute-1.amazonaws.com/logs/PreCommit-HIVE-TRUNK-Build-5670/

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.TestCheckPhase
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
Tests exited with: TestsFailedException: 2 tests failed
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12766915 - PreCommit-HIVE-TRUNK-Build, +1, Committed to master., Thanks for the review!]