[Attach patch. Will add testcase later., Add test case., Would it not make more sense to add the new test to TestHCatLoaderComplexSchema, so that it's run with both ORC and RCFile?, Also, can HIVE-5020 now be closed as duplicate?, While this protects the difference between orc and rcfile from HCat, HIVE-5020 is about the differences in behaviour between rcfile and orc in how they handle nulls in maps, and should not be closed until hive has a consistent behaviour. I would actually prefer to solve this in a consistent manner in hive before applying this to hcat, as explained in comments in that jira. I'll try to revive the discussion there., When I digging more, I feel disallow null map key is more proper. Reasons are:
1. This can solve the semantic difference between orc and rcfile
2. Allow null map key seems risky, it will break assumption of some other code, eg, LazyMap, I agree that null key in a map is a bad idea.  Since we still have to deal with data which already has been written with null key, could we add some table property that will let user say "if data contains a map with null key, replace null with 'my_value' on read".  (Perhaps the same property can be used to change a null key to 'my_value' on write to support existing writers, but this of course won't work for all cases.)  This way null key can be disallowed., Resync the patch with trunk. Also in the new patch, I skip the null key entries in the map, this is consistent with null key handling in other part of Hive (HIVE-8115)., 

{color:red}Overall{color}: -1 at least one tests failed

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12675550/HIVE-7282.3.patch

{color:red}ERROR:{color} -1 due to 2 failed/errored test(s), 6569 tests executed
*Failed tests:*
{noformat}
org.apache.hadoop.hive.cli.TestMiniTezCliDriver.testCliDriver_cbo_correctness
org.apache.hive.hcatalog.streaming.TestStreaming.testTransactionBatchCommit_Json
{noformat}

Test results: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/1321/testReport
Console output: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/1321/console
Test logs: http://ec2-174-129-184-35.compute-1.amazonaws.com/logs/PreCommit-HIVE-TRUNK-Build-1321/

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
Tests exited with: TestsFailedException: 2 tests failed
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12675550
 - PreCommit-HIVE-TRUNK-Build, +1, looks good to me., Patch committed to both trunk and 0.14 branch., This has been fixed in 0.14 release. Please open new jira if you see any issues.
]