[Did you follow the steps at: http://wiki.apache.org/hadoop/Hive/GettingStarted/EclipseSetup, I don't think I have ever tested the Hive Eclipse environment with Hadoop-0.19. I don't think there is an easy way to compile Hive in Eclipse for both hadoop 17 and 19., Raghu: Yeah, I did. The problem is specified to 0.19...

Prasad: Yeah, I didn't find an easy way to do conditional compilation in Eclipse. Perhaps we could use reflection instead?, Hi Neil, that's a nice idea. Actually we do use reflection in some cases like this (Look at FileSinkOperator.java). Will you have time to take a try on this?
, Candidate patch, Candidate patch., Definitely is much better than the previous approach. So +1. I suppose this will not have a significant performance impact as well as validateInput is not going to get called in the data path any way. nice!!, You will also have to fix the javadoc target for ql in build.xml so that it creates the javadocs from the sources and not from ql/build. After that, this one should be good to checkin., Candidate patch, v2., Ashish: Thanks for the feedback. My revised patch makes the fix you suggested, I believe -- "ant tar binary" suggests without any unexpected warnings., Neil, you might want to completely remove 

{code}
  <target name="configure" depends="deploy-ant-tasks">
    <!-- If not set already make sure that they are defined but empty -->
    <taskdef name="getversionpref" classname="org.apache.hadoop.hive.ant.GetVersionPref"
             classpath="${build.dir.hive}/hive_anttasks.jar"/>

    <getversionpref property="hadoop.version.prefix" input="${hadoop.version}"/>

    <copy todir="${build.dir}/java">
      <fileset dir="${src.dir}">
        <include name="**/*.java"/>
      </fileset>
    </copy>
  </target>
{code}

from ql/build.xml, and let ql/build.xml to build from src/java instead of build/java.

What do you think?, Zheng: Thanks, that's a good idea. I've uploaded a revised version of the patch that incorporates your suggestion. Sorry this took so long for me to get around to..., +1

Looks good to me. Will be running tests on this and will then check it in., Ping? AFAIK this is ready to commit., yes it is. I ran into some local issues due to which some of the tests were failing in my environment. And then when I reran the tests some others started failing which are mainly due to data ordering not enforced in the test programs. I am changing that test and will check that in here. Will get this done over the weekend if not tonight.
, committed. Thanks Neil!!
]