[Yea I see it now too, good catch.  +1 (non-binding), Since this affects versions 0.11 and 0.12, the wiki should mention it.  

Should the wiki just say that --help doesn't work in those versions?  The usage message isn't documented yet, but it could go in this section:

* [HiveServer2:  How to Start |https://cwiki.apache.org/confluence/display/Hive/Setting+Up+HiveServer2#SettingUpHiveServer2-HowtoStart], Sreenivasulu can correct me if wrong, but looks like running './hive --service hiveserver2 --help' will print an 'unrecognized option' error, but as a side effect of that error, still displays the usage.  In other words, any parse error (even one trying to display usage) displays the usage.  

Up to you whether we want to document the defect, as it works in a weird way, but definitely the usage in general is good to document. , Oh, right.  But there's only one option besides help (--hiveconf) and that's standard for Hive, so does it really need to be documented in the wiki?  Well, no harm putting it in., +1, Committed to trunk. Thanks, Sreenivasulu!, Added a Usage Message section:

* [Setting Up HiveServer2:  How to Start |https://cwiki.apache.org/confluence/display/Hive/Setting+Up+HiveServer2#SettingUpHiveServer2-HowtoStart], Thanks Ashutosh Chauhan, szehon and Lefty Leverenz  for Review the Patch., [~szehon]
{code}
 public boolean process(String[] argv) {
    try {
      commandLine = new GnuParser().parse(options, argv);
      if (commandLine.hasOption('H')) {
        printUsage();
        return false;
      }
{code}
In the above code passing argument is handled by GnuParser class, there parse exception we are getting, in catch block any error we are getting, showing usage again.
{code}
catch (ParseException e) {
      System.err.println(e.getMessage());
      printUsage();
      return false;
    }
    return true;
  }
{code}
Better will throw parse Exception only.
Instead of printing usage again.
Based on Exception end user will come to know., This has been fixed in 0.14 release. Please open new jira if you see any issues.
]