[The reason for the warnings presented in this bug is Hive client tries to override some Hadoop final parameters defined in mapred-default.xml. To dig it deeper, Hive configuration inherits Hadoop configuration and the current way Hive overrides Hadoop parameters is:

1) Create a default Hadoop configuration (this contains all default Hadoop parameters including the ones defined as final).
2) Overlay parameters it wants to override on configuration created in 1).
3) Overlay configuration generated in 2) over the default Hadoop parameters it inherits (these default Hadoop parameters contains all default Hadoop parameters including the ones defined as final again).

Since configuration generated in 2) contains all the default Hadoop parameters and when it comes to 3), the warning is thrown.

Solution to resolve this problem is when 1) happens, instead of create a default Hadoop configuration, an empty Hadoop configuration is created and 2) overlays Hive parameters on this empty configuration. This way, in 3), configuration in 2) will override any default Hadoop parameters it wants to overrides, however, no warning will be thrown as 2) does not contain default Hadoop parameters.

I have tested this by different code path including:

1) keep everything as default
2) define overriding parameters in hive-site.xml
3) define overriding parameters in hive client shell

and all these cases work well., Can someone please help me to review this code? Thanks, Chu, sorry about the delay. I can test patched Hive to see if this resolves my original problem, please give me a few days.

In the meanwhile, even though this is a small patch, do you mind uploading it on Reviewboard or Phabricator? Thanks for contributing!, Patch doesn't apply cleanly on trunk anymore. [~stayhf] Can you rebase it on trunk ?, Sync the changes with trunk, [~mgrover], I tried to search on the Facebook Phabricator and I can't find this bug there. Do I need to create on there first and upload the patch to it afterwards? Thanks a lot., +1, Ashutosh +1'ed it. So, I guess there is no need for Phabricator now:-)

Thanks Chu and Ashutosh!, Committed to trunk. Thanks, Chu!, no problem, thank you for reviewing it [~ashutoshgupta17@gmail.com], Integrated in Hive-trunk-h0.21 #2126 (See [https://builds.apache.org/job/Hive-trunk-h0.21/2126/])
    HIVE-4403 : Running Hive queries on Yarn (MR2) gives warnings related to overriding final parameters (Chu Tong via Ashutosh Chauhan) (Revision 1489008)

     Result = FAILURE
hashutosh : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1489008
Files : 
* /hive/trunk/common/src/java/org/apache/hadoop/hive/conf/HiveConf.java
, I took a look at the Hudson build log and seems it is because of a build failure instead of test failure due to newly added functionality/bug fix., Chu, that's fine. Nothing required from your side., Integrated in Hive-trunk-hadoop2 #224 (See [https://builds.apache.org/job/Hive-trunk-hadoop2/224/])
    HIVE-4403 : Running Hive queries on Yarn (MR2) gives warnings related to overriding final parameters (Chu Tong via Ashutosh Chauhan) (Revision 1489008)

     Result = FAILURE
hashutosh : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1489008
Files : 
* /hive/trunk/common/src/java/org/apache/hadoop/hive/conf/HiveConf.java
, This issue has been fixed and released as part of 0.12 release. If you find further issues, please create a new jira and link it to this one.]