[[~gopalv]/[~sershe] Can someone please take a look?, Will this work with ACID?  I assume it will just do the dumb dump of the deltas treating them like separate, regular ORC files with different structure.
Is that true (or will it fail in some way), and is it intended (maybe it should dump the acidified output, or something)., I don't think there is anything special for the acid case here. Since delta files are still orc files it should still work. Acid files can be identified only by looking at the schema. The printed schema will have a struct for acid and another struct with actual row schema. , +1, 

{color:red}Overall{color}: -1 at least one tests failed

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12752835/HIVE-11669.1.patch

{color:red}ERROR:{color} -1 due to 1 failed/errored test(s), 9380 tests executed
*Failed tests:*
{noformat}
org.apache.hive.hcatalog.api.TestHCatClient.testTableSchemaPropagation
{noformat}

Test results: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/5095/testReport
Console output: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/5095/console
Test logs: http://ec2-174-129-184-35.compute-1.amazonaws.com/logs/PreCommit-HIVE-TRUNK-Build-5095/

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
Tests exited with: TestsFailedException: 1 tests failed
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12752835 - PreCommit-HIVE-TRUNK-Build, Test failure is unrelated. Committed patch to master and branch-1., Doc note:  This should be documented, with version information, in the ORC File Dump Utility section of the ORC doc.

* [ORC Files -- ORC File Dump Utility | https://cwiki.apache.org/confluence/display/Hive/LanguageManual+ORC#LanguageManualORC-ORCFileDumpUtility]

By the way, I don't see anything about the file dump utility in the ORC project documentation (https://orc.apache.org/docs/)., [~leftylev] I update the ORC file dump section in the hive docs. We need to migrate this information to orc docs page as well. But I suspect the syntax will change when ORC code moves out of hive. , Thanks [~prasanth_j].  I added a link to this JIRA issue.

I also opened ORC-26 so we won't forget to document the file dump utility when the time comes.

]