[Looks like in jpox to datanucleus transition in HIVE-445 this target was left behind., Invalid since the move to Maven, [~lars_francke] It will be good to have this functionality. Moving our build system has not provided this functionality nor made it obsolete. It will be good to have a maven target using which one can generate schema from jdo declaration. Shall we edit title of jira as "Provide generate-schema target" and reopen this?, Ah, maybe I have been too overeager. Do I understand this correctly that this goal would create the necessary schema (tables etc.) in an underlying database?

I've looked at the datanucleus Maven Plugin http://www.datanucleus.org/products/datanucleus/jdo/schema.html
That does have a schema-create goal which one can just run. The only problem I am facing there is that it expects the DB Driver on the classpath so we'd need a profile for every DB....I think.

I'd be in favor of leaving this closed until someone needs it and is willing to work on it but I won't object if you want to open it again :), No, it will not create schema, but will generate sql file which you can than run to create schema. But, second half of your point is still valid I believe because target requires jdbc connector jar on path. I think useful thing here is to atleast document steps (in addition to any changes required in pom files) on how to do this, if one desires. I myself would have used it if it existed to generate schema for a released version of hive. Anyhow, Invalid is not correct resolution, may be just leave it open?, I am not suggesting to add db-specific profiles (although if some does that will be useful), but expose this target and than document steps to follow to make it work for one's desired db., Okay, I'll reopen the issue but won't work on it.

The problem is that the DataNucleus Maven Plugin requires a database connection even to create the Schema. That means we need to provide a profile or some other way to get a driver on the classpath., Turns out I can't reopen issues....can you?]