[required Tez upgrade, The patch. Cannot be committed before Tez 0.9.0.
[~sseth] does this make sense? The tez patch example sets the entire ShuffleScheduler to WARN, and has no changes to TezMerger, so I'm keeping them as is, ShuffleScheduler should be ShuffleScheduler.fetch
TezMerger - I think we should leave this at INFO. Can add another change once a custom less noisy logger is setup in Tez, or tez starts logging less (the second one is more likely in this case).

Think this can be committed. It will have an affect depending on the deployed version of Tez. There's no warnings / compile time problems that will show up if it is committed.

Tried on a real cluster?, If we commit it now, the older versions of Tez will still produce log spam... 
Also TezMerger was 11.5% of the entire log on some cluster where that was measured (from 3 different statements). Perhaps it also needs a custom logger, I think we should commit now. The logging will depend on the version of Tez used. If we're not committing - we should revert HIVE-15954.
Disabling logging from these classes is not a good option - makes debugging any issue related to them difficult. I'd rather have extra logs instead of none. For reference, the same logs show up in regular Tez jobs as well. They haven't been noticed since the logs are on a per query basis, rather than giant log files.
The TezMerger definitely needs fixing. It's more noisy when disk spills are involved - which typically indicates a large query. For shorter queries, there should not be that much noise., A lot of different logging is useful for a lot of different issues. We disable, for instance, ZK logging, even though recently I've been looking at issues where having detailed ZK logging would be useful; because generally it's not useful and the amount of it writes in unacceptable... the 2 of these 4 classes in some cases constitute ~50% of all logging. I don't think they are as useful as all other logging combined :) They clearly log debug data on info... so I don't think we should enable until Hive officially switched to 0.90. Before that it should be disabled., Committed to master after discussion; also removed TezMerger in light of TEZ-3637.
The logs will not be gone until Tez 0.9. If you are bothered by spammy logs before then, you are encouraged to complain to [~sseth] personally ;)]