[Raised review board request - https://reviews.apache.org/r/17708/, attaching patch, There's another issue - In SessionState.registerJar class loader is obtained from the current thread. If the current thread was used during another session, then the current session can get some jars from that session., Although, HIVE-3969 is marked as duplicate, I don't think it is a duplicate. This one fixes the problem of having right class loader for a thread serving the query, whereas HIVE-3969 talks about unloading registered jars. So, it seems there are two independent problem, both of which needs to be fixed.
[~jaideepdhok] would you like to rebase your patch., Hi Jaideep, when I tried debugging hiveserver2 due to HIVE-6672, it appeared that there was a thread running for each connection (session).  Non-SQL commands (such as ADD JAR), were being run within this session thread and so the classloader for the session thread had the JARs loaded.  When a SQL command was executed the session thread would start a new thread, and it appeared that this new thread was using the same classloader (and had the added JARs in the classloader's list of URLs). Were you seeing different behavior  in your testing (I was running this on Mac, I think with jdk 1.6, not sure if it would have been different)?

In the patch, the thread's classloader is getting set to the HiveConf's classloader .. where is the HiveConf's classloader getting set from? Do we need to worry about having to make sure this classloader is updated whenever a JAR is added to the classpath?, [~ashutoshc] I will put up a new patch.
[~jdere] Add jar will always update the class loader. That's the current behaviour. I think the first class loader is set using the conf.getClassLoader method, if nothing is set it will return the default class loader.

, I think [~navis] 's patch on HIVE-3969 is more complete and subsumes current patch. So, I guess we should try to get that one and close this one. Although, [~jaideepdhok] 's [earlier point | https://issues.apache.org/jira/browse/HIVE-6364?focusedCommentId=13892132&page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel#comment-13892132] about jars on a thread being visible across session is still there. Though, I am not sure how will that negatively impact query execution and way to fix it. That probably can be taken up as follow-up of HIVE-3969, Fixed via HIVE-3969]