[There's a workaround.

Ignore the directions on the wiki. Instead, set HADOOP_HOME, HIVE_HOME, PATH, and CLASSPATH as follows before running squirrel-sql.sh:

{noformat}

export HADOOP_HOME=<YOUR_HADOOP_HOME>
export HIVE_HOME=<YOUR_HIVE_HOME>
export PATH=$HIVE_HOME/bin:$HADOOP_HOME/bin:$PATH

# You'll need to manually expand the wildcards
export CLASSPATH=$HADOOP_HOME/hadoop-*.jar:$HIVE_HOME/conf:$HIVE_HOME/lib/*.jar
{noformat}
, Any idea of the root cause of this? Is SquirrelSQL doing something funky with the thread's context classloader by any chance?, I have the exact same problem. I have squirrel installed on windows machine which is not part of the cloudera hadoop cluster. and I am trying to connect to HIVE using JDBC. Is there anything else to do to get this working...



, HIVE-2054 removes the dependency to SessionState which includes code which should be server side so it's most likely fixed by that. Can you try 0.7.1 or higher?, Thanks. Is 0.7.1 available in binary form for download?, 0.7.1 has not yet been released, but you can get SNAPSHOT tarballs here:

https://builds.apache.org/job/Hive-branch-0.7.1-h0.21/
, Verified that this was fixed in HIVE-2054., We came across this same issue in another scenario - it looks like Hive is somewhere setting the thread's ContextClassLoader to null. I opened HADOOP-7982 to work around the issue from the Hadoop side, but I think Hive must have a bug that causes these problems., @Todd: can you provide more details about this other situation you encountered? How can I reproduce it? Thanks., Unfortunately the other situation was integrated into some non-open-source software, so it's not easy to reproduce. It does make use of the Hive metadata, so my guess is that calling into some SessionState code (as described above in this ticket) was the culprit. I did verify that the ContextClassLoader was set to null which is what caused the problem, I just couldn't tell how it got that way., Todd, thanks for finding this. I filed HIVE-2729 to track the ContextClassLoader issue.]