[Removed the finally{} block from commitJob(). If commit succeeds, there are no exceptions, and the tokens are cancelled. If commit fails, the cancel is avoided, and abortJob() takes care of cancelling the token.

I've also removed an annoying typo. I would also like to remove the following  catch blocks:
{code}
catch(TException e){} 
{code}

TException isA MetaException, so this is redundant. The error handling is identical in both cases. I'd like to remove this cruft, if it's alright., Hi Mithun, could you please cancel your patch, rename your patch to HIVE-6409.patch, and mark it as patch available again? That helps the pre-commit tests pick up the patch and run it with it., Also, actually, you may have to regenerate this patch real quick off trunk now, since FileOutputCommitterContainer has changed a bit., Also, please do not patch any of the org.apache.hcatalog.* classes - they are deprecated and are being maintained in parity with the state they were in as of hive-0.11. The only reason we'd change them is if they do not build any more due to issues with hadoop or hive/etc. Bugfixes are to go on to org.apache.hive.hcatalog.* only for now., I've renamed the patch, removed the changes to the deprecated code and resubmitted.

About not making changes to org.apache.hcatalog: It is really quite dangerous to patch fixes only into org.apache.hive.hcatalog. :/ We'll have to make sure that projects like Pig are using the right version of the packages, for fixes.

Wouldn't it be preferable to remove the package entirely (and visibly break code) than to silently compile and produce something unusable? (Has this been discussed already?), 

{color:green}Overall{color}: +1 all checks pass

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12632065/HIVE-6409.patch

{color:green}SUCCESS:{color} +1 5201 tests passed

Test results: http://bigtop01.cloudera.org:8080/job/PreCommit-HIVE-Build/1594/testReport
Console output: http://bigtop01.cloudera.org:8080/job/PreCommit-HIVE-Build/1594/console

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12632065, I'm +1 on this new patch, I'll go ahead and commit it.

As to your other concerns, this is per HIVE-5274, and per discussions that I brought up in the next hive-dev meetup(after that patch) as well.

As to visibly breaking code, we will do that, as of 0.14, which will be trunk in a couple more days as soon as we branch out for 0.13 - we have HIVE-6432 open for just that. The idea is that org.apache.hcatalog.* works predictably in the way it has for all of those that have already been using it and find it usable in the state it is in, whereas to all new users who may be evaluating, they must be moving to org.apache.hive.hcatalog.
, Committed (with some minor indenting fixes).

Thanks, Mithun!]