[I am considering adding a register statement for registering a jar to classpath.   Agree?, it works, now.

hive> register '/home/zhoumin/myudf.jar' ;
OK
Time taken: 0.141 seconds
hive> CREATE TEMPORARY FUNCTION strlen AS 'hadoop.hive.udf.UdfStringLength';
OK
Time taken: 0.062 seconds, The create function statement loads a function class staticly from $HIVE_AUX_JARS_PATH and hive.aux.jars.path
 http://issues.apache.org/jira/browse/HADOOP-4070

We ofen start a Hive thrift server, and it will up for quite a time. We cannot dynamically load another UDF in another jar unless we restart the server .
It's not practical for us.
This patch introduces a register statement for appending a jar path to hive on-the-fly. It works well both in CLI and Thrift server mode.
usage:
hive>register '/home/zhoumin/zhoumin.jar';
hive>CREATE TEMPORARY FUNCTION strlen AS 'hadoop.hive.udf.UdfStringLength';
hive>select strlen(time) from log_data;

Nevertheless, this patch cannot pass current unit test of hive, because the MapTask run during unit test will serialize  MapRedWork w/o having done a register command. It will cause the ClassLoader cannot find my UDF.  see line 61 and line 63 in MapTask.java., Can pass unit test now. but I need add another directory to store my udf jars, any better suggestions?, there's already an 'add/delete/list <resource> ...' infrastructure on the cli. this should be part of that infrastructure (currently it only supports 'file' resource - but the idea was that it would support 'jar' and other kinds of resource in future as well).
, Hey Joydeep,  I'll try to implement it, however, we will make our UDFs temporarily on Thrift  Server  mode, not  CLI.
That a great feature you mentioned! , The add/delete/list <resource> ...' command is only supported by CLI mode right now.  It puts a file path into a map, then be retrieved and added into hadoop's tmpfiles by ExecDriver's initialize method, but you know, this method won't be called by Thrift Server mode. 


Have you considered adding this feature to Thrift Server mode?, for the thrift server mode -  where does the jar file sit? if it is available on the client side - doesn't it need to be transferred to the server side via the Thrift interface? 

the set commands are also not available through the Thrift server - and i agree that all of these should be accessible via the Thrift interface (ignoring the file location issue). I think it should be fairly easy to refactor Thrift server and Driver/CliDriver code to make sure that all commands are supported on the ThriftServer (and don't think that we need to bring all the cli commands into the Hive grammar for that to happen).

let's open another jira for this issue (executing cli commands into thrift server) - it should be fairly easy to get in. if u can add the 'add jar' command to the cli in the meantime - we should be good to go. I looked at the patch and the main code looks good., Files reside in tmpfiles, Jars in tmpjars of hadoop system.  
My thrift server support add/delete file/jar, set, and normal HSQL query now , and the other commands I think is no need for thrift server. 
I've created another jar, let's move there.
https://issues.apache.org/jira/browse/HIVE-338
, Hi Min - are you going to resubmit this as a 'add jar' cli command. should be very easy to do.

meanwhile i will review the thriftserver code., Hi Joydeep, 
pls check out this jira https://issues.apache.org/jira/browse/HIVE-338
It supports add file/jar on both cli & thriftserver  now., duping to 338 that contains the fix]