[Looks like minimizeJar is removing the classes accessed by reflection. like Shims?, Yup, exactly that. Might have to test a little more with different combinations too: secure/unsecure; http/tcp; with & w/o ZK etc, One more issue, the uber jar embedded jetty classes. This breaks jar loading in J2EE envirronement.
For exemple, Tomcat don't load the uber jar because of Servlet classes defined in jetty lib.
We should check that jetty lib is not in the uber jar., Split this into 2 as there are 2 diff issues here: size & missing classes. I have a fix for missing classes for Hive 14; size can be taken up in Hive 15 I guess.

, Also reduces size to 15MB now (from 28MB)., +1
New size looks acceptable.
Were you able to test the different HiveServer2 combinations?, 

{color:green}Overall{color}: +1 all checks pass

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12671677/HIVE-8270.1.patch

{color:green}SUCCESS:{color} +1 6360 tests passed

Test results: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/1026/testReport
Console output: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/1026/console
Test logs: http://ec2-174-129-184-35.compute-1.amazonaws.com/logs/PreCommit-HIVE-TRUNK-Build-1026/

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12671677, I assume the uber jar is expected to be used only with a remote HS2 (not HS2 embedded mode). We should clarify this in docs.
, LGTM +1
As Thejas pointed out, we should clarify in doc that this is meant for remote HS2, not for embedded one., Sure, I'll add the notes to the doc., Committed to trunk. [~vikram.dixit] It will be good to have this in 0.14 as well., +1 for 0.14., Committed to 0.14, There still have a bug in Tomcat.
{noformat}
INFO: validateJarFile(/usr/share/apache-tomcat-7.0.50/webapps/SmartDataDev/WEB-INF/lib/hive-jdbc-0.14.0-SNAPSHOT-standalone.jar) - jar not loaded. See Servlet Spec 3.0, section 10.7.2. Offending class: javax/servlet/Servlet.class
Oct 08, 2014 4:13:02 PM org.apache.catalina.startup.HostConfig deployWAR
{noformat}

After few tests, I see many javax.* and javax.jdo.* classes in the ubber jar. It's a real problem.
Avoiding the classes in javax.* namespace will reduce heavily the size of the jar.

I think the JDBC standalone jar is poor quality currently. It is unusable in J2EE environment.

Also why embedded JDO classes ? , [~damien.carol] Now that we have settled on the question that this jar is not meant to be used for HS2 embedded mode, (as discussed on this jira). I agree javax.* and jdo classes are baggage. We should explore possibility to excluding those. Feel free to open a new jira and attach a patch (if you have worked out something)., [~ashutoshc] I'm working on shading it. If I succeed, I will create a new JIRA., Doc done?  [~vgumashta], can we remove the TODOC14 label now?

bq.  ... clarify in doc that this is meant for remote HS2, not for embedded one., This has been fixed in 0.14 release. Please open new jira if you see any issues.
]