[Since its merely a name change for hadoop and not a code change, This is a superficial change required only because Hive explicitly checks for Hadoop version number.  , Marking ready for review., All the unit tests passed. Since, its a straight forward patch will commit unless some one has an objection., +1. Will commit if tests pass.

bq. Since, its a straight forward patch will commit unless some one has an objection.

Hive committers are not allowed to commit their own patches, right?, Correct, bylaws say "one +1 from a committer who has not authored the patch followed by a Lazy approval (not counting the vote of the contributor), moving to lazy majority if a -1 is received"., FWIW, other communities with these same rules (Pig and Hadoop) interpret this to mean another committer must review a patch, but not that another committer must commit it.  Once a second committer has reviewed it the original contributor is free to commit it., Right, I meant the +1 vote (not the mechanics of committing).
, bq. +1. Will commit if tests pass.

Carl, did tests pass ?, Committed to trunk. Thanks Ashutosh!, Integrated in Hive-trunk-h0.23.0 #32 (See [https://builds.apache.org/job/Hive-trunk-h0.23.0/32/])
    HIVE-2631. Make Hive work with Hadoop 1.0.0 (Ashutosh Chauhan via cws)

cws : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1215279
Files : 
* /hive/trunk/bin/hive
* /hive/trunk/shims/src/common/java/org/apache/hadoop/hive/shims/ShimLoader.java
, Integrated in Hive-trunk-h0.21 #1154 (See [https://builds.apache.org/job/Hive-trunk-h0.21/1154/])
    HIVE-2631. Make Hive work with Hadoop 1.0.0 (Ashutosh Chauhan via cws)

cws : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1215279
Files : 
* /hive/trunk/bin/hive
* /hive/trunk/shims/src/common/java/org/apache/hadoop/hive/shims/ShimLoader.java
, Backported to 0.8.1, This issue is closed now. It was released with the fix in 0.9.0. If there is a problem, please open a new jira and link this one with that.]