[I have posted a patch for a fix. I have tested this on trunk by confirming that Avro core is in the hive-exec jar and successfully running a simple Hive query against a table registered with the AvroSerDe. The fix was a simple 1 line change. It looks like this issue was caused by the Ant -> Maven switch and the avro core jar was inadvertently left out when creating the hive-exec  jar.

I am not able to create an RB right now because RB is giving me a 502 error when I try to create a new review request, both using {{rbt post}} and manually via the RB web UI. I will try to create a RB later. , RB: https://reviews.apache.org/r/21471, Thanks for the patch. What query are you running that demonstrates the problem? Recently I worked on HIVE-5823, and didn't hit the problem you described. I'd like to reproduce the problem in order to verify your fix., 

{color:red}Overall{color}: -1 no tests executed

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12644913/HIVE-7066.1.patch

Test results: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-Build/204/testReport
Console output: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-Build/204/console

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12644913, Hi Xuefu, I simply ran {{select count(1) from avro-table;}}. I ran {{mvn clean install -DskipTests -Phadoop-1 -Pdist}} to build Hive, create the tarball, unzipped it and set up a local metastore and ran the query., [~xuefuz], were you able to reproduce the problem? Do you have any more feedback on this patch before it can be merged?, [~davidzchen] I ran your mvn command and built a tarball. I unzipped it, and found in the lib directory there is a jar named avro-1.7.5.jar. Is this what you need? I thought all jars under /lib will be shipped to the cluster. BTW, I was able to run avro query from this build, though my cluster may already have the avro jar.

Your change seems to shade the avro jar in Hive libexec jar, but the JIRA's title mentiones avro-mapred. I'm little confused., [~xuefuz] Sorry for the confusion. The title should be referring to avro core and not avro-mapred. avro-mapred is already included but avro core is not.

From what I understand, only the hive-exec jar is shipped to the cluster. The jars under /lib are used by Hive locally before firing the MapReduce jobs. If your cluster already has the Avro jar, then the query would work. In this case, I was simply running a local instance; further, we do not install Avro on each node but rather expect jobs to provide the jars. Based on the testing that I have done, if avro core is not present in the hive-exec jar, then queries that read tables registered with the AvroSerDe fails with the above exception., Okay. +1, Committed to trunk. Thanks David!, This has been fixed in 0.14 release. Please open new jira if you see any issues.
]