[
The issue here is this:
a) templeton runs as user hcat
b) templeton runs hcat command line as user hcat
c) It sets appropriate delegation tokens so that hdfs and hive metastore recognize the command as being run as user hrt_qa, but the current unix user for the hcat commandline is user hcat.
d) SBAP uses the hive default authentication provider, which recognizes that the user is hcat.
e) The old HdfsAuthorizationProvider did not use the provided authentication provider, and instead special-cased how it did authentication by instantiating its own ugi. In addition, it would create a proxy user ugi if a setting proxy.user.name was set, and that's how it used to authorize whether or not "hrt_qa" would perform an action, as opposed to authorizing if "hcat" was allowed to do so.

So, we need to create a new ProxyUserAuthenticator which can mock authenticate as a particular user that it's asked to authenticate as, and fall back to default authentication if not. This can be used as an authenticator for servers such as webhcat which have alternate means of figuring out who the user is, and telling the hcat command line who they are running as.

A further issue props up if we make the aforesaid change, and that is that HCatCli instantiates a SessionState, and therefore a AuthorizationProvider and an AuthenticationProvider before it processes its -D parameters, which is what is used to provide overrides such as the proxy.user.name that webhcat provides. The reason this worked with HdfsAuthorizationProvider before was that it instantiated a ugi depending on whether or not that conf parameter was set at runtime, for every single authorization call.

So, we need to change the initialization order in the hcat commandline, to make sure the -D parameters are processed before we instantiate SessionState as well., Patch attached. This fixes failures for tests that exist as part of the webhcat authorization e2e testsuite., 

{color:red}Overall{color}: -1 at least one tests failed

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12608421/HIVE-5542.patch

{color:red}ERROR:{color} -1 due to 1 failed/errored test(s), 4401 tests executed
*Failed tests:*
{noformat}
org.apache.hive.hcatalog.mapreduce.TestHCatExternalHCatNonPartitioned.testHCatNonPartitionedTable
{noformat}

Test results: https://builds.apache.org/job/PreCommit-HIVE-Build/1126/testReport
Console output: https://builds.apache.org/job/PreCommit-HIVE-Build/1126/console

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
Tests failed with: TestsFailedException: 1 tests failed
{noformat}

This message is automatically generated., The precommit failures are unrelated to the issue at hand. [~thejas], could you please have a look at this patch?, +1
, Patch committed to trunk.
Thanks for the contribution Sushanth!
]