[I'll attach the fix patch for now as this is a pretty severe bug. As for testing, it is easy to test from manual tests or with e2e tests, but difficult to test with a unit test. I'll also attach a "SleepyAuthorizationProvider" that I used to test this manually, so as to elongate the critical section to demonstrate and reproduce this error easily., SleepyAP.patch attached - Note, before using this for testing, you'll have to set hive.metastore.client.socket.timeout to an appropriately high amount (I used 60000 for 1 minute) to make sure that we don't hit a timeout on the client., Attached patch., Setting to patch-available so Hive-QA can pick it up to run existing tests with this patch., 

{color:red}Overall{color}: -1 at least one tests failed

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12617917/HIVE-5989.patch

{color:red}ERROR:{color} -1 due to 2 failed/errored test(s), 4761 tests executed
*Failed tests:*
{noformat}
org.apache.hadoop.hive.cli.TestCliDriver.testCliDriver_decimal_precision
org.apache.hadoop.hive.cli.TestMinimrCliDriver.testCliDriver_bucket_num_reducers
{noformat}

Test results: http://bigtop01.cloudera.org:8080/job/PreCommit-HIVE-Build/584/testReport
Console output: http://bigtop01.cloudera.org:8080/job/PreCommit-HIVE-Build/584/console

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
Tests exited with: TestsFailedException: 2 tests failed
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12617917, [~thejas], could I please get a review on this? I'm not certain if this is affected by any of your newer patches, but this is a pretty important bug at scale., As a matter of fact, I think we're hitting this right now. I'll review your patch as well., This might be related: [HS2 creates DBs/Tables with wrong ownership when HMS setugi is true|https://issues.apache.org/jira/browse/HIVE-6245]., Much appreciated Mithun.

And Vaibhav, I had a look at the jira you linked to - I don't think the two are related - this bug related to the metastore auth system using a non-threadlocal hiveconf to instantiate itself and test for ownership. It's not that hive has an idea of incorrect ugi, it's that the metastore auth system uses it incorrectly., Thanks for taking a look [~sushanth]!, [~sushanth] Can you also create a reviewboard link ?
, Reviewboard is not responding currently when I attempt to create a new review request, I will try to create it later tonight., Created now : https://reviews.apache.org/r/18054/, +1 . Just a minor indentation issue in the patch, I can add those 2 spaces before commit.
, Thanks, and yup, the indentation is incorrect in those two places. I've attached a newer patch with that updated., Patch committed to trunk.
Thanks for the contribution Sushanth!
]