[Note that the second query does sort properly if I explicitly set the number of reducers to 1 with the following command.

set mapred.reduce.tasks=1; , Actually sort is supposed to be a local sort within a reduce instead of a global sort. It is usually used along with the distribute by to define the manner in which the keys are distributed to a reducer and sorted within a reducer.

I believe that if you used order by instead of sort by we automatically select 1 reducer and do the sort.
, ORDER BY also uses multiple reducers and returns unordered results. Using SORT BY (with or without DISTRIBUTE BY) returns N sets of ordered results, where N is the number of reducers. 

It makes sense that sort by is only per-reducer. The fact that the presents or absence of a LIMIT clause changes the result set in ways other that number of records returned though, seemed like a bug to me.

It's an easy enough workaround though, so maybe this issue should be closed?, order by should use only 1 reducer - if you see otherwise, can you update the jira
sort behavior is as expected - you are not guaranteed that the first query returns sorted results, it just happens to be sorted, probably the first reducer had more than 50 records which were returned.

if order by does work, you can close this jira., Thanks for you explanation re the first LIMIT query, that makes sense.

Re-verified that ORDER BY does not use only 1 reducer in my tests. 

SELECT user, SUM(numRequests) AS num FROM MyTable GROUP BY user ORDER BY num DESC;, Not a problem - behavior is as expected, I think what Bill is saying is that order by DOES NOT use 1 reducer in his tests. That seems to be a bug to me.
, Are you sure - I just tried the same query and it works for me - are you using trunk ?


Also, can you look at the plan file and search for numReducers 
(the plan file for the second job)

The plan file can be found by: hive.exec.plan from the tracker, I turns out was testing using Hive 0.3.0 actually. I upgraded to the trunk on both my hive client and my hive server, and sure enough saw only one reducer. Sorry for the false alarm. Closing., Verified expected behavior using trunk.]