[[~vihangk1], could you take a look and let me know what you think? Now that ptests infra is down, it is probably a good time to deploy it. Thanks, This file does not affect the batch sizes. Unfortunately, the file which controls the batch sizes is different than this one and is loaded when the ptest starts. I will be able to port these changes to that file from your change. I will create a separate JIRA to make it easy to change the batch sizes for everyone.

These two lines doesn't make sense to me. What are you intending to do with these lines? I don't think they are needed.
qFileTest.miniDruid.include = normal
qFileTest.miniDruid.isolate = long, Thanks [~vihangk1]. I copied them from above configuration properties in file, if you think they are not needed, I can delete them (to be clear, I have not explored how they are used and it is the first time I modify this file)., OK, got it, those are the groups... Uploaded a second patch where I removed the 'isolate' part., +1 I merged that patch manually to the master-mr2.properties on ptest server. It should start using batch size of 5 qfiles for TestMiniDruidCliDriver from the next run., Thanks [~vihangk1]!, Created HIVE-19998 to expose this information to everyone., Hi [~jcamachorodriguez] unfortunately, I had to revert this issue while woeking on HIVE-19999. The Ptest server was not coming up and I was reverting the recent changes to narrow down the root causes. Sorry about that. I will commit it again and resolve it once its done., OK, no worries. Please, let me know when it goes in, HIVE-12192 will need this one to be pushed., I have made the changes to the file. I think the next precommit job should start using batches. If not, we may need to restart ptest server., I think it was not picked up... https://builds.apache.org/job/PreCommit-HIVE-Build/12172/consoleFull It may need a restart, not sure., I do see the new property values in the console though., Ah.. I noticed that we missed add {{miniDruid}} to this line 

{noformat}
qFileTests = clientPositive miniMr clientNegative miniMrNegative hbasePositive miniTez spark miniLlap miniLlapLocal encryptedCli miniSparkOnYarn erasurecodingCli
{noformat}

I added that it to that line. I think the next precommit job should pick it up., Thanks! I'll push the change to the repo., Looks like its working now. 

{noformat}
2018-06-27 00:06:37,750 DEBUG [TestExecutor] ExecutionPhase.execute:98 PBatch: QFileTestBatch [batchId=189, size=5, driver=TestMiniDruidCliDriver, queryFilesProperty=qfile, name=189-TestMiniDruidCliDriver-druid_basic2.q-druidmini_mv.q-druidmini_test_alter.q-and-2-more, tests=[druid_basic2.q, druidmini_mv.q, druidmini_test_alter.q, druidmini_extractTime.q, druidmini_floorTime.q], isParallel=true, moduleName=itests/qtest]
2018-06-27 00:06:37,750 DEBUG [TestExecutor] ExecutionPhase.execute:98 PBatch: QFileTestBatch [batchId=190, size=5, driver=TestMiniDruidCliDriver, queryFilesProperty=qfile, name=190-TestMiniDruidCliDriver-druidmini_dynamic_partition.q-druidmini_masking.q-druidmini_expressions.q-and-2-more, tests=[druidmini_dynamic_partition.q, druidmini_masking.q, druidmini_expressions.q, druidmini_test1.q, druidmini_test_insert.q], isParallel=true, moduleName=itests/qtest]
2018-06-27 00:06:37,750 DEBUG [TestExecutor] ExecutionPhase.execute:98 PBatch: QFileTestBatch [batchId=191, size=2, driver=TestMiniDruidCliDriver, queryFilesProperty=qfile, name=191-TestMiniDruidCliDriver-druidmini_joins.q-druid_timestamptz.q, tests=[druidmini_joins.q, druid_timestamptz.q], isParallel=true, moduleName=itests/qtest]
{noformat}, This is released in Hive 3.1.0.]