[This is a continuation of HIVE-13858. Not all problems related to abort processing were fixed there.

There's a window at the moment, while the RecordProcessor is being initialized where an abort can be ignored. initialize in progress, mapOp/reduceOp not setup yet, abort received - this sends an abort to the RecordProcessor - but it's essentially useless since it's not propagated to the operator (which hasn't been setup yet)

Uploading a patch shortly to resolve this., Patch to fix the issue mentioned below.

I've left some TODOs in the code, which will likely be fixed in subsequent jiras. Need information from someone more familiar with the code. (Some of the comments read TODO: reviewer - those specifically need more info, ideally on RB)

Any operation which can block - e.g. processorContext.waitTillReady within the hive codebase has the potential to lead to problems like this. To be fixed in subsequent jiras. Some have been identified in the patch.

cc [~prasanth_j], [~sershe]

, I think  TODO: Reviewer:  things need to be investigated (and other TODOs may need to be fixed). I don't have exact answers to most of them.
Dummy ops are used for mapjoin. Prasanth may know more about merge. The global map does not need to be cleaned up explicitly; you can check the existing cleanup, as far as I can tell this patch wouldn't interfere with it.

Overall, I think we should be able to interrupt the execution with interrupt exception, so I am not sure why some comments say that having a blocking op is a problem - shouldn't an interrupt there abort properly? Abort flag would only be an optimization then. The only problem are other library calls that can swallow interrupt exceptions... as long as abort flag is checked after those it should be alright. Also we should file JIRAs to fix the code if these are Hadoop libraries/components. At the very least they should restore the interrupt flag. There should be not retries on interrupts, etc., [~hagleitn] - mind taking a look at the patch, and providing some more information on dummyOps / mergeOps.

An interrupt would ideally stop an opeartion - however it's really a suggestion, and we cannot rely on libraries to handle them correctly. I suspect most of Hadoop has issues here. An HDFS jira was created and has already been fixed.
The abort flag serves to protect against operations which reset the interrupt status - which is where the avoid blocking op comment comes in. In most cases we'll be OK, with an abort flag check., [~sershe], [~prasanth_j] - is the patch good to go in (with the comments changed to point to new jiras which will be created). I think there are additional cases which need to be addressed; they can be addressed in a different jira. This one, in it's current form, does get rid of queries getting stuck on hash table creation., looks good to me with comments addressed..., Which ones specifically ?
My intent was to fix the rest of the TODOs left in the code as follow ups (after getting more clarity, and some more support from Tez). Fix one known problem for now. Create new jiras to fix others., Can you make the TODOs as follow up jiras? nit: "KKK" can be removed. Also "Reviewer" comments.
Other than that LGTM +1, Updated patch with comments cleaned up and converted to TODOs - to be addressed in HIVE-14042., +1, 

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12811266/HIVE-14003.02.patch

{color:red}ERROR:{color} -1 due to no test(s) being added or modified.

{color:red}ERROR:{color} -1 due to 11 failed/errored test(s), 10220 tests executed
*Failed tests:*
{noformat}
TestMiniTezCliDriver-join1.q-mapjoin_decimal.q-vectorized_distinct_gby.q-and-12-more - did not produce a TEST-*.xml file
org.apache.hadoop.hive.cli.TestCliDriver.testCliDriver_acid_globallimit
org.apache.hadoop.hive.cli.TestCliDriver.testCliDriver_constantPropagateForSubQuery
org.apache.hadoop.hive.cli.TestCliDriver.testCliDriver_list_bucket_dml_13
org.apache.hadoop.hive.cli.TestCliDriver.testCliDriver_repair
org.apache.hadoop.hive.cli.TestCliDriver.testCliDriver_stats_list_bucket
org.apache.hadoop.hive.cli.TestCliDriver.testCliDriver_subquery_multiinsert
org.apache.hadoop.hive.cli.TestMiniSparkOnYarnCliDriver.testCliDriver_index_bitmap3
org.apache.hadoop.hive.cli.TestMinimrCliDriver.testCliDriver_table_nonprintable
org.apache.hadoop.hive.ql.metadata.TestHiveMetaStoreChecker.testPartitionsCheck
org.apache.hadoop.hive.ql.metadata.TestHiveMetaStoreChecker.testTableCheck
{noformat}

Test results: https://builds.apache.org/job/PreCommit-HIVE-MASTER-Build/158/testReport
Console output: https://builds.apache.org/job/PreCommit-HIVE-MASTER-Build/158/console
Test logs: http://ec2-50-18-27-0.us-west-1.compute.amazonaws.com/logs/PreCommit-HIVE-MASTER-Build-158/

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.TestCheckPhase
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
Tests exited with: TestsFailedException: 11 tests failed
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12811266 - PreCommit-HIVE-MASTER-Build, Thanks for the reviews [~prasanth_j], [~sershe]. Test failures are unrelated. Committing.

Wonder why the test failures are up to 10 now. It was down to 4-5 a while ago.]