[IMHO the "table" output format is primarily for console viewing, so options like color & headerInterval for readability and pagination make sense for this format. But the non-tablular OF(csv(2), tsv(2),dsv) could be used for generating output files that can be serve as input to other systems. So I dont think it makes sense to support options like headerInterval and color for delimited output formats but showHeader is important.  It enables the users to generate output in standard formats with or without the header.

So I am proposing the following behavior. Please let me know if you disagree.
   * showHeader support for all output formats. T
   * headerInterval and color are only supported for "table: OF. Change documentation to state this., I have attached a patch that changes the behavior I described above.
{code}
0: jdbc:hive2://localhost:10000> !outputformat csv2
0: jdbc:hive2://localhost:10000> select * from booleantest;
booleantest.name,booleantest.value
true,t
false,f
TRUE,T
FALSE,F
ZERO,0
ONE,1
t,t
T,t
0,0
1,1
f,f
F,f
12 rows selected (0.854 seconds)
0: jdbc:hive2://localhost:10000> !set showHeader false
0: jdbc:hive2://localhost:10000> select * from booleantest;
true,t
false,f
TRUE,T
FALSE,F
ZERO,0
ONE,1
t,t
T,t
0,0
1,1
f,f
F,f
12 rows selected (0.639 seconds)
{code}

I have tested this for other output types too (csv, tsv,tsv2, dsv etc). They all seem to be working as expected.
Could someone please review it? Thank you in advance., 

{color:green}Overall{color}: +1 all checks pass

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12700549/HIVE-9770.patch

{color:green}SUCCESS:{color} +1 7567 tests passed

Test results: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/2858/testReport
Console output: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/2858/console
Test logs: http://ec2-174-129-184-35.compute-1.amazonaws.com/logs/PreCommit-HIVE-TRUNK-Build-2858/

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12700549 - PreCommit-HIVE-TRUNK-Build, [~ngangam],

where do those header rows come from? They'll always be there?, [~brocknoland] Yes, they always appear to be the first row of the result set, based on my testing and other areas of the code., +1, Thank you Naveen! I have committed this to trunk!, This issue has been fixed and released as part of the 1.2.0 release. If you find an issue which seems to be related to this one, please create a new jira and link this one with new jira.]