[cc [~xuefuz], 

{color:green}Overall{color}: +1 all checks pass

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12675794/HIVE-8518.1.patch

{color:green}SUCCESS:{color} +1 6565 tests passed

Test results: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/1352/testReport
Console output: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/1352/console
Test logs: http://ec2-174-129-184-35.compute-1.amazonaws.com/logs/PreCommit-HIVE-TRUNK-Build-1352/

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12675794
 - PreCommit-HIVE-TRUNK-Build, [~ruili], patch looks good. I'm wondering if it makes sense to add a test case for this. Thanks., Hi [~xuefuz], I find there're already several unit tests for compile time skew join, e.g. skewjoinopt1.q. They all passed the pre-commit test. That makes sense because the assert statement is triggered in UT so the patch here won't change test results., Okay. Thanks for the explanation.

+1, Patch committed to trunk. Thanks to Rui for the contribution., This would be a good candidate for 0.14 also., Thank you [~xuefuz] for the review!
Could you also merge this to spark branch? Thanks!, I think [~brocknoland] is in the middle of merging trunk to branch. This, in addition to a few other important patches will be included, I assume., OK got it., There is some results difference s that I cannot account for. Since I am off the rest of the week I think we should merge any individual fixes we want using {{svn merge -c$num ^/hive/trunk}}

I will finish the rest of the merge this weekend., Merged. Not sure if I screwed up anything though., Thanks [~xuefuz] and [~brocknoland]! Everything seems fine from the git log., lgtm as well. Thank you!!, Included this fix to branch-1.0]