[I can take a look at this ..., Hi [~dmarkovitz] I looked into this issue. I was not able to reproduce the first example you have in the description. What version of Hive are you using?

However, I could reproduce the second example. It seem from the code that Hive expects that the partition sub-directory structure should be in the order of the fields defined in the partition spec. But I am not able to find any documentation saying that. If that is the case then I can create a patch to reject such partitions which do not follow the partition key order on the filesystem. [~ashutoshc] any thoughts? Do you think if this is something we should enforce in the HiveMetastoreChecker?, Hi

1.
The 1st example could be created on hive 1.1.0-cdh5.7.0 but not on Hive 1.2.1000.2.5.3.0-37.
The 2nd example could be created on both.

2.
I think that a situation where a partition is created built on directories structure and then directories are built based on the partitions that were just added, is not healthy and should be prevented.
It would make a lot of sense to validated a complete path and not each directory separately.








, [~vihangk1] yes we should enforce the key order in msck., It should use {{hive.msck.path.validation}} to throw in case user wants that behavior., Thats a good point. I think we can use this information to exit early during the listing phase itself. If there are invalid partition directories, we don't need to list them and throw error or skip based on the value of {{hive.msck.path.validation}}., Updating the patch with a better implementation. The patch makes changes to the parallel file listing algorithm so that the directory structure which do not follow the partition key specs are not searched. This early exit strategy will also help improve query response time on slower filesystems like S3 and when partition directory structure does not conform to partition definitions. MSCK will throw exception or log a warning based on the value of {{hive.msck.path.validation}} configuration., Linked the review url, 

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12861352/HIVE-16299.02.patch

{color:green}SUCCESS:{color} +1 due to 2 test(s) being added or modified.

{color:red}ERROR:{color} -1 due to 2 failed/errored test(s), 10544 tests executed
*Failed tests:*
{noformat}
org.apache.hadoop.hive.cli.TestCliDriver.testCliDriver[comments] (batchId=35)
org.apache.hive.hcatalog.api.TestHCatClient.testTransportFailure (batchId=172)
{noformat}

Test results: https://builds.apache.org/job/PreCommit-HIVE-Build/4477/testReport
Console output: https://builds.apache.org/job/PreCommit-HIVE-Build/4477/console
Test logs: http://104.198.109.242/logs/PreCommit-HIVE-Build-4477/

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.TestCheckPhase
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
Tests exited with: TestsFailedException: 2 tests failed
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12861352 - PreCommit-HIVE-Build, +1, Pushed to master. Thanks, Vihang!, Fixed an issue for the skip mode. msck doesn't need to list any further if the partition directory is invalid even in skip mode., Update to the patch : removed trailing space, Hi [~ashutoshc] looks like we had a race condition yesterday when I updated a newer version of patch since I didn't see your comment when I posted the updated patch :) I have created HIVE-16347 to fix the bug in this patch., Hive 3.0.0 has been released so closing this jira.]