[the patch also appears to add Günther , Yes. Gunther's name was missing from the PMC list. Changed description to reflect the same., non-binding +1 :), +1 LGTM, The description should say "NO PRECOMMIT TESTS" and Günther's name should be removed from the committer list.  For an example, see [HIVE-5644|https://issues.apache.org/jira/browse/HIVE-5644].  I'm going to add a note explaining that PMC members are also committers.

(Thanks for the umlaut, [~sershe].), But wait ... there's more!  Günther needs an empty entry for the "roles" column, like this:

{code}
+        <td>Hortonworks</td> <!-- organization -->
+        <td></td> <!-- roles -->
{code}

See HIVE-5742 for more examples:  https://issues.apache.org/jira/secure/attachment/12611991/HIVE-5472.patch., [~leftylev] I had committed this patch yesterday evening before your comments came in. I am sorry I jumped the gun and went ahead since it was a trivial patch and I had the +1. However, after looking at your comments, I found more such things in the page. I will raise another jira to fix it.

Thanks
Vikram., Committed to hive site., HIVE-6158 raised for follow up., That expains one mystery but raises another -- when I added my comments in the wee hours, this JIRA was still marked as unresolved and yet my download of the Hive site included your changes.  So apparently I can't rely on the JIRA status being current, but at least the system isn't committing patches automatically.  Hm, it wasn't just a display buffer problem because I hadn't received email about it either.  Most peculiar.

Have you patched HIVE-6158 yet?  I can't trust what I'm seeing on the JIRA.  If you prefer, I can revise my patch on HIVE-6155 to include the HIVE-6158 changes.  Or (here's a cooperative thought) you could revise my patch., Hi Lefty,

I got a bit eager on this one considering it was trivial and missed updating the jira. My bad! I closed this issue today morning. I will be more careful from now onwards.

I haven't worked on HIVE-6158 yet. I would upload the patch if I had completed it and waited for a +1 and 24hrs thence before committing and closing it. (I learned my lesson :).) You can go ahead and revise your patch on HIVE-6155 to include changes from the jira HIVE-6158.

Thanks
Vikram., Okay, patch 2 for HIVE-6155 has the changes for HIVE-6158.  And thanks for the offline tutorial on how to commit patches.]