[A gentle reminder ... this should get done by the time Hive 0.13.0 is released., Another reminder., The "Installation" wikidoc also needs to be updated with maven instructions:

* [AdminManual Installation |https://cwiki.apache.org/confluence/display/Hive/AdminManual+Installation]

A recent message to the user mailing list pointed out the obsolete Installation doc:  [http://mail-archives.apache.org/mod_mbox/hive-user/201403.mbox/%3cCAHwWqxgykr+eo+VqZ-jmC+AcC=rK9yQcTriyPxvAY5J_k9J92A@mail.gmail.com%3e]., [~brocknoland], can you take care of these doc changes or suggest someone else?, [~szehon] or [~xuefuz] any interest in taking this up?, Sure I update the build instruction, but it is a wiki change only right ?  I dont think I have permission for wiki, can somebody grant?, [~ashutoshc] has been granting wiki edit privileges lately, and [~cwsteinbach] used to.  (I don't know who else can do it.)  Or you could tell me what changes to make, but I'm swamped trying to catch up with 0.13.0 doc issues.

Thanks for volunteering, Szehon., [~szehon] I granted you wiki edit karma., Thanks Ashutosh.  [~leftylev]  I updated the page with the latest information on the current maven distributable.  Feel free to look and correct if necessary, when you get the chance., [~szehon] and [~brocknoland], I added an introductory sentence in "Installation and Configuration" to clarify the either/or nature of its subsections and made some changes in "Building Hive from Source" to differentiate trunk from branches -- would you please review the doc?

* [Getting Started -- Installation and Configuration | https://cwiki.apache.org/confluence/display/Hive/GettingStarted#GettingStarted-InstallationandConfiguration]
* [Getting Started -- Building Hive from Source | https://cwiki.apache.org/confluence/display/Hive/GettingStarted#GettingStarted-BuildingHivefromSource]

While you're at it, you might revise the Disclaimer at the beginning of the doc:  "Hive has only been tested on Unix (Linux) and Mac systems using Java 1.6...."]