[Made a patch. Could anyone have it reviewed? Thanks!, how did you test this?, [~ekoifman] Here's test case. 
{noformat}
1. New empty metastore's created with 0.14 schema. 
2. upgrade-0.14.0-to-0.15.0.mssql.sql is run manually to get 0.14 metastore upgraded to 0.15. 
3. Double check it to make sure every orginal varchar column changed to nvarchar.
{noformat}

As you suggested, it'd be better to do test in context HIVE/HIVE CLI/, e.g., 
1. New empty metastore's created with 0.14 schema. 
2. create some hive tables/load real data
3. shutdown metastore server
4. run schemetool to do upgrade
5. start metastore server
6. query those tables inited in step 2 to make sure things are correct.

I will do that. Thanks!, +1 to content, that looks reasonable to me.

There is one other thing to take care of though, before committing this. [~vikram.dixit]/[~brocknoland]/[~alangates] : given that it's not 0.15 anymore but 1.2, what's the plan for db upgrade scripts? Should we have a 0.14->1.0 without this, a 1.0->1.1 without this, and 1.1->1.2 with this?, Thank you very much. HIVE-9554 should go into trunk and then this patch and be done on top of it. I will have a patch there shortly., fyi, 0.14 to 1.0 upgrade is a no-op,as the metastore schema did not change between those releases. I made this change in HIVE-9514 ., bq. 1.1->1.2 with this

yes this option makes sense, Xiaobing, could you please update the patch accordingly to make the 0.14->0.15 upgrade script a 1.1->1.2 upgrade script?, Attaching updated patch accounting for version changes (and NOTIFICATION_LOG table in update script), (Also attaching patch for branch-1.2), [~thejas], could you please backup review/verify?, +1, Looks like we lost a bunch of queued precommit tests over the weekend. Have resubmitted this., The precommit tests failed because it took the branch-1.2 attachment as the latest patch to test:

{noformat}
+ grep -q 'ATTACHMENT ID: 12729763' /tmp/tmp.O03e6AgB80
+ shopt -s nocasematch
++ basename /jira/secure/attachment/12729763/HIVE-9456.branch-1.2.patch
+ PATCH_NAME=HIVE-9456.branch-1.2.patch
+ [[ HIVE-9456.branch-1.2.patch =~ ^HIVE-[0-9]+(\.[0-9]+)?(-[a-z0-9-]+)?\.(patch|patch.txt)$ ]]
+ [[ HIVE-9456.branch-1.2.patch =~ ^(HIVE-[0-9]+\.)?D[0-9]+(\.[0-9]+)?\.(patch|patch.txt)$ ]]
+ fail 'Patch HIVE-9456.branch-1.2.patch does not appear to be a patch'
+ echo 'Patch HIVE-9456.branch-1.2.patch does not appear to be a patch'
Patch HIVE-9456.branch-1.2.patch does not appear to be a patch
+ exit 1
+ rm -f /tmp/tmp.O03e6AgB80
Build step 'Execute shell' marked build as failure
Archiving artifacts
Recording test results
{noformat}

Will attempt to resubmit, with the appropriate attachment id 12729762., Precommit tests skipped this saying that attachment id 12729762 had also already been tested. As I prepared to upload a .3.patch identical to the .2.patch, I got to thinking - there's no point in the precommit tests running on this patch - this patch affects only mssql, which the precommit tests do not use.

[~thejas], what do you think? Should we go ahead and submit this as-is?, 

{color:red}Overall{color}: -1 no tests executed

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12730875/HIVE-9456.3.patch

Test results: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-METASTORE-Test/44/testReport
Console output: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-METASTORE-Test/44/console
Test logs: http://ec2-174-129-184-35.compute-1.amazonaws.com/logs/PreCommit-HIVE-METASTORE-Test-44/

This message is automatically generated.

ATTACHMENT ID: 12730875 - PreCommit-HIVE-METASTORE-Test, Agree, precommit tests won't help for this.

Note that this is kicking off  PreCommit-HIVE-METASTORE-Test (not the trunk test), however, that does not work with MSSQL AFAIK.
, Please go ahead and commit this.
, Thanks, will do., HIVE-9456.3.patch committed to master, and HIVE-9456.branch-1.2.patch committed to branch-1.2.

Thanks for the review, Thejas, and thanks for the patch, Xiaobing!, Does this need documentation?, This issue has been fixed and released as part of the 1.2.0 release. If you find an issue which seems to be related to this one, please create a new jira and link this one with new jira.]