[A log file showing the errors when running "ant test", Right now the dependency between the test and compile is broken.

Also for tests you have to run 

ant -lib testlibs test...

Since the build scripts do not automatically picj up junit.jar in testlibs., yeah - test needs to depend on 'package' i believe., This patch makes the test target depend on deploy and changes the build.xml in the ql module to include junit.jar in the classpath.
It runs a lot further, however on my machine a test fails so the whole build doesn't complete.
[junit] Test org.apache.hadoop.hive.cli.TestCliDriver FAILED (timeout)
That should be another ticket though., Hmm.

for some reason we were able to run the tests fine (apart from a couple of diffs in the test run). We will continue to investigate this.

Regarding the patch,

I am fine with the junit.jar change.

The dependency between the test and deploy should however be in build-common.xml (dependency between test and jar) as otherwise this dependency will not be picked up if the test is run from within one of the sub directories., Just having test depend on jar in build-common.xml doesn't work for me. Tried both running "ant test" straight in the project root and in the metastore dir.
For example, doing the latter gives errors such as:
core-compile:
     [echo] Compiling: 
    [javac] Compiling 38 source files to /home/johan/workspace/hive-116/build/metastore/classes
    [javac] /home/johan/workspace/hive-116/metastore/src/java/org/apache/hadoop/hive/metastore/DB.java:30: package org.apache.hadoop.hive.conf does not exist
    [javac] import org.apache.hadoop.hive.conf.HiveConf;          

etc etc....
I assume they're not run in the right order?, yup. 

It seems that the directory dependencies are not set up properly. Ideally

serde depends on common
metastore depends on serde
ql depends on serde and metastore

for the main directories.

I guess without fixing those, it is futile to fix the builds within each of those packages for now.

Will file a separate JIRA for that.

In the light of this I think the latest patch is good.

+1
, committed 724496, HIVE-116. Let test depend on deploy. (Johan Oskarsson through zshao)]