[I think the problem only happens if ColumPruner kicks in and creates a new SELECT op. Otherwise things seem to be fine., The select operator created by ColumnPruner doesn't have the map of output column to input column names so the code is asserting as expected. Added this map for ColumnPruner as well., +1. Looks good, and it passed my example., If we keeps column information(column names instead of numbers) for input tables,as Hive-460 intends to do, can this problem also be resolved.
In my debug, the error is caused by passing in number to RowResover's reverseLookup(), but should pass in real column name., actually "0" here is not a number but the internal name. so if and when 460 is fixed, actual names are compared. name of columns change when they flow through an operator, especially in a select op. so the colExprMap keeps a map of output columns to input column names (or the other way round, not sure) so that translation can be done when predicates move up (or down depending on how you look at it) an operator., Got it. Thanks for the explanation, Prasad. The parse and optimize codes are making me a little headache.  :D, +1

Am running tests on this and I will check it in once those are done.
, I am getting a test failure for

ppd1.q

, i forgot to update the ppd1.q.out file. attached is the updated version., can we turn on partition pruning by default in the unit tests - new tests are getting added all the time, and it might be difficult to catch these bugs.
We can still turn it off in any production cluster till it gets reasonably tested., Yes we should, we definitely have to do it before putting it into production.

Need a new JIRA for that. Can you do the honors?
, still fails the tests.

You have to update the outputs for TestParse as well., yes, we should turn on ppd. let's make it a different JIRA.

@ashish, TestParse results shouldn't need to be changed since ppd is not enabled for them. and tests passed fine for me. anyways, i am rerunning the tests. , ok, another attempt. *sigh*, Running the tests now., athusoo committed this patch may19th, 2009.]