[I noticed that in the schema files under metastore/scripts/upgrade/mysql, like hive-schema-2.0.0.mysql.sql, the character set is latin1 for all tables instead of utf8.

And it could work with MySQL if I update the following columns in the schema script to utf8

SDS.LOCATION
PARTITIONS.PART_NAME
PARTITION_KEY_VALS.PART_KEY_VAL
1)  change the limitation of varchar(xxx) to varchar(255)
2) change "latin1" to "utf8"

In Hive's wiki and HIVE-8550, it mentioned that Hive could support unicode in the partition name.
Is there some special settings for MySQL to support it?, [~libing], is this issue specific to MySQL?, Hi, Rui
I didn't have a chance to try other databases, like Derby, Oracle and Postgres.
But one thing I found is that in the scripts for other databases, it didn't specify the character set.
, Hi [~xuefuz], do you have any idea on this one? Is user allowed to use Chinese for partition value? Thanks., Hi, [~xiaobingo]
I noticed that you fixed HIVE-8550 on windows, and mentioned that it should work on Linux.
I ran the similar query but failed with MySQL.

In order to make it work, besides the changes in Hive schema script, I also need to update MySQL's configuration file which is my.cnf.

When you ran it on windows, did you change the configuraions for the database? Did you have a chance to run it on Linux as well?

Thank you.
, I tried this on postgres, seems not an issue.

{code}
create table foo (name string, age int) partitioned by (city string) row format delimited fields terminated by ',';
alter table foo add partition(city='深圳');
show partitions foo;
+------------+--+
| partition  |
+------------+--+
| city=深圳    |
+------------+--+
1 row selected (0.355 seconds)
{code}, Since the partition names are stored in underlying metadata store DB, that DB has to support unicode in order to support unicode partition names. This in return might require some configuration changes (to enable unicode values) on the DB.

Here is the doc for mysql: http://dev.mysql.com/doc/refman/5.7/en/charset-unicode.html, Thanks [~xuefuz] and [~niklaus.xiao] for your inputs.
Besides configuring the underlying DB, I think we also need to change how we create the database and table in hive's script. This [doc|https://dev.mysql.com/doc/refman/5.7/en/charset-applications.html] provides a way to set character set per database., I am wondering whether we should update the Hive's script since character-set is set in Database Server level. Any thoughts?, [~Ferd] - my understanding is that when Hive creates database and tables, it specifies the character set to be used. So just configuring MySQL won't work. [~libing], please help verify this.
One concern is I'm not sure if this will bring any compatibility issue for users using an early version of MySQL. Besides, does anybody know if we even allow users to use unicode as partition value?, According to wiki, the minimum supported MySQL version is 5.6.17.]