[Adding some specs here., I am thinking to create a new wiki child page and add the information of this JIRA directly there, and link from [https://cwiki.apache.org/confluence/display/Hive/Configuration+Properties|https://cwiki.apache.org/confluence/display/Hive/Configuration+Properties]  

+ [~leftylev] do you have any better thoughts?  Thanks , That sounds good, [~szehon], although additional links from other docs could increase visibility for this issue.  Perhaps we need more documentation about *hive.warehouse.subdir.inherit.perms* somewhere besides Configuration Properties.

How does this relate to storage-based authorization?  When storage-based authorization is not being used, is this still relevant to create/load/insert/export/import commands?

Oh, cool, you've already added the new page.  Reference links:

* [Configuration Properties -- hive.warehouse.subdir.inherit.perms | https://cwiki.apache.org/confluence/display/Hive/Configuration+Properties#ConfigurationProperties-hive.warehouse.subdir.inherit.perms]
* [Permission Inheritance in Hive | https://cwiki.apache.org/confluence/display/Hive/Permission+Inheritance+in+Hive]
* [Storage Based Authorization | https://cwiki.apache.org/confluence/display/Hive/Storage+Based+Authorization+in+the+Metastore+Server]
, Thanks Lefty, I think its a lower level than Storage Based Authorization, because if the flag is on then permissions will be inherited regardless of which authorization is configured.  I updated [Storage Based Authorization|https://cwiki.apache.org/confluence/display/Hive/Storage+Based+Authorization+in+the+Metastore+Server] to add the link according to this understanding.

Question for you, I had a JQL I wanted to in [Permission Inheritance in Hive|https://cwiki.apache.org/confluence/display/Hive/Permission+Inheritance+in+Hive] page to display the full list of patches:
project = HIVE and issue in linkedIssues(HIVE-6892)
but its giving me some wiki runtimeError when I try.  Do you know how to make that work?  Thanks.

, I don't have any experience with that, [~szehon].  Have you taken a look at how it's done in the Open Issues section of HBase Integration?

* [HBase Integration -- Open Issues | https://cwiki.apache.org/confluence/display/Hive/HBaseIntegration#HBaseIntegration-OpenIssues(JIRA)]

It was added by [~cwsteinbach] in version 8 of the doc, so maybe Carl can help you.  Or maybe all you need is this:

* [Versions Compared -- 7 to 8 | https://cwiki.apache.org/confluence/pages/diffpagesbyversion.action?pageId=27362089&selectedPageVersions=8&selectedPageVersions=7]

You might already know, but it's a JIRA Issue box which can be inserted in edit mode from the "+" drop-down list (Insert More Content).  Did you do that, then hit a snag with the query?, Can we remove the TODOC14 label now?

Also, should any other docs have links to Permission Inheritance in Hive?  For example, Authorization or Storage Based Authorization:

* [Authorization | https://cwiki.apache.org/confluence/display/Hive/LanguageManual+Authorization]
* [Storage Based Authorization | https://cwiki.apache.org/confluence/display/Hive/Storage+Based+Authorization+in+the+Metastore+Server], Strange, I thought I added a link from "Storage Based Authorization", but I must have forgotten to save it.  I'll try to add it and remove the label., Ah I found it.  I added a link from [HCatalog Authorization|https://cwiki.apache.org/confluence/display/Hive/HCatalog+Authorization] where it discusses file permissions.  That is in turn is referred from [Storage Based Authorization|https://cwiki.apache.org/confluence/display/Hive/Storage+Based+Authorization+in+the+Metastore+Server].

There is also a link from : [Configuration Properties|https://cwiki.apache.org/confluence/display/Hive/Configuration+Properties].  I will remove the label then., Thanks for finding that link, [~szehon].  I changed it to an internal link so now it shows up in the page information as an incoming link.

* [Page information for Permission Inheritance in Hive | https://cwiki.apache.org/confluence/pages/viewinfo.action?pageId=48203008], Can some changes be made to [Permission Inheritance in Hive|https://cwiki.apache.org/confluence/display/Hive/Permission+Inheritance+in+Hive]?
I've seen some behavior that doesn't match what the doc claims.
Namely:
* Group isn't inherited when the flag is off, "already done by HDFS for new directories" implies that it shouldn't matter.
* Extended ACLs are not "inherited" they are "cloned", which means that default ACLs don't propagate down as default+access (the HDFS way), but default only (which means default for directories and nothing for files). "Extended Acl's are taken from parent" in the first paragraph  already implies this, but it's still rather ambiguous (especially with below containing the same "already done by HDFS" text)., The second point might be a valid change, to mimic the HDFS way instead of cloning the extended ACL's.  I dont have bandwidth to make the change at the moment, someone else can feel free to take a stab (looks like HIVE-11481).  It would be more complex, we would have to traverse the tree and essentially copy the HDFS logic for extended ACL for 'default' group.

I have not investigated enough to comment on the first point., What needs to be changed in the wiki?  (Perhaps it should be a separate JIRA issue.)

* [Permission Inheritance in Hive | https://cwiki.apache.org/confluence/display/Hive/Permission+Inheritance+in+Hive], I made the change, thanks Lefty.]