[This might explain some timeouts
, This patch fixes the problem.
It also changes the naming convention to the Java naming convention.
, That is my bad. 

We should just fix this by reading stderr from the spawned process and sending updates to the tracker if something has been written to stderr instead of indefinitely sending updates as that may lead to processes not getting cleaned up?
, I believe that it is sufficient to track stderr output to see if the process is alive., The major goal of status reporting is probably more for the detecting dead process/dead node than for infinite loops.

Also, users will probably just output stderr messages using timers in their python code.
If that's the case, it does not prevent our users' program from infinite loop.

I think we should check this fix in first (after all it's so simple a fix). Thoughts?
, Instead of asking the users to have a timer in python to send information to stderr a better approach (and the one that we can strongly recommend) would be to check some stats that are maintained by the main loop and only report stderr when those stats have changed. With the current approach that is just not possible, so application errors can easily be amplified. That was the concern that Joy had raised with the previous fix (after it got checked in).
, Escalating this issue to blocker since there is currently no way for a user script to run over 10 minutes without creating an output row., This patch fixes the current timer approach (with a configurable option), and adds the capability to do "reporter.progress()" for each stderr line (but no more frequently than once per minute)., By default, the auto progress is false, which means that the timer would also be off.
It is a change from the existing behavior - is that acceptable ?, The old timer code was never useful because the timeout is the same as the expiry period, so the behavior didn't change actually.

I think this is what we want. If we set it to true by default, it is very easy for some programs to enter infinite loops and never finish.
We should enable it only with users' explicit command "set hive.script.auto.progress=true;".
, +1

Running tests right now, Committed. Thanks Zheng]