[There are no failures in trunk, all tests pass. [~rhbutani], do you think anything is missing in branch-0.13? Looking at commits, i couldnt figure out.
, [~amareshwari], I can't reproduce this.  Tests pass for me in 0.13 and trunk.  These tests should be creating the tables they need as part of the tests (see TxnHandler.checkQFileTestHack()).  Is there anything in your logs indicating it tried to create the tables and failed?  Are you doing anything in your build to turn off the hive.in.test config value?  This would prevent the tables being created., Just ran the tests you mention: TestInitiator, TestWorker, TestCleaner on 0.13
I cannot reproduce the errors either., Thanks [~alangates] and [~rhbutani] for trying. The tests are passing when i run them individually. When all the tests are run together, they are failing.

Here is what i have done :
{noformat}
git clone https://github.com/apache/hive apache-hive
git checkout branch-0.13
nohup mvn clean install -Phadoop-1 &
{noformat}

Attaching nohup output for reference.

bq. Is there anything in your logs indicating it tried to create the tables and failed?
Will check and update.

bq. Are you doing anything in your build to turn off the hive.in.test config value?
No. 

I'm thinking the test db or conf is getting cleaned up by some-other means, when all the tests are run together.

, The nohup test output, The machine on which I'm running is a Linux machine. Same thing happens on Mac as well.

{noformat}
uname -a
Linux <hostname> 2.6.32-21-server #32-Ubuntu SMP Fri Apr 16 09:17:34 UTC 2010 x86_64 GNU/Linux

$ java -version
java version "1.6.0_26"
Java(TM) SE Runtime Environment (build 1.6.0_26-b03)
Java HotSpot(TM) 64-Bit Server VM (build 20.1-b02, mixed mode)
{noformat}, Attaching TestInitiator.xml, Tests are failing for me as well. I did a fresh checkout of the git repo, and ran the test with hadoop-1 profile., Also, there are some tests failing randomly because they fail to create path in /user/hive/warehouse

For ex: org.apache.hadoop.hive.ql.io.TestSymlinkTextInputFormat failed with following errors
{noformat}
log4j:ERROR Could not read configuration file from URL [file:/<hive-path>/ql/target/tmp/conf/hive-log4j.properties].
java.io.FileNotFoundException: /<hive-path>/ql/target/tmp/conf/hive-log4j.properties (No such file or directory)
....

FAILED: Execution Error, return code 1 from org.apache.hadoop.hive.ql.exec.DDLTask. MetaException(message:file:/user/hive/warehouse/text_symlink_text is not a directory or unable to create one)
{noformat}

So, most probably something is getting cleaned-up. But I could not find where to start.

Can someone help me to find the root cause? Where can i start to look at it.  , The test failures were because of HIVE-6877. After applying the patch from HIVE-6877 into branch-0.13, all the tests are passing]