[Good catch, [~mithun].

Some people use old versions of Hive, so the doc needs to show both packages with version information.  Do you know what JIRA issue removed the old package?, Hmm ... HCatalog LoadStore has 10 instances of "org.apache.hcatalog.pig.HCatLoader" and 4 of "org.apache.hcatalog.pig.HCatStorer" so we don't want to show two versions in every location.  Perhaps variables could be used, such as <hcatloader-package>, with a version information box giving the actual package names and versions.

Alternatively, all instances could be updated and a version information box could explain that the package names are different in earlier versions.  What do you think works best?, I could not find the Pig JIRA that caused this issue in version 0.14 however I did modify the documentation and a note to explain the version difference.  I noticed this caused an Ambari issue and some JIRAs for other apps.  Updating docs to latest code may prevent this confusing going forward.

Rather than 2 different instances of code I replaced with updated version and a note regarding the syntax change.  Also emphasized the need for -useHCatalog parameter., Thank you, Andrew.  Here are links to the doc changes:

* [Running Pig | https://cwiki.apache.org/confluence/pages/viewpage.action?pageId=34013511#HCatalogLoadStore-RunningPig]
* [HCatLoader -- Usage | https://cwiki.apache.org/confluence/pages/viewpage.action?pageId=34013511#HCatalogLoadStore-Usage]
* [HCatLoader -- Load Examples | https://cwiki.apache.org/confluence/pages/viewpage.action?pageId=34013511#HCatalogLoadStore-LoadExamples]
* [HCatStorer -- Usage | https://cwiki.apache.org/confluence/pages/viewpage.action?pageId=34013511#HCatalogLoadStore-Usage.1]
* [HCatStorer -- Store Examples | https://cwiki.apache.org/confluence/pages/viewpage.action?pageId=34013511#HCatalogLoadStore-StoreExamples]

A question:  In the Stale Content Warning box, shouldn't "Pig Versions" be "Hive Versions"?  I'm not familiar with Pig versions but in this jira's description [~mithun] says "The old package was deprecated and removed in Hive 0.13."  Hmm ... that would mean it's Hive 0.13+ instead of 0.14+.  Could you please check?

The same question applies to the new subheading "Using Pig 0.14+" in the HCatLoader Usage section., I found the JIRA issue that removed the deprecated package:  HIVE-6432 in release 0.14.0 ("Remove deprecated methods in HCatalog").  So the doc should say Hive version 0.14 instead of Pig version 0.14.

I'll fix it later if you don't get to it first., Fixed documentation in wiki]