[Hi [~xuefuz]

[~prasanth_j] and me found this issue with the patch at HIVE-10166. 
Could you help us take a look to know what's the problem?, Sure. How can I access the hive.log file that has an excessive size?, Just run this test on your machine.
# mvn test -Phadoop-2 -Dtest=TestJdbcWithMiniHS2

Then search for the hive.log, and you will see it is big. , It seems using thrift 0.9.2 for the code generation has caused the problem. I ran the test before and after HIVE-9152 commit on Spark branch and can see the behavior difference. Basically, you will either see or not see the following in hive.log after or before the commit when you run the test above.
{code}
2015-08-06 07:17:08,960 WARN  [Thread-17]: server.TThreadPoolServer (TThreadPoolServer.java:serve(206)) - Transport error occurred during acceptance of message.
org.apache.thrift.transport.TTransportException: No underlying server socket.
	at org.apache.thrift.transport.TServerSocket.acceptImpl(TServerSocket.java:126)
	at org.apache.thrift.transport.TServerSocket.acceptImpl(TServerSocket.java:35)
	at org.apache.thrift.transport.TServerTransport.accept(TServerTransport.java:60)
	at org.apache.thrift.server.TThreadPoolServer.serve(TThreadPoolServer.java:161)
	at org.apache.hive.service.cli.thrift.ThriftBinaryCLIService.run(ThriftBinaryCLIService.java:100)
	at java.lang.Thread.run(Thread.java:722)
{code}
I don't see anything obviously wrong though. [~csun], could you take a look? We can either find a fix (if that's easy), or simply regenerate thrift code using 0.9.0., OK, I'll take a look., Let's see if using Thrift 0.9.0 solve the problem., Hmm, seems like with Thrift 0.9.0 it still have this message in the log., [~csun] [~xuefuz] So you think its some other change in spark merge patch that is causing the problem ?, [~thejas], in spark branch itself, it seems that some change in HIVE-9152 itself exposed this problem. Besides the thrift version change for code generation, there doesn't seem to be anything that can causes this. I guess some investigation is needed. In the meantime, second eye helps. Maybe you can take a look at the patch there as well to see if you spot anything suspicious., I'm still investigating this.. the strange thing is the issue happens even after switching back to 0.9.0.
Looks like something unrelated to thrift in HIVE-9152 caused this issue. More latter.., Looks like there was a bad merge of ThriftBinaryCLIService.java, and server.serve() is called twice. I commented out the first invocation and it looks like the log size isn't huge anymore.

{noformat}
        // TCP Server
        server = new TThreadPoolServer(sargs);
 +      server.setServerEventHandler(serverEventHandler);
 +      server.serve();
-       String msg = "Started " + ThriftBinaryCLIService.class.getSimpleName() + " on port "
+       String msg = "Starting " + ThriftBinaryCLIService.class.getSimpleName() + " on port "
            + portNum + " with " + minWorkerThreads + "..." + maxWorkerThreads + " worker threads";
        LOG.info(msg);
+       server.serve();
      } catch (Throwable t) {
{noformat}, eh, spoke to soon .. still seem to be getting errors in my test. I'll take a look when the test finishes, [~csun] What do you think of reverting the HIVE-9152 change temporarily while the issue with the change is investigated, so that we can get the precommit tests going again ?
, I think this could be it. When I debugged it, it seems that the errors started showing up after the service is stopped. It seemed that the "service" didn't stop completely, but now I realized that there might be two services and only one was stopped., Yes, I'm OK with it. , My test shows that by removing one of the line "server.serve()", the problem goes away. Thanks to Jason for eying that out. How is your test coming out?, I removed HIVE-9152 on my local machine, but the exception messages are still in the log. I'm not quite sure if HIVE-9152 caused the problem., Yeah, it might not be related to HIVE-9152. I'm not sure why I saw the behavior difference previously. To me now HIVE-10330 seems to be the problem. I'm going to submit a patch to fix that. We can probably commit this w/o a precommit run, but +1 from someone will be good., +1 for .1 patch., Committed to master and spark branch. Thanks to Jason for the identifying the fix and Prasanth for the review., The latest run showed that the problem went away. The log file size went down to 13M in the lastest QA run: http://ec2-174-129-184-35.compute-1.amazonaws.com/logs/PreCommit-HIVE-TRUNK-Build-4869/succeeded/TestJdbcWithMiniHS2/hive.log., [~prasanth_j] [~spena] [~xuefuz] [~jdere] [~csun]
Thanks for the great team work  ! ]