[This test was introduced in HIVE-4268 .
, Now that the build doesn't fail earlier anymore this problem is causing the build to fail. Since we've disabled BeeLine tests I guess we can disable this one too?, [~robw] do you want to take a look?, bq. Since we've disabled BeeLine tests I guess we can disable this one too?

No, I think it would be better to fix TestBeeLineWithArgs (which isn't actually broken), and re-enable a comprehensive subset of the other HiveServer2 tests, unless of course the plan is to let HiveServer2 rot until it's completely broken.

TestBeeLineWithArgs was committed in HIVE-4268, but it wasn't enabled until I committed HIVE-4497 the other day. HIVE-4356 was committed in between, and that's the actual source of the bug.

Gunther, can you please take a look at this? Thanks., This is a blocker for 0.11 since HIVE-4356 is included on that branch., I haven't actually touched HIVE-4356. That's Thejas' work. I believe Ashutosh mistakenly put my name in the commit log. [~thejas] do you have any ideas?, Sure, looking into it.
, HIVE-4498.1.patch - TUGIContainingProcessor calls  shim.closeAllForUGI() to free up entries from FileSystem.CACHE. But that ends resulting in the empty result being fetched in the next call.

The best way to fix the memory leak, in my opinion is to just disable the FileSystem cache.  See HIVE-4501

, Review board link - https://reviews.apache.org/r/11017/ 
I think we should also get HIVE-4501 into hive 0.11, ie disable cache by default, so that there is no memory leak with default configs.

, @Thejas: Thanks for providing a patch. I verified that it fixes the problem. I also took a look at HIVE-4356 and left some comments on the original reviewboard request here: https://reviews.apache.org/r/10554/

I would really appreciate it if you take a look. Thanks., +1. If someone else can test this that would be great., Carl, Thanks for the review.
I will go through your comments on HIVE-4356, but I don't think I will be able to get to it today.

, Thanks. My comments all fall into the nice-to-have category, so there's no need to worry about it now., I'm starting up tests now and will commit it if they pass., I just committed this. Thanks, Thejas!, Integrated in Hive-trunk-h0.21 #2098 (See [https://builds.apache.org/job/Hive-trunk-h0.21/2098/])
    HIVE-4498 TestBeeLineWithArgs.testPositiveScriptFile fails (Thejas Nair via omalley) (Revision 1481345)

     Result = FAILURE
omalley : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1481345
Files : 
* /hive/trunk
* /hive/trunk/service/src/java/org/apache/hive/service/auth/TUGIContainingProcessor.java
, Integrated in Hive-trunk-hadoop2 #193 (See [https://builds.apache.org/job/Hive-trunk-hadoop2/193/])
    HIVE-4498 TestBeeLineWithArgs.testPositiveScriptFile fails (Thejas Nair via omalley) (Revision 1481345)

     Result = FAILURE
omalley : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1481345
Files : 
* /hive/trunk
* /hive/trunk/service/src/java/org/apache/hive/service/auth/TUGIContainingProcessor.java
]