[Also, Prasad [brought up|https://issues.apache.org/jira/browse/HIVE-6555?focusedCommentId=13921608&page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel#comment-13921608] on HIVE-6555 that schema version update should happen at last.
[~alangates] Can you take a look?, Thanks [~ashutoshc] !
It's a pretty simple change. I can take care of it., Sorry, [~prasadm] I mixed up two issues here. One which you brought up. Another different issue is calling out txn-script from schema script is not working as intended.  See description of this issue. Feel free to pick either one or both of them., The changes will be done on top of the 0.14 scripts that are being added by HIVE-6555 patch., ah ok. sorry, didn't notice that. I was talking about the script ordering issue. will create a separate ticket for that. Thanks
, Although, HIVE-6583 will help one get past problem I pasted above, that doesn't help completely. New requirement because of sourcing another script leads one into a situation that you need to be in same dir to perform this sourcing correctly. Otherwise, you will get 
{code}
ERROR: 
Failed to open file 'hive-txn-schema-0.13.0.mysql.sql', error: 2
{code}
This is inconvenience for user, but real problems is for tools because they now need to cd into correct dir to invoke this script.
I believe we should not source another script, but inline all sql statements in existing script., I fixed the issue by removing the invocations from the hive-schema-0.13 scripts and inlining the table creation., 

{color:green}Overall{color}: +1 all checks pass

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12633741/HIVE-6559.patch

{color:green}SUCCESS:{color} +1 5377 tests passed

Test results: http://bigtop01.cloudera.org:8080/job/PreCommit-HIVE-Build/1704/testReport
Console output: http://bigtop01.cloudera.org:8080/job/PreCommit-HIVE-Build/1704/console

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12633741, Looks fine to me. 
The same changes will be needed in hive-schema-0.14.0.*.sql files in trunk. I guess this patch can be applied to 0.13 as is., +1. yeah.. we should get this in 0.13 as well., For 0.14.* sql files we can track in separate jira because I guess Alan is thinking on how to do it better in trunk., Sounds good.

+1
, Committed to 0.13 & trunk. Thanks, Alan!]