[[~prasadm], [~thejas], [~szehon], could you review the patch? Thanks, Patch has been uploaded to https://reviews.apache.org/r/45552/ for review. Thanks in advanced., +1  Quick question, is it possible to add miniKDC test with some LDAP like in HIVE-11866?  If so it may be good to add as a follow-on JIRA, although not sure the feasibility.  Just wondering., Thanks [~szehon] for review. I will definitely explore this possibility in a follow-up JIRA., 

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12796352/HIVE-13401.patch

{color:green}SUCCESS:{color} +1 due to 1 test(s) being added or modified.

{color:red}ERROR:{color} -1 due to 1 failed/errored test(s), 9974 tests executed
*Failed tests:*
{noformat}
org.apache.hadoop.hive.cli.TestMiniSparkOnYarnCliDriver.testCliDriver_index_bitmap3
{noformat}

Test results: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/7448/testReport
Console output: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/7448/console
Test logs: http://ec2-174-129-184-35.compute-1.amazonaws.com/logs/PreCommit-HIVE-TRUNK-Build-7448/

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.TestCheckPhase
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
Tests exited with: TestsFailedException: 1 tests failed
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12796352 - PreCommit-HIVE-TRUNK-Build, The failed test testCliDriver_index_bitmap3 is not related., Committed to 2.1.0, thanks [~szehon] for review., Should this be backported to 2.0.1?, Yeah, [~sershe] It should be backported to 2.0.1 as well., Attach the patch for branch-2.0.1. [~sershe]I have not backported to branch yet since current 2.0.1 seems break in compilation of LLAP., Backported to 2.0.1., Hmm, I made another commit of the same patch, reverting it now., Thanks for the backport!, Looks like this depends on other patches. I will remove from 2.0.x for now. , [~sershe] It actually fixes an issue from HIVE-10115 which is already in 2.0.1, I resolved some minor conflicts in its tests which used some test methods not yet available in 2.0.1. So I think it should be OK in 2.0.1 given that without it the feature provided in HIVE-10115 does totally not work., Can you commit it again then with build working? ;), Apology, my mistake. I committed the patch HIVE-13401-branch2.0.1.patch partially :-(.
[~szehon], could you help to review and double check? I think it should be in 2.0.1 since it fixes the issue from HIVE-10115, without it, the feature provided by HIVE-10115 does not work at all., Yes, committed it again. Thanks [~sershe]. ]