[https://reviews.facebook.net/D3861

Working directory could be different from temp directory for MapredLocalWork (intentional?), so just prepended the temp directory as a parent of stored files with some error handling., Did you very-clean? The tests look ok.

[edward@tablitha trunk]$ ant test -Dtestcase=TestCliDriver -Dqfile=bucketmapjoin1.q
BUILD SUCCESSFUL
Total time: 4 minutes 18 seconds
, @Navis is there any way we can unit test here. This slipped through the unit testing., Please ignore here. There is not much that can be done about this one unit test wise. +1, Resolved. Thanks Navis., Committed this fast? o.o 
I missed to close input files. Could you change the fetch if not yet committed?
{code}
IOUtils.copy(new FileInputStream(f), tOut); // copy with 8K buffer, not close
-->
FileInputStream input = new FileInputStream(f);
try {
  IOUtils.copy(input, tOut); // copy with 8K buffer, not close
} finally {
  input.close();
}
{code}, @Navis - Would it be possible to update/add aunit test? it looks like some settings are missing in the .q file.

Thanks, @Navis please supply a patch to place on top of this one. Or we can revert the change and supply a fully patch., @Kanna Karanam - Some problems are not shown by hive test framework. I don't know why.
@Edward Capriolo - Added HIVE-3207. Sorry for your inconvenience., Integrated in Hive-trunk-h0.21 #1518 (See [https://builds.apache.org/job/Hive-trunk-h0.21/1518/])
    HIVE-3206 FileUtils.tar assumes wrong directory in some cases. Navis Ryu (via egc) (Revision 1354816)

     Result = SUCCESS
ecapriolo : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1354816
Files : 
* /hive/trunk/common/src/java/org/apache/hadoop/hive/common/FileUtils.java
, Integrated in Hive-trunk-hadoop2 #54 (See [https://builds.apache.org/job/Hive-trunk-hadoop2/54/])
    HIVE-3206 FileUtils.tar assumes wrong directory in some cases. Navis Ryu (via egc) (Revision 1354816)

     Result = ABORTED
ecapriolo : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1354816
Files : 
* /hive/trunk/common/src/java/org/apache/hadoop/hive/common/FileUtils.java
, This issue is fixed and released as part of 0.10.0 release. If you find an issue which seems to be related to this one, please create a new jira and link this one with new jira.]