[Hmm looking at this code:
https://github.com/apache/hive/blob/trunk/metastore/src/java/org/apache/hadoop/hive/metastore/ObjectStore.java#L6630

The only way I could see multiple versions being inserted is by multiple clients executing against a HMS which did not have a version recorded., Hi, please look at 
https://github.com/apache/hive/blob/trunk/metastore/src/java/org/apache/hadoop/hive/metastore/ObjectStore.java#L6617
getMetaStoreSchemaVersion() will return null if it have MysqlException. this will cause Hive to insert another version record. I think maybe I met this situation, The only exception which is caught is {{NoSuchObjectException}} which is expected if the table is empty. , You are right, but this exception always happens. I am sure The meta already has a verion record before this exceptin happen and after i delete the duplicate record in the mysql table manually everything is ok, But the exception will happen within a few hours. So can you give some else clue?, Hey [~brocknoland], as [~lijy83] pointed out, when ever there is a MysqlException, a duplicate entry will be created. The problem here is with https://db.apache.org/jdo/api20/apidocs/javax/jdo/Query.html#execute%28%29 execute() function of Query.java.  "execute()" does not throw any exceptions. 

Some reproducible steps: 
1) Make sure metastore db is reachable&running. 
2) Enable debugger and stop at a breakpoint inside checkSchema().
3) Stop the metastore db or make it unreachable. 
4) Continue on the debugger, you would see execute call of getMSchemaVersion() does not throw exceptions of DB reachability. It just returns an empty array as if there are no entries in the table. Thus making the getMSchemaVersion() throw NoSuchObjectException. 


This issue happens when we have a flacky network connection to DB. 

, hi，have you worked out any approach to solve the problem? i have the same problem. thanks. my QQ:363190371 email:rain841024@163.com, all above 2 errors are due to query.execute() function didnt throw exceptions when network is wrong...i think
if we can add a exception in this section?, 这个问题你们也经常发生吗？我其实现在还没有发现具体什么原因导致 metastore 表中会有多个版本出现？按照你的说法，应该是hive的bug吗？ 








, I met this today 
what is the reason for, anyon can explain ?]