[Github user jamescao commented on a diff in the pull request:

    https://github.com/apache/flink/pull/1064#discussion_r38163609
  
    --- Diff: flink-staging/flink-hcatalog/pom.xml ---
    @@ -34,17 +34,64 @@ under the License.
     
     	<packaging>jar</packaging>
     
    +	<repositories>
    +		<repository>
    +			<id>cloudera</id>
    +			<url>https://repository.cloudera.com/artifactory/cloudera-repos/</url>
    +		</repository>
    +	</repositories>
    +
     	<dependencies>
     		<dependency>
     			<groupId>org.apache.flink</groupId>
     			<artifactId>flink-java</artifactId>
     			<version>${project.version}</version>
     		</dependency>
    -
    +		<dependency>
    +			<groupId>org.apache.flink</groupId>
    +			<artifactId>flink-scala</artifactId>
    +			<version>${project.version}</version>
    +		</dependency>
    +		<dependency>
    +			<groupId>org.apache.hive.hcatalog</groupId>
    +			<artifactId>hive-hcatalog-core</artifactId>
    +			<version>1.1.0-cdh5.4.0</version>
    --- End diff --
    
    This is a known issue with hcatalog, the maven artifact is compiled against hadoop1 and blocks unit testing. 
    https://issues.apache.org/jira/browse/HIVE-7349
    @fhueske 
    I found there is no pre-exist test when I begin to work on this issue. How did hcatalog get tested before? If we stick to the vanilla hcatalog, I guess one way is to move it to hadoop1 profile(flink compiled against the maven hcatalog jar can't be used in a hadoop2 env anyway), which will limit its usage to a large extend since almost all hive production servers on run on hadoop2 now.
, Github user jamescao commented on the pull request:

    https://github.com/apache/flink/pull/1079#issuecomment-136359875
  
    @chiwanpark 
    Yes, it's sure that the apache version of HCatalog is compiled against hadoop1. Using this jar in an hadoop2 environment will lead to binary incompatibility error. I think Hive community is aware of this problem.
    https://issues.apache.org/jira/browse/HIVE-7349
    On the other hand. The cloudera Hcatalog jar is compiled against hadoop2, thus works with hadoop2 environment. But using cloudera jar in a hadoop1 environment will lead to binary incompatibility error. I guess one way to solve this is to add a vendor-specific hcatalog-module for users who want to use hcatalog in hadoop2 or we need to wait until hive community publish 2 artifacts in maven for both hadoop1 and hadoop2. 
]