[I have updated code in the  org.apache.hadoop.hive.ql.parse.SemanticAnalyzer java file for both server side and client side.
, I have updated code in the org.apache.hadoop.hive.ql.parse.SemanticAnalyzer java file for both server side and client side. , To solve this issuse need to apply this patch  HIVE-1346_patch.patch and    updated hive-exec-0.5.0.jar in both server side and client side, The change looks good - can you change the comment to remove your name from it.
, Hi Namit,

Sure I will change and upload the new patch.

Thanks and Regards.
Sunil Kumar
Extn- 2657


, Patch updated, Updated patch name removed from comment section, The patch does not apply cleanly - can you regenerate the patch ?
Make sure that you do from $HIVE_TRUNK, and not $HIVE_TRUNK/ql, updated, Hi Namit,

 Patch HIVE-1346_patch.patch ,2010-05-26 01:48 AM is now  created from $HIVE_TRUNK, Hi Sunil,

Have you created this patch on 0.5.0 branch or trunk? Are you  proposing that this goes into both 0.5.1 and trunk?, @Namit,

in what cases would colAlias ever be null. There seems to be code which checks for this around line 3314 in the trunk branch. But afaik we should always be generating a colAlias (at least the default ones). Just wanted to make sure that we are covering all the basis with this fix.

Ashish, Hi Ashish,
I have created patch on http://svn.apache.org/repos/asf/hadoop/hive/tags/release-0.5.0
, Can someone comment on the state of this jira: is the review pending on a modification to the patch or is the commit pending on a review? Thanks., @Vinithra: the patch needs to be rebased to trunk and submitted for review. Another issue is that 
this patch does not include any test output updates, which is almost certainly an oversight since this
change should affect the output of EXPLAIN.
, Updated patch with regenerated outfiles., Review request: https://reviews.apache.org/r/364/
, +1. Will commit if tests pass.
, Update: the original 1 line patch does not seem to address all of the problems. This needs to get reworked before it can be committed.]