[@Zhenxiao: please submit a review request., review request submitted at:
https://reviews.facebook.net/D4041, Thanks Zhenxiao. These are good changes. Instead of selecting all rows and then displaying them in order, can we just go with displaying the count of records in the table so that it works on Unix as well as on Windows (Windows has a problem with extra white spacing.. in this case they are new line records), Kanna,

Do you mind showing me the output that windows produces? I do not love the idea of juggling around the unit tests to make everyone "happy". There is just something fundamentally wrong with a unit test telling you what you can and can not test, or changing existing tests to make tools happy. In the case of mapreduce2 we may be able to write a partitioner and secondary sort (cluster by) to make this happen., @Edward – I do agree with you. Unit test shouldn’t restrict us on what to test and what not. Apart from  the differences in new line characters, “ToString()” on some objects are introducing extra lines/spaces at the end  on Windows compare to Unix and it is causing  some tests fail. Here is the diff for “alter1.q” on windows. (Note: I trimmed the CR characters to minimize the patch)

Coming to this Jira – timestamp_lazy.q is passing with no issues. I couldn’t run newline/q test yet on windows because of some Path/Perl related issue.
, Corrected: ToString()” on some objects are introducing differences in white lines/spaces on Windows compare to Unix and it is causing some tests fail, +1. Will commit if tests pass., @Zhenxiao: This needs a rebase after HIVE-3327. Please update., Patch rebased, Review request submitted at:
https://reviews.facebook.net/D4539, +1. Will commit if tests pass., Committed to trunk. Thanks Zhenxiao!, Integrated in Hive-trunk-hadoop2 #54 (See [https://builds.apache.org/job/Hive-trunk-hadoop2/54/])
    HIVE-3240. Fix non-deterministic results in newline.q and timestamp_lazy.q (Zhenxiao Luo via cws) (Revision 1376834)

     Result = ABORTED
cws : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1376834
Files : 
* /hive/trunk/ql/src/test/queries/clientpositive/newline.q
* /hive/trunk/ql/src/test/queries/clientpositive/timestamp_lazy.q
* /hive/trunk/ql/src/test/results/clientpositive/newline.q.out
* /hive/trunk/ql/src/test/results/clientpositive/timestamp_lazy.q.out
, This issue is fixed and released as part of 0.10.0 release. If you find an issue which seems to be related to this one, please create a new jira and link this one with new jira.]