[Here are comments years ago to explain why the grand-children process is not killed(http://bugs.java.com/bugdatabase/view_bug.do?bug_id=4770092), but I guess there should be some fixes, I will dig more.
The following excellent SDN comment explains what's going on:
---------------------------------------------------------------------
The fundamental problem here is that, unlike Unix, Windows does that
maintain parent-child relationships between processes. A process can
kill its own immediate children, but unless you make other
arrangements to obtain the information, can't kill any
'grand-children' because it has no way of finding them. Ctrl-C types
at a command prompt is just a character that the command processor
interprets and not a signal sent from outside. When you 'destroy' a
child command script, that process does not get the opportunity to
terminate any child processes it may know about.
Recent versions of WIndows (2000 or later) do provide a "Job" concept
which acts as a container for processes. Killing a Job does terminate
all processes associated with that job. However Jobs do not contain
other jobs, so fully emulating the Unix behaviour is probably
impossible.
---------------------------------------------------------------------
Note that Unix emulation environments on Windows, like Cygwin,
suffer from the same problem. Any fix would be difficult.
Even if we could figure out how to fix this, we might choose not to do so
for the usual reason – compatibility.
2005-09-27, Removed cmd.exe process as a wrapper of JVM process. This fixed the issue., Made a patch. Can anyone in the watcher list review it? Thanks!, Making this critical since this is required for windows., [~xiaobingo] Posted some comments on rb. Thanks for the patch., [~hsubramaniyan] I think you had more knowledge to clear [~vgumashta]'s doubts in review board. Can you comment on this? Thanks!, [~vgumashta] hiveserver2.cmd changes that [~xiaobingo] made are used to generate the hiveserver2.xml file used as an input config file to the service host bin to  start up hiveserver2 service in windows. Since the changes in hiveserver2.cmd are specific to hiveserver2 and cannot be added as part of hive-site.xml(since this will affect queries run via cli), I believe the changes made by [~xiaobingo] should be fine. 

Thanks
Hari, [~hsubramaniyan] Cool. I'll mark that comment as resolved., Posted 2nd patch to be reviewed. Thanks!, [~xiaobingo] For HiveConf, the description will need to go in as the 3rd parameter rather than a comment. This helps when hive-site-default is generated., Thanks [~vgumashta]. Made that change and the 3rd patch to be reviewed., [~xiaobingo], the description of hive.hadoop.classpath runs over the 100-character line limit so please break it into several lines.  (Starting the description on a new line will make it look better in hive-default.xml.template.)  And hiveserver2 should be camel caps:  HiveServer2.  Should java be Java?

For example:

{code}
    HIVE_HADOOP_CLASSPATH("hive.hadoop.classpath", null, 
        "For Windows OS, we need to pass HIVE_HADOOP_CLASSPATH java parameter while starting HiveServer2 \n" +
        "using \"-hiveconf hive.hadoop.classpath=%HIVE_LIB%\"."),
{code}

Also, you accidentally added some trailing whitespace on the previous line (hive.typecheck.on.insert)., Thanks [~leftylev]. Made the 4th patch to be reviewed. , +1. Will commit in clean precommit run. , 

{color:red}Overall{color}: -1 at least one tests failed

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12672912/HIVE-8340.4.patch

{color:red}ERROR:{color} -1 due to 1 failed/errored test(s), 6524 tests executed
*Failed tests:*
{noformat}
org.apache.hadoop.hive.ql.txn.compactor.TestCompactor.testStatsAfterCompactionPartTbl
{noformat}

Test results: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/1121/testReport
Console output: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/1121/console
Test logs: http://ec2-174-129-184-35.compute-1.amazonaws.com/logs/PreCommit-HIVE-TRUNK-Build-1121/

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
Tests exited with: TestsFailedException: 1 tests failed
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12672912, Test failure is unrelated., Committed to trunk and 14. Thanks for the patch [~xiaobingo]!, Thanks for reviewing the configs [~leftylev], Doc note:  This adds *hive.hadoop.classpath* to HiveConf.java, so it needs to be documented in the wiki. Although the parameter doesn't start with "hive.server2...", it belongs in the HiveServer2 section:

* [Configuration Properties -- HiveServer2 | https://cwiki.apache.org/confluence/display/Hive/Configuration+Properties#ConfigurationProperties-HiveServer2], This doesn't seem to be a user-facing property as per my understanding, [~xiaobingo] is that the case?, [~szehon] and [~leftylev], I guess, this should be documented. Users are allowed to set that parameter in hiveserver2.xml. , I see, but I thought the hiveserver2.cmd sets this when starting HS2, so wondering what case would the user need to set this?   Wasn't following the JIRA, thanks in advance., This has been fixed in 0.14 release. Please open new jira if you see any issues.
, *hive.hadoop.classpath* is documented in the wiki:

* [Configuration Properties -- HiveServer2 -- hive.hadoop.classpath | https://cwiki.apache.org/confluence/display/Hive/Configuration+Properties#ConfigurationProperties-hive.hadoop.classpath]

Should it also be documented in "Setting Up HiveServer2"?

* [Setting Up HiveServer2 -- How to Configure | https://cwiki.apache.org/confluence/display/Hive/Setting+Up+HiveServer2#SettingUpHiveServer2-HowtoConfigure]]