[Ok, this took rather longer than expected... initially I tried to make stat fetching part of partition pruning, this can be added as an extra optimization if necessary as this requires too many API changes all over the place.
The alternative is simple, getting stat calls are all batched. New APIs on thrift use req/resp pattern; requests contain db, table, column list, and partition list (for partitions). The request returns whatever it can find (rather than the full list with some nulls, like the old APIs that built lists using individual calls to metastore). The code then uses this. 
On metastore there's both JDO and SQL path for speed.
Also, cleaned up some stuff in StatOptimizer and StatsUtil that was generally suboptimal., Patch coming today barring something surprising happens, Well, it looks like I cannot defeat datanucleus today... SQL path seems to work, although I didn't run all the tests. Let me comment out and check for now., Currently, the API fetches statistics for a given column. hive.stats.fetch.column.stats fetches stats for all columns for all partitions in all tables. Bad idea. HIVE-4301 was filed to support a bulk fetch API so that stats for all columns for all partitions in multiple tables can be fetched with a single call. Feel free to pick up HIVE-4301., Sorry, was not aware of that JIRA. Among other things, this patch adds bulk APIs. They do not support multiple tables as of now, though. Stats are currently fetched on the level of one column (stat optimizer) or one table (table scan stuff), so making use of multi-table API would require more extensive changes on the client (optimizer) side., first patch. There's one TODO# left where I think some validation code is dead, need to see if any tests fail with it.

Other than that many tests I ran passed, let's see what HiveQA says, nogen patch omits generated code and is posted to https://reviews.apache.org/r/17162/, hmm, q.out file change may have not been a planned inclusion, let me dbl check, HiveQA won't pick the patch; same file, 

{color:red}Overall{color}: -1 at least one tests failed

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12624267/HIVE-6157.01.patch

{color:red}ERROR:{color} -1 due to 3 failed/errored test(s), 4943 tests executed
*Failed tests:*
{noformat}
org.apache.hadoop.hive.cli.TestCliDriver.testCliDriver_alter_partition_coltype
org.apache.hadoop.hive.cli.TestCliDriver.testCliDriver_annotate_stats_table
org.apache.hadoop.hive.cli.TestCliDriver.testCliDriver_metadataonly1
{noformat}

Test results: http://bigtop01.cloudera.org:8080/job/PreCommit-HIVE-Build/980/testReport
Console output: http://bigtop01.cloudera.org:8080/job/PreCommit-HIVE-Build/980/console

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
Tests exited with: TestsFailedException: 3 tests failed
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12624267, Patch looks good. Some questions/comments on RB. What about the test failures? They seem relevant., RB feedback, also test fixes (02 fixed those but I couldn't add it to jira). I am running the tez test now, metadata_only_queries.q.out got modified for tez test, but it appears that the changes come from unrelated patches. Because it doesn't run in HiveQA it didn't get updated at some point. Not including in this patch... the rest passed, I have HIVE-6261 open for the metadata_only_queries, exact same patch, HiveQA won't run, [~prasanth_j] do you want to also take a look? This would effect the stats annotation too., 

{color:red}Overall{color}: -1 at least one tests failed

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12625080/HIVE-6157.03.patch

{color:red}ERROR:{color} -1 due to 6 failed/errored test(s), 4958 tests executed
*Failed tests:*
{noformat}
org.apache.hadoop.hive.cli.TestMinimrCliDriver.testCliDriver_bucket_num_reducers
org.apache.hadoop.hive.cli.TestMinimrCliDriver.testCliDriver_bucketmapjoin6
org.apache.hadoop.hive.cli.TestMinimrCliDriver.testCliDriver_import_exported_table
org.apache.hadoop.hive.cli.TestMinimrCliDriver.testCliDriver_infer_bucket_sort_reducers_power_two
org.apache.hadoop.hive.cli.TestMinimrCliDriver.testCliDriver_load_hdfs_file_with_space_in_the_name
org.apache.hadoop.hive.cli.TestNegativeMinimrCliDriver.testNegativeCliDriver_file_with_header_footer_negative
{noformat}

Test results: http://bigtop01.cloudera.org:8080/job/PreCommit-HIVE-Build/1010/testReport
Console output: http://bigtop01.cloudera.org:8080/job/PreCommit-HIVE-Build/1010/console

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
Tests exited with: TestsFailedException: 6 tests failed
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12625080, Mostly looks good. Left minor comments on RB., Some of the test failures are also happening in other jiras and some I cannot repro... let me address recent RB feedback and rerun QA, LGTM +1, on some other jira with harmless patch all but one of the same tests failed so I assume they are all broken. I'll take a look at bucketmapjoin6, cannot repro on multiple machines and I see bucketmapjoin6 also fails in some jiras... probably flaky. Will commit tomorrow., Committed to trunk. Thanks Sergey!]