[All the unit test cases which not using QTestUtil can use the same method in the patch to convert the paths in the HiveConf and avoid inconsistent test result on Windows, Fixed Unit test in HIVE-4448.1.patch
1.TestExecDriver
2.TestHiveMetaStoreChecker
, You are changing following four strings, which I think is not necessary.
 
* HiveConf.ConfVars.METASTOREWAREHOUSE : This is a path on hdfs. C:\\user\hive\warehouse won't make sense here.

* System.getProperty("test.tmp.dir") This is coming from build-common.xml. We should rather fix it there, by properly using file seprators  ${file.separator} More info: http://ant.apache.org/manual/Types/mapper.html

* System.getProperty("test.src.data.dir") : Same as above.

* HiveConf.ConfVars.SCRATCHDIR : This fixed via HIVE-4609, Hi [~ashutoshgupta17@gmail.com]
Thanks for the comments.
You are right, since HiveConf.ConfVars.METASTOREWAREHOUSE is a path on hdfs, so the "convertPathsFromWindowsToHdfs" not only change the file separator, it also remove the drive name in Windows path. Here is an example for HiveConf.ConfVars.METASTOREWAREHOUSE before and after the conversion:
before: "pfile://E:\HIVE-4448\hive-trunk\build\ql/test/data/warehouse" (this path will cause confusion and "E:\HIVE-4448\hive-trunk\build\ql" will be removes as authority of the path. We need the /HIVE-4448/hive-trunk/build/ql folder structure when creating the warehouse folder)
after conversion: "pfile:///HIVE-4448/hive-trunk/build/ql/test/data/warehouse" (valid hdfs path which will create the /test/data/warehouse folder in the correct location on windows machine)
by only use the proper file separators, the driver name in Windows path like E:\ will still cause confusion in HDFS path.
In addition, the reason I use the function "convertPathsFromWindowsToHdfs" is because the same function is in the class QTestUtil. This insure the same behavior of path conversion in all unit tests (a few unit test does not use QTestUtil which make the fix like this easier to apply to all of the tests), The same changes are also a part of HIVE-5176, trying to get that one pushed through.]