[Simple patch., Marking PA to get HIVE QA to run., 

{color:red}Overall{color}: -1 at least one tests failed

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12597791/HIVE-5077.patch

{color:red}ERROR:{color} -1 due to 1 failed/errored test(s), 2856 tests executed
*Failed tests:*
{noformat}
org.apache.hadoop.hive.cli.TestMinimrCliDriver.testCliDriver_infer_bucket_sort_reducers_power_two
{noformat}

Test results: https://builds.apache.org/job/PreCommit-HIVE-Build/425/testReport
Console output: https://builds.apache.org/job/PreCommit-HIVE-Build/425/console

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
Tests failed with: TestsFailedException: 1 tests failed
{noformat}

This message is automatically generated., +1

The infert_bucket_sort_reducers_power_two test failure doesn't seem related. Ran multiple times locally without being able to reproduce the issue., I am -1 until I understand something.

It seems like this issue:
https://issues.apache.org/jira/browse/HIVE-5054

Is removing a feature similar to the one this ticket is adding. Can someone explain the difference between the thing we are removing and the thing we are adding? Also with no description I can not understand why we want this option., Basically I just want to understand what 'in process' means in this context., Quoting http://www.apache.org/foundation/voting.html 
""
To prevent vetos from being used capriciously, they must be accompanied by a technical justification showing why the change is bad (opens a security exposure, negatively affects performance, etc. ). A veto without a justification is invalid and has no weight.
""
bq. I am -1 until I understand something.

is not a technical justification. Please provide a technical justification for your veto., Since no technical justification is provided, I will consider this veto as void., What is the technical justification for adding the feature? That is all I want to know, but no one wants to give me an answer., {quote}
To prevent vetos from being used capriciously, they must be accompanied by a technical justification showing why the change is bad (opens a security exposure, negatively affects performance, etc. ). A veto without a justification is invalid and has no weight.
{quote}
Are you trying to argue that we should allow people to add features with no use case an no description, just because I can not prove it's bad? I can't argue the technical justification for my -1 until you give me technical justification why we need this feature., "technical justification showing why the change is bad"

Technical justification:
1) Issues had no description and no obvious use case. 
2) Other issues https://issues.apache.org/jira/browse/HIVE-5054 seem to suggest running in-process is a bad thing

http://wiki.apache.org/hadoop/CodeReviewChecklist (in bold)
1) unit tests exist for bug fixes and new features, or a rationale is given in Jira for why there is no test

I will gladly remove my -1 when it is explained to me what this feature does., https://cwiki.apache.org/Hive/howtocontribute.html

Making Changes

Before you start, send a message to the Hive developer mailing list, or file a bug report in JIRA. 

{bold}Describe your proposed changes and check that they fit in with what others are doing and have planned for the project. Be patient, it may take folks a while to understand your requirements.{bold}

Modify the source code and add some features using your favorite IDE., Fixed via HIVE-7271 after which using {{hive.exec.submit.local.task.via.child}} local task can run in memory if desired., This has been fixed in 0.14 release. Please open new jira if you see any issues.
]