[{code}
# cat beeline.sql
select * from booleantest
limit 
5;
# sudo -u hive beeline -u jdbc:hive2://localhost:10000 --showHeader=false --silent=false --outputformat=tsv2 -f beeline.sql 
0: jdbc:hive2://localhost:10000> select * from booleantest 
0: jdbc:hive2://localhost:10000> limit 
0: jdbc:hive2://localhost:10000> 5;
true	        t
false	        f
TRUE	T
FALSE	F
ZERO	0
5 rows selected (6.263 seconds)
{code}

With the patch
{code}
[root@ngangam2-rhel64-1 ~]# sudo -u hive beeline -u jdbc:hive2://localhost:10000 --showHeader=false --silent=true --outputformat=tsv2 -f beeline.sql 


true	        t
false 	f
TRUE	T
FALSE	F
ZERO	0
{code}

The blank lines at the top are coming form jline code. I have already proposed a fix for this issue in HIVE-10087.
, 

{color:red}Overall{color}: -1 at least one tests failed

Here are the results of testing the latest attachment:
https://issues.apache.org/jira/secure/attachment/12709285/HIVE-10202.patch

{color:red}ERROR:{color} -1 due to 5 failed/errored test(s), 8694 tests executed
*Failed tests:*
{noformat}
TestMinimrCliDriver-smb_mapjoin_8.q - did not produce a TEST-*.xml file
TestThriftHttpCLIService - did not produce a TEST-*.xml file
org.apache.hadoop.hive.thrift.TestHadoop20SAuthBridge.testMetastoreProxyUser
org.apache.hadoop.hive.thrift.TestHadoop20SAuthBridge.testSaslWithHiveMetaStore
org.apache.hive.jdbc.TestSSL.testSSLFetchHttp
{noformat}

Test results: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/3278/testReport
Console output: http://ec2-174-129-184-35.compute-1.amazonaws.com/jenkins/job/PreCommit-HIVE-TRUNK-Build/3278/console
Test logs: http://ec2-174-129-184-35.compute-1.amazonaws.com/logs/PreCommit-HIVE-TRUNK-Build-3278/

Messages:
{noformat}
Executing org.apache.hive.ptest.execution.PrepPhase
Executing org.apache.hive.ptest.execution.ExecutionPhase
Executing org.apache.hive.ptest.execution.ReportingPhase
Tests exited with: TestsFailedException: 5 tests failed
{noformat}

This message is automatically generated.

ATTACHMENT ID: 12709285 - PreCommit-HIVE-TRUNK-Build, Hi [~ngangam]

Thanks for the fix. This is the expected result, but it also needs to happen even when silent mode is set to false.
The Hive CLI does not print the query to the standard output when silent is true or false either.

This might work if you set silent to true when a query file is detected from Beeline.java:executeFile()., Thanks [~spena] 
I made it so intentionally so the customers relying on the current behavior will continue to have an option to do so. In a future release, we could make the default behavior to be silent=true when running in script mode and users can retain old behavior by specifying silent=false.
Thoughts?, Thanks [~ngangam]
The patch looks good. +1, Thanks [~ngangam]
I applied this patch to trunk., Should this change in behavior be documented in the wiki?, hi [~leftylev]

This just changed the output of beeline in order to match hive-cli output only when the '--silent=true' is set to true.
If we have a doc section where shows an output example of the '--silent=true', then we should do that change on it; if not, then I think it should be ok if we don't document this.

If we have a doc section for this, could you post the url so that I can take a look?, Nope, no output example in the docs.  But the Beeline Command Options section includes some usage notes and bug fixes so it could be mentioned there.  The current text is:

{quote}
Reduce the amount of informational messages displayed (true) or not (false). It also stops displaying the log messages for the query from HiveServer2 (Hive 0.14 and later). Default is false.
Usage: beeline --silent=true
{quote}

* [HiveServer2 Clients -- Beeline Command Options | https://cwiki.apache.org/confluence/display/Hive/HiveServer2+Clients#HiveServer2Clients-BeelineCommandOptions]

Thanks [~spena]., It's good to mention this on that section [~leftylev].

Maybe something like this?:
Reduce the amount of informational messages displayed (true) or not (false). It also stops displaying the log messages for the query from HiveServer2 (Hive 0.14 and later) and the HQL commands. , [~ngangam]

I've just noticed that when using the '--silent=true' without passing a file script, then beeline interactive is executed but it does not show the prompt.
Is this something desired? Do users use the --silent flag to stop displaying log messages only, but they would like to see the prompt?., [~spena] I dont think thats desirable. My take is that --silent should supress additional info but not the prompt in interactive mode. I will take another look. Perhaps a modification to the fix for HIVE-10087. We atleast have  workaround to not use --silent for now. Thanks for pointing this out., Doc done, thanks [~spena].

* [Beeline Command Options (see --silent) | https://cwiki.apache.org/confluence/pages/viewpage.action?pageId=30758725#HiveServer2Clients-BeelineCommandOptions] , [~spena] Could you please review the patch when you get  chance? Thank you, This issue has been fixed and released as part of the 1.2.0 release. If you find an issue which seems to be related to this one, please create a new jira and link this one with new jira.]