[[~lachisis] thank you for reporting this issue. I think this issue is resolved by operation-level retry of FSRMStateStore implemented on YARN-2820. The feature is merged on 2.7.0. I think 2.7.1 is coming soon, so could you use it for your development?, Thanks for your attention. 
I have downladed the 2.7.0, and review the FileSystemRMStateStore.java implementation. 
But I think it dosen't fix the issue which I submitted.

The followinf is the code of 2.7.0. If "fs.delete" return false, it still thows Exception.  I think a warning is enough here. otherwise, if someone move this application folder manually,  Exception will throw through function "deleteFile", "deleteFileWithRetries", "removeApplicationStateInternal".

@Override
  public synchronized void removeApplicationStateInternal(
      ApplicationStateData appState)
      throws Exception {
    ApplicationId appId =
        appState.getApplicationSubmissionContext().getApplicationId();
    Path nodeRemovePath = getAppDir(rmAppRoot, appId);
    LOG.info("Removing info for app: " + appId + " at: " + nodeRemovePath);
    deleteFileWithRetries(nodeRemovePath);
  }

private void deleteFileWithRetries(final Path deletePath) throws Exception {
    new FSAction<Void>() {
      @Override
      public Void run() throws Exception {
        deleteFile(deletePath);
        return null;
      }
    }.runWithRetries();
  }

private void deleteFile(Path deletePath) throws Exception {
    if(!fs.delete(deletePath, true)) {
      throw new Exception("Failed to delete " + deletePath);
    }
  }



, Thank you for clarification. On YARN-3410, whose target is 2.8.0, the problem looks to be addressed since removeApplication check the existence of the directory. Please correct me if I'm wrong.

{code}
  @Override
  public synchronized void removeApplication(ApplicationId removeAppId)
      throws Exception {
    Path nodeRemovePath = getAppDir(rmAppRoot, removeAppId);
    if (existsWithRetries(nodeRemovePath)) {
      deleteFileWithRetries(nodeRemovePath);
    }
  }
{code}, YARN-3410 try to remove the application from RMStateStore which is used as RM start up arguments i.e {{./yarn resourcemanager -remove-application-from-state-store <appId>}}. 

I am wondering about the use case that why someone move this application folder manually?? OTOH, it is better either check for path existence of handle the exception and log WARN message instead of throwing exception which crashes the RM, [~lachisis] Would you be interest in providing patch? feel free to take up!!. , @Rohith FSRMStateStore has checked path existence before removing the path. Do I missing something?

@lachisis I appreciate if you can provide a patch :-), Some methods does not check for existence of path like {{removeRMDTMasterKeyState}} {{removeApplicationStateInternal}} {{removeRMDelegationTokenState}} and {{removeRMDTMasterKeyState}} .. Am I right?, [~rohithsharma] thank you for clarification, I got the point. You're right.

[~lachisis] do you have a chance to create a patch dealing with following things?

* Creating a helper method like "checkAndRemovePathWithRetries()", which calls existsWithRetries and deleteFileWithRetries internally.
* Updating call checkAndRemovePathWithRetries() in the files.

, {quote}
checkAndRemovePathWithRetries
{quote}

checkAndDeleteFileWithRetries would be more consistent, personally., Yes, it is ok to check the existence of the directory first., Yes, it is ok to check the existence of the directory first., Yes, it is ok to check the existence of the directory first., Yes, it is ok to check the existence of the directory first., Sorry, terrible network.  How can i delete the repeated replys., I used HA of yarn for stable service. 
Months later, I find when standby resourcemanager try to transitiontoActiver, it will cost more than ten minutes to load applications. So I backup the rmstore in hdfs and change the configure "yarn.resourcemanager.state-store.max-completed-applications" to limit applications number in rmstroe. And find it work well when transition.
Later my partner restore backuped rmstore, and submitted a new application, then find resoucemanager cashed.

I know restoring backuped rmstore when resourcemanager running is not suitable. But this also means the processing logic of FileSystemRMStateStore is weak a liitle. So I suggest a little change here.
 

, Thanks for the chance to provide the patch.
I will submit the patch later., {quote} when standby resourcemanager try to transitiontoActive, it will cost more than ten minutes to load applications{quote}
did you dig into this one, like why it's took 10mins..? Thanks, hi @lachisis
bq.when standby resourcemanager try to transitiontoActive, it will cost more than ten minutes to load applications
Is this a secure cluster ? , Yes it is. But need to configure "yarn.resourcemanager.state-store.max-completed-applications"  to limit applications number in rmstore. 
Before modify the configure, it will cost ten minutes to switch to active when four thousand apps in rmstore. that situation is not comfortable., One possible cause is discussed in YARN-868
Can you try the solution given in this issue., check file exist before delete.]