[I was wondering what people feel around exposing some of the internals to allow debugging tools and other AMs to get insight into the NM. I understand that there can be reluctance to take a code dependencies, but by using protobuf the dependency should be weak. There are other internals I would like to expose over time like, Working Directory, etc. 

[~wangda] [~jianhe] , any thoughts? Do you have any recommendation what would be a " kosher" way of doing this?
, Technically adding LOCALIZING and LOCALIZED is going to break some clients.  They currently only expect NEW, RUNNING, and COMPLETE.  As soon as we start returning LOCALIZING/LOCALIZED instead of RUNNING that can break clients who are not expecting the new value.

To be completely backwards compatible the request for container state needs to include client version information so we know which enumerations the client expects.  If it is an older client then the NM can map the new states to the older enums.  For example, if a client asks for container state and doesn't include any client version info then we know we need to map LOCALIZED/LOCALIZING to RUNNING and EXIT_WITH_FAILURES to COMPLETE., [~jlowe] : So the thought is to add a version number to the request, call the existing one v1 and make it the default in protobuf, and if clients ask for v2, then pass the extra params.

Another way of doing it is to add this as "detailed state". So the old states remain as is, but if anyone is interested in the details it can query the state more. This takes advantage of protobufs instead of needing to add a new version field.

Any other thoughts?, The approach I proposed also leverages protobufs, passing a new version field in the client request instead of a new detailed info field in the server response.  At a high level they're the same concept -- pass new information in a field that old code will ignore.

I personally think it's cleaner for users to extend the existing enum transparently to the user's code (i.e.: the client version shenanigans will be hidden by the yarn client layer), but it does complicate the server code since it has to translate the container state to the appropriate list of enums.  I don't feel super strongly about it either way.  If we create a separate detailed field, note we'll have the same dilemma if we later add a new container state.  Would we then have a "super detailed" state?  ;-)
, Yep, I kinda prefer working on the existing class.  Since the container state is also used by RM for its own logic e.g RMNodeImpl#handleContainerStatus, similar kind of mapping needs to be done there also. 

On a related note, while working on YARN-1503, I also thought to expose the state of whether localization failed or succeeded.  But there I need a more sophisticated localization status per resource, though we probably also need a limit to limit the number resources object returned, otherwise, it could make the getContainerStatus heavy. 
, ok, so I'm hearing the consensus to be add a version number, and hide the logic in the clients. Default values arae set via protobuf and clients are unaware of the change. 

]