[This exception appears two days ago in a yarn platform.
there are about 7000+ history jobs in rmstore. Then one time, Activate ReourceManager find session expiry and transitionToStandby. 
meanwhile, the standby ReourceManager  start to transitionToActive, but Throw exception as attached above., I have found ZOOKEEPER-706, this means if zookeeper server receive a request which the body size is larger than 1M, the server will throw exception "Broken pipe" to reject the request.
this feature is used to limit the body size of Znode.

By scanning the zookeeper snapshot, I do not find a znode created by ZKRMStateStore which have large data size. 
Then analyzing code,  I find large numbers of Watcher are set when call function of "loadRMAppState" and "loadApplicationAttemptState". 

, It is better if zookeeper fix the ZOOKEEPER-706. , But I think most of these Watchers in ZKRMStateStore  seems not necessary., Hi [~lachisis], thanks for reporting this issue.
Most likely, Broken pipe is due to Len error at ZooKeeper server.
To confirm this, Could you check the ZooKeeper server logs to see whether you can find the following log:
{code}
WARN org.apache.zookeeper.server.NIOServerCnxn: Exception causing close of session 0x???????? due to java.io.IOException: Len error ???????
{code}

You can work around the Len error issue by increasing jute.maxbuffer size at ZooKeeper server or you can try YARN-3469.
 , Yes, I have found "Len error" in zookeeper server as Following:
2015-06-05 06:06:52,976 [myid:2] - INFO [NIOServerCxn.Factory:0.0.0.0/0.0.0.0:2181:ZookeeperServer@897] - auth success /134.41.33.88:49189
2015-06-05 06:06:53,007 [myid:2] - WARN [NIOServerCxn.Factory:0.0.0.0/0.0.0.0:2181:NIOServerCnxn@354] - Exception causing close of session 0x34db2f72ac50c86 due to java.io.IoException: Len error 1113979
2015-06-05 06:06:53,008 [myid:2] - WARN [NIOServerCxn.Factory:0.0.0.0/0.0.0.0:2181:NIOServerCnxn@1001] - Close socket connection for client /134/41/33.88:49189 which bad sessionid 0x34db2f72ac50c86 , But I think it is not a good way to change jute.maxbuffer size. 
Because there is no larger znode in ZKRMStateStore.  this Exception is caused by larger numbers of Watcher.
And I think these Watchers  seems not necessary, On, I checked the YARN-3469. It seems resolve the problem. 
A moment..., Emm, Could anyone tell me how to close the issus.
I find YARN-3469 have resolved the problem., hi ,i have the same problem,but my scenario is that when i failover RM2 to RM1,the zookeeper in RM1 report watcher num is large, and RM1 is health, then i reboot the zookeeper in RM1,after that ,i found RM1's web can't access and  a lot of "Broken pipe" message in RM1's log ,and "java.io.IOException: Len error"  appeared in ZK server 's log ,so i want to  know if your ZK is health when the above problem occured?]