[Here are some possible ways to fix it.

1) Fix RMAppManager's recoverApplication to ignore any unrecoverable app.
2) Fix RawLocalFileSystem used by FileSystemRMStateStore to force sync data to disk device.
3) Fix FileSystemRMStateStore to skip app with null ApplicationState#context.

Sounds like #3 is the best given the usage scenario of FileSystemRMStateStore. Also RM should expect each implementation of RMStateStore#loadState load valid ApplicationState into RMState.

Thoughts?, [~mingma], It's potentially already fixed by YARN-2010. We can try it for our scenario., YARN-2010 may not solve this. YARN-1185 might have fixed this., [~jianhe], to add more details: we use 2.4+patches, YARN-1185 is in 2.3., It is likely that the assumption we made in [YARN-1776|https://issues.apache.org/jira/browse/YARN-1776?focusedCommentId=13942201&page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel#comment-13942201] is not fully correct.

When updating a state file, we (1) write the new file to .new, (2) delete the existing one, and (3) rename the .new to the existing file name. If crash happens before (2), we use .new to recover the state file when loading the state (see FileSystemRMStateStore#checkAndResumeUpdateOperation).

According to the description here, RM can crash when (1) is in progress, and leave a corrupted .new file. It seems that we have to do additional validation to check if .new file is corrupted or not, or just simply ignore it ., Thanks, [~jira.shegalov], [~jianhe], [~zjshen].

I am able to repro the issue in trunk. a) pick an application in FileSystemRMStateStore; b) run "cat /dev/null >  application_xxxx_yyyy" size; c) restart RM.

The corrupted .new file might be another issue. There is no .new file in this specific case where the state file has been written or updated from RM point of view. However, it appears the state file hasn't been flushed from OS to disk before the machine hard shutdown., [~rohithsharma], took a quick look, I think YARN-3410 can solve this problem, do you think so? Please resolve this issue if you think so. , Thanks, [~rohithsharma] and [~leftnoteasy]. Yes, YARN-3410 will be useful. So admins still need to look through RM logs to identify those apps. Will it be useful to provide a new RM startup option to delete or skip such apps automatically?]