[Screenshot of such a filtered page.

Note that it clearly says it's showing 2 entries filtered from 601 entries, but all the search fields are blank., Could this be related to YARN-237?, A minor clarification: if the filtering was done via the top right search field, the search term is shown when you go to another page. So at least you know the filtering is being done by that search term.

On the other hand, if the filtering was done via the bottom search fields (key, value, or source chain), the search term is NOT shown when you go to another page (but the filtering is still done)., Ping? I'd like to find out more about this. Is this an "expected" behavior?

As in the previous comment, this issue boils down to filtering by search terms when a search had been done previously. However, in case of search by key, value, or source chain, the search term is not displayed in the UI, thus making this a real strange. I'd appreciate comments on this., We have the same issue and it is very annoying for our users.  If the front page is being filtered, it should be able to be cleared from that page., Any comments on this?

I understand the rationale for saving the table state as session data, but not showing the search terms simply baffles the users. IMO, we either should not store the search terms or should display the filtering search terms if we store the search terms., It's clearly a bug, and I agree YARN-237 is likely what introduced it.  Unfortunately I'm not a jquery or HTML5 expert.

[~jianhe], could you comment on the state saving change from YARN-237 and whether it is affecting this behavior?  If we're just telling jquery to save and restore state, is this a jquery bug or something we're not doing properly on state restore?, I'll take a look., Any update on this? A lot of our users are stumbling onto this and are completely baffled.

Would it be an acceptable short term fix to at least display the search terms that are being used to filter the entries? After all, that's the behavior with the upper-right corner search box. Currently this bug is more problematic if the search was done via one of the bottom search boxes (as it hides the search term)., couldn't quickly find the cause.. seems jquery dataTable issue, appreciate if anyone has a quick answer here, The problem is the jquery dataTable search box resets the text after refreshing the page., There is another sequence of events that reproduces this problem.

- go to the scheduler page
- click on any queue to narrow the list of running apps to be those in that queue
- now go to the main RM UI page: now you'll see it's filtering (based on that queue) but there is no indication in the UI whatsoever what it's filtering on

That case seems subtler although it is some form of filtering. I don't know if that is a search box reset problem., [~sjlee0], do you have any update about this issue?, Are you asking if this problem still exists in the latest versions? I haven't tested later versions (2.6.x or 2.7.x) so I can't say for sure. I'll try it out soon and let you know. But as far as I understand, there has been no attempt to fix it?, Same problems still exist in trunk, recently our customers too faced the same issue as mentioned as per [~sjlee0] steps., Uploaded a patch to fix the filter problem.
Since the app table is actually shared on app page and scheduler page, the main idea is to not preserve the filter state of the data table. , \\
\\
| (x) *{color:red}-1 overall{color}* |
\\
\\
|| Vote || Subsystem || Runtime || Comment ||
| {color:blue}0{color} | pre-patch |  14m 41s | Pre-patch trunk compilation is healthy. |
| {color:green}+1{color} | @author |   0m  0s | The patch does not contain any @author tags. |
| {color:red}-1{color} | tests included |   0m  0s | The patch doesn't appear to include any new or modified tests.  Please justify why no new tests are needed for this patch. Also please list what manual steps were performed to verify this patch. |
| {color:green}+1{color} | javac |   7m 32s | There were no new javac warning messages. |
| {color:green}+1{color} | javadoc |   9m 36s | There were no new javadoc warning messages. |
| {color:green}+1{color} | release audit |   0m 23s | The applied patch does not increase the total number of release audit warnings. |
| {color:red}-1{color} | checkstyle |   0m 52s | The applied patch generated  1 new checkstyle issues (total was 18, now 18). |
| {color:green}+1{color} | whitespace |   0m  0s | The patch has no lines that end in whitespace. |
| {color:green}+1{color} | install |   1m 32s | mvn install still works. |
| {color:green}+1{color} | eclipse:eclipse |   0m 33s | The patch built with eclipse:eclipse. |
| {color:green}+1{color} | findbugs |   1m 23s | The patch does not introduce any new Findbugs (version 3.0.0) warnings. |
| {color:green}+1{color} | yarn tests |   1m 58s | Tests passed in hadoop-yarn-common. |
| | |  38m 33s | |
\\
\\
|| Subsystem || Report/Notes ||
| Patch URL | http://issues.apache.org/jira/secure/attachment/12734957/YARN-2238.patch |
| Optional Tests | javadoc javac unit findbugs checkstyle |
| git revision | trunk / 446d515 |
| checkstyle |  https://builds.apache.org/job/PreCommit-YARN-Build/8063/artifact/patchprocess/diffcheckstylehadoop-yarn-common.txt |
| hadoop-yarn-common test log | https://builds.apache.org/job/PreCommit-YARN-Build/8063/artifact/patchprocess/testrun_hadoop-yarn-common.txt |
| Test Results | https://builds.apache.org/job/PreCommit-YARN-Build/8063/testReport/ |
| Java | 1.7.0_55 |
| uname | Linux asf909.gq1.ygridcore.net 3.13.0-36-lowlatency #63-Ubuntu SMP PREEMPT Wed Sep 3 21:56:12 UTC 2014 x86_64 x86_64 x86_64 GNU/Linux |
| Console output | https://builds.apache.org/job/PreCommit-YARN-Build/8063/console |


This message was automatically generated., Test locally, the patch works fine.

+1 LGTM. Will commit later if no objection.

[~Naganarasimha] [~sjlee0] Could you take a look at this patch, too ?, I do not have much idea on JQuery, but I did blackbox testing in 1 node cluster applying the patch. 
Some observations
# Filtering on scheduler page does not carry to application page. This is JIRA scenario which is working fine.
# Once navigate to scheduler page, the click on LeafQueue bar apply the filters but does not show any apps running on that queue in the scheduler page., Attached the RM web UI page image file which depicts the problem-2 in my previous comment., Hi [~rohithsharma], i think the issue which you mentioned has been taken care in YARN-3707, from the attached image it seems like you have not updated with trunk which has YARN-3707 changes., Tested locally with YARN-3707 fix, working fine:-), +1 lgtm (non-binding), +1 lgtm (non-binding), Tested the patch with trunk, 
but would it be also good to add the filter params some where in the UI to indicate whats the current filter  ? 
, Thanks for the validation. 
bq. but would it be also good to add the filter params some where in the UI to indicate whats the current filter ?

We could do that separately if we have requirement in future.

+1, check this in., Committed into trunk/branch-2/branch-2.7. Thanks, Jian, FAILURE: Integrated in Hadoop-trunk-Commit #7899 (See [https://builds.apache.org/job/Hadoop-trunk-Commit/7899/])
YARN-2238. Filtering on UI sticks even if I move away from the page. (xgong: rev 39077dba2e877420e7470df253f6154f6ecc64ec)
* hadoop-yarn-project/CHANGES.txt
* hadoop-yarn-project/hadoop-yarn/hadoop-yarn-common/src/main/java/org/apache/hadoop/yarn/webapp/view/JQueryUI.java
, FAILURE: Integrated in Hadoop-Yarn-trunk-Java8 #208 (See [https://builds.apache.org/job/Hadoop-Yarn-trunk-Java8/208/])
YARN-2238. Filtering on UI sticks even if I move away from the page. (xgong: rev 39077dba2e877420e7470df253f6154f6ecc64ec)
* hadoop-yarn-project/CHANGES.txt
* hadoop-yarn-project/hadoop-yarn/hadoop-yarn-common/src/main/java/org/apache/hadoop/yarn/webapp/view/JQueryUI.java
, SUCCESS: Integrated in Hadoop-Yarn-trunk #939 (See [https://builds.apache.org/job/Hadoop-Yarn-trunk/939/])
YARN-2238. Filtering on UI sticks even if I move away from the page. (xgong: rev 39077dba2e877420e7470df253f6154f6ecc64ec)
* hadoop-yarn-project/hadoop-yarn/hadoop-yarn-common/src/main/java/org/apache/hadoop/yarn/webapp/view/JQueryUI.java
* hadoop-yarn-project/CHANGES.txt
, FAILURE: Integrated in Hadoop-Hdfs-trunk #2137 (See [https://builds.apache.org/job/Hadoop-Hdfs-trunk/2137/])
YARN-2238. Filtering on UI sticks even if I move away from the page. (xgong: rev 39077dba2e877420e7470df253f6154f6ecc64ec)
* hadoop-yarn-project/CHANGES.txt
* hadoop-yarn-project/hadoop-yarn/hadoop-yarn-common/src/main/java/org/apache/hadoop/yarn/webapp/view/JQueryUI.java
, FAILURE: Integrated in Hadoop-Hdfs-trunk-Java8 #197 (See [https://builds.apache.org/job/Hadoop-Hdfs-trunk-Java8/197/])
YARN-2238. Filtering on UI sticks even if I move away from the page. (xgong: rev 39077dba2e877420e7470df253f6154f6ecc64ec)
* hadoop-yarn-project/CHANGES.txt
* hadoop-yarn-project/hadoop-yarn/hadoop-yarn-common/src/main/java/org/apache/hadoop/yarn/webapp/view/JQueryUI.java
, SUCCESS: Integrated in Hadoop-Mapreduce-trunk-Java8 #207 (See [https://builds.apache.org/job/Hadoop-Mapreduce-trunk-Java8/207/])
YARN-2238. Filtering on UI sticks even if I move away from the page. (xgong: rev 39077dba2e877420e7470df253f6154f6ecc64ec)
* hadoop-yarn-project/hadoop-yarn/hadoop-yarn-common/src/main/java/org/apache/hadoop/yarn/webapp/view/JQueryUI.java
* hadoop-yarn-project/CHANGES.txt
, SUCCESS: Integrated in Hadoop-Mapreduce-trunk #2155 (See [https://builds.apache.org/job/Hadoop-Mapreduce-trunk/2155/])
YARN-2238. Filtering on UI sticks even if I move away from the page. (xgong: rev 39077dba2e877420e7470df253f6154f6ecc64ec)
* hadoop-yarn-project/CHANGES.txt
* hadoop-yarn-project/hadoop-yarn/hadoop-yarn-common/src/main/java/org/apache/hadoop/yarn/webapp/view/JQueryUI.java
, Sorry for the belated comment. The changes look good to me. Thanks for working on this [~jianhe]!]