[David, can you give us more information? RM, AM and NM logs will help a lot., Hi Vinod,

These are the RM, AM and NM logs.  The kill happens at 11:32:14 on 2013/07/30.

Thanks for looking into this.

David, $ uname -a
Linux david-ubuntu 3.8.0-27-generic #40-Ubuntu SMP Tue Jul 9 00:17:05 UTC 2013 x86_64 x86_64 x86_64 GNU/Linux

$ java -version
java version "1.6.0_45"
Java(TM) SE Runtime Environment (build 1.6.0_45-b06)
Java HotSpot(TM) 64-Bit Server VM (build 20.45-b01, mixed mode)

$ hadoop version
13/07/30 11:36:15 DEBUG util.VersionInfo: version: 2.0.4-alpha
Hadoop 2.0.4-alpha
Subversion https://svn.apache.org/repos/asf/hadoop/common -r 1467471
Compiled by hortonmu on 2013-04-12T21:35Z
From source with checksum c8f4bd45ac25c31b815f311b32ef17
This command was run using /home/david/hadoop-2.0.4-alpha/share/hadoop/common/hadoop-common-2.0.4-alpha.jar

$ cat /etc/lsb-release 
DISTRIB_ID=Ubuntu
DISTRIB_RELEASE=13.04
DISTRIB_CODENAME=raring
DISTRIB_DESCRIPTION="Ubuntu 13.04"

, This bug is serious and it has been 5 months since it was filed. 
If anybody needs more information, I'm happy to provide it., @davidyan, sorry missed your logs. The logs show the following for the AM Container
{code}
13/07/30 11:32:14 DEBUG launcher.ContainerLaunch: Sending signal to pid 30435 as user david for container container_1375209060900_0002_01_000001
13/07/30 11:32:14 DEBUG launcher.ContainerLaunch: Sent signal to pid 30435 as user david for container container_1375209060900_0002_01_000001, result=failed
{code}
It seems like NM sent a SIGTERM, but I don't see the following SIGKILL getting sent. Is your custom AM somehow trapping SIGTERM? What is yarn.nodemanager.sleep-delay-before-sigkill.ms set to on your cluster?, Vinod, Thanks again for looking into this.
My custom AM is not trapping any system signal, and I don't have yarn.nodemanager.sleep-delay-before-sigkill.ms set.
The thing is, the exact same code works with Ubuntu 12.04, but not 12.10 or 13.04., The issue is with the kill command in later Ubuntu versions., looking at https://launchpad.net/ubuntu/+source/procps it appears that 13.10 will still deploy procps-3.3.3 and the /bin/kill  parameter parsing bug is not fixed until 3.3.4.  , I see.  Will there be workaround fix in YARN to get around this problem?  I would imagine more and more users will try to run YARN on ubuntu 12.10, 13.04 and 13.10., The problem is reproducible in mvn test -Dtest=org.apache.hadoop.yarn.server.nodemanager.TestNodeManagerShutdown

I have confirmed that kill version 3.3.8 does not have this problem by installing it ahead of /bin/kill and running the above test(no code change required).  I had a half baked patch that I will dig up, clean up and post. The patch precedes the -<PID> with a ' -- ' .  I had hoped Ubuntu would fix this sooner but that sadly does not appear to be the case.]