[I will make the following changes :
1. Create new logSuccess and logFailure methods having an additional parameter indicating log level. This can be an enum in RMAuditLogger and NMAuditLogger.
2. The previous logSuccess method in RMAuditLogger will continue printing logs at INFO level. The new method can be used to print logs at appropriate levels.
3. Change the container logs to DEBUG.
, Adding of log levels in RM and NM is addressed by this issue, Changed NM container logs to debug level so that they don't appear in audit logs by default., Please review the patch, {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12655734/YARN-2256.patch
  against trunk revision .

    {color:red}-1 patch{color}.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-YARN-Build/4304//console

This message is automatically generated., Submitted incorrect patch file by mistake, {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12655753/YARN-2256.patch
  against trunk revision .

    {color:green}+1 @author{color}.  The patch does not contain any @author tags.

    {color:red}-1 tests included{color}.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    {color:green}+1 javac{color}.  The applied patch does not increase the total number of javac compiler warnings.

    {color:green}+1 javadoc{color}.  There were no new javadoc warning messages.

    {color:green}+1 eclipse:eclipse{color}.  The patch built with eclipse:eclipse.

    {color:green}+1 findbugs{color}.  The patch does not introduce any new Findbugs (version 2.0.3) warnings.

    {color:green}+1 release audit{color}.  The applied patch does not increase the total number of release audit warnings.

    {color:green}+1 core tests{color}.  The patch passed unit tests in hadoop-yarn-project/hadoop-yarn/hadoop-yarn-server/hadoop-yarn-server-nodemanager.

    {color:green}+1 contrib tests{color}.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-YARN-Build/4305//testReport/
Console output: https://builds.apache.org/job/PreCommit-YARN-Build/4305//console

This message is automatically generated., Only changed log level from INFO to DEBUG. No tests need to be included.
Tested the flows manually where the audit log changed appears., Someone correct me if I'm wrong, but I'm fairly certain that the intent of this information is to be the equivalent of the HDFS audit log.  In other words, setting these to debug completely defeats the purpose.  Instead, I suspect the real culprit is that the log4j settings are wrong for the node manager process., bq. Someone correct me if I'm wrong, but I'm fairly certain that the intent of this information is to be the equivalent of the HDFS audit log. In other words, setting these to debug completely defeats the purpose. Instead, I suspect the real culprit is that the log4j settings are wrong for the node manager process.

[~aw], the issue raised was basically for both NM and RM. I have updated the description to reflect that. The issue here is that some of the container related operations' audit logs in both NM and RM are too frequent and too many. This may impact performance as well.

Now, there are 2 solutions possible, either remove these logs or change the log level, so that they do not occur in live environment and can be opened only when required. 
As I wasnt sure if these audit logs have to be removed or not, I changed the log level for some of these logs in RM and all of them in NM. To ensure this, I supported printing of audit logs at different levels, as is done in HBase (as per my info). This is handled as part of YARN-2287

Now for NM, you are correct, Log level can be changed in log4j properties to suppress these logs if required. But for RM, as not all logs have to be suppressed, this cant be done. So to be consistent, I added log levels for both NM and RM. 

If its agreeable to remove these audit logs, that can be a possible solution as well. Pls suggest. , So with YARN-2287, do we still need to this jira? The scope seems to be duplicate., \\
\\
| (x) *{color:red}-1 overall{color}* |
\\
\\
|| Vote || Subsystem || Runtime || Comment ||
| {color:blue}0{color} | pre-patch |  15m  0s | Pre-patch trunk compilation is healthy. |
| {color:green}+1{color} | @author |   0m  0s | The patch does not contain any @author tags. |
| {color:red}-1{color} | tests included |   0m  0s | The patch doesn't appear to include any new or modified tests.  Please justify why no new tests are needed for this patch. Also please list what manual steps were performed to verify this patch. |
| {color:green}+1{color} | javac |   7m 53s | There were no new javac warning messages. |
| {color:green}+1{color} | javadoc |   9m 53s | There were no new javadoc warning messages. |
| {color:green}+1{color} | release audit |   0m 23s | The applied patch does not increase the total number of release audit warnings. |
| {color:green}+1{color} | checkstyle |   0m 37s | There were no new checkstyle issues. |
| {color:green}+1{color} | whitespace |   0m  0s | The patch has no lines that end in whitespace. |
| {color:green}+1{color} | install |   1m 34s | mvn install still works. |
| {color:green}+1{color} | eclipse:eclipse |   0m 33s | The patch built with eclipse:eclipse. |
| {color:green}+1{color} | findbugs |   1m  4s | The patch does not introduce any new Findbugs (version 2.0.3) warnings. |
| {color:red}-1{color} | yarn tests |   5m 50s | Tests failed in hadoop-yarn-server-nodemanager. |
| | |  42m 51s | |
\\
\\
|| Reason || Tests ||
| Failed unit tests | hadoop.yarn.server.nodemanager.security.TestNMTokenSecretManagerInNM |
\\
\\
|| Subsystem || Report/Notes ||
| Patch URL | http://issues.apache.org/jira/secure/attachment/12655753/YARN-2256.patch |
| Optional Tests | javadoc javac unit findbugs checkstyle |
| git revision | trunk / d3d019c |
| hadoop-yarn-server-nodemanager test log | https://builds.apache.org/job/PreCommit-YARN-Build/7581/artifact/patchprocess/testrun_hadoop-yarn-server-nodemanager.txt |
| Test Results | https://builds.apache.org/job/PreCommit-YARN-Build/7581/testReport/ |
| Java | 1.7.0_55 |
| uname | Linux asf903.gq1.ygridcore.net 3.13.0-36-lowlatency #63-Ubuntu SMP PREEMPT Wed Sep 3 21:56:12 UTC 2014 x86_64 x86_64 x86_64 GNU/Linux |
| Console output | https://builds.apache.org/job/PreCommit-YARN-Build/7581/console |


This message was automatically generated., [~zjshen], just to brief you on the issue; in our setup we were getting too many audit logs related to container events. We also found some other unnecessary logs(not required for debugging) appearing frequently. Had raised another JIRA for this. Anyways, so we internally we took up the task of cleaning up these logs. This also made a slight improvement in the throughput of running process(2.4.0)

To resolve the problem, one option was to remove these logs completely. But, we decided to support different log levels for audit logs so that if some customer requires these logs, we can enable them by merely changing log4j properties.
The scope of these 2 JIRAs' is indeed inter related. But I segregated them, because I wasnt sure if community would accept support for different log levels. We can decide if we need either one of these., I kindly agree with Allen. If we want logSuccess of NM audit logs, we're considering them as equivalently important as other component's audit logs. It may not be a good idea if logSuccess in other place shows up at INFO level, but doesn't in NM.

I checked the usage of logSuccess in NM. I think it's necessary to logSuccess for starting/stopping containers. Another place where logSuccess is used is the lifecycle of container (added in YARN-2675). Not sure if that is important too, as RM app/attempt doesn't log this. /cc [~zxu].

So what's the major NM audit logs do you see in your environment? Shall we try to avoid unnecessary logSuccess instead of changing the log level?]