[attaching sample output files. , [~pramachandran], how did you update the entity? Do you keep *primaryFilters* field set to the same filters when the entity is created? I understand it may be counter intuitive, but to post again to the existing entity and make all the records indexed by *primaryFilters* be updated to, you need to make sure *primaryFilters* field is properly set., thanks for the clarification.[~zjshen] could be the reason, will check and update. 

so to clarify 
* if I have 2 primaryFilters while creating the entity,  any update to entity has to use the TimelineEntity.addPrimaryFilter for both primaryFilters?
* can a new primaryfilter be added in an update. (2 primaryfilters at entity creation time, add a new filter in update to make 3 filters, every subsequent update sets all 3 filters)
* can the primaryFilter value be changed in an update?
 
, bq. if I have 2 primaryFilters while creating the entity, any update to entity has to use the TimelineEntity.addPrimaryFilter for both primaryFilters?

Yes

bq. can a new primaryfilter be added in an update

You can, but when you filter with 3rd primaryfilter, you will miss the information that is posted before. It's a limitation of primaryfilter. The recommended way to use primaryfilter is to come up with all filters you may want to use.

bq. can the primaryFilter value be changed in an update?

It doesn't update, but append. Say you have primaryFilter key1:value1. Then you update key1:value2. Finally you will get key1:[value1, value2]., bq. Do you keep primaryFilters field set to the same filters when the entity is created? I understand it may be counter intuitive, but to post again to the existing entity and make all the records indexed by primaryFilters be updated to, you need to make sure primaryFilters field is properly set.

bq. It doesn't update, but append. Say you have primaryFilter key1:value1. Then you update key1:value2. Finally you will get key1:[value1, value2].

Where is all of the above documented?, Unfortunately, we're still lacking the documentation., [~zjshen] looks like that was the issue. can close this jira now. Thanks, Thanks for your confirmation, [~pramachandran]! Close the Jira.]