[testAMRestartNotLostContainerCompleteMsg times out intermittently in branch-2.8, but also intermittently increases the runtime of the test in branch-2 and trunk by ~10 seconds. These phenomena can be reproduced reliably by adding a {{Thread.sleep(10)}} to the code as shown below. A sleep as low as 1ms seems to trigger the race condition, though it isn't 100% reliable for failure at a sleep value that low. 

{noformat}
771    // container complete
772    nm1.nodeHeartbeat(
773        am1.getApplicationAttemptId(), 2, ContainerState.COMPLETE);
774    Thread.sleep(10);
775    rm1.waitForState(nm1, containerId2, RMContainerState.COMPLETED);
{noformat}, Looks like there are 2 bugs here. 

1) TestAMRestart uses {{waitForState()}} to wait for the completed container. However, this checks for the liveContainers list. Once the container is completed, it will quickly be taken out of this list. I think we can instead use {{waitForContainerToComplete()}} to check for the last set of finished containers. Something like this:

{noformat}
-    rm1.waitForState(nm1, containerId2, RMContainerState.RUNNING);
+    NMContainerStatus completedContainer =
+        TestRMRestart.createNMContainerStatus(am1.getApplicationAttemptId(), 2,
+        ContainerState.COMPLETE);
+    rm1.waitForContainerToComplete(app1.getCurrentAppAttempt(), completedContainer);
{noformat}

2) YARN-4807 changed {{waitForState()}} in MockRM.java so that it quietly returns false on failure instead of throwing an exception. In 2.8 and below, the code would call an {{assertNotNull()}} on the container to make sure that it wasn't null and throw an exception if it was. Since 2.9+ quietly returns false instead of throwing an exception, the test waits for the timeout and then continues with the test once {{waitForState()}} returns (even though it returned false). We could fix the test to check for a false return value, but there are most likely other tests that also depend on {{waitForState()}} throwing an exception on failure instead of checking the return value. So I would think that it'd be better to put the {{assertNotNull()}} back in. 

[~kasha], [~yufeigu] (reporter/assignee from YARN-4807), what do you think about adding the {{assertNotNull()}} back into {{waitForState()}}, Revisited this and I cannot reproduce the failure. Closing as cannot reproduce]