[With the attached patch, I have verified successful execution of MapReduce jobs in a single-node YARN cluster on a Windows VM.  I also have verified the ability to kill a running job and have it propagate down to stopping the child processes at the OS level., Overral looks good. Nice work on the shell script builder.

Didnt quite get this removal?
{code}
+++ hadoop-mapreduce-project/hadoop-mapreduce-client/hadoop-mapreduce-client-app/src/main/java/org/apache/hadoop/mapred/MapReduceChildJVM.java
...
-    vargs.add("exec");
{code}

ContainerExecutor.java
Should this not true? Jobobject in winutils task are doing what setsid does for process groups. setsid is a bad name because it indicates the implementation rather than the concept of process groups. In branch-1 its used to determine whether tasks should be killed using group methods or not etc. So setting it to false might disable other functionality that is based on process groups. MAPREDUCE-4325 tracks renaming setsid but it did not make sense to do it on branch-1. On trunk we should rename it. Perhaps move MAPREDUCE-4325 to YARN and do it.
Alternatively, if you think setsid does not have the group concept in trunk then we should use setsid only under Linux (ie regardless of Windows) and also rename it to setSidLinux or something.
{code}
   private static boolean isSetsidSupported() {
+    if (Shell.WINDOWS) {
+      return false;
+    }
{code}

DefaultContainerExecutor.java
If possible, it would be preferable to minimize if(Shell.WINDOWS) in the code by moving it inside Shell.java so that its all in one place.
{code}
+    LocalWrapperScriptBuilder sb = Shell.WINDOWS ?
+      new WindowsLocalWrapperScriptBuilder(containerIdStr, containerWorkDir) :
+      new UnixLocalWrapperScriptBuilder(containerWorkDir);
{code}
{code}
ContainerLaunch.java
+  public static final String CONTAINER_SCRIPT = Shell.WINDOWS ?
+    "launch_container.cmd" : "launch_container.sh";
{code}

Good place to create/use a Shell.getKillCommand(). I think branch-1-win already has it.
{code}
+      } else {
+        ShellCommandExecutor shexec = new ShellCommandExecutor(new String[] {
+          Shell.WINUTILS, "task", "kill", pid });
+        shexec.execute();
+      }
+    } else {
+      ShellCommandExecutor shexec = new ShellCommandExecutor(new String[] { "kill",
+        "-" + signal.getValue(), pid });
+      shexec.execute();
+    }
{code}

ProcessIdFileReader.java
Instead of removing the code we could scope it for linux. Also for windows would be a helpful sanity check to use ConverterUtils to check that the string is a valid container id.
{code}
-            try {
-              Long pid = Long.valueOf(temp);
-              if (pid > 0) {
-                processId = temp;
-                break;
-              }
-            } catch (Exception e) {
-              // do nothing
-            }
+            processId = temp;
+            break;
{code}

It would be great if we can check that when a container is spawned by the NM then the first process created in the tree is WINUTILS.exe
, Is there an equivalent of TestKillSubProcesses from branch-1? If yes, would be good to see it passing or modify it to work on Windows. It might be that it runs only when setsid is true., Thanks for the review, Bikas.  I have attached an updated patch to address some of your feedback.

{quote}
Didnt quite get this removal?
{quote}

The "exec" to launch a command varies per platform.  It needs to be "@call" on Windows.  I chose to move this logic into ContainerLaunch.ShellScriptBuilder#command and its subclasses, so that MapReduce and any other YARN applications don't need to repeat if (WINDOWS) checks.  However, it occurs to me that this could be considered a backwards-incompatible change if existing contract is that the application must submit the "exec" in its command.  I don't know how significant the impact is, so let me know what you think.

Yes, I agree with your assessment that "setsid" in the code is really checking for "process groups supported".  I've moved MAPREDUCE-4325 to YARN-240 for the rename work.  Meanwhile, I have updated this patch to return true for isSetsidSupported when running on Windows.  (We are saying that WinUtils must be present for Hadoop to work on Windows, so it must be true that process groups are supported.)

I have been trying to minimize the if (WINDOWS) checks.  For the two examples you gave, I didn't see any other logical place to move the checks.  It's so specific to DefaultContainerExecutor that it didn't seem to fit inside Shell.  Let me know if you have any suggestions on this.

I've updated the patch to add a kill command helper method in Shell, but it's slightly different from the branch-1-win version.  YARN uses "kill -0" for checking validity of a pid, so I needed to add a special case for signal 0 to use "winutils task isAlive" instead of "winutils task kill".  In order for error handling to work correctly, I needed to change winutils to return a non-zero exit code from "winutils task isAlive".  I refactored isSetsidAvailable into Shell too.

I'm curious if we actually need this validation logic in ProcessIdFileReader or if we can simplify by discarding it.  From what I can tell, the pids are always generated by YARN code, so they are always going to be the expected numeric pid on Unix or the expected container ID on Windows.  It would seem that we can just trust them.  What is the goal of this validation logic?  Is it security protection against an external process feeding in bogus pid values?  I'd expect that to be protected by proper permissions and ownership settings on the node manager's working directories, so the extra logic wouldn't be necessary.  Some other requirement?

It looks like the closest equivalent of TestKillSubProcesses is some combination of the tests in TestContainerLaunch, TestContainerManager, and TestContainersMonitor.  Right now, nearly all YARN tests fail early on Windows due to validation failures on the test data path containing a drive specification.  I'd prefer to address those test infrastructure failures in a separate jira.
, Its common to suffix patches as .1.patch, .2.patch etc so that its easy to download and diff etc.

Changes look good. 

For the kill -0 change I think I would do it a little differently. I would create containerExists() or containerIsAlive() and use that for the alive check and create a killContainer(TYPE kill) for terminating containers. That does not leak implementation details of Unix like Signal handling into the Hadoop code. Might remove the need to change the native code also. What do you think?

About ProcessIdFileReader. I am not sure about the reasoning for that code since it predates me. I do see that checking formats helps us differentiate among OS implementations though I am not sure if that was the original reasoning :P e.g. if we are on Linux we should check that we are getting expected numeric pids. If we are on windows we should check that we are getting containerIds. This helps fail fast. I am not sure if the upper level code would fail if we asked it to use wrong process identifiers.

, Thanks again, Bikas.  I've attached version 3 of the patch.  I now have separate methods for containerExists and killContainer.  To prevent the need to change the native code, I've created a subclass of Shell called ProcessIsAlive to handle (and hide) the details of "winutils task isAlive" vs. "kill -0" and their different error handling strategies (stdout message vs. non-zero exit code).  Regarding ProcessIdFileReader, I've restored the existing pid validation logic and also added Windows-specific logic for validating that the pid is a container ID.  I've updated TestProcessIdFileReader too and verified that it passes on Mac and Windows., Sorry for not being clear. Its totally fine to change native code as long as its backwards compatible wherever its used currently.
On the other hand creating ProcessIsAlive as a subclass of Shell does not seem to match the pattern of all the remaining simple operations like kill etc. I should word my comments better.

Rest of the changes look good.
, No worries at all.  Sometimes it's easy enough to just post multiple patches to see which ideas stick.  Code is always less ambiguous than conversation.  :-)

ProcessIsAlive is similar in spirit to other Shell subclasses like DF and DU.  It's more code, but it seems like this is the established pattern when you need a shell command with custom error-handling.  (i.e. The command does not communicate error condition by a non-zero exit code.)

Just to confirm so we can finish off this patch: we have 3 alternatives for implementing the "winutils task isAlive" call.  1) put the call directly in the YARN code, 2) put the call in Shell and change task.c to return non-zero exit code, 3) ProcessIsAlive subclass of Shell and leave task.c alone.  Which do you prefer?  My preference is #1 as long as we're not expecting any other parts of the codebase to need "winutils task isAlive".

Thanks again,
--Chris
, 3) seems overdone
Between 1) and 2) I would pick 2 since it makes lives of future developers easier :) Also, it looks like the lack of error exit code for isAlive is a good thing to fix since the current behavior is inconsistent. The same change would need to be made on branch-1-win too, if you choose to this approach.
Your call.
, I'll work on a new patch to switch back to idea 2, and I'll port it to branch-1-win too.  Thanks!, I'm attaching version 4 of the patch.  This discards ProcessIsAlive and changes task.c to return a non-zero exit code if the process is not alive.  Let me know how this looks., Looks good! Thanks!
Branch-1-win change would be good. I suspect the code there relies on parsing the output instead of an error exit code. I dont remember why I did it that way. If it was an oversight then it would be good to fix. If there was a need to do it that way then we might have check that it does not get broken.

+1, I just committed this. Thanks Chris!]