[Did the kill occur shortly after the container was started?  I'm wondering if the pid file somehow appeared _after_ the attempt to kill.  What does {{ls -l --full-time}} show for the pid file, and how does that correlate to the timestamps in the NM log?  Also just to verify it's in the right place, where is the pid file located relative to the yarn local directory root?

You mentioned NM recovery is enabled.  Does this only occur on containers that were recovered on NM startup or also for containers that are started and killed within the same NM session?
, We did some more digging and found that a few containers that are currently in RUNNING state, are missing directories under {{nmPrivate}} dir. The web interface reports that the containers are running on that node and the container processes are there too, but we are missing the the entire application dir under {{nmPrivate}}.

[~jlowe] This usually happens to long running containers. The PID files are missing for containers in KILLING state, and for certain RUNNING containers. The pid file should be under {{nm-local-dir}}, for us it's: {{/tmp/hadoop-ec2-user/nm-local-dir/nmPrivate/<application_id>/<container_id>/<container_id>.pid}}., If this only happens to long-running containers and the pid files are missing for even RUNNING containers that have been up a while then I'm thinking something is coming along at some point and blowing away the pid files because they're too old.  Is there a tmp cleaner like tmpwatch or some other periodic maintenance process that could be cleaning up these "old" files?  A while back someone reported NM recovery issues because they were storing the NM leveldb state store files in /tmp and a tmp cleaner was periodically deleting some of the old leveldb files and corrupting the database.

You could also look in other areas under nmPrivate and see if some of the distributed cache directories have also been removed.  If that's the case then you should see messages like "Resource XXX is missing, localizing it again" in the NM logs as it tries to re-use a distcache entry but then discovers it's mysteriously missing from the local disk.  If whole directories have been reaped including the dist cache entries then it would strongly point to something like a periodic cleanup like tmpwatch or something similar., Yep, looks like we had tmpwatch delete all files older than 10 days. We have set the NM local-dirs to be outside of tmp. [~jlowe] thanks for your help. , Glad to hear the cause was found!  Be sure to check that the NM state store is also stored outside of /tmp, or it too can become a victim of tmpwatch.]