[*Solution*
# We can check and try creation of localdir before testdir() all dir with *0755* permission
# Should create Random localdir only if the localdir exits , So that local dir will be considered as bad.

In my opinion should use *Solution 1* makes NM auto recoverable.Thoughts?
, I think its kind of related to YARN-5765 and YARN-5287 with restricted rights on the user. Not sure which user you are trying to refer here user with which NM is run ? , [~naganarasimha_gr@apache.org]
Not related to appcache.. This jira is forconfigured nmlocaldir permission
{quote}
User with which NM is run ?
{quote}


NM started user umask is 077, cc/ [~jlowe] and [~vvasudev] . Could you please share your thoughts too?, I'm curious how the top-level local directory was deleted in the first place.  It sounds like an incorrect setup, like tmpwatch or something was coming along and blowing away NM directories.  Arbitrary removal of NM directories while it is running is going to cause container failures at a minimum.

I'm somewhat torn on this.  Part of me thinks it would be best to treat this case like a bad disk, since something _clearly_ is wrong when top-level directories go missing out of the blue.  Either admins setup something wrong on the cluster or the filesystem is having difficulty persisting data.  Both are bad.  Someone should really look into it, otherwise if we keep silently trying to fix it up after the fact then we just move the issue to debugging mysteriously failing containers.  However I can see the benefits of not forcing an admin to intervene, as it can hobble along automatically (with degraded performance due to reruns of mysteriously crashing containers).

If we do go with solution 1, we need to log an error when we detect it., Thank you [~jlowe] for looking into issue 

Sorry missed to add about bad disk scenario.The following sequence of steps could happen in actual cluster also.
# Bad disk was shown in RM UI due to hardware fault.(1 of the disk)
# Formatted and mounted again or new disk added
# After 2 min interval in RM UI node was healthy.(Admin also will think server is healthy)
# But containers will start failing randomly.

Will implement patch based on solution 1 and upload soon. Additional logging mentioning {{nmlocal}} folder is created in {{DirectoryCollection#testDirs}} will be included .
, If the disk was wiped and re-introduced then this may be more complicated than just fixing the one directory.  The NM creates quite a few directories for each disk on startup with various permissions, and we'd need to ensure that all of them get properly recreated when the top-level directory is detected as missing., [~jlowe]
{quote}
If the disk was wiped and re-introduced then this may be more complicated than just fixing the one directory. The NM creates quite a few directories for each disk on startup with various permissions, 
{quote}
Totally agree with you lot of cases need to be handled. Admin have to handle carefully.

IMO i think we could handle for the possible scenarios which can be solved (nmlocal and nmlog).If not i am open to close this issue


]