[Simple fix., {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12555519/YARN-252.patch
  against trunk revision .

    {color:green}+1 @author{color}.  The patch does not contain any @author tags.

    {color:red}-1 tests included{color}.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    {color:green}+1 javac{color}.  The applied patch does not increase the total number of javac compiler warnings.

    {color:green}+1 javadoc{color}.  The javadoc tool did not generate any warning messages.

    {color:green}+1 eclipse:eclipse{color}.  The patch built with eclipse:eclipse.

    {color:green}+1 findbugs{color}.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    {color:green}+1 release audit{color}.  The applied patch does not increase the total number of release audit warnings.

    {color:green}+1 core tests{color}.  The patch passed unit tests in hadoop-yarn-project/hadoop-yarn/hadoop-yarn-applications/hadoop-yarn-applications-unmanaged-am-launcher hadoop-yarn-project/hadoop-yarn/hadoop-yarn-server/hadoop-yarn-server-resourcemanager.

    {color:green}+1 contrib tests{color}.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-YARN-Build/199//testReport/
Console output: https://builds.apache.org/job/PreCommit-YARN-Build/199//console

This message is automatically generated., Testing is covered by the existing TestUnmanagedAMLauncher., I had initially done this for MAPREDUCE-4438 but later changed it back to an empty object since I wasnt sure if more code in the RM could end up trying to access the context without checking for it being non-null (and causing the RM to crash).
I also wasnt sure if a context object would be needed or not in order to implement YARN-255.
Is there a specific issue thats requires removal of the code from the client and addition of existence checks in the RM?

In any case, maybe we should also assert that context is null because the am is unmanaged. Otherwise we might end up ignoring future bugs in the RM when the context should not be null but happens to be so (100% of managed AM's currently)., Bikas, thanks for taking a look. I was thinking that since there is no AM container in an unmanaged situation then setting one doesn't make sense - and in fact requiring that one be set is very confusing for YARN application writers. For YARN-255 the tokens could be passed by another API call.

I've updated the patch to assert the context is null for unmanaged AMs., {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12555752/YARN-252.patch
  against trunk revision .

    {color:green}+1 @author{color}.  The patch does not contain any @author tags.

    {color:red}-1 tests included{color}.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    {color:green}+1 javac{color}.  The applied patch does not increase the total number of javac compiler warnings.

    {color:green}+1 javadoc{color}.  The javadoc tool did not generate any warning messages.

    {color:green}+1 eclipse:eclipse{color}.  The patch built with eclipse:eclipse.

    {color:green}+1 findbugs{color}.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    {color:green}+1 release audit{color}.  The applied patch does not increase the total number of release audit warnings.

    {color:green}+1 core tests{color}.  The patch passed unit tests in hadoop-yarn-project/hadoop-yarn/hadoop-yarn-applications/hadoop-yarn-applications-unmanaged-am-launcher hadoop-yarn-project/hadoop-yarn/hadoop-yarn-server/hadoop-yarn-server-resourcemanager.

    {color:green}+1 contrib tests{color}.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-YARN-Build/205//testReport/
Console output: https://builds.apache.org/job/PreCommit-YARN-Build/205//console

This message is automatically generated., I think it would be good to add the assert in the other places too. e.g. to catch a bug when context is set for the app but not in the attempt because of some new code bug.

The other thing I am not sure I understand is the ACL's bit. What are the use cases for these ACL's. If they are needed to be sent by the client to the RM then dont we need the submission context to pass the ACL's? From what I see the client passes ACL's to the RM via the app submission context, so that the RM can pass it onto the attempt during attempt registration. Now say we are going to use unamanged AM for debugging. Ideally, the AM should have the same code path for receiving ACL's in managed and unmanaged mode, right? And that currently is getting ACL's from the registerAM response. If we remove the context completely then how do we pass ACL's around in the unmanaged case? If this is correct then perhaps instead of removing context from the launcher we might want to improve it to accept ACL's and add it to the context. In general I am thinking of having 1 client allow users to launch apps, in managed or unmanaged mode. I may be missing something. So you might have to educate me here :P

bq. and in fact requiring that one be set is very confusing for YARN application writers.
I am not clear why application writers would need to do this. Application writers need to think about setting context for containers and not AM's themselves, dont they?, > I think it would be good to add the assert in the other places too. e.g. to catch a bug when context is set for the app but not in the attempt because of some new code bug.

I'm not sure where you are suggesting such a check is needed. Which class/method do you mean?

> In general I am thinking of having 1 client allow users to launch apps, in managed or unmanaged mode.

I think that is a good goal, but this change doesn't preclude that at all. E.g. if ACLs aren't needed for the AM then not setting the AM's container spec should be OK. If ACLs are needed, then either set it on ApplicationSubmissionContext#setAMContainerSpec, or perhaps move the ACl methods to top-level methods of ApplicationSubmissionContext. The latter question could be tackled in YARN-255.

> I am not clear why application writers would need to do this. Application writers need to think about setting context for containers and not AM's themselves, dont they?

I'm talking about the ApplicationSubmissionContext#setAMContainerSpec call, which folks writing YARN apps call in their client. If the AM is unmanaged then there is no AM container so they shouldn't have to call this method. Of course, the AM will typically launch containers too and they will certainly need ContainerLaunchContext objects, set via StartContainerRequest#setContainerLaunchContext. Does that make more sense?, bq. I'm not sure where you are suggesting such a check is needed. Which class/method do you mean?
I meant over here. I think in addition to the assert a code comment pointing to your above comments on ACL's would also be useful here.
{code}
+      if (app.getRMAppAttempt(applicationAttemptId).getSubmissionContext().getAMContainerSpec() == null) {
+        response.setApplicationACLs(new HashMap<ApplicationAccessType, String>());
+      } else {
+        response.setApplicationACLs(app.getRMAppAttempt(applicationAttemptId)
+            .getSubmissionContext().getAMContainerSpec().getApplicationACLs());
{code}

Regarding your comments on ACL's I agree that container spec should not be set and perhaps we should move ACL's to application submission context instead of container spec. Or in addition to container spec in case its needed in container spec for other scenarios. We can make sure this is covered in YARN-255. Would you please register your ideas in a comment on YARN-255.

bq. I'm talking about the ApplicationSubmissionContext#setAMContainerSpec call, which folks writing YARN apps call in their client.
I didnt think that someone else would need to write an unmanagedAM launcher client. So this would be the only client. Do you have any scenarios in mind where another client would be needed?
, Another patch with some comments about ACLs.

> Would you please register your ideas in a comment on YARN-255.

Done.

> I didnt think that someone else would need to write an unmanagedAM launcher client. So this would be the only client. Do you have any scenarios in mind where another client would be needed?

That's interesting. I looked at the UnmanagedAMLauncher but it didn't fit my use case since I want to run the AM in the same process as the launcher client (i.e. in the same JVM). We could extend the launcher to support that case; I opened YARN-273

It's still possible that folks will want to write their own unmanaged AM clients (e.g. in a web app context, or where class isolation needs handling differently), but those cases should be relatively rare., {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12560990/YARN-252.patch
  against trunk revision .

    {color:green}+1 @author{color}.  The patch does not contain any @author tags.

    {color:red}-1 tests included{color}.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    {color:green}+1 javac{color}.  The applied patch does not increase the total number of javac compiler warnings.

    {color:green}+1 javadoc{color}.  The javadoc tool did not generate any warning messages.

    {color:green}+1 eclipse:eclipse{color}.  The patch built with eclipse:eclipse.

    {color:green}+1 findbugs{color}.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    {color:green}+1 release audit{color}.  The applied patch does not increase the total number of release audit warnings.

    {color:green}+1 core tests{color}.  The patch passed unit tests in hadoop-yarn-project/hadoop-yarn/hadoop-yarn-applications/hadoop-yarn-applications-unmanaged-am-launcher hadoop-yarn-project/hadoop-yarn/hadoop-yarn-server/hadoop-yarn-server-resourcemanager.

    {color:green}+1 contrib tests{color}.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-YARN-Build/226//testReport/
Console output: https://builds.apache.org/job/PreCommit-YARN-Build/226//console

This message is automatically generated., Patch looks good to me.

Thats interesting. My initial implementation of the client was to launch the AM in the same JVM but then I decided against that because I thought one would want to run the AM just as it was running in the cluster - ie. in its own process/JVM. It would be great to be able to do both because that would solve other scenarios like yours. Would you mind sharing your use case that did not fit the current implementation?
, Bikas - it's a toy YARN app written in Java that runs the AM from the client. I agree we need both., Tom, instead of checking for nullity, we should use ApplicationSubmissionContext.getUnmanagedAM() and then do what you are doing in the patch.

Also, can you try writing a test for this? Perhaps in TestUnmanagedAMLauncher.]