[I do see the node in question trying to get in sync with the RM with the applications it thinks it still owns. The trigger might be related to that. Still, it's not clear why the queue was still flooded with those events even after the *second* restart that disabled the NM work-preserving restart., I am  not pretty sure whether it is same YARN-3990. Based on the affect version I am suspecting it might be a same issue. On the other hand, looking into event type, it may be new issue also.
Anyway [~sjlee0] can  you cross verify the fix of YARN-3990 is present in your cluster? , Hi,[~sjlee0], 
1,  does the num of FINISHED_CONTAINERS_PULLED_BY_AM log equal to the num of active applications?
2,  does NM received the RSYNC command from RM while restart?  could you paste the status changes of one NM?
, one race condition may cause the "Invalid event FINISHED_CONTAINERS_PULLED_BY_AM".
1,  RMNode A  finished(LOST or REBOOTED), rm removes it from rmContext.activeNodes
2,  scheduler complete the container running on node A. To AM container, RM will send FINISHED_CONTAINERS_PULLED_BY_AM event to RMNode A
3,  normally RMNode A is removed in step 1.  but when node A register at this time, new RMNode of A may process this event at NEW state.

but the main problem may not applying YARN-3990 and YARN-3896., I attached the node manager log. It's pretty much the entirety of the log from the start until after it's past the point of these events happening for this node in the RM. The only thing I removed is a section early in the log that lists all the localization service recovering files.

Unfortunately I no longer have the RM log for this episode.

We do not have YARN-3990 or YARN-3896 applied. Although we should get them in any case, I'm not sure if those are related to the issue we're seeing., without the fix of YARN-3990 and YARN-3896, our rm was flooded by node up/down events, and node is synced.  and have the same output in NM.
{quote}
2016-02-18 01:39:43,217 WARN org.apache.hadoop.yarn.server.nodemanager.NodeStatusUpdaterImpl: Node is out of sync with ResourceManager, hence resyncing.
2016-02-18 01:39:43,217 WARN org.apache.hadoop.yarn.server.nodemanager.NodeStatusUpdaterImpl: Message from ResourceManager: Too far behind rm response id:100314 nm response id:0
{quote}

things may like that:
1,  nm restarted,  ResourceTrackerService send a NodeReconnectEvent to reset response id to 0,
2,  nodeHeartBeat is processed before NodeReconnectEvent is handled(dispatcher is flooded by RMAppNodeUpateEvent),  RM send sync command to NM for mismatch of response id,
3,  rmNode comes to REBOOT status, and remove it from rmContext.activeNodes
4,  nm register, create a new rmNode, added to  rmContext.activeNodes and send NodeStartEvent
5,  scheduler  complete the container running on node,   to AM container, will send FINISHED_CONTAINERS_PULLED_BY_AM event to RMNode , but the RMNode is in NEW state, couldn't handle FINISHED_CONTAINERS_PULLED_BY_AM.]