[Hi [~zxu].  Since this is a proposal to call native code, I'd like to make sure test suites are passing on both Linux and Windows when it's ready.  The method is implemented for both Linux and Windows, so I do expect it would work fine, but I'd like to make sure.  If you don't have access to a Windows VM for testing, I'd be happy to volunteer to test on Windows for you when a patch is ready.  Thanks!, Thanks [~cnauroth], It is very nice of you to help test on windows environment., Hi [~zxu] and [~cnauroth], this sounds like a change need to happen in hadoop-common project instead of YARN. Shall we move this JIRA from YARN to HADOOP?, Hi [~djp].  This will be a YARN code change in the localizer, so YARN is the appropriate project to track it.  The code change will involve calling a native fstat method provided in hadoop-common, but that code already exists, and I don't expect it will need any changes to support this., bq. but that code already exists.
I see. Thanks [~cnauroth] for clarifying on this., Can we not get RawLocalFileSystem to automatically use native fstat if the native library is available? That way all users can simply benefit from this seamlessly., bq. Can we not get RawLocalFileSystem to automatically use native fstat if the native library is available? That way all users can simply benefit from this seamlessly.

That's an interesting idea.  Looking at this more closely, {{ResourceLocalizationService#checkLocalDir}} really can't use the existing {{NativeIO.POSIX#getFstat}} method anyway.  That one is a passthrough to {{fstat}}, which operates on an open file descriptor.  Instead, {{ResourceLocalizationService#checkLocalDir}} really wants plain {{stat}} or maybe {{lstat}}, which operates on a path string.  Forcing this code path to open the file just for the sake of passing an fd to {{fstat}} isn't ideal.

Let's try it!  I filed HADOOP-11935 as a pre-requisite to do the Hadoop Common work., thanks [~vinodkv] and [~cnauroth]! it makes sense to do the optimization at {{loadPermissionInfo}}, so all users can benefit from it.
I did some profiling and I find It can speed up 3-4x using NativeIO.POSIX. {{checkLocalDir}} takes about 15ms with shell-based implementation currently, it only takes about 4 ms using NativeIO.POSIX. I will make this issue duplicate as HADOOP-11935.]