[This sounds like a bug in the user re-creation procedure rather than YARN. If a user with user ID = 1234 creates some files then we delete and re-create the user with user ID = 5678 then not just YARN is going to have issues.  Any local files in the OS that were created with the old user ID will not be accessible via the new user ID if they are private (e.g.: mode 0700 or something like that). That's not just a YARN thing.

The user ID needs to be preserved when it is re-created or all paths belonging to the old user need to be chowned when the new user ID is created., +1 to what Jason said.  This is systems administration 101. , While I completely agree that it's sysadmin 101, I don't think that makes it a non-issue for YARN.  YARN has no concept of UID or GID exposed to the user at any level.  Either we should be clear in the docs up front that the usernames are materialized into UIDs on the NMs for localization purposes, and that there's a per user cache that hangs around between jobs, so don't freaking change the UID mappings, or we should actually be independent of UIDs., Agree this is not an issue in YARN, but we need to make sure the error message is informative. Is it failing with a "permission denied" message on yarn local dirs? Does yarn exposed local dir permission in the error message?, Thanks [~jlowe], [~aw], [~templedf] and [~cheersyang] for sharing your views,
In our case we had a seperate OM console through which user managment was done and cycle of user getting added and deleted is not deterministic and it would not be ideal to track each user what was the id given earlier. And the job's tasks were failing because of launching issues where ever any container had run earlier for this recreated user.
And as mentioned by [~surendrasingh], fix was simple as NM user has the rights to delete the folder and recreate with new ID fix was very simple if the folder was not getting created we delete and recreate the folder during Application initialization.
Though its not completely a YARN issue its easy to fix in YARN layer for this scenario. Thoughts ?, [~Naganarasimha] - if you delete the user folder, what would happen to other running applications by the same user? The fix seems to me to retain UIDs across user creation and deletion., [~vvasudev], In our scenario In OM side we were ensuring before deleteting the user any running apps are deleted, but in a general case would suggest that we can return with a error code when application initialization fails in NM for a given user and if its the reason for different ID, then we can check whether any containers are running for this user and if not then we can delete the folder recursively. Also if the user is deleted whether any further operations(like log aggregation, in Mapred case writing intermediate folders/files etc) will get successfully completed ? 
IMO atleast appropriate error message needs to be displayed (which is missing currently) and if possible to handle it gradaully if not immediately, thoughts? ]