[/cc [~ashahab], [~vinodkv] : Please chime in, I'm pretty much against the idea.  It's much easier to change DCE to add these features rather than muck with LCE, which has been stable and consistent for years.  In fact, YARN-3291 is pretty much doing exactly that.

So I'm inclined to close this as a dupe of that JIRA., Hi [~aw] ,

I agree with you that we should ensure that current LinuxContainerExecutor functionality isn’t broken - but at the same time, I believe it is important to add useful new features that bring more value to users. This has already been happening to LinuxContainerExecutor
 and related functionality - refactored resource handler/cgroups handler, support for new resources types. 

About YARN-3291 : The patch for this JIRA already moves in the direction described in this JIRA. DockerContainerExecutor is changed to be a child of LinuxContainerExecutor (along with some minor changes to LinuxContainerExecutor itself). In addition, there are changes to the native code in the linux-specific container-executor tool which has so far only been used by LinuxContainerExecutor. I don’t believe this JIRA is a dupe of YARN-3291 - the scope differs quite a bit - more sub-tasks are to be added to this JIRA for various pieces of functionality that need to be built. 

thanks,
-Sidharta , Just looked at this and YARN-3291 JIRA.

The main direction of both of these JIRAs as I understand is to reuse code from (a) the container-executor binary and (b) the java LinuxContainerExecutor code; so as to setup things correctly. This was one of my comments in the original docker integration JIRAs itself.

May be it is just the JIRA title that is throwing us off a bit. Both JIRAs are advocating similar idea though. Can we establish a clear relationship between the two? [~sidharta-s] and [~ashahab]., I agree with [~vinodkv]. Both Jiras have the same objective, and I am fine with either.
I like the proposal in this Jira, because it makes Docker a first class citizen of Hadoop. However, I'm fine with keeping it in DefaultContainerExecutor also if merging this into LCE slows the whole process down. 
Also, network and disk resource management is new in LCE, so we should not make those a blocker for Docker integration.
My main concern across all Docker issues is that are we making incremental progress. We have alpha, and we should make incremental progress towards beta.
, [~ashahab] and I have been working together on this for the past few weeks. (We demoed this recently as well). I am going to file sub tasks so that we can make progress. 

thanks,
-Sidharta, Looks like I forgot to link to the slides/demo from hadoop summit. Here it is, in case somebody is interested in taking a look : https://prezi.com/2mxvb0n_q1rt/yarn-and-the-docker-ecosystem/, Has the LinuxContainerExecutor Docker support been documented yet, or should I file a JIRA to add docs?  I didn't see anything., hi [~templedf], please go ahead and file a JIRA for adding docs. Thanks!, Why is this not being done in a branch?  , Hi folks,

Docker is now available on Windows and is fully supported by Docker INC (I'm talking about launching Windows containers via Docker).

https://www.docker.com/microsoft

Unfortunately in the current design Docker is being limited to Linux only. I think we need to revisit this and have a way to share the same code across Docker support for Windows and Linux. Another goal to keep in mind is to have DockerContainerExecutor be completely OS agnostic. As in certain cases Docker client might actually be talking to a daemon on a remote machine or a VM (which maybe Linux or Windows). Would love to hear some thoughts on how to achieve Docker support for Windows by reusing all the good work being done here.

Thanks!







, We have closed out Phase 1 of Docker container support and are now moving onto Phase 2. Phase 2 will be tracked by YARN-8472, so please file any new JIRAs under that umbrella (with the 'Docker' label). , We have completed 88 out of 105 tasks in the first milestone, and moved only 17 tasks to phase 2 for incremental improvement.
This was a great community effort.  Thank you to everyone who contributed to this JIRA.  :), +1000 :) Great effort everyone. I'm excited for what has been achieved and where this support is going., Hi, [~shanekumpf@gmail.com] 

I would like to use this feature in our production environment,  and It's so useful to us. Any Suggestions?, [~zhouyunfan] - thank you for your interest! Please see the [YARN containerization docs|https://github.com/apache/hadoop/blob/trunk/hadoop-yarn-project/hadoop-yarn/hadoop-yarn-site/src/site/markdown/DockerContainers.md] as a starting point. If you have specific questions after that, please do reach out on the hadoop-user mailing list.]