[Hi,

I am newbie to Hadoop contribution. I think this is the great chance for me to understand how to contribute to Hadoop.

Shall I go forward and create the patch for this issue?, Hi chandrashekhar, go for it.
, Done. I have renamed FSSchedulerApp class to FSSchedulerAppAttempt and its corresponding test class TestFSSchedulerApp to TestFSSchedulerAppAttempt.

Please check if patch file is correct or not.


Thanks,
Chandrashekhar, {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12623862/HADOOP-YARN-1586.patch
  against trunk revision .

    {color:red}-1 patch{color}.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-YARN-Build/2909//console

This message is automatically generated., Hello,

Looks like I was working on this simultaneously too. Please find the attached patch file and the shell script to 'svn mv' the files. I could apply the patch cleanly using dev-support/test-patch.sh . 

I have captured an issue I faced on my Mac for generating the patch when svn mv is involved on yarn-dev mailing list yesterday:  http://mail-archives.apache.org/mod_mbox/hadoop-yarn-dev/201401.mbox/%3CCACn45ToZCTpGpsV5dP-tJ1Yynop-5gybd=FuwbGoPUYVK3=VJQ@mail.gmail.com%3E

Thanks,
Abhiraj, {color:green}+1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12623878/YARN-1586.patch
  against trunk revision .

    {color:green}+1 @author{color}.  The patch does not contain any @author tags.

    {color:green}+1 tests included{color}.  The patch appears to include 3 new or modified test files.

    {color:green}+1 javac{color}.  The applied patch does not increase the total number of javac compiler warnings.

    {color:green}+1 javadoc{color}.  The javadoc tool did not generate any warning messages.

    {color:green}+1 eclipse:eclipse{color}.  The patch built with eclipse:eclipse.

    {color:green}+1 findbugs{color}.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    {color:green}+1 release audit{color}.  The applied patch does not increase the total number of release audit warnings.

    {color:green}+1 core tests{color}.  The patch passed unit tests in hadoop-yarn-project/hadoop-yarn/hadoop-yarn-server/hadoop-yarn-server-resourcemanager.

    {color:green}+1 contrib tests{color}.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-YARN-Build/2910//testReport/
Console output: https://builds.apache.org/job/PreCommit-YARN-Build/2910//console

This message is automatically generated., Hey Sandy, kindly review the patches when you can and let us know if there are any suggestions. I would be glad to help make necessary changes and get this in!

Thanks,
Abhiraj, It is now called FSAppAttempt. close this as fixed]