[If lots of container hierarchys remained, it will make the cpu busy of this node, even when no jobs are running.

------------------------------------------------------------------------------
   PerfTop:  129889 irqs/sec  kernel:76.3% [100000 cycles],  (all, 16 CPUs)
------------------------------------------------------------------------------

             samples    pcnt   kernel function
             _______   _____   _______________

           117166.00 - 59.1% : tg_shares_up
            35688.00 - 18.0% : _spin_lock_irqsave
            12045.00 -  6.1% : __set_se_shares
, 'release_agent' in cgroups ([https://www.kernel.org/doc/Documentation/cgroups/cgroups.txt|https://www.kernel.org/doc/Documentation/cgroups/cgroups.txt]) might help for this case. Maybe we could use it to remove empty dirs? SLURM has used it ([http://slurm.schedmd.com/cgroups.html|http://slurm.schedmd.com/cgroups.html]).

{quote}
If the notify_on_release flag is enabled (1) in a cgroup, then whenever the last task in the cgroup leaves (exits or attaches to some other cgroup) and the last child cgroup of that cgroup is removed, then the kernel runs the command specified by the contents of the "release_agent" file in that hierarchy's root directory, supplying the pathname (relative to the mount point of the cgroup file system) of the abandoned cgroup.  This enables automatic removal of abandoned cgroups.  The default value of notify_on_release in the root cgroup at system boot is disabled (0).  The default value of other cgroups at creation is the current value of their parents' notify_on_release settings. The default value of a cgroup hierarchy's release_agent path is empty.
{quote}, [~lachisis] Thanks for reporting the issue. Please feel free to re-assign to yourself if you starts/wants to work on it. , Thanks for your reply, Jun Gong. 
I think it is a good idea to use "release_agent" to clear the empty container hierarchys. But I am afaid that does "release_agent" option suit all the cgroup versions?
I just test "release_agent" option, maybe some mistake, it does not work now.
, I have tested for the "release_agent" feature, and think it is suitable.
Jun Gong , do you make the patch now?  If not, I will assignee to me and make., Sorry for late reply. I am working on it, will attach a patch later., Hi Jun Gong.I have the interest to fix this problem. But I can not understand what you mean. You want to write the shell command or the script to  release_agent in the cgroup ? The Shell command or the script that can delete the hierarchy or the container  empty dirs.You can write the demo or descirbe your idea?Thanks.：）
, {quote}
You want to write the shell command or the script to release_agent in the cgroup ? The Shell command or the script that can delete the hierarchy or the container empty dirs.
{quote}
Yes. The demo could be found at https://access.redhat.com/documentation/en-US/Red_Hat_Enterprise_Linux/6/html/Resource_Management_Guide/sec-common_tunable_parameters.html.

Please feel free to work on it. Sorry for it. I was busy at that time and forgot it...:(]