[I think this is more intuitive the way it is....than using same prefix for all..thoughts?, [~ojoshi], can you please explain why is more intuitive not to be consistent?, like..RM_PREFIX..clearly means it is for RM... similarly NM_PREFIX for NM and YARN_PREFIX for other general stuff.. if we use common prefix then first of all there will be no point to have any prefix as all yarn specific configurations will go into yarn-site.xml and it is meant for YarnConfiguration only.... Let me know if you disagree.. , I think this is only for the scheduler configs.  Do you think there is a fundamental difference between the ones that start with "yarn.resourcemanager.scheduler" and the ones that start with "yarn.scheduler".?, It sounds good to uniform the prefix. Better to use "yarn.resourcemanager.scheduler"?

Shall we consider the compatibility to the early 2.x versions? Maybe we can deprecate, but not remove the ones beginning with YARN_PREFIX., Can you list the specific changes that you are proposing? Asking as some of the configs that are common to all schedulers are termed RM configs, so..

BTW, I did think of fixing all config names, but felt it was too late. If possible, we should avoid it. If only we pay more attention with reviews, we wouldn't be needing these major configuration name surgeries. I'm leaning towards keeping the names as they are, instead of changing them now and creating lots of confusion. And request everyone to +1 patches with config names with more care - we should definitely have a config name guide., The ones that caught my eye are:

{code}
YARN_PREFIX + "scheduler.minimum-allocation-mb";

YARN_PREFIX + "scheduler.minimum-allocation-vcores";

YARN_PREFIX + "scheduler.maximum-allocation-mb";

YARN_PREFIX + "scheduler.maximum-allocation-vcores";

RM_PREFIX + "scheduler.client.thread-count";

RM_PREFIX + "scheduler.monitor.enable";

RM_PREFIX + "scheduler.monitor.policies";
{code}

YARN-1004 would take care of the first 2. What about the last 3, are they a false positive from my side and it is OK they say in the RM? If so, we can close this as invalid., Set target version 2.4.0. [~tucu00] - now that we have already shipped 2.2.0 GA and 2.3, do you think we should continue to call this a blocker? , I think it's safe to downgrade this one. As Karthik points out, we have already shipped 2.2 & 2.3; we really can't change them without breaking folks. , I think we should just change this to Won't Fix.  It only made sense in the pre-GA timeframe.]