[Cgroup support is already added via YARN-4553. Can this be closed as dup?, Thanks! I tried Yarn-4553! I think that's a reasonable way to solve this problem! But my docker only supports the name like "xxx.slice" as the parameter of "--cgroup-parent", and yarn will set the parameter of "--cgroup-parent" like "--cgroup-parent=/hadoop-yarn/container_1479368276135_0020_02_000001". So my YarnChild will report the following error:
Exception message: docker: Error response from daemon: cgroup-parent for systemd cgroup should be a valid slice named as "xxx.slice".

notes: docker version is 
Client:
 Version:         1.10.3
 API version:     1.22
 Package version: docker-common-1.10.3-46.el7.centos.14.x86_64
 Go version:      go1.6.3
 Git commit:      cb079f6-unsupported
 Built:           Fri Sep 16 13:24:25 2016
 OS/Arch:         linux/amd64

Server:
 Version:         1.10.3
 API version:     1.22
 Package version: docker-common-1.10.3-46.el7.centos.14.x86_64
 Go version:      go1.6.3
 Git commit:      cb079f6-unsupported
 Built:           Fri Sep 16 13:24:25 2016
 OS/Arch:         linux/amd64
, [~zhengchenyu] - It sounds like you are using systemd cgroup driver for docker. Systemd was the default in Docker 1.10/11 but was changed back to cgroupfs in 1.12 due to the many issues it caused. Can you try running docker with {{--exec-opt native.cgroupdriver=cgroupfs}} and see if that fixes the problem for you?, Sorry, I reconfigurated and restarted docker by your way. still report "systemd cgroup should be a valid slice named as "xxx.slice"". It is necessary to ending with "xxx.slice". , Can you give me the steps you took to reconfigure docker? What does {{ps -ef | grep docker}} return? Do you see the exec-opt in the ps output? 

_systemd cgroup_ in the error output indicates that systemd is in use still, so it doesn't sound like docker was reconfigured correctly. Let me know the steps you took and I can try to advise., Oh, my god! I found "/usr/lib/systemd/system/docker.service" has this option "--exec-opt native.cgroupdriver=systemd ". I configured this file(/etc/sysconfig/docker) just now. Thank you for you advice, I reconfigure the file(/usr/lib/systemd/system/docker.service), then I can success!Thank you again! , Great news, [~zhengchenyu] - I will go ahead and close this issue.]