[{color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12688574/YARN-2983.patch
  against trunk revision 8f5522e.

    {color:green}+1 @author{color}.  The patch does not contain any @author tags.

    {color:red}-1 tests included{color}.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    {color:green}+1 javac{color}.  The applied patch does not increase the total number of javac compiler warnings.

    {color:green}+1 javadoc{color}.  There were no new javadoc warning messages.

    {color:green}+1 eclipse:eclipse{color}.  The patch built with eclipse:eclipse.

    {color:red}-1 findbugs{color}.  The patch appears to introduce 15 new Findbugs (version 2.0.3) warnings.

    {color:green}+1 release audit{color}.  The applied patch does not increase the total number of release audit warnings.

    {color:green}+1 core tests{color}.  The patch passed unit tests in hadoop-yarn-project/hadoop-yarn/hadoop-yarn-server/hadoop-yarn-server-resourcemanager.

Test results: https://builds.apache.org/job/PreCommit-YARN-Build/6163//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-YARN-Build/6163//artifact/patchprocess/newPatchFindbugsWarningshadoop-yarn-server-resourcemanager.html
Console output: https://builds.apache.org/job/PreCommit-YARN-Build/6163//console

This message is automatically generated., Findbugs to be addressed by YARN-2937 to YARN-2940, [~kasha] / [~jianhe], kindly review this., thanks [~varun_saxena], I filed YARN-2987 while looking at this.
I think this NPE is very rare to happen, because  so far, scheduler.getAppsInQueue returns only running applications. If the app is present in scheduler, it is very unlikely it's not present in the rmContext, as RM is always evicting the oldest app first from the rmContext. do you also see other scenarios ?, bq. do you also see other scenarios ?
No. This is probably the only scenario. Yes, I agree this may happen very rarely. Will have to be an extremely long running app with the kind of default config value we have for max completed applications(10000)., thanks for taking over YARN-2987 too ! Given the change is fairly small and they are touching the same piece of code, do you mind incorporating this change as part of that and close this ?, bq. do you mind incorporating this change as part of that 
Sure, will do so., YARN-2987 is committed, closing this.]