[[~eyang], [~billie.rinaldi], have we seen this issue when trying to get app status in a kerberoized cluster?, This looks like a misconfiguration on the tested cluster.  YARN user is not allowed to impersonate hadoop user to access HDFS.  YARN user must have proxy user ACL setup to impersonate end user in order to access the home directory of the end user in HDFS.  Please check core-site.xml, and make sure that user have the following defined:
{code:java}
    <property>
      <name>hadoop.proxyuser.yarn.groups</name>
      <value>users</value>
    </property>

    <property>
      <name>hadoop.proxyuser.yarn.hosts</name>
      <value>rm1.example.com,rm2.example.com</value>
    </property>{code}
 , Thanks [~eyang], 

[~yuan_zac], are you able to *submit* job without enabling proxy? I guess you cannot submit job as well.

[~eyang], in some environment setups, admin doesn't want to add yarn to proxy user. In existing native service implementation, what is the dependency of API Server to end user's home directory? If it is only for service spec, can we store such specs to yarn's own directory?, YARN implementation is built as a thick client and thick server.  The thick client can run in the server as well.  Without security ACL, it becomes possible to reverse engineer thick client and send network packets to fool server to perform operations.

In the current implementation, we can not recommend to run without proxy user setup due to the spec file stored in end user's home directory instead of centralized.  There was proposal to centralize the metadata in YARN-7399.  The centralized meta store must define ACL to represent which user can access which app.  That details needs to be hashed out to remove proxy user ACL dependency that we have today., [~leftnoteasy]

Yeah， without the proxy settings，we can't submit the job as well.

[~eyang] 

In the current implementation, we need to add the proxy settings, right?

 , [~yuan_zac] {quote}In the current implementation, we need to add the proxy settings, right? {quote}

Yes.]