[I would like to work on this Jira. Please reassign otherwise. Thank you., [~bibinchundatt] Could u also please attach NM logs here., I have got the logs from [~bibinchundatt] offline.

{noformat}
2015-05-30 01:11:16,179 WARN org.apache.hadoop.yarn.server.nodemanager.DefaultContainerExecutor: Exception from container-launch with container ID: container_e313_1432908361253_4506_01_000001 and exit code: 0
java.io.IOException: java.lang.InterruptedException
...
...
2015-05-30 01:11:16,179 WARN org.apache.hadoop.yarn.server.nodemanager.containermanager.container.ContainerImpl: Unable to update diagnostics in state store for container_e313_1432908361253_4506_01_000001
java.io.IOException: org.iq80.leveldb.DBException: Closed
	at org.apache.hadoop.yarn.server.nodemanager.recovery.NMLeveldbStateStoreService.storeContainerDiagnostic
{noformat}

When NM is shutting down, ContainerLaunch is also interrupted. During this interrupted exception handling, NM tries to update container diagnostics. But from main thread statestore is down ,hence caused the DB Close exception.

This scenario is handled in YARN-3641 already by [~djp] . [~bibinchundatt] could you please update this patch and check this and we can close this ticket as duplicate. Attaching NM logs too.
, bq. When NM is shutting down, ContainerLaunch is also interrupted. During this interrupted exception handling, NM tries to update container diagnostics. But from main thread statestore is down ,hence caused the DB Close exception.
I think this issue caused since NM jvm did not exit on_time which allowed to process the statestore event. After YARN-3585 , I think this should be OK.
[~bibinchundatt] Can you regression it pls, [~rohithsharma] and [~sunilg] Have tried with build containing YARN-3585 and YARN-3641.
org.iq80.leveldb.DBException: Closed. exception i am not able to reproduce . 

, Hi [~bibinchundatt]
If this issue is not reproducible as per latest trunk, cud u please mark this issue as closed., I am closing this  issue as it is not happening in trunk.
[~bibinchundatt] please reopen otherwise.]