[Straight forward patch to fix this issue., +1 , {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12689606/0001-YARN-2999.patch
  against trunk revision b7442bf.

    {color:green}+1 @author{color}.  The patch does not contain any @author tags.

    {color:red}-1 tests included{color}.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    {color:green}+1 javac{color}.  The applied patch does not increase the total number of javac compiler warnings.

    {color:green}+1 javadoc{color}.  There were no new javadoc warning messages.

    {color:green}+1 eclipse:eclipse{color}.  The patch built with eclipse:eclipse.

    {color:green}+1 findbugs{color}.  The patch does not introduce any new Findbugs (version 2.0.3) warnings.

    {color:green}+1 release audit{color}.  The applied patch does not increase the total number of release audit warnings.

    {color:green}+1 core tests{color}.  The patch passed unit tests in hadoop-yarn-project/hadoop-yarn/hadoop-yarn-server/hadoop-yarn-server-resourcemanager.

Test results: https://builds.apache.org/job/PreCommit-YARN-Build/6220//testReport/
Console output: https://builds.apache.org/job/PreCommit-YARN-Build/6220//console

This message is automatically generated., -1 to the patch

Use of <> entries is valid Java 7 code; Hadoop 2.7 is meant to be java 7 only, and the language source tagged as such. Therefore it should be valid in the source.

If it is not compiling on your machine, then something is wrong with either your machines or the POM files aren't passing the java source tag down to the javac command. This is a maven build ,not an IDE build, right?
, bq. This is a maven build ,not an IDE build, right?
yes, test has run with maven build. My machine has java 1.7 only installed,no java 1.6. I think I get root cause of the problem i.e my eclipse set up has jre 1.6 default compiler. And Build Automatically has set true. So when I do any change in eclipse, source file were compiled under jre 1.6 but I run test in maven build which run on jre 1.7. After changing eclipse default compiler to 1.7, it is working fine.

Given Hadoop 2.7 is meant to be java 7 only, I am open to close the issue., bq.  I think I get root cause of the problem i.e my eclipse set up has jre 1.6 default compiler.
same issue to me...  thanks for debugging into this. thanks Steve for the comments. ]