[CC [~leftnoteasy], [~asuresh]., [~djp], APIs of YARN server are private. No class from daemons like RM/NM are listed in Java API doc: http://hadoop.apache.org/docs/r3.0.0-alpha4/api/index.html. In the other word, sub projects for daemons are excluded when we generate javadocs. (Ref: https://github.com/apache/hadoop/blob/trunk/pom.xml):

{code} 
<!-- Non-public APIs -->     <excludePackageNames>org.apache.hadoop.authentication*,org.apache.hadoop.mapreduce.v2.proto,org.apache.hadoop.yarn.proto,org.apache.hadoop.yarn.server*,org.apache.hadoop.yarn.webapp*</excludePackageNames>
{code} 

Even if YARN supports specifying different scheduler implementation other than Fair/Capacity/Fifo, but we never maintain API compatibility of customized scheduler., Thanks [~leftnoteasy] for reply. I will downgrade this JIRA's priority to unblock current progressing releases - as Wangda point out, this API is not get public in our API doc.

While I agree in API definition it is a private one (as all yarn-server APIs) so far. However, my second thoughts is we make YarnSchduler pluggable since long time ago to build ecosystem for third parties to enhance/improve schedulers on their scheduling scenario. Making resource scheduler pluggable has been a long time strategy for hadoop even before YARN comes out. Other competitive resource scheduling systems (like K8S, etc.) also has similar design. I don't know since when CS and FS scheduler is the only option for hadoop YARN but this break our promise to make scheduler pluggable - yes. current yarn is still pluggable but if every upgrade can potentially breaking third-party schedulers (given no guarantee of stable) then what this pluggable meaning for?, [~djp], 

Thanks for suggestions.

Regarding to scheduler of K8S, it works quite different comparing to YARN: K8S supports customized scheduler or even multiple schedulers concurrently running so POD can choose to use different schedulers when it is submitted to the cluster.

However, OTOH, In K8S, there's no official "scheduler" API. IIRC, schedulers in K8S runs in a separate process and makes decisions by:
1) Watch POD update. (via IPC)
2) Watch NODE update. (via IPC)
3) Call POD's binding API to bind a POD to node when allocation decision made. (via IPC).

So we can say, scheduler of K8S makes decision by invoking POD/binding to assign POD to node. That's the only contract for customized scheduler, which is not descriptive enough but very simple to maintain compatibility.

However since YARN scheduler is too much coupled with other RM components, so it is almost impossible to keep API stability of scheduler, and beyond API, scheduler need to handle internal RM events, which we never ensure compatibility before. To be frank, I don't see big benefit of making scheduler API stable now, adding customized scheduler is never recommended by Hadoop community and vendors. And I can expect declare stability of scheduler API could slow down innovations in scheduler side.

Had some discussions with [~curino] / [~subru] / [~kkaranasos] during Hadoop summit regarding to how to better design scheduler semantics, I suggest to declare scheduler API stability once we reach there. I don't think it can be done in the short term. 

Thoughts? cc: [~curino] / [~subru] / [~kkaranasos]. 

, Thanks [~leftnoteasy] for response.
bq. Regarding to scheduler of K8S, it works quite different comparing to YARN: K8S supports customized scheduler or even multiple schedulers concurrently running so POD can choose to use different schedulers when it is submitted to the cluster.
Agree that it is different so far, but the way how K8S works now may hint the direction that YARN could leverage in future - especially for long running services with extremely scale. Taking federation as an example, we are working on support for one application to ask resources on multiple clusters now. But technically, there is no hard restraint for apps to ask resource from one kind of scheduler which means it potentially can ask resource from multiple clusters which run different schedulers (at least can mix with FS and CS scheduler). If that becomes true someday, then how far between YARN and K8S in scheduling (at least for this scenario) then?

bq. In K8S, there's no official "scheduler" API.
That's not true. K8S website (https://kubernetes.io/docs/tasks/administer-cluster/configure-multiple-schedulers/) document how to implement a customized scheduler with several pre-define APIs and these APIs even get versioned (so far is version 1). For more details, you can refer: https://github.com/kubernetes/kubernetes/blob/master/plugin/pkg/scheduler/algorithm/scheduler_interface.go

bq. So we can say, scheduler of K8S makes decision by invoking POD/binding to assign POD to node. That's the only contract for customized scheduler, which is not descriptive enough but very simple to maintain compatibility.
Hmm... I agree that K8S scheduler logic could be simpler than YARN so far but that doesn't have to mean that maintaining compatibility is also simpler. Actually, maintaining several basic APIs' compatibility is not that hard for YARN by following current public API update protocol - just instead of changing long existing APIs but adding new APIs with mark old one as deprecated. maintaining allocated() definitely belong to this case. 

bq. However since YARN scheduler is too much coupled with other RM components, so it is almost impossible to keep API stability of scheduler, and beyond API, scheduler need to handle internal RM events, which we never ensure compatibility before.
That's unfortunately true. However, ideally, a good design should make YARN scheduler API to be more independent with implementations of these RM events - the later should always get updated for new scenarios.

bq. To be frank, I don't see big benefit of making scheduler API stable now, adding customized scheduler is never recommended by Hadoop community and vendors. And I can expect declare stability of scheduler API could slow down innovations in scheduler side.
This is not true. CS and FS is not born for the first day when Hadoop comes. Even for YARN, FS are added much later than CS. How can we assume there is no better scheduler than CS/FS for YARN in future? About innovation, I don't understand how declaring stability on several APIs could slow down things here? I am more worried about less people could be interested to join contribution of their ideas as discouraged by non-stop changing APIs.

bq. Had some discussions with Carlo Curino / Subru Krishnan / Konstantinos Karanasos during Hadoop summit regarding to how to better design scheduler semantics, I suggest to declare scheduler API stability once we reach there.
Can you share more details on these discussions? better to be document somewhere for broader audiences. We never reach a place that we can safely declare something is the best and absolutely stable. Instead, we should ask ourselves - are we comfortable to claim current APIs are good and relative stable? If not, keep evolving these APIs to a relatively good and stable status should be first citizen task for YARN community., Thanks [~djp] for additional comments: 

bq. That's not true. K8S website (https://kubernetes.io/docs/tasks/administer-cluster/configure-multiple-schedulers/) document how to implement a customized scheduler with several pre-define APIs and these APIs even get versioned (so far is version 1). For more details, you can refer: https://github.com/kubernetes/kubernetes/blob/master/plugin/pkg/scheduler/algorithm/scheduler_interface.go
I'm not familiar with golang, so please correct me if I was wrong. My understanding of {{scheduler_interface.go}} is, it provided suggested APIs for scheduler, but it is not a public API. Signatures like {{v1.Node}} means it use {{Node}} api inside v1 API package. But it doesn't claim scheduler API stability itself. Could you point me if you have any ref of claiming scheduler API stability for K8S?

bq. Agree that it is different so far, but the way how K8S works now may hint the direction that YARN could leverage in future - especially for long running services with extremely scale ..
Instead of following K8S's model to let app choose scheduler, I would like to let a "router" module to choose scheduler for app -- this is also the model used to implement RM federation's. Blindly letting multi-scheduler run independently in the cluster could cause lots of resource accounting and maintenace issues: every scheduler could account resource once so it could cause over allocation, etc. 
To clarify, I agree with the idea of making a better API for scheduler and declare stability so we can support easier pluggability in the future. However I don't think it is the time to claim that now before we clean up scheduler implementation. It doesn't helpful and even discouraging to developers if we claim existing scheduler API to stable.

bq. Can you share more details on these discussions?
I can try to summarize what we discussed, no conclusions so far:
a. https://issues.apache.org/jira/secure/attachment/12867869/YARN-6592-Rich-Placement-Constraints-Design-V1.pdf, "implementation design": by adding a ResourceRequestPreprocessor to look at scheduler state and request, and forward hard-locality request to scheduler to do allocation. User can plug their own "ResourceRequestPreprocessor" to do request to node binding. 
b. {{YARN-5139-Global-Schedulingd-esign-and-implementation-notes-v2.pdf}} in YARN-5139 suggested an approach to introduce NodeScorer and committer interface so users can implement their own scorer to lookup cluster states and send allocation proposal to scheduler to do allocation.
I personally prefer b. than a.



, I suggest to convert this JIRA to a task (instead of bug) to introduce better scheduler APIs as a long term goal and remove 2.9.0, 3.0.0-beta1 from target version, probably we can try to see if we can get some reasonable scheduler API definition with the development of YARN-6592 (which is targeted to 3.1 or 3.2)., I agree with [~wangda]; though it might be cleaner to close this as "Won't Fix" and file a new JIRA.  We should change this to introduce a proper scheduler API as a long term goal.  As it is now, you can't practically make your own Scheduler for a number of reasons.  I big one is that there's a number of places in the code where we cast to {{AbstractYarnScheduler}} and that's {{@Private}} :)

Does anyone mind if I go ahead and do that?, [~rkanter], +1 to your proposal., Ok.  I've created YARN-7301., Updated right JIRA number in summary!, Sorry to come late into this.  Should we add a Release Note to YARN-5221 to document the incompatibility and mark the JIRA as incompatible?, [~rchiang], I would prefer to not do that, reasons see my previous comment: https://issues.apache.org/jira/browse/YARN-7138?focusedCommentId=16148381&page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel#comment-16148381, Given that, then does it actually make sense to have such annotations on classes like YarnScheduler?  Would it be better to remove all such annotations then?, [~rchiang], I'm fine with doing that., Thanks.  Filed YARN-7322.]