[Attached v1 patch for review., Hi [~Tao Yang]

Thanks for the patch, but could you please take a look YARN-4686? That patch puts \{{this.isStopped=false}} after \{{statusUpdater.start()}}. Maybe another way to fix this is to take use of \{{shutdownMonitor}} lock?, Thanks [~cheersyang] for your mention.
{quote}
That patch puts this.isStopped=false after statusUpdater.start()
{quote}
[~ebadger], [~cheersyang], I don't understand why YARN-4686 exchange these two lines. can you give a hint for that?  Thanks., Been awhile since I worked on that patch, but I think the idea was that we shouldn't say that the service is running until it's finished starting up. Setting isStopped to false before the whole NM startup has finished would introduce a race condition where the NM says it's running, but it isn't fully up yet. Looking at the code, I'm not sure if there is a functional reason, since the statusUpdater thread loops on isStopped until it's false. , Thanks [~ebadger] for adding some background. In this case, I am OK with [~Tao Yang]'s approach, as the case he mentioned was possible which could cause this silent-exit case. [~Tao Yang] could you please upload another patch to trigger jenkins? Thanks., Thanks [~ebadger], [~cheersyang] for your reply.
{quote}
Setting isStopped to false before the whole NM startup has finished would introduce a race condition where the NM says it's running, but it isn't fully up yet.
{quote}
I think isStopped here is used as a switch which can control async updater thread to run or stop, not a state, so that it's reasonable to set isStopped to be false before starting the async updater thread,  just as setting isStopped to be true to stop the updater thread  in current codes.

{quote}
I'm not sure if there is a functional reason, since the statusUpdater thread loops on isStopped until it's false.
{quote}
The updater thread will exit if isStopped is true instead of waiting.
Related codes in StatusUpdaterRunnable:
{noformat}
public void run() {
      int lastHeartbeatID = 0;
      while (!isStopped) {
         ...
      }
}
{noformat}

{quote}
could you please upload another patch to trigger jenkins? 
{quote}
Done.]