[[~vinodkv], do you think it has anything to do with YARN-386?, Marking this as a Blocker as it is essential functionality for ops to be able to change configs without bouncing the RM.  I see it's marked as occurring in 2.3, but I assume it would also occur in 2.1.0?, I haven't explicitly tested 2.1, but it is very likely that the same defect exists in 2.1., The protocol was renamed in YARN-387. , This was actually broken by YARN-869., It's broken on trunk too, but only when hadoop.security.authorization is true which is something that we didn't test with.

Here's a simple patch. Tested this manually and it works.

We don't have junit tests for RMAdmin at all, will tackle that separately so that we can move on with this blocker., {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12594001/YARN-968.txt
  against trunk revision .

    {color:green}+1 @author{color}.  The patch does not contain any @author tags.

    {color:red}-1 tests included{color}.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    {color:green}+1 javac{color}.  The applied patch does not increase the total number of javac compiler warnings.

    {color:green}+1 javadoc{color}.  The javadoc tool did not generate any warning messages.

    {color:green}+1 eclipse:eclipse{color}.  The patch built with eclipse:eclipse.

    {color:green}+1 findbugs{color}.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    {color:green}+1 release audit{color}.  The applied patch does not increase the total number of release audit warnings.

    {color:green}+1 core tests{color}.  The patch passed unit tests in hadoop-yarn-project/hadoop-yarn/hadoop-yarn-common.

    {color:green}+1 contrib tests{color}.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-YARN-Build/1574//testReport/
Console output: https://builds.apache.org/job/PreCommit-YARN-Build/1574//console

This message is automatically generated., +1 The patch looks good. Are you going to file a jira for adding test cases?, Thanks for fixing this, Vinod. I've committed this to trunk, branch-2 and branch-2.1-beta., Are you going to file a jira for adding test cases?
Filed YARN-970.]