[Looks like the problem here is that realpath for {{/bin}} returns {{/usr/bin/}} on CentOS7/RHEL7. So when the test checks for the permitted mounts, it sees {{/usr/bin/ls}} or {{/usr/bin}} instead of {{/bin/ls}} or {{/bin}}

{noformat}
[ebadger@foobar]$ cat /etc/redhat-release 
Red Hat Enterprise Linux Server release 7.1 (Maipo)
[ebadger@foobar]$ realpath /bin
/usr/bin
[ebadger@foobar]$ realpath /bin/ls
/usr/bin/ls
{noformat}, I think the best way to fix this is to do a readlink/realpath/etc. on the files/directories in question before we add them to the permitted_mounts list and list of volumes to be mounted. Otherwise, there's no way to avoid the possibility of symlinks screwing up the test. The only other way I can think to fix this is to find files/directories that will always be in the same absolute path on all of the different OSes., [~ebadger] We will want to prevent symlink being mounted, so test case fails for the right reason.  This means finding test file that exists in both OS is probably best solution.  May I suggest to look for /etc/passwd and /etc in the test case?, Hey [~eyang]

bq. We will want to prevent symlink being mounted, so test case fails for the right reason.
True, but we want the test to be deterministic across all environments. We should explicitly test symlinks as well.

bq. May I suggest to look for /etc/passwd and /etc in the test case?
/etc is a symlink /private/etc on my mac. , [~ebadger] Linux Container Executor is Linux centric.  The test case doesn't apply to Darwin, does it?, /usr/bin/touch is probably a better choice from YARN-7353.  [~ebadger] Would you like to update your change for YARN-7353 for this JIRA as well.  The lines are closely related, and good to have changes based on another changeset.

/etc/localtime is best source for symlink test., bq. Eric Badger Linux Container Executor is Linux centric. The test case doesn't apply to Darwin, does it?
Ah I suppose you're right. That solves that problem then. I'll go ahead and assign to myself and fix up the tests using /etc and /etc/passwd, bq. /usr/bin/touch is probably a better choice from YARN-7353. Eric Badger Would you like to update your change for YARN-7353 for this JIRA as well. The lines are closely related, and good to have changes based on another changeset.
So you want me to dup YARN-7353 to this JIRA and make both changes here?, [~ebadger] Let's resolve this as part of YARN-7353, and update test case in YARN-7353 to include suggestion in this JIRA., Sounds good. I'll dup this JIRA to that one and then update the summary in YARN-7353, Thank you, Eric. Changes will be in unit test for YARN-7353.]