[Also, is there a reason we don't just fetch the logs from the NM directly?, @Sandy Ryza: I tried to reproduce the scenario without log aggregation enabled,but was unable to get the message "Aggregation is not enabled.....".I was looking at mapred-niranjan-historyserver-niranjan-OEM.log file. But somehow I came up with the solution. Below is the code:

if (!conf.getBoolean(YarnConfiguration.LOG_AGGREGATION_ENABLED,
        YarnConfiguration.DEFAULT_LOG_AGGREGATION_ENABLED)) {
      String nodeAddress = conf.get(YarnConfiguration.NM_WEBAPP_ADDRESS,
    	        YarnConfiguration.DEFAULT_NM_WEBAPP_ADDRESS);
    	   
      html.h1()
          ._("Aggregation is not enabled. Try the nodemanager at " + nodeAddress)
          ._();
      return;
    }
Will this work?, Thanks for looking into this, Niranjan. The message I'm referring to is in the RM web UI, not the logs. Are you able to getThe the message there?

The solution you posted, however, is definitely along the lines that I was thinking.  If possible, it would be nice to augment it to point not to just the NM UI, but to the actual page with the container logs in it., Putting up something preliminary.

1) I'm still getting familiar with a lot of the APIs.  So, if there's a cleaner or more robust way to extract the host and port for the NM, let me know.

2) For pointing directly at the container URL, let me know if there's a better way to put it together other than String concatenation.
, AggregatedLogsBlock is hosted on a server that is not the nodemanager - today the MR JobHistoryServer and the TimelineServer in the near future. So you cannot look into the config., That makes sense.  Thanks!, Submitting for testing.  Has very basic version of creating the correct URL for NM port., {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12655081/MAPREDUCE5185-01.patch
  against trunk revision .

    {color:green}+1 @author{color}.  The patch does not contain any @author tags.

    {color:red}-1 tests included{color}.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    {color:green}+1 javac{color}.  The applied patch does not increase the total number of javac compiler warnings.

    {color:green}+1 javadoc{color}.  There were no new javadoc warning messages.

    {color:green}+1 eclipse:eclipse{color}.  The patch built with eclipse:eclipse.

    {color:green}+1 findbugs{color}.  The patch does not introduce any new Findbugs (version 2.0.3) warnings.

    {color:green}+1 release audit{color}.  The applied patch does not increase the total number of release audit warnings.

    {color:red}-1 core tests{color}.  The patch failed these unit tests in hadoop-yarn-project/hadoop-yarn/hadoop-yarn-common:

                  org.apache.hadoop.yarn.util.TestFSDownload

    {color:green}+1 contrib tests{color}.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-YARN-Build/4294//testReport/
Console output: https://builds.apache.org/job/PreCommit-YARN-Build/4294//console

This message is automatically generated., I just tried the TestFSDownload test in my tree and it passed.  I'm assuming this is an unrelated failure.

I didn't add a new test for changing the output string, since the link could be to the NM or a Container URL., bq. So you cannot look into the config.
What I meant is that the patch as it exists today doesn't work.., Oh, I see what you mean now.  So, you'd prefer that a proper patch would grab the full information from the configuration file (currently not possible) rather than cobble together the two pieces of information (the config has the proper host in one piece and the proper port, but not the proper IP, in another piece).

Given that restriction, I'll agree that such a patch is not possible without having the proper NM configuration info on the same node as the JobHistoryServer.

And I'm open to other suggestions or compromises.  I'd like to get something that points to an understandable URL for customers rather than the "nothing at this port" that the message currently provides.
, It seems like there is no solution that would satisfy everyone here.  If there are any objections to closing this JIRA as "will not fix", please comment.  Thanks., Unable to fix this using a single Configuration property.  Patch which hacks and uses two properties considered not acceptable.  Closing this bug as won't fix.]