[Duh. Too many issues fixed all at once, they are all running together in my mind. OK, going over this again, this is happening during my integration tests with MiniYARNCluster, not on the real cluster.

So perhaps the real YARN implementation handles propagating the error to the client and RM (etc) when the command line the client tries to use to launch the container for the AM fails. I think its the MiniYARNCluster that is not handling this situation correctly.

Again, the issue is:

Client starts fine. Creates AMContainerSpec stuff and tries to request AM container. This request includes the shell command to launch our AM in the container. Container shows up as being granted and provisioned by RM, but from there the client hangs waiting for job success/fail, saying it has "1 container used" the whole time (the AM failed container.) What seems to be happening is this shell script fails in launching the AM in its container, so the container just sits there forever. Lets check this in MiniYARNCluster and see.

I will try to "break" the Giraph MiniYARNCluster test again and recreate some decent log traces leading up to the event and I will post here. Thanks!, nodemanager log for MiniYARNCluster DID get a log report for app master that could only come from the shell command failing:

{code}
Exception in thread "main" java.lang.NoClassDefFoundError: org/apache/giraph/yarn/GiraphApplicationMaster
Caused by: java.lang.ClassNotFoundException: org.apache.giraph.yarn.GiraphApplicationMaster
        at java.net.URLClassLoader$1.run(URLClassLoader.java:202)
        at java.security.AccessController.doPrivileged(Native Method)
        at java.net.URLClassLoader.findClass(URLClassLoader.java:190)
        at java.lang.ClassLoader.loadClass(ClassLoader.java:306)
        at sun.misc.Launcher$AppClassLoader.loadClass(Launcher.java:301)
        at java.lang.ClassLoader.loadClass(ClassLoader.java:247)
{code}

So thats good. But I don't think its propagating this to the MiniYARNCluster's RM or my Client. From my Client's end, the logs are endless heartbeat msg's with -1000 exitCode until I ctrl-c out of the test suite.

FYI, this is not a priority or blocker for my Giraph on YARN, it all works now (including the test) in case I wasn't clear. But it should probably get investigated/fixed soon if I've really found something here ;)

, Sorry, tried to recreate this today and am not seeing the same problem when I set up the same conditions (test breaks instead of hangs on minicluster job forever like before) maybe wait on this and I will post NM and RM logs when I encounter it again.

, Eli, please reopen the ticket if you run into this again. Tx.]