[I would like to fix it, could someone help me out in assigning the bug to me..Seems like I could not assign the issue to me .

Thanks, I added you as a contributor to the YARN project and assigned it to you. Thanks for taking this up., It order to fix this request, two files will be tweaked

File name:

1) yarn
2) yarn-env.sh

I have added a new OPTS called "COMMON_LOGGING_OPTS" in yarn-env.sh to turn off the unnecessary log info messages.

COMMON_LOGGING_OPTS is used into the yarn shell script to turn the log message.

Suggestion are welcome

, Do I need any special permission to attach a patch file for this jira ?

Sorry this is my first time.

Appreciated , Please review the code.

Many Thanks, {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12570829/YARN-379.patch
  against trunk revision .

    {color:green}+1 @author{color}.  The patch does not contain any @author tags.

    {color:red}-1 tests included{color}.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    {color:green}+1 javac{color}.  The applied patch does not increase the total number of javac compiler warnings.

    {color:green}+1 javadoc{color}.  The javadoc tool did not generate any warning messages.

    {color:green}+1 eclipse:eclipse{color}.  The patch built with eclipse:eclipse.

    {color:green}+1 findbugs{color}.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    {color:green}+1 release audit{color}.  The applied patch does not increase the total number of release audit warnings.

    {color:green}+1 core tests{color}.  The patch passed unit tests in .

    {color:green}+1 contrib tests{color}.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-YARN-Build/433//testReport/
Console output: https://builds.apache.org/job/PreCommit-YARN-Build/433//console

This message is automatically generated., Hi Abhishek, It might be better to change these INFO level messages to DEBUG., The NodeCLI utility does not use log4j instead it uses sysout. 

Changing the above messages from INFO to DEBUG would change the logging level in AbstractService class which is super class for many services.

If that is okay, then I can go for it and change it.




, Are we okay with the fix ? 

Please suggest 

Thanks
Abhi, I think the approach looks fine.  Did you see a way to just disable the logging for AbstractService for these calls rather then everything?

minor nit, can you change the name of COMMON_LOGGING_OPTS to be something more like YARN_CLI_NOLOG_OPTS and add a comment about what it is for., Can we not simply add 
log4j.category.org.apache.hadoop.yarn.service.AbstractService=WARN
to the log4j.properties file? In my testing, this prevented INFO messages on the console but not in the log file for the AM (which I don't completely understand how that were possible). This is obviously dependent on my log4j.properties file and I believe that is where it should be handled
, Hi Abhishek,

I recant. I like the patch's approach better. But we already have YARN_CLIENT_OPTS for this. Do you see a reason why we shouldn't add the NoOpLog to YARN_CLIENT_OPTS??

Thanks for your contribution. Lets get it in., I recant my recant. So many options. We probably don't want to turn off ALL logging for YARN_CLIENT_OPTS either. We just want to set log level to WARN., This patch sets the log level to WARN for console.

I tested by building cleanly after the patch and bringing up the daemons. The log and out files for the daemons are still at info level and the yarn commands are at WARN level.

Could someone please review and check it in?, {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12587458/YARN-379.patch
  against trunk revision .

    {color:green}+1 @author{color}.  The patch does not contain any @author tags.

    {color:red}-1 tests included{color}.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    {color:green}+1 javac{color}.  The applied patch does not increase the total number of javac compiler warnings.

    {color:green}+1 javadoc{color}.  The javadoc tool did not generate any warning messages.

    {color:green}+1 eclipse:eclipse{color}.  The patch built with eclipse:eclipse.

    {color:green}+1 findbugs{color}.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    {color:green}+1 release audit{color}.  The applied patch does not increase the total number of release audit warnings.

    {color:green}+1 core tests{color}.  The patch passed unit tests in .

    {color:green}+1 contrib tests{color}.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-YARN-Build/1202//testReport/
Console output: https://builds.apache.org/job/PreCommit-YARN-Build/1202//console

This message is automatically generated., The same patch also applies to branch-2, Hi Abhishek! Thanks for the contribution. I can help drive this fix in from here. If you feel you can, please feel free to take it back.

Assigning to myself., Tom pointed out that with the current patch, yarn jar will not show the necessary INFO messages., This issue seems to have been fixed by YARN-530. I do not see the annoying message(s) any more.]