[Thanks, [~nishan]. I think there is a bug inside the NodeManagerMetrics. i.e., 
{code}
  public void allocateContainer(Resource res) {
    allocatedContainers.incr();
    allocatedGB.incr(res.getMemory() / 1024);
    availableGB.decr(res.getMemory() / 1024);
    allocatedVCores.incr(res.getVirtualCores());
    availableVCores.decr(res.getVirtualCores());
  }
{code}
If the user configure the minimum allocation to 512 MB, the res is <512MB, 1vcore>, the allocatedGB/availableGB nevel change.
I'll post a patch to fix this., And for the JMX output, not sure whether we should change from integer to float, this may introduce compatibility issue. I think we can keep an accurate value (in MB maybe) in metric, but output GB in integer. What's your thought, [~nishan]?, {color:green}+1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12673647/YARN-2655-1.patch
  against trunk revision e16e25a.

    {color:green}+1 @author{color}.  The patch does not contain any @author tags.

    {color:green}+1 tests included{color}.  The patch appears to include 1 new or modified test files.

    {color:green}+1 javac{color}.  The applied patch does not increase the total number of javac compiler warnings.

    {color:green}+1 javadoc{color}.  There were no new javadoc warning messages.

    {color:green}+1 eclipse:eclipse{color}.  The patch built with eclipse:eclipse.

    {color:green}+1 findbugs{color}.  The patch does not introduce any new Findbugs (version 2.0.3) warnings.

    {color:green}+1 release audit{color}.  The applied patch does not increase the total number of release audit warnings.

    {color:green}+1 core tests{color}.  The patch passed unit tests in hadoop-yarn-project/hadoop-yarn/hadoop-yarn-server/hadoop-yarn-server-nodemanager.

    {color:green}+1 contrib tests{color}.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-YARN-Build/5329//testReport/
Console output: https://builds.apache.org/job/PreCommit-YARN-Build/5329//console

This message is automatically generated., Keeping values in MB's is good approach that make consistency accros RM and NM. But my worry is these metrics are already exposed to users so that they can query using http://<nm-http-address>/jmx. Chaning fields units effect users. , [~rohithsharma], yes, I agree that for compatibility, we shouldn't change field unit. So in the patch, I added two additional MBs to track the accurate values, and the metric outputs still use the GB unit., [~ywskycn] - the patch doesn't apply anymore. Mind updating it? , [~kasha], sure, will do it soon., Problem already solved in YARN-1156. Closing it.]