[Queue configurations works in intersection. If leaf queue does not have access check with parent. Since parent(root) has all access, you are able to submit job. .

I feel it is problem because in reality, we can not restrict individual users across the child queue anytime unless parent has single user access.
I am keeping open for more discussion with experts. I am open to be get convinced., As per the description in the YARN documentation 
{quote}
"yarn.scheduler.capacity.root.<queue-path>.acl_submit_applications" 
 The ACL which controls who can submit applications to the given queue. If the given user/group has necessary ACLs on the given queue or one of the parent queues in the hierarchy they can submit applications. ACLs for this property are inherited from the parent queue if not specified.
{quote}
So basically ACL is union of all ACL's in the queue hierarchy
and there is a note : 
{quote}
Note: An ACL is of the form user1, user2spacegroup1, group2. The special value of * implies anyone. The special value of space implies no one. The default is * for the root queue if not specified.
{quote}
So jcsong2 can access all as by default root queue is * .
But i feel the default root queue permission should not be * and better to be taken as no rights (i.e. space) when acl's are enabled.
May be others can give opinion on this ..., The child queue inherits the ACL of  root queue In the capacity scheduler configuration. The child queues' ACL is the UNION of the root queue. So the configurations of child queue will not work if the root queue not configured, in other word, leave the root queue in default configuration which allow any user to submit applications., Hi [~rootsongjc] or [~rohithsharma]
Can you set the title and description as per the latest discussions ... "Capacity scheduler configuration ACLs for children queue/sub queues will not work if the root queue's default acl configurations are not modified", Going through queueACLs more deeper I believe as per design , it is expected to disable ACLs for root queue. ACLs disables can be done configuring " "(space) for the queue configuration., Closing as Invalid. Feel free to discuss and reopen again.
For configuring queue level Acl's and woking properly, parent Acl's is supposed to be disabled using space " " explicitely.By default all users are allowed to submit jobs if parent does not disable the Acl's. For more information on CS , kindly refer [CapacityScheduler|http://hadoop.apache.org/docs/current/hadoop-yarn/hadoop-yarn-site/CapacityScheduler.html], I also met the same problem, can you tell me how do you solve this problem?]