[Hi, Ashwin.
We have discussed a little bit about the priority and preemption in YARN-596. The old preemption implementation is based on container's priority, and YARN-596 starts to consider fairshare.

Have one question here, consider all queues deploy fair share policy. By taking app priorities, if we want to preempt a container, which option do we deploy? (1) We collect all running apps from over-fairshare queues, and select the one with the lowest priority as the candidate, or (2) We firstly choose the queue which is most over its fair share, then the select the app with the lowest priority inside that queue as the candidate., I think the desired behavior here should be that a leaf queue's scheduling policy determines which apps get containers preempted inside of it. For fair share and DRF, the app to get a container preempted should be that which most exceeds its fair share. Priorities come in to play by providing weightings on the fair share.  It would also be possible to add a leaf-level scheduling policy that always preempts the app with the lowest priority.

I think that once YARN-596 is in we will actually have this behavior.

Thoughts?  Anything I'm missing?, Add a PriorityPolicy besides the existing fifo/fair/drf should work fine. Also, we also need to think about the resource allocation part. For a queue using PriorityPolicy, resource should be assigned to the applications from the highest proority. right?, Ah, I didn't know about YARN-596,this is very nice ! 
I agree with Sandy's comment. Keeping app preemption based on leaf queue's scheduling policy and having a separate policy
which is purely based on priority makes sense to me., Hey, [~ashwinshankar77], Are you working on this one? If not, I would like to take it., Hey [~ywskycn], please go ahead., Upload an initial patch to capture which we discussed.
Need to add testcases once YARN-2098 resolved., [~ywskycn], please check following [comment|https://issues.apache.org/jira/browse/YARN-2098?focusedCommentId=16119468&page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel#comment-16119468]]