[[~wangda] could you please help take a look at this proposed change? Thanks, [~leftnoteasy], 2.7.1 has already been released. Please choose either 2.7.2 if its a critical fix or 2.8.0, \\
\\
| (x) *{color:red}-1 overall{color}* |
\\
\\
|| Vote || Subsystem || Runtime || Comment ||
| {color:blue}0{color} | pre-patch |  16m 43s | Pre-patch trunk compilation is healthy. |
| {color:green}+1{color} | @author |   0m  0s | The patch does not contain any @author tags. |
| {color:red}-1{color} | tests included |   0m  0s | The patch doesn't appear to include any new or modified tests.  Please justify why no new tests are needed for this patch. Also please list what manual steps were performed to verify this patch. |
| {color:green}+1{color} | javac |   7m 43s | There were no new javac warning messages. |
| {color:green}+1{color} | javadoc |  10m 28s | There were no new javadoc warning messages. |
| {color:green}+1{color} | release audit |   0m 24s | The applied patch does not increase the total number of release audit warnings. |
| {color:green}+1{color} | checkstyle |   0m 50s | There were no new checkstyle issues. |
| {color:green}+1{color} | whitespace |   0m  0s | The patch has no lines that end in whitespace. |
| {color:green}+1{color} | install |   1m 30s | mvn install still works. |
| {color:green}+1{color} | eclipse:eclipse |   0m 33s | The patch built with eclipse:eclipse. |
| {color:green}+1{color} | findbugs |   1m 28s | The patch does not introduce any new Findbugs (version 3.0.0) warnings. |
| {color:green}+1{color} | yarn tests |  58m 12s | Tests passed in hadoop-yarn-server-resourcemanager. |
| | |  97m 54s | |
\\
\\
|| Subsystem || Report/Notes ||
| Patch URL | http://issues.apache.org/jira/secure/attachment/12751600/YARN-4067.patch |
| Optional Tests | javadoc javac unit findbugs checkstyle |
| git revision | trunk / 0bf2854 |
| hadoop-yarn-server-resourcemanager test log | https://builds.apache.org/job/PreCommit-YARN-Build/8928/artifact/patchprocess/testrun_hadoop-yarn-server-resourcemanager.txt |
| Test Results | https://builds.apache.org/job/PreCommit-YARN-Build/8928/testReport/ |
| Java | 1.7.0_55 |
| uname | Linux asf908.gq1.ygridcore.net 3.13.0-36-lowlatency #63-Ubuntu SMP PREEMPT Wed Sep 3 21:56:12 UTC 2014 x86_64 x86_64 x86_64 GNU/Linux |
| Console output | https://builds.apache.org/job/PreCommit-YARN-Build/8928/console |


This message was automatically generated., I don't think we should cap negative value to zero in any case. In some cases, YARN provide flexible resource model to allow resource to do over commit. Just like OS can claim/allocate more memory resource than physical one - backed by virtual memory mechanism, YARN's resource model is also flexible here - backed by mechanisms like: resource/container preemption, dynamic resource configuration (YARN-291), etc. We never have assumption that available resource couldn't be negative value, and this negative value can notify YARN to balance resource consumption again in some way. 
Thus, I propose to resolve this JIRA as Not A problem or Invalid., thanks [~djp] for explain. Agree that this is not a problem., IMO, available resource being negative is misleading. Even if we overcommit resources, it needs to transparent to users. This is actually one of the goals of YARN-1011. 

With regards to YARN-291, I was under the impression the primary motive of that work was to allow modifying the capacity of nodes dynamically. When the capacity is reduced on a fully allocated node, we should handle it more gracefully. Per YARN-1011 parlance, we should demote these containers to being called opportunistic. Sometimes, this might not be possible/allowed and the capacity update should fail. We can discuss this more on YARN-291. , YARN-3933 is addressing the same issue. ]