[ I am no sure does it works, have you tried configuring by escaping the space? , Hi [~rohithsharma] thank you for looking into the issue .

Escaping should work havn't tested it yet . 

{noformat}
-Dyarn.app.container.log.dir=<PATH>/container\ logs/application_1450332140888_0007/container_1450332140888_0007_01_000063 -Dyarn.app.container.log.filesize=0 -Dhadoop.root.logger=INFO,CLA -Dhadoop.root.logfile=syslog org.apache.hadoop.mapred.YarnChild <ip port > attempt_1450332140888_0007_m_000007_2 63 1><PATH>/container\ logs/application_1450332140888_0007/container_1450332140888_0007_01_000063/stdout 2><PATH>/container\ logs/application_1450332140888_0007/container_1450332140888_0007_01_000063/stderr
{noformat}

The paths mentioned above "\ " we could use in unix if path contains space . Will upload a patch soon.
Any other solution?, I am not very sure how you are planning to  fix  this. {{%20}} is an option correct? like URL., Hi [~sunilg]
To explain the problem further.
In launch_container.sh we create exec  command for launching yarn child <space> in path cause unexpected results like failure of container launch.
URL encoding might not work in this one. Either the path should be in "" or for space we should use escape character. if we use   *XXXXX%20XXXX* to append out and err stream will create a file with name *XXXXX%20XXXX* not *XXXXX<SPACE>XXXX* file rt?, Thanks for share the details. 
Yes, for file names "Escape Character" looks like a viable option for me., [~sunilg]/[~rohithsharma]
Another option can we to skip all those paths with space. For both nmlocal-dir and nm-log-dir, [~bibinchundatt], thanks for raising this issue. The issue is because command line arguments have to be quoted if they carry spaces. This issue would not only be with log dirs but local dirs as well. And the issue IIUC may not only be restricted to DCE but LCE as well.

This can be resolved by putting wherever log dirs and local dirs are used within single quotes(') and double quotes(") when we create the different scripts such as launch_container.sh
Please note we already do this when we export environment variables in the script. But some places it has not been handled.
I was for instance able to fix the issue reported in the JIRA and run the job successfully after making changes in ContainerLaunch#call (by putting a single quote around the command line java property values where LOG dir had to be expanded).

You can discuss with me offline and then we can work towards a more comprehensive fix for the issue.]