[I feel like ordering the charts to only two rows breaks the width/height balance of the whole page and does not work well on typical 16:9 screens (not to mention 4:3 ones). However, what do you think of moving the Node Managers chart to the 2nd row (see in the attached patch)? This balances the page and it gets closer to the cluster resources (as you suggested). , [~GergelyNovak] Thank you for the patch.  The dashboard looks better with your patch.  Original proposal wasn't strictly bound to two rows, but we can have second row charts to auto flow base on browse width.  New charts can be added to fill up the empty space.  Bootstrap can specify the screen resolution to assist the auto flow base on media resolution, and we can probably auto-flow two charts to third row base on browser width.  I agree with you that if someone maximize browser on 16:9 TV.  The two rows to fill out the horizontal real estate is not helping, and we probably want to create more charts to fill up the empty space or increase the chart heights of second row to the same height as the first row. 

 

Small nits that Memory and VCore are also related to system resource, which are more closely related to Cluster Resource on the top row.  Would it be better to move Finished Apps and Running Apps to third row?  Memory-mb and Vcores probably need capitalization for correctness.  Thoughts?, ??Small nits that Memory and VCore are also related to system resource, which are more closely related to Cluster Resource on the top row. Would it be better to move Finished Apps and Running Apps to third row???

There are two problems with it:
 # one might say that Finished/Running Apps are also related Cluster Resource Usage by Applications in the top left corner
 # the number of resources in the (current) 3rd line is not necessarily 2. We might have additional resource types (GPUs, etc, see YARN-7330), so we should leave the opportunity for this last row to "overflow", we shouldn't add any other charts to it or move it up.

 , [~GergelyNovak] Cud u pls attach screen shot as per latest patch. Also pls keep resources in same line (gpu etc to be shown later), [~sunilg] Please find the attached screenshot. All I did was moved the Node Managers to the 2nd row, didn't touch the resources., perfect! Thanks [~GergelyNovak]., I would like to get this in sooner. [~eyang] could you please check whether this approach is fine. Thanks.]