[Hi [~bibinchundatt]

I would like to take this as I made some recent related GUI changes. Will help in providing a patch soon. Pls let me know if any issues., Hi [~sunilg]
Not a problem. please continue., Hi [~sunilg],
IMO its slightly related to the issue which i had mentioned in YARN-4415 (refer the attached images which shows as 100% but the app diagnostic info doesn't launch as abs capacity & max capacity is 0%).
Basically this issue is happening because when {{QueueCapacitiesInfo.getPartitionQueueCapacitiesInfo(String)}} called for a particular partition if capacity information is not there then we create a *PartitionQueueCapacitiesInfo* which takes 0 as capacity and *100* as max capacity (even we take 1 as the default value as suggested by [~wangda]  we face the same problem). 
Both these values needs to be *zero* based on current implementation.  Size will get reset to *0*, when there is non exclusive sharing of resources to this queue for apps in default partitions as there will be an proper entry in {{QueueCapacities}} which was earlier not there.
Once we correct this then size is getting reset to zero will not be there on these particular cases. , Attaching a snapshot where in the Absolute Max capacity of a queue is zero but the overall usage of a partition is greater than 100 % and a given's queue's usage is 300 % and configured max capacity is 100% but absolute configured max capacity is 0%. So overall statistics are going wrong., Hi [~sunilg],
Further to this as i was discussing offline, i think the queue's max capacity is shown as zero but in Non exclusive mode max resource usage for a qiven queue is 100% of the non exclusive partition resource. So though queue's absolute max capacity is zero(or any configured value), used capacity can go greater than max capacity, hence i feel max absolute max capacity should be 100% for all queue's in non exclusive partition, OR we may be the absolute max capacity bar can be 100% and instead of just specifying {{"Absolute Max Capacity"}} we can specify  {{"Absolute Max Capacity(in Exclusive Mode)"}}.
Thoughts ?
, Thanks [~Naganarasimha Garla] for sharing detailed thoughts and for the sample pblm ui.

As I see this, we will have a case of over usage and under usage. But in short, I agree that metrics are coming wrong when mappings are not configured correctly (or left with default). I will make code change as suggested to  see whether this scenario is covered by the YARN-4415. Also will update the test scenario and will share detailed analysis in a short while.]