[[~gagan.bansal@gmail.com]
Have you configured the 
{code}
<name>yarn.log.server.url</name>
{code}
in the yarn-site.xml for container log redirection for the case you want to check the container log when the app finished ?, Hi Xuan,

Yes I forgot to mention it, I did try to both in the yarn-site and mapred but couldn't get success either. I will retry with yarn-site. Could you tell me is the following value correct for 
<name>yarn.log.server.url</name>
<value>localhost:jobhistory port</value>

I think I might have put in the incorrect port earlier. What would be the correct port to put in and where to get it from ?
Also when I googled about this error, one of the links mentioned the creation of stderr file, where is it created ?, Hi Xuan,

Could you please confirm upon the points mentioned in my previous comment ?, Hi Gagan,
The below convention in configuring the log server url.

{CODE}
<property> 
 <name>yarn.log.server.url</name> 
 <value>http://$jobhistoryserver.full.hostname:port/jobhistory/logs</value>
 <description>URL for job history server  </description>
</property>
{CODE}

Note: 
The port should be the port being used for the mapreduce.jobhistory.webapp.address.
for example if the mapreduce.jobhistory.webapp.address has the value ip1:10988, then the host and port for the log server shuld ip1:10988

Please verify once your configuration.
, Hi Mohammad,

May be I am making a fundamental mistake.

My target is to run - wordcount example jar with 2.7.1 on yarn in a psuedo distributed mode (on my laptop). 

When I run it I get an exception, in order to check what it is  I am trying to look for logs at 
http://garima-pc:8088/cluster/apps/FAILED to http://garima-pc:8088/cluster/app/application_1439303739376_0001 to logs link and after implementing what you have described it takes me to a link
http://garima-pc:19888/jobhistory/logs/Garima-PC:50415/container_1439303739376_0001_02_000001/container_1439303739376_0001_02_000001/Garima
which is broken. seems like port 50415 port is getting dynamically generated.
I am attaching my configuration xml files., It should go +to the link 
http://garima-pc:49712/jobhistory/logs/Garima-PC:50415/container_1439303739376_0001_02_000001/container_1439303739376_0001_02_000001/Garima

Seems like you have not restarted the Cluster after the configuration change., Hi Mohammed,

I reverted the property to 
  <property>
    <name>mapreduce.jobhistory.address </name>
    <value>Garima-PC:10020</value>
  </property>
  <property>
    <name>mapreduce.jobhistory.webapp.address</name>
    <value>Garima-PC:19888</value>
  </property>
in map reduce.xml
and to 
<property> 
   <name>yarn.log.server.url</name> 
   <value>http://Garima-PC:19888/jobhistory/logs</value>
   <description>URL for job history server  </description>
  </property>
in yarn-site.xml. Restarted everything!!
I am directed to http://garima-pc:19888/jobhistory/logs/Garima-PC:49552/container_1439399185544_0001_02_000001/container_1439399185544_0001_02_000001/Garima 
again the link is broken. Could you tell me if I can check the logs anywhere else, I need to find what went wrong with running the wordcount.jar example ?
, Hi Mohammed,

I am not sure what difference came in hadoop configs but I configured everything from scratch using the following link
https://hadoop.apache.org/docs/stable/hadoop-project-dist/hadoop-common/SingleCluster.html#YARN_on_Single_Node

The error
"Failed while trying to construct the redirect url to the log server. Log Server url may not be configured
java.lang.Exception: Unknown container"

disappeared and I could see standard err, out files, which contain the following 

Error: Could not create the Java Virtual Machine.
Error: A fatal exception has occurred. Program will exit.

I tried setting various values of 
set HADOOP_HEAPSIZE=512
but in vain, a value over 512 did not start the daemons. I have 8 gb ram.

Could you help me on the same ?
]