[This appears to be caused by YARN-2704.  YARN-2964 tried to fix it but assumed that Oozie launcher jobs will always run for the duration of the sub-jobs.  This is true when the launcher runs a Pig job, but apparently is not true when it runs a standard MapReduce job., Daryn is out so posting a prototype patch he developed to get some early feedback.  Note that this patch can't go in as-is, as it's a work-in-progress that hacks out the automatic HDFS delegation token logic that was added as part of YARN-2704.

Essentially the idea is to reference count the tokens and only attempt to cancel them when the token is no longer referenced.  Since the launcher job won't complete until it has successfully submitted the sub-job(s), the token will remain referenced throughout the lifespan of the workflow even if the launcher job exits early., {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12709044/YARN-3439.001.patch
  against trunk revision eccb7d4.

    {color:green}+1 @author{color}.  The patch does not contain any @author tags.

    {color:green}+1 tests included{color}.  The patch appears to include 1 new or modified test files.

    {color:green}+1 javac{color}.  The applied patch does not increase the total number of javac compiler warnings.

    {color:green}+1 javadoc{color}.  There were no new javadoc warning messages.

    {color:green}+1 eclipse:eclipse{color}.  The patch built with eclipse:eclipse.

    {color:red}-1 findbugs{color}.  The patch appears to introduce 2 new Findbugs (version 2.0.3) warnings.

    {color:green}+1 release audit{color}.  The applied patch does not increase the total number of release audit warnings.

    {color:green}+1 core tests{color}.  The patch passed unit tests in hadoop-yarn-project/hadoop-yarn/hadoop-yarn-server/hadoop-yarn-server-resourcemanager.

Test results: https://builds.apache.org/job/PreCommit-YARN-Build/7200//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-YARN-Build/7200//artifact/patchprocess/newPatchFindbugsWarningshadoop-yarn-server-resourcemanager.html
Console output: https://builds.apache.org/job/PreCommit-YARN-Build/7200//console

This message is automatically generated., bq. Essentially the idea is to reference count the tokens and only attempt to cancel them when the token is no longer referenced. 
   Would be a good idea. I think this is the third time we have had delegation token renewal broken for Oozie with the Hadoop 2.x line. , I think at YARN-2964 we were so focused on not canceling the token that we forgot about future renewals.

IAC, this is a dup of YARN-3055., IIUC, isn't this a long-standing issue that Ozzie doesn't set "mapreduce.job.complete.cancel.delegation.tokens" to false for standard MR Job ? according to [here | https://issues.apache.org/jira/browse/YARN-2964?focusedCommentId=14250926&page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel#comment-14250926]. Should we set it to false on Ozzie side ?, I believe it is setting that to false, as that behavior hasn't changed on the Oozie side.  However this isn't an issue of the token being cancelled but rather expiring.  The RM properly avoids cancelling the token when the launcher job exits, but it then forgets to keep renewing it as well.  Eventually the token expires and downstream jobs fail (if they run long enough)., bq. IAC, this is a dup of YARN-3055.

Agreed, closing as a duplicate.]