[JIRA is for tracking features and defects in Apache Hadoop and not for general user support.  This is not a problem in Apache Hadoop but rather a problem with the network setup of the hosts.  See https://wiki.apache.org/hadoop/InvalidJiraIssues and https://wiki.apache.org/hadoop/UnknownHost for more details.  I highly recommend asking this on the [Hadoop user mailing list|http://hadoop.apache.org/mailing_lists.html#User] where hopefully someone with experience setting up a Kubernetes cluster to run Apache Hadoop can assist you.
, I think it's a valid report even if it's not a bug but rather a improvements/feature request. I understand that the current Yarn couldn't be start without dns system, but it's a valid request to make it usable (at least without kerberos) in an ip only environment (such as kubernetes without statefulset). It's not just about kubernetes but there are cloud providers where the dns (or at least the reverse dns) is not guaranteed. Therefor a setting to use ip only yarn without dns/reversedns would help to use Hadoop in these environments (even if there are limitations of this approach).  , bq. java.lang.IllegalArgumentException: java.net.UnknownHostException: hadoop-slave-743067341-hqrbk

I'm a bit confused.  Why is the node resolving itself as "hadoop-slave-743067341-hqrbk"?  I believe that's the hostname self-reported during registration.  If this is truly an ip-only environment, presumably that means the junk hostname is only in that node's /etc/hosts, but not in /etc/hosts of the other nodes?  I understand not having reverse dns.  However not having forward dns but assigning a private hostname is a bit obtuse, might as well not let the host resolve itself if nobody else can resolve it...

Did you try setting {{hadoop.security.token.service.use_ip=false}} per the javadocs on buildTokenService?  That will get you past the exception while generating the container token.  It's likely the client won't be able to locate the token though – ie. token will have a host, but if the env is ip-only, the client must use an ip to connect and won't be able to match the ip with the hostname in the token.

]