[Please attach logs separately instead of pasting inline. Too hard to read., Attaching log., I also ran into this usability issue. At first glance, the word "killed" made me think that something went wrong.
It would have been much more clear to me if I saw something like this:

"Container finished by the ApplicationMaster"

or when something was wrong:

"Container killed by the ApplicationMaster"
, Closing this as duplicate as YARN-903 shows the latest misleading log messages. Attaching patch and fixing there., Hello,

I am seeing this in Note section of each map task. Each of Map task state is SUCCEEDED.

Message:
attempt_1399912169384_0001_m_000013_0	100.00	SUCCEEDED	map	datanode-9-281920.slc01.dev.company.com:8042	logs	Mon, 12 May 2014 16:33:33 GMT	Mon, 12 May 2014 16:34:26 GMT	52sec	Container killed by the ApplicationMaster. Container killed on request. Exit code is 143 Container exited with a non-zero exit code 143

Hadoop Details:
NameNode 'namenode-284133.slc01.dev.company.com:8020' (active)

Started:	Tue May 06 16:18:04 GMT-07:00 2014
Version:	2.4.0.2.1.1.0-385, 68ceccf06a4441273e81a5ec856d41fc7e11c792
Compiled:	2014-04-16T21:24Z by jenkins from (no branch)
Cluster ID:	CID-fb86b3cf-7787-4c67-998f-24f00e43c137
Block Pool ID:	BP-1163369527-10.65.216.196-1399412949036, I don't believe this is related to YARN-903, rather it seems more likely to be related to MAPREDUCE-5465.  The MapReduce ApplicationMaster kills tasks as soon as they report success via the umbilical connection, and sometimes that kill arrives before the task exits on its own.  In those cases the containers will be marked as killed by the ApplicationMaster., In my case the reducers were moved to COMPLETED state after 22 mins, they had reached 100% progress at 15 mins. Blocking other reducers start.
Is there some setting that i could tweak to stop seeing this behavior ?, bq. In my case the reducers were moved to COMPLETED state after 22 mins, they had reached 100% progress at 15 mins.

Having progress reach 100% but the task not completing for 7 more minutes is an unrelated issue.  Check your reducer logs and/or the input format which is responsible for setting the progress.  This is probably a question better suited for the user@hadoop.apache.org mailing list.]