[+1. We also need a ticket in MAPREDUCE rt, Could you please link that to this for better traceability., I think MR changes can be done in this JIRA itself since MR changes are less. , [~sunilg]/[~naganarasimha_gr@apache.org]/[~rohithsharma]
Along with queue we have to send label too when default queue label is specified. AM side blacklisting based on partition same will be required., bq. Along with queue we have to send label too when default queue label is specified. AM side blacklisting based on partition same will be required.
Yes. But this JIRA is slightly different in intention. We will do that in YARN-6148 or some other JIRA which will have to be raised. Right?
Basically label information will have to passed for each Container info which is sent upon allocation., Probably you mean that we report default label of the queue to which job has been submitted to in this JIRA. And also report it when application moves to a new queue.
+1 to doing that in this JIRA. 
But I think MAPREDUCE related changes with regards to blacklisting for it can be done separately. Thoughts?
, Sorry to ask this question. I didnt really get this :(
bq.default label of the queue
Why this is needed at MR side. MR just need to know its AM label expression and map/reducer label expression rt. , Basically in SchedulerUtils while normalizing ask after receiving it from AM, we will change the label expression in ask to default queue label expression or the one in ASC if none is specified.
RM would store asks alongwith this label. Now when RM reports to AM the label to node count info in YARN-6148, it needs to correlate if this is the default queue label expression or the one in ASC or not to ascertain how to consider it while ignoring blacklisting.
Thoughts?, Ideally its better if we get an update from RM regarding the real AM' label. Let it be coming from ASC or from default label of queue etc. Given that information in {{RegisterApplicationMasterResponse}}, MR will have idea about AM containers label. So rather passing as queue;s default label, it could be passed as AM's label. Now other containers(map/reduce) label are available from container info rt ? 

I agree there are some more grey areas here
# change label of a node at runtime which will impact running containers as well.
# container launched on a non-exclusive label

If per-label-node-count for requested partition is buffered at RM level, could we NOT make it dirty when node label s changed in a node. Any way such containers are prone for preemption when a real ask is available for new label.
As mentioned, I think you are not planning to add this count, correct?
, My thoughts. Probably you meant the same in comment above.
I think what we should report is default applicable label for the application. This can be either from ASC or default label of the queue (or whatever applicable default label is chosen due to future modifications).
And this needs to be reported on both register AM response and on allocate response as the application can move across queues.

Probably we can move this discussion over to YARN-6148 so that we can discuss in detail as this is more related to AM blacklisting.
I will summarise the offline discussion we just had with you there as well
, Going through whole discussion above, I would suggest to keep this JIRA only for notifying queue name into AM. Label related changes would discuss separately. One of the major difference I see is, changing queue name is *user operation* which has to be informed to ApplicationMaster i.e via push by YARN to AM. To the labels, we may need new first class API that gives full details about QueueInfo which could be a pull model. , I agree we can do that in another JIRA. We were initially thinking of reporting default label of queue and this would go hand in hand with move operation as well. Hence had suggested doing it here.
But upon checking further I proposed that we should report something called default applicable label for an app.
If we do that, it does not fall within the scope of this JIRA and as you said this also requires more discussion.

Whether labels should be pulled or pushed, we can discuss further on YARN-6148. We were thinking of pushing. If they are to be pulled we need to decide when to pull them.
Anyways that's not a discussion related to this JIRA. And can be discussed on YARN-6148.
]