[Is this because the ContainerLocalizer is launched in a separate process from LCE with a timeOutInterval of 0?, No, rather it's more an issue that there's no concept of heartbeat timeouts coming from the container localizer.  The localization service starts a localizer then expects that localizer to phone in via heartbeats to control it.  It doesn't track the pid or any other way to normally control it.  The problem with using a timeout interval at the Shell level is that it puts a hard limit on how long to localize something, and there may be cases where we want to keep localizing because good progress is being made (e.g.: large docker container download).  The other issue is that during NM restarts we no longer have a Shell instance associated with those processes since they are no longer children of the new NM process.

IMHO the clear indication something is amiss is that startLocalizer returns void.  There's no pid or cookie of some kind to associate with the localizer instance.  It's fire-and-forget.  Once we start the localizer we can't stop it without it voluntarily heartbeating, and if the localizer goes rogue and refuses to heartbeat or respond properly to heartbeat commands the NM can't force it to stop like it can with normal containers.  The localizer should be tracked like containers are tracked so we can control them like we can control containers., bq. The localizer should be tracked like containers are tracked so we can control them like we can control containers.
+1. This really becomes a problem for containers with large sized resources(like docker). We have to be able to kill a localizer., Note that we can get localizers to stop today (e.g.: when the corresponding container being localized is killed), but only if the localizer is well-behaved.  So even with large sized resources as long as the localizer heartbeat thread is still heartbeating to the NM and can respond properly to heartbeat commands things end up working out OK.  It becomes a problem when the localizer _doesn't_ behave properly and needs external intervention.  I don't think that's common in practice, but it does happen sometimes., @Varun Vasudev hi Varun, I am reading localizer code recently, maybe I can take this job.]