[{color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12622780/YARN-1599.v01.patch
  against trunk revision .

    {color:green}+1 @author{color}.  The patch does not contain any @author tags.

    {color:red}-1 tests included{color}.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    {color:green}+1 javac{color}.  The applied patch does not increase the total number of javac compiler warnings.

    {color:green}+1 javadoc{color}.  The javadoc tool did not generate any warning messages.

    {color:green}+1 eclipse:eclipse{color}.  The patch built with eclipse:eclipse.

    {color:green}+1 findbugs{color}.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    {color:green}+1 release audit{color}.  The applied patch does not increase the total number of release audit warnings.

    {color:green}+1 core tests{color}.  The patch passed unit tests in hadoop-yarn-project/hadoop-yarn/hadoop-yarn-server/hadoop-yarn-server-resourcemanager.

    {color:green}+1 contrib tests{color}.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-YARN-Build/2882//testReport/
Console output: https://builds.apache.org/job/PreCommit-YARN-Build/2882//console

This message is automatically generated., Thinking more about it, there is too much redundant clicking on this page. When the app runs, or there is a post-mortem tracking url, users want to go there in the first place. I suggest to consider always redirecting to the tracking url if available., Is there any way to get the regular RM app page if there is a tracking URL?  What if the tracking URL is provided but a broken link?  And in the past there have been occasions where the RM app page provided crucial diagnostics or additional info (e.g.: due to bug/race/whatever history server does not have record of job but RM has links to AM logs, diagnostic message from AM, etc.), {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12623517/YARN-1599.v02.patch
  against trunk revision .

    {color:green}+1 @author{color}.  The patch does not contain any @author tags.

    {color:red}-1 tests included{color}.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    {color:green}+1 javac{color}.  The applied patch does not increase the total number of javac compiler warnings.

    {color:green}+1 javadoc{color}.  The javadoc tool did not generate any warning messages.

    {color:green}+1 eclipse:eclipse{color}.  The patch built with eclipse:eclipse.

    {color:green}+1 findbugs{color}.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    {color:green}+1 release audit{color}.  The applied patch does not increase the total number of release audit warnings.

    {color:green}+1 core tests{color}.  The patch passed unit tests in hadoop-yarn-project/hadoop-yarn/hadoop-yarn-server/hadoop-yarn-server-resourcemanager.

    {color:green}+1 contrib tests{color}.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-YARN-Build/2902//testReport/
Console output: https://builds.apache.org/job/PreCommit-YARN-Build/2902//console

This message is automatically generated., Hi Jason, thanks for good questions. I added a boolean "redirect" parameter (true by default) that can disable redirect. Further more I swapped links being used from "ID" and from "tracking UI" on AppsBlock. The main link that all our users click first redirects to tracking URL, and the right most link uses AppBlock "Application Overview". I'll attach screenshots., YARN-1599.v03 , {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12623571/YARN-1599.v03.patch
  against trunk revision .

    {color:green}+1 @author{color}.  The patch does not contain any @author tags.

    {color:red}-1 tests included{color}.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    {color:green}+1 javac{color}.  The applied patch does not increase the total number of javac compiler warnings.

    {color:green}+1 javadoc{color}.  The javadoc tool did not generate any warning messages.

    {color:green}+1 eclipse:eclipse{color}.  The patch built with eclipse:eclipse.

    {color:green}+1 findbugs{color}.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    {color:green}+1 release audit{color}.  The applied patch does not increase the total number of release audit warnings.

    {color:green}+1 core tests{color}.  The patch passed unit tests in hadoop-yarn-project/hadoop-yarn/hadoop-yarn-server/hadoop-yarn-server-resourcemanager.

    {color:green}+1 contrib tests{color}.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-YARN-Build/2903//testReport/
Console output: https://builds.apache.org/job/PreCommit-YARN-Build/2903//console

This message is automatically generated., I actually argue the contrary. We still have many cases where we don't have tracking URLs for whatever reasons. So, I proposed a solution quite opposite to what is being put up here - to always force the users to land on the RM page - see YARN-1140. It is more clicks as argued here, but at the least we can then be consistent. Similarly see YARN-1106.

I can't find the JIRA but given bulk of YARN-321 is done, we are changing the RM UI to add much more information than is present. Clearly the per-framework UI > RM UI in terms of data richness but the second UI isn't trivial anymore.

bq. our users think that the AppMaster logs were lost because the link to the AM attempt logs are not updated and result in HTTP 404
Why don't we fix this issue if that is the driving force. I don't expect a 404 if users go through the proxy (which they should!). Can you throw more light on when this can happen?, [~vinodkv], with v03 we are no longer forcing the redirect. I agree with this point, raised by [~jlowe] as well. You can still access the RM app via the corresponding link, as you can see from the screenshot. I simply moved the tracking UI link that our users really want to see to the 1st column. And now users tend to click it first. 

bq. Why don't we fix this issue if that is the driving force. I don't expect a 404 if users go through the proxy (which they should!). Can you throw more light on when this can happen?

However, you are correct that 404 on the link from RM app to AM logs should be fixed as well. 404 is caused by the log aggregation after the local logs are deleted., I'd rather not change the meaning of the exisiting URLs.  If the user wants to see the app-specific UI if there is one, that's the purpose of the proxy URL provided by the job client when the job launches.  If the user wants to see the RM's details on the application then that's the purpose of the RM app URL.

If the issue is users tend to click on the left link instead of the right link when they want to go to the app-framework-specific UI for an app then I'd rather discuss swapping the links in the application table rather than change what URLs go where by default.

bq. However, you are correct that 404 on the link from RM app to AM logs should be fixed as well. 404 is caused by the log aggregation after the local logs are deleted.

I'm confused about the 404 scenario.  If log aggregation is configured and working properly, the NM should redirect to the aggregated logs server when the logs are not present, and the logs are not deleted until log aggregation completes.  The user would briefly see "Redirecting to log server for container_xxx" during the redirect.  Is yarn.log.server.url configured properly?, [~jlowe] thanks for pointing in the right direction. E.g., setting yarn.log.server.url to {code}http://${mapreduce.jobhistory.webapp.address}/jobhistory/logs{code} solves the problem on the pseudo-distributed cluster., For the log links, we could set yarn.log.server.url. And if the app is finished, it will automatically redirect to the configured url.
[~jira.shegalov] Do we still need this ? I will close this. Feel free to re-open this ticket if you think that we still need this.]