[I would like to work on this.  Would u mind if I take this. 

Thank u...  , go for it.  Thanks!, Uploading an initial version patch.

* "Container ID" is shown only for Running containers in App Attempt page. Change the column name to "Running Container ID"
* "AM Container" is showing the container link when Attempt is running, else showing the container ID in plain text. Here we can change label to "AM Container Link" in case when AM is running and "AM Container ID" while AM is finished or killed
* AM Container logs are shown in App page but not app attempt page. An entry is added for same as "AM Container Logs", Attaching an updated version of patch. Also attaching screen shots of UI. [~tgraves] Could u please take a look on this. Thank you., [~tgraves] Could you please take a look on the screen shot which I attached and share your opinion., Rebasing patch against latest trunk., [~sunilg] If it is "Running Container ID", is it still necessary to include "Container Exit Status" ?  And any reasons to exclude the killed containers here ? I think it would be helpful to diagnose if all the containers are included. 
, Hi [~jeffzhang]
Thank you for pointing this. {{Container Exit Status}} must not be present in AppAttempt page. I will remove the same and upload a patch.

For RM WebUI, we are using {{ClientRMService}} alone, and ATS/AHS is not contacted here to get container info. Also RM keeps tracks of running containers here and the idea is to keep information about completed containers in ATS/AHS UI. When application is finished/running, ATS UI is capable of giving detailed information about the application (containers info also). , Still feel excluding failed container doesn't make sense. If some of my containers fail during job running, how can I check its logs through web ui if I don't want to kill the job ? , Hi [~jeffzhang]
Thank you for sharing the thoughts. I could remember an old JIRA YARN-1809, where UI is made similar for RM and HistoryServer.
Here we use {{getContainers)), where History/Timeline fills containers info from ApplicationContext (has all container info). But RM was taking from RMContext where only live containers are taken. I understood the need of killed containers here. it can help in debugging. However we have to segregate killed/preempted containers from completed containers. 

Hi [~leftnoteasy]
I also feel that we can have the information about killed/preempted container along with running containers in app attempt UI. In YARN-1809, we added for only running containers. Could you pls share your thoughts here.

, I think this patch  has gone stale and I feel we can move this ticket forward.
[~rohithsharma] / [~xgong] / [~tgraves] Could you please help to check the screen shots attached and see if its a good addition.

Also would like to propose one point which got discussed with Jeff about killed container. Is it good to have that information in RM UI. Any known reasons why we do not have killed/preempted container list in UI. 
Thank You.]