[bq. If a NM node shuts down, RM will not mark it as LOST until liveness monitor finds it timeout. However before that, RM might continuously allocate AM on that NM.
Is scheduler is enabled with async scheduling mode? In normal way, allocation will happen when there is node heartbeat is received. If node is shutdown, node does not send heartbeat. I am thinking how can RM allocate container to same node if NM is shutdown provided async scheduling mode is not enabled. Am I missing any critical point here?

bq. we could add the NM to AM blacklist if RM failed to launch it.
What is the reason for launch failure? YARN-2005 provide support for blacklisting scheduling AMs node but it has design level issue which would cause issue like YARN-4685, Thanks [~rohithsharma] for looking into the issue.

{quote}
Is scheduler is enabled with async scheduling mode? In normal way, allocation will happen when there is node heartbeat is received. If node is shutdown, node does not send heartbeat. I am thinking how can RM allocate container to same node if NM is shutdown provided async scheduling mode is not enabled. Am I missing any critical point here?
{quote}
Yes, we use FairScheduler with continuousScheduling enabled.

{quote}
What is the reason for launch failure? YARN-2005 provide support for blacklisting scheduling AMs node but it has design level issue which would cause issue like YARN-4685
{quote}
AMLauncher failed to launch AM because the NM had already shut down and it can not connect to it, then RMAppAttempt's state transitioned from *RMAppAttemptState.ALLOCATED* to *RMAppAttemptState.FINAL_SAVING* with receiving event *RMAppAttemptEventType.LAUNCH_FAILED*. However now we are considering add NM to blacklist only for cases that RMAppAttempt's state transitioned from *RMAppAttemptState.RUNNING* to *RMAppAttemptState.FINAL_SAVING*., Thanks for clarifying my doubts. I think this is very good scenario for AM node blacklisting to be consider. Keeping cc:/ [~sunilg] [~vvasudev] [~vinodkv] let also they know about scenario. As I said, there are design level issue in YARN-2005, so need to wait for proper solution. Ex : Node is not reachable so that node is blacklisted. Since other nodes are busy, the same  node comes back(registered) where in new node is not considered for allocation. See YARN-4685]