[Thanks for reporting issue. Would like to work on this?, Or shall I take over the issue?, Sure, please take it over. , Sure, please take it over. , Kindly review attached patch, {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12689660/0001-YARN-3000.patch
  against trunk revision e7257ac.

    {color:green}+1 @author{color}.  The patch does not contain any @author tags.

    {color:red}-1 tests included{color}.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    {color:green}+1 javac{color}.  The applied patch does not increase the total number of javac compiler warnings.

    {color:green}+1 javadoc{color}.  There were no new javadoc warning messages.

    {color:green}+1 eclipse:eclipse{color}.  The patch built with eclipse:eclipse.

    {color:green}+1 findbugs{color}.  The patch does not introduce any new Findbugs (version 2.0.3) warnings.

    {color:green}+1 release audit{color}.  The applied patch does not increase the total number of release audit warnings.

    {color:green}+1 core tests{color}.  The patch passed unit tests in .

Test results: https://builds.apache.org/job/PreCommit-YARN-Build/6225//testReport/
Console output: https://builds.apache.org/job/PreCommit-YARN-Build/6225//console

This message is automatically generated., It's worth pointing out that YARN_PID_DIR is effectively deprecated in trunk.  The variable is still honored, but HADOOP_PID_DIR is documented and used as the default., Thanks [~aw] for pointing out YARN_PID_DIR is deprecated.
[~zjffdu], what do you think? Can I close this jira?, It makes sense to make YARN_PID_DIR as deprecated if HADOOP_PID_DIR is used for yarn in trunk. , BTW, what's the jira for making HADOOP_PID_DIR to replace YARN_PID_DIR ? As I know hadoop-2.6 didn't do that. , It was part of HADOOP-9902, thus why it isn't in branch-2 at all, much less 2.6, [~aw] THanks for clarification, then it make sense to make YARN_PID_DIR deprecated. , Thanks [~aw] for mentioning the lira id. I will close the issue as Not a problem.]