[Attaching the patch., {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12551936/MAPREDUCE-4768.branch-trunk-win.scripts.patch
  against trunk revision .

    {color:green}+1 @author{color}.  The patch does not contain any @author tags.

    {color:red}-1 tests included{color}.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    {color:green}+1 javac{color}.  The applied patch does not increase the total number of javac compiler warnings.

    {color:green}+1 javadoc{color}.  The javadoc tool did not generate any warning messages.

    {color:green}+1 eclipse:eclipse{color}.  The patch built with eclipse:eclipse.

    {color:green}+1 findbugs{color}.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    {color:green}+1 release audit{color}.  The applied patch does not increase the total number of release audit warnings.

    {color:green}+1 core tests{color}.  The patch passed unit tests in .

    {color:green}+1 contrib tests{color}.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/2985//testReport/
Console output: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/2985//console

This message is automatically generated., Moving to YARN and re-linking to YARN umbrella jira. Ivan, YARN is now an independent project and so changes to YARN are tracked separately from MAPREDUCE., yarn-config.cmd seems to miss some stuff thats present in the sh version like setting conf dir, slavefile and malloc_arena env var ?

yarn.cmd
could you please elaborate on the --service option? seems to be missing from from comments and usage display. Looks like the order of the arguments wrt this option is important?

could you please double check if this comment is valid?
{code}
+@rem This changes %1, %2 etc. Hence those cannot be used after calling this.
{code}

statements like the following seem replicated in yarn-env.cmd and yarn.cmd
{code}
+  set YARN_OPTS=%YARN_OPTS% -Dhadoop.log.dir=%YARN_LOG_DIR%
{code}
, bq. yarn-config.cmd seems to miss some stuff thats present in the sh version like setting conf dir, slavefile and malloc_arena env var ?
Thanks, fixed in the next iteration. conf dir was previosly set in yarn.cmd, but it makes sense to move it to yarn-config for consistency.

bq. could you please elaborate on the --service option? seems to be missing from from comments and usage display. Looks like the order of the arguments wrt this option is important?
I removed the service option altogether since it is not needed at the moment. When it becomes needed, we'll bring it back.

bq. Could you please double check if this comment is valid?
This is valid, after {{shift}} cmd line arguments are shifted to the right.

bq. statements like the following seem replicated in yarn-env.cmd and yarn.cmd
Yes, I saw this while doing the changes, at this point I just replicated the logic from the corresponding sh scripts. Let me know if you'd like to fix this now in cmd.

, Attaching updated patch including the start/stop scripts (not complete, see comment in HADOOP-9005).

Bikas, thanks for reviewing. Your feedback should be addressed in the updated patch. , Thanks!
MALLOC_ARENA_MAX seems to be still missing from the patch. It is set in yarn-config.sh and I see it referenced a lot in the code.

Would be good to not replicate setting the env vars., I have successfully tested starting a resourcemanager and nodemanager with these scripts.  If you upload a new patch to address the feedback from Bikas, I will retest too.  Thank you!, Thanks Bikas, Chris for reviews and testing.

bq. MALLOC_ARENA_MAX seems to be still missing from the patch. It is set in yarn-config.sh and I see it referenced a lot in the code.
Bikas, I would prefer not to include MALLOC_ARENA_MAX, seems to be specific to the GNU C lib. See HADOOP-7154.

bq. Would be good to not replicate setting the env vars.
Thanks, will fix this.

, Attaching updated patch., +1

I retested successfully with the new patch.  I agree on MALLOC_ARENA_MAX too.  Thanks, Ivan!
, +1, +1. Thank you Ivan. Committed the patch to branch-trunk-win.]