[I'd like to look into this, but I cannot assign this bug to myself. Can someone assign this to me or give me permissions? Thanks., I gave you contributor status so you can be assigned jira., I haven't seen any updates on this, so assigning this to another contributor. Feel free chime in if you're still wanting this. I'd like to get this committed in the next week or so., REST API is showing wrong number of pending applications as it was populating the value from *pendingApplications set* (i.e. size of pendingApplications set). IMO, it should get the value from Queue metrics instead of getting from in-memory data structures.

LeafQueue : 
{noformat}
1) *pendingApplications* : all submitted applications will be added to this set first. 

2) *activeApplications* :  applications added to this set from pendingApplications set if the number of active applications are lesser than maximum number of active applications. 
{noformat}

Jmx metrics showing appsPending metric properly. AppsPending will be incremented when the application is submitted to Queue and decremented only when the application is actually launched(i.e. allocated some resources to it). 

IMO, Rest call for queue info should also use queue metrics instead of depending on other data structures. Applications from pendingApplications set will be removed before the launching of application.

pendingApplciations set contains the applications which are not ready for schedulable at this moment.

One more interesting fact, CapacitySchedulerPage(in UI) has "Num Non-Schedulable Applications" and  getting the value form pendingApplications set. Rest API call is correct in this case.

 I am thinking couple of approaches to fix this issue:
{noformat}
1) Rename the pendingApplications to nonSchedulableApplications in CapacitySchedulerLeafQueueInfo class and introduce new fields (pendingApplications) in the CapacitySchedulerLeafQueueInfo and get this value from QueueMetrics.
  
     refactor activeApplications to schedulableApplications and introducing a new field(activeApplications) for the same which tells exactly how many AMs are there.

2. Refactor "Num Non-Schedulable Applications:" to "Num of Pending Applications"  and  refactor "Num Schedulable Applications" to activeApplications. Update properly through QueueMetrics instead of depending on in-memory data structures in the LeafQueue to get the values.
{noformat}
]