[The Spark shuffle service is not part of Hadoop but rather the Spark project.  This issue should be moved there.  It may be related to SPARK-21501, [~jlowe] Thank Jason.
I think this is more than just the spark shuffle service, after all, the spark shuffle service runs as an *auxiliary service* for *NM*. So, I think for the YARN, we need to make the *NM* stable enough. We need to separate the *auxiliary services*, as a separate process which is very necessary., OK, if that's why this was filed in YARN instead of SPARK then this is a duplicate of YARN-1593., Thank [~jlowe]. Is there a plan for this issue? It seems like it hasn't been updated for a long time. I think it's an urgent need., Looks like Varun was driving that effort but may be busy with other work.  Feel free to ping him on that JIRA for the current status.  It makes more sense to keep the discussion there where there's already earlier discussion, draft of a proposed design, and many people watching that ticket.  Splitting the discussion across that ticket and here does not make sense.  Closing this as a duplicate.

As for the urgent need, we ran into something similar and fixed the spark shuffle handler.  That's the urgent fix you need today.  Migrating it out of the NM to a separate process doesn't really solve this particular issue.  If the spark shuffle handler's memory is going to explode, it just changes what explodes with it.  It would be nice if it just destroyed the spark handler instead of the NM process, but a cluster running mostly Spark is still hosed if none of the shuffle handlers are running.  The NM supports a work-preserving restart, so you could also consider placing your NMs under supervision so they are restarted if they crash.  When doing this you will probably want to set yarn.nodemanager.recovery.supervised=true to inform the NM that it can rely on something to restart it in a timely manner if it goes down due to an error.  Not as preferable as fixing the problem in the spark shuffle handler directly, but it is an option to help your situation in the short term.
]