[I met the same issue for spark streaming job running on YARN in Hadoop 2.4 with security enabled.

I found failed period is related with 7 days, and I think it may be caused by "dfs.namenode.delegation.token.max-lifetime" that default value is 7 days. 
After 7 days application token is removed from NameNode, so application cannot access HDFS any more.

If so, how can long running service work on security cluster?, Our jobs typically run few hours. One more thing: all our jobs are launched by oozie coordinator. So sequence is following:
* A user schedules oozie coordinator job with valid kerberos ticket
* oozie spawns a workflow and issues delegation token to it
* the workflow spawns java action (YARN)
* "NM can't aggregate logs: token  can't be found in cache" error
* in result the oozie is not able to fetch action's results and terminates the workflow with following error
{code}JA017: Unknown hadoop job [job_1425460197245_1192] associated with action [0000639-150304101106345-oozie-oozi-W@RawValidatorAndParserRegular]. Failing this action!{code}, This looks like an issue fixed by YARN-2704, YARN-2790 and YARN-2964. Could you check whether YARN-2704, YARN-2790  and YARN-2964 can fix your issue?, According this [changelog|http://archive.cloudera.com/cdh5/cdh/5/hadoop-2.5.0-cdh5.3.1.releasenotes.html]
[YARN-2704] & [YARN-2964] was ported to CDH 5.3.1 already. So, these issues have no influence to found error.

I took a look to [YARN-2790] and main difference is following: my problem points to "token XXXX can't be found in cache", but [YARN-2790] to "token is expired".
, Sorry, some mistake in the changelog  for CDH 5.3.1 release, YARN-2964  is not really in CDH 5.3.1, but it is in CDH 5.3.2., [~dubislv],
Could you try the following work around to see whether it can solve your issue?
set the following property for all Oozie jobs(job client):
<property>
<name>mapreduce.job.complete.cancel.delegation.tokens</name>
<value>false</value>
</property>, This property set to *false* already. I had found a failed MR task and verified the value., Going to upgrade my cluster to 5.3.2, After upgrade to 5.3.2 the error had disappeared., issue is fixed by YARN-2964 ]