[Probably something has broken either due to change in HBase version or some other change on the reader side itself.
Let me check, Btw, I am using hbase-1.1.5. But the same hbase version is used in old build where metricslimit is working fine. 
And also I looked into tests modifying a bit. It appears in test {{metricslimit}} is working fine for ApplicationEntity. So may be issue with GenericEntity publishing. , As discussed in the call today:
- atsv2 now uses 1.2.4 (previously 1.1.3). We did not test with 1.1.5.
- we should ensure that the scan always fetches the latest version for metrics unless timerange is explicitly specified. Fetching too much data will not only affect latency but also client response set size. , I suspect this issue is not related to HBase version since it was working previous builds. However, I will verify in 1.2.4 and will post the result. , I verified in HBase-1.2.5, still the same issue. I took help from HBase committers and found a difference behavior with HBase-1.2.5. Tried from HBase Shell to create simple table and added 2 versions of values. And the result is surprising. In the below code snippet, scanning of table with maxversion is not working if we set max_version during create table. This seems to be an issue from HBase.
{code}
create 't1', {NAME => 'f1', VERSIONS => 100}
put 't2','row','f1:c','value',10000
put 't1','row','f1:c','value2',100111
hbase(main):005:0> scan 't1'
ROW                                           COLUMN+CELL
 row                                          column=f1:c, timestamp=100111, value=value2
 row                                          column=f1:c, timestamp=10000, value=value
1 row(s) in 0.0260 seconds

hbase(main):007:0> scan 't1', { VERSIONS => 1}
ROW                                           COLUMN+CELL
 row                                          column=f1:c, timestamp=100111, value=value2
 row                                          column=f1:c, timestamp=10000, value=value
1 row(s) in 0.0060 seconds
{code}

But one doubt is HBase-1.1.5 with old ATS is working fine and with new ATS i.e yarn-5355 is not working. , Ping [~vrushalic] [~varun_saxena], I am using latest hbase version i.e hbase-1.2.6. I see this error. Do you guys also test it and let me know, otherwise it will be a critical issue., Code looks fine on the ATS side. Must be an issue from HBase side I think...I will look at it tomorrow.]