[Attaching the stacktrace of the threads related to the dead lock., Seems to be related to YARN-3619., Sorry by mistake assigned it ... , Seems like the code in the stack trace is before to YARN-3619, so you mean to say YARN-3619 fixes this issue ?, bq. you mean to say YARN-3619 fixes this issue?
I meant that YARN-3619 may fixed this issue. Perhaps the bug still exists even after YARN-3619., IIUC, in trunk this issue should not come because {{ContainerMetrics#unregisterContainerMetrics}} is synchronized on class object and {{ContainerMetrics#getMetrics}} is synchronized on "this".  
But for more precisely I updated the patch., Hi [~rohithsharma], thank you for your comment. Do you think this issue still exists in branch-2.7/2.8?, Based on the commit history of YARN-3619, YARN-3619 is fixed to branch-2 and branch-2.7.
Branch-2.6 might need to port this issue., Thanks [~rohithsharma] for your comment.
bq. Branch-2.6 might need to port this issue.
ContainerMetrics doesn't exist in branch-2.6, so there's no need to backport this issue., GitHub user steveloughran opened a pull request:

    https://github.com/apache/hadoop/pull/72

    YARN-4563

    Attempt to document YARN security, including HADOOP_TOKEN_FILE_LOCATION propagation

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/steveloughran/hadoop HADOOP-12649-security/YARN-4653-yarn

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/hadoop/pull/72.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #72
    
----
commit 73baa11ff74201faa56ce1fc18941bdad43263fe
Author: Steve Loughran <stevel@apache.org>
Date:   2016-01-28T20:04:14Z

    YARN-4653 document YARN security: first pass

commit 778f623f7c436a975a1020d8a1eea55b67a630bf
Author: Steve Loughran <stevel@apache.org>
Date:   2016-01-29T20:04:53Z

    YARN-4653 document YARN security: more, though more is needed

commit 6b4ce5fa7ed6a83e471d14994bd26aa01bf37552
Author: Steve Loughran <stevel@apache.org>
Date:   2016-02-01T15:20:35Z

    YARN-4653 document YARN security with instructions on propagating oozie credentials

----
]