[Here's the fix for the problem. Trivial., To verify., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12444760/hdfs-1159.patch
  against trunk revision 944566.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h5.grid.sp2.yahoo.net/366/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h5.grid.sp2.yahoo.net/366/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h5.grid.sp2.yahoo.net/366/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h5.grid.sp2.yahoo.net/366/console

This message is automatically generated., Apparently, not test is needed for the patch.
Also, according to the test results page there's no failures but a one test less has been run compare to the previous run. Apparently, the previous run has reported '+1' (an extra) test in the same package. Looks like some kind of glitch..., Looked into the console output once more (thanks Boris) and found that TestHdfsProxy is failing. Unrelated., +1, I have just committed this., Integrated in Hadoop-Hdfs-trunk-Commit #279 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Hdfs-trunk-Commit/279/])
    HDFS-1159. clean-cache target removes wrong ivy cache. Contributed by Konstantin Boudnik
]