[Is there already a suppression list for RAT? Clearly all of the generated files should be exempted., Looks like the HDFS releaseaudit target doesn't filter out much:

      <fileset dir="${dist.dir}">
        <exclude name="CHANGES.txt"/>
        <exclude name="docs/"/>
        <exclude name="lib/jdiff/"/>
      </fileset>

The thriftfs gen-* directories seem like obvious candidates to filter out.  Any others?
, OpenOffice files (src/docs/src/documentation/resources/images/FI-framework.odg) should be going.
cli/clitest_data
src/test/smoke|commit|all-tests
src/test/*xml
webapps/**/*xml
src/docs/releasenotes.html
at the very least., First crap., Attached patch moves the count back to 0.  Some files have licenses added, others are added to the ignore list via a liberal interpretation of http://www.apache.org/legal/src-headers.html

Result of ant releaseaudit after patch:
{noformat}
releaseaudit:
[rat:report] 
[rat:report] *****************************************************
[rat:report] Summary
[rat:report] -------
[rat:report] Notes: 9
[rat:report] Binaries: 22
[rat:report] Archives: 47
[rat:report] Standards: 610
[rat:report] 
[rat:report] Apache Licensed: 609
[rat:report] Generated Documents: 1
[rat:report] 
[rat:report] JavaDocs are generated and so license header is optional
[rat:report] Generated files do not required license headers
[rat:report] 
[rat:report] 0 Unknown Licenses
[rat:report] 
[rat:report] *******************************
[rat:report] 
[rat:report] Unapproved licenses:
[rat:report] 
[rat:report] 
[rat:report] *******************************{noformat}
and
{noformat}
[rat:report]  *****************************************************
[rat:report]  Printing headers for files without AL header...
[rat:report]  
[rat:report]  

BUILD SUCCESSFUL
Total time: 1 minute 25 seconds{noformat}

On a side note, it's time to get rid of forrest.  It was a serious pain to get up and running on my mac with OSX and JDK5 has been EOL'ed for several months, as well as the forrest project not having had a release in almost four years.  I'll open a JIRA to do so, if one has not yet been., +1 patch looks good and works as expected.

A couple of optional nits:
  - replace commit-tests, all-tests, and so on with a mask like this
{{<exclude name="src/test/*-tests" />}}
  - replace specific {{resources}} folder location with something like
{{<exclude name="**/*/resources/" /> }}
This will allow not to update the exclude list everytime a new test list or resources folder is added into the source tree.
  - keeping the exclude list outside of the build.xml looked more appealing to me, but having it embedded into the build file is Ok too.
, I'm fine with those nits, if someone wants to update the patch or open a new JIRA, but I'd like to get this committed now and free Hudson.  I'll commit this in the morning unless any committers have any objections., +1. Thanks Jakob. , As I said, those are optional, so I don't have any issues with committing this as is., I've committed this to trunk.  Resolving as fixed., Ran a test run of HDFS precommit testing. Hudson is still seeing these 4 issues after this patch:

[rat:report]  !????? trunk/build/hadoop-hdfs-1051334_HDFS-1534_PATCH-12465968/src/docs/src/documentation/resources/images/FI-framework.odg

[rat:report]  !????? trunk/build/hadoop-hdfs-1051334_HDFS-1534_PATCH-12465968/src/docs/src/documentation/resources/images/hdfsarchitecture.odg

[rat:report]  !????? trunk/build/hadoop-hdfs-1051334_HDFS-1534_PATCH-12465968/src/docs/src/documentation/resources/images/hdfsdatanodes.odg

[rat:report]  !????? trunk/build/hadoop-hdfs-1051334_HDFS-1534_PATCH-12465968/src/test/hdfs/org/apache/hadoop/hdfs/hadoop-14-dfs-dir.tgz
, What is the ant target for the precommit release audit? For my patch I was running ant releaseaudit.  They must be different.  I didn't see any odg files.  , actually, you haven't include *.odg nor *.tgz into the exclude list, that's because those files weren't showing up in my release audit when I was running it, as above.  I went through the results I was getting and fixed or bypassed each one until there were no more.  I'm not sure why those files weren't being included in mine..., But they are in the initial text file Nigel attached. And in my initial patch as well ;), I suspect it's because releaseaudit is run in a workspace that has already had tar and doc (forrest) run in it. Like Cos said, I think we just need to add *.odg and *.tgz to the exclude list and we should be golden., I just committed the extra 3 lines to get Hudson patch process to work.  Attaching the new complete patch., Integrated in Hadoop-Hdfs-trunk #643 (See [https://builds.apache.org/hudson/job/Hadoop-Hdfs-trunk/643/])
    , Integrated in Hadoop-Hdfs-22-branch #35 (See [https://builds.apache.org/hudson/job/Hadoop-Hdfs-22-branch/35/])
    ]