[exit if no editlog file is opened when open method of FSEditLog is called, exit if open cannot open any edit file, I cannot apply your patch to current trunk. Is it for 19.2 only?
In general, all io errors including open() should be handled by  processIOError().
As far as I understand your explanation the NameNode exits eventually, if somebody
tries to sync, but you want to happen it earlier, is that right?, I only did it on 0.19 branch...

AFAIK processIOError() intends to deal with errors of editStreams
and remove bad ones. But in open(), no editStream should 
exists in advance. Thus I think it should be handled here.

If no editStreams opened here, NameNode will still keep alive,
but logSync() cannot written anything and cause no exception.

I think if editStreams is empty, it should be dealt with at once, 
ether in open() or in processIOError().

, > AFAIK processIOError() intends to deal with errors of editStreams and remove bad ones

Correct. And also shutdown the node if there are no streams remained.
It does it in the first line., > > AFAIK processIOError() intends to deal with errors of editStreams and remove bad ones
> 
> Correct. And also shutdown the node if there are no streams remained.
> It does it in the first line.

Thus we should call processIOError() with a trivial argument at the end of open() if no editStream is opened correctly. is this OK?, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12406235/fseditlog-open.patch
  against trunk revision 768376.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/242/console

This message is automatically generated., processIOError instead of exit directly, I modified the patch to call processIOError() instead of exit directly if no editStream were opened., Cancelling patch.  It appears that the patch has not passed tests yet (and probably is stale at this point).  Wang, please don't delete previous patches, as it makes it hard to track the progress of the patch.  Just number the patches as you submit them.  , Hi Jakob, what should I do next? Upload another patch? 
(The patch had only been made to 0.19 branch and tested in our environment.)]