[This patch includes new test which illustrate the problem. NB: the test's contract might have to be changed depending on the resolution of the JIRA itself., I believe, this test version better reflects the expected reaction of FSnamesystem in case of 0 blocks length. Lease needs to be removed and file to be closed., This patch fixes both issues in the {{FSNamesystem}} and provides correct unit tests for the problem., Corrected version of the patch: if penultimate block is missing (e.g. in case of single block file) then its minimal replication factor should be considered as met., I've ran hdfs tests with this patch in place and it went fine. The only seen problem is that testBlockReplacement is failing. However, this test is failing on the current trunk without the patch being applied., In case of 0 block, the original code seems to handle correctly. The NPE is thrown in finalizeINodeFileUnderConstruction:
java.lang.NullPointerException
	at java.util.TreeMap.getEntry(TreeMap.java:324)
	at java.util.TreeMap.get(TreeMap.java:255)
	at org.apache.hadoop.hdfs.server.namenode.LeaseManager.getLease(LeaseManager.java:82)
	at org.apache.hadoop.hdfs.server.namenode.LeaseManager.removeLease(LeaseManager.java:140)
	at org.apache.hadoop.hdfs.server.namenode.FSNamesystem.finalizeINodeFileUnderConstruction(FSNamesystem.java:2037)
	at org.apache.hadoop.hdfs.server.namenode.FSNamesystem.internalReleaseLease(FSNamesystem.java:1939)
	at org.apache.hadoop.hdfs.server.namenode.TestNNLeaseRecovery.testInternalReleaseLease_0blocks(TestNNLeaseRecovery.java:179)
Is it a test set up problem?, Great catch, Hairong! Thank you. Attached is the patch with fixed test case for 0 blocks and FSNamesystem modification to handle a single-block file., +1, Integrated in Hadoop-Hdfs-trunk-Commit #148 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Hdfs-trunk-Commit/148/])
    , I've ran all unit tests and all HDFS tests. All seemed Ok except for 4 testcases in TestHDFSFileContextMainOperations which have failed for unrelated reasons.

I've just committed this and merged back to branch-0.21., I forgot to mention that this JIRA doesn't have results of test-patch because the build has been broken because of HDFS-832., Integrated in Hadoop-Hdfs-trunk #172 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Hdfs-trunk/172/])
    . FSNamesystem#internalReleaseLease throws NullPointerException on a single-block file's lease recovery. Contributed by Konstantin Boudnik
, Integrated in Hdfs-Patch-h5.grid.sp2.yahoo.net #148 (See [http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h5.grid.sp2.yahoo.net/148/])
    , Integrated in Hdfs-Patch-h2.grid.sp2.yahoo.net #94 (See [http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h2.grid.sp2.yahoo.net/94/])
    ]