[I had attached this same patch to HDFS-142, but then realized it is a problem on trunk as well. This is the 0.20-append version -- I'll write a patch that applies to trunk as well., Patch for trunk, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12444449/hdfs-1152.txt
  against trunk revision 944015.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 6 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h5.grid.sp2.yahoo.net/361/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h5.grid.sp2.yahoo.net/361/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h5.grid.sp2.yahoo.net/361/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h5.grid.sp2.yahoo.net/361/console

This message is automatically generated., Toggling patch available to get a fresh hudson run (patch still applies to trunk), Todd, it seems to me that the two synchronized sections should actually be one. There is some redundant work done in the second section, and also the consistency of actions is not clear to me, because if you release the lock in the middle then you basically need to verify everything again, say lease may expire or permissions can change. Looks to me that either we should move the second section inside startFileInternal() or remove it if this is a redundant code. 
Let's target this jira for 0.20-append. I'll create another one for trunk and will take a closer look at the problem., Todd, I agree that this might be a bug. But does this cause any problem to HBase? If this is not a blocking issue to HBase, I would prefer not to commit this to append 0.20., I'm not certain if this has been seen in production, but it's clearly incorrect in 0.20-append. Wouldn't call it a blocker, since it's a pretty narrow race that hasn't been observed, but don't see a reason *not* to commit either., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12444449/hdfs-1152.txt
  against trunk revision 1051669.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 6 new or modified tests.

    -1 patch.  The patch command could not apply the patch.

Console output: https://hudson.apache.org/hudson/job/PreCommit-HDFS-Build/26//console

This message is automatically generated., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12444449/hdfs-1152.txt
  against trunk revision 1072023.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 6 new or modified tests.

    -1 patch.  The patch command could not apply the patch.

Console output: https://hudson.apache.org/hudson/job/PreCommit-HDFS-Build/194//console

This message is automatically generated., Likely stale.]