[Attached patch. This patch remove formatting for namespase quota, file count and directory count...

All the count should be display in number format...

Please review ....., Closing as Won't Fix.

This is working as intended. The whole point of -h is make it usable by humans. , Hi [~aw]

Why we need to display file and directory count in MB and GB ??. Only size should be display in MB and GB. 
, bq. Why we need to display file and directory count in MB and GB ??

The whole reason this feature exists is because admins that do the work with count and setXQuota want to do it in round numbers.  I don't have enough fingers and toes to say how many times I've had to "add commas" from this display to figure out what the magnitudes actually are.  When dealing with terabyte and larger sizes, -h is invaluable for *all* of the numbers.

It's worth pointing out that setXQuota also takes these abbreviations.  So there is a consistently thing happening as well.

If there's a bug here, it's that one billion, it should be displaying B and instead of G, but that's pretty minor.
, Thanks [~aw] for looking into this issue.
{quote}
If there's a bug here, it's that one billion, it should be displaying B and instead of G, but that's pretty minor.
{quote}

When i test with below values i observe that it displays in G instead of B --
{noformat}
 ./hdfs dfsadmin -setQuota 1099511000 /dir123

 ./hdfs dfs -count -v -h -q /dir123
       QUOTA       REM_QUOTA     SPACE_QUOTA REM_SPACE_QUOTA    DIR_COUNT   FILE_COUNT       CONTENT_SIZE PATHNAME
       1.0 G           1.0 G            none             inf            1            0                  0 /dir123

 ./hdfs dfsadmin -setQuota 1099511627776 /dir123

 ./hdfs dfs -count -v -h -q /dir123
       QUOTA       REM_QUOTA     SPACE_QUOTA REM_SPACE_QUOTA    DIR_COUNT   FILE_COUNT       CONTENT_SIZE PATHNAME
         1 T           1.0 T            none             inf            1            0                  0 /dir123

{noformat}, Right, counts should be in billions, byte sizes should be in gigabytes.  So that's pretty much the only bug here. But it's:

a) relatively minor
b) causes a cascade of other, incompatible changes (e.g., need to honor b and not g for setting size-based quotas), bq. b) causes a cascade of other, incompatible changes (e.g., need to honor b and not g for setting size-based quotas)

we will write new Util for count, we will use {{StringUtils.TraditionalBinaryPrefix.long2String()}} only for size.
, You're going to have touch not just count, but lots of other code that uses -h.  Please open a new JIRA and mark it as an incompatible change since you'll be changing how various commands take input and display output.

Thanks.]