[screen shot, a GET on the command line returns the HTTP error code, though the body is meaningless
{code}
$ GET http://localhost:50070/webhdfs/v1/?op=LISTSTATUS
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"/>
<title>Error 401 </title>
</head>
<body><h2>HTTP ERROR 401</h2>
<p>Problem accessing /webhdfs/v1/. Reason:
<pre>    </pre></p><hr /><i><small>Powered by Jetty://</small></i><br/>                                                
<br/>                                                
<br/>                                                
<br/>                                                
<br/>                                                
<br/>                                                
<br/>                                                
<br/>                                                
<br/>                                                
<br/>                                                
<br/>                                                
<br/>                                                
<br/>                                                
<br/>                                                
<br/>                                                
<br/>                                                
<br/>                                                
<br/>                                                
<br/>                                                
<br/>                                                

</body>
</html>
{code}, workaround is to revert to the old GUI
{code}
 <property>
   <name>dfs.webhdfs.enabled</name>
   <value>false</value>
 </property>
{code}, Sidenote, one of the spnego patches I have available for webhdfs's http protocol violations will cause the body to contain "Authentication required".  I do find it humorous that it currently appears to blame Jetty itself. :)

I'm not disagreeing with the fallback because it doesn't make sense for the NN UI to depend on an optional service.  I've been a bit dismayed about the direct reliance on webhdfs http calls because it's problematic when the NN UI is protected by a custom non-spnego auth filter - in our case and probably yours because desktop clients aren't configured to do spnego.  Yet the UI references URL's that require spnego which the client cannot do.

Perhaps the NN should be internally invoking the servlets to get the response direct webhdfs calls would return.  That retains the cool new UI and allows flexibility for authentication., Related to or possible dupe of HDFS-5796? 

bq. Perhaps the NN should be internally invoking the servlets to get the response direct webhdfs calls would return. That retains the cool new UI and allows flexibility for authentication.

I agree, but HDFS-5796 is not heading that way. Please chime in.]