[Trunk hdfs commit builds are broken in the last 6 days b'coz of this.

http://hudson.zones.apache.org/hudson/view/Hdfs/job/Hadoop-Hdfs-trunk-Commit, This patch fixes the -mvn-system-deploy task and hence the trunk builds., added the issue to the right component and version, This patch has to be applied back to branch-0.21 as well because the issue is present there too.
+1 patch looks good. Thanks for catching it Giri!
, Let's verify just in case., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12446584/hdfs-1193.patch
  against trunk revision 951555.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h5.grid.sp2.yahoo.net/401/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h5.grid.sp2.yahoo.net/401/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h5.grid.sp2.yahoo.net/401/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h5.grid.sp2.yahoo.net/401/console

This message is automatically generated., core test problem is known intermittent issue (HDFS-733)
contrib test is {{TestHdfsProxy}} failing for month+

So, I'm going to commit this., I have just committed this. Thanks Giri., Integrated in Hadoop-Hdfs-trunk-Commit #298 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Hdfs-trunk-Commit/298/])
    HDFS-1193. -mvn-system-deploy target is broken which inturn fails the
mvn-deploy task leading to unstable mapreduce build. Contributed by Giridharan
Kesavan.
]