[I have tied several times, but cannot reproduce the error in our cluster. The following is my step to reproduce:

1. Decommission four data nodes in my cluster which has 9 data nodes and 1 name node in total.
2. Generate 9 files in the path /benchmarks and the size of each file is 15GB.
3. Set erasure code policy "RS-DEFAULT-3-2-64k" on the path /ECTest.
4. Copy files to the path /ECTest by the command: bin/hdfs dfs -cp /benchmarks/* /ECTest
5. Kill the data node process in data node 1: sudo pkill -9 -f datanode
6. Carry out hdfs fsck, however, the files in the path /ECTest is healthy.

I have no idea about the reason why I can not reproduce the error. Could you help me?
, I'm sorry I'm so late.
It was possible to reproduce the bug by a new procedure.

The following is the steps to reproduce:

{code:title=hdfs-site.xml}
<property>
  <name>dfs.datanode.data.dir</name>
  <value>file:///data1/hdfs/data,file:///data2/hdfs/data,file:///data3/hdfs/data</value>
</property>
{code}

1) datanode1: sudo rm -rf /data1/hdfs/data/* /data2/hdfs/data/* /data3/hdfs/data/*
2) datanode1: sudo /etc/init.d/hadoop-hdfs-datanode restart
3) datanode2: sudo rm -rf /data1/hdfs/data/* /data2/hdfs/data/* /data3/hdfs/data/*
4) datanode2: sudo /etc/init.d/hadoop-hdfs-datanode restart
5) namenode1: sudo -u hdfs hdfs dfsadmin -triggerBlockReport datanode1:9867
6) namenode1: sudo -u hdfs hdfs dfsadmin -triggerBlockReport datanode2:9867
7) namenode1: /etc/init.d/hadoop-hdfs-namenode restart
8) namenode2: /etc/init.d/hadoop-hdfs-namenode restart
9) Carry out hdfs fsck and confirm that Under-Replicated Blocks occurred.
10) Wait for about 24 hours.
11) namenode1: /etc/init.d/hadoop-hdfs-namenode restart
12) namenode2: /etc/init.d/hadoop-hdfs-namenode restart, Hi Eisuke Umeda, thanks for provide more information! Have you ever tried if only one namenode is involved, will this issue still be reproduceable? Is the second namenode involvement a must have condition to reproduce the issue? , Hi SammiChen, I conducted a re-test in a single NameNode. It was possible to reproduce a problem., Hi [~ademu], thanks for providing this information. Will try to reproduce the problem and see what can do. , Thanks for reporting this issue, [~ademu].

I think this bug (and HDFS-10775) might have already been solved by HDFS-10858. Before fixing the bug, when datanodes sent full block reports which contained ec blocks and replicated blocks, namenode sometimes handled it wrongly. Eventually, it stopped the recovery process.

Please try to do the test with the latest trunk branch.]