[Patch that changes our basis from 'green' to 'orange'.  Screen shot coming..., Here is what the patch looks like.

The colors used ... are 'International Orange (Aerospace)
#FF4F00' for  banner background and 'International Orange (Golden Gate
Bridge) #C0362C' for highlighting when an item is selected in the banner.
A lighter hue of 'International Orange (Aerospace)' courtesy of
http://www.colorhexa.com/ff4f00 is also used for ui-tabs div.  See
http://en.wikipedia.org/wiki/International_orange for more on IO., I'm +1, but let's give others some time to comment before committing., What if there is a vendor using orange (or any color you chosen)?, bq. What if there is a vendor using orange (or any color you chosen)?

Such a vendor could exist.  My little survey was not extensive for sure.  I just clicked through here: http://wiki.apache.org/hadoop/Distributions%20and%20Commercial%20Support

What you think of the green [~szetszwo]?  Does it make you think of any particular vendor in particular as it did this hadoop user?

Thanks.

, Why don't we choose the Hadoop elephant yellow? Or Apache purple? Seems like we already have some project branding that we could "fit with" in that sense., Interesting. It could be a controversial thing, but here's my take. There is no single HWX green, but if I were to pick one shade up, it would be the light green in the logo. And looking at the screenshot you shared (I deployed 2.4 clusters, but never happened to look at HDFS UI), that one seems much darker.

If one focuses only on one color's shades, I can see why one would correlate them.

Irrespective, since when is pure colors tied to a company? If this were the case, any company with grey background will conflict with the colors we chose in the YARN UI. And Oozie UI would essentially be same as Cloudera's? Not sure if we can rule out colors in Apache software because vendors happen to include those in their color palette., +1 - I like it!

In fact - very bright and optimistic! And indeed brand neutral , bq. Why don't we choose the Hadoop elephant yellow? Or Apache purple?
I believe these two won't look good in the interface - yellow is too light; and purple is on a darker side. I really like Stack's version!, bq. And Oozie UI would essentially be same as Cloudera's?

Oozie came from Yahoo and most of the committers there are from Y!, if I am not mistaken ;), I think the UI which used to look decent now looks pretty ugly. Can we go back to just white and grey and be done with it?, bq. Oozie came from Yahoo and most of the committers there are from Y!, if I am not mistaken
Which is precisely the point. Colors on Apache UIs don't necessarily correlate to Companies.

bq. Can we go back to just white and grey and be done with it?
+1. There is far more important stuff that needs contributors than arguments on nonissues like this., bq. Can we go back to just white and grey and be done with it?

Nah... a splash of color wouldn't hurt anyone. , Current color scheme seems to be similar to http://www.datastax.com/. I am not sure if the shades are the same. We should avoid that. , Is it because Cassandra treating us?, [~tlipcon] bq. Why don't we choose the Hadoop elephant yellow? Or Apache purple? Seems like we already have some project branding that we could "fit with" in that sense.

The color is just a suggestion.  I now think it too radical a departure after your comment and considering we are on the eve of a release; we shouldn't be choosing a hadoop color at this juncture.

I put up a patch because I'd gone to the trouble of hunting out what would need to change.  Elephant yellow would have been a good, non-controversial obviously 'apache hadoop' color but as per [~cos] it'd probably be poor as background for white text.  A 'purple' or the 'Maven Blue' on hadoop.apache.org would work better as background.

I was also after colors with a neutral provenance -- hence the choice from the International Orange palate -- so it was clear where they came from so this issue could be put to rest once and for all and never raise its head again.

[~vinodkv]
bq. Interesting. It could be a controversial thing, but here's my take. There is no single HWX green, but if I were to pick one shade up, it would be the light green in the logo. And looking at the screenshot you shared (I deployed 2.4 clusters, but never happened to look at HDFS UI), that one seems much darker.

Thanks for the opinion V.  I do think it a bit darker (though best to look at the actual UI since the link I posted is of a PNG of a desktop picture -- so some fidelity is lost). 

bq. Irrespective, since when is pure colors tied to a company?

I think it fairly well established that color can stand for an entity such as a company (Here is a fun game that makes the point well: http://www.businessinsider.com/can-you-identify-these-12-brands-by-their-trademarked-colors-alone-2012-2?op=1)

bq. If this were the case, any company with grey background will conflict with the colors we chose in the YARN UI. And Oozie UI would essentially be same as Cloudera's?

IMO, grey is different.  My guess is that is probably hard to find a company that uses a washed out gray as its signature color.

bq. Not sure if we can rule out colors in Apache software because vendors happen to include those in their color palette.

I was just suggesting we could avoid a few colors, ones that the big hadoop vendors are known by.

[~sureshms] bq. I think the UI which used to look decent now looks pretty ugly. Can we go back to just white and grey and be done with it?

Let me do this.  In general, as per [~cos], I like a bit of color, let me put up a grey so we can be done.

Thanks.


, [~stack], coming to think of it, color is such a personal preference. I have no problems if you want to commit the patch as is.

Enough time wasted. +1 for the patch from me., Here is what the gray looks like and the patch to implement it., Looks like I have a +1 from Suresh.  I've tried it here.  I'll commit in a while unless objection (sorry [~cos])., No worries [~stack] - I am artistically challenged like most engineers, anyway ;), [~saint.ack@gmail.com], I must say the gray looks even worse. You have the knack of making poor color choices. Please do not get into UI :) Your new effort has convinced me that the orange scheme was better :) +1 for that., Told ya guys - orange is awesome. Looks like I am less artistically challenged than [~stack] :D, [~cos], hope your liking for it is not because of Wandisco orange ;-), Sorry lads., Although I'm not an HCI expert at all, but I think it is worthwhile to document the rationale of how the original colors are chosen.

If you look at the original colors at the HSL space. They have the same hues (ignoring the rounding), with different values of saturation and light. The intervals between them are identical to the ones on http://getbootstrap.com

Hue decides the primary color (i.e., green, yellow, orange). Green is chosen because the color theory suggests that green color gives an impression of stability and relaxation. Another reason is that from the HCI prospective, cold color schemes (e.g., green / blue backgrounds + white text) usually have good visibility on computer screens.

It is usually easy to see some code is better than the other, but it is subjective and subtle to tell which color is superior. I'm pretty open on what color schemes should be used in the UI, and I understand everybody has his / her favorite colors and I fully respect their choices. I sincerely appreciate putting the time to reasoning about the changes from the HCI prospective so that the end-users can have the best experience., This is green, as it was, only darkened so it is away from the problematic part of the green spectrum.  This is what I will commit in the morning believing it the least controversial offering unless I hear otherwise.  Thanks.

, bq. hope your liking for it is not because of Wandisco orange
Damn, you totally figured me out. Now I can't help but wonder why did I get me 2 of those orange dial divers a few years ago?  Musta been sensing my career path.

- Do you have paranoia?
- Yes. Who told you?, Maybe this would be a good vendor-neutral color palette.  ;)  Didn't view it but I think it's right., +1 for HDFS-5852.best.txt.  I love purple (Y!) :) 
, [~wheat9] Thanks for the rationale.  I missed it last night.  Helps.  Gives the choice of color a provenance (I thought it some innocent random pick from the color palate).  Does the result make you think of a popular Hadoop vendor when viewed with other than a creator's eyes?  You think we should just hold the original color?  Or any opinion on the few uploaded?  Thanks., I've uploaded color-rationale.png to visualize the intervals of the original color scheme., (Disclaimer: I'm not an HCI expert, so please see the comments where it fits.)

As I have said, the preferences of colors are highly subjective. Every people have their own interpretations of colors. It is understandable that people (especially software engineers like us) associate a particular color to the logos they see everyday.

However, I suspect that the end-users (which are a much wider audiences) generally share the same interpretations as we had here. Therefore, if I had to choose some color for the UI I would start with two things in mind:

# The impressions of the colors of general populations, which are throughly studied in arts and architectures for centuries (e.g., green -> stability, red -> attacking, orange -> hot)
# The color intervals chosen by one of the most popular front-end framework (i.e. bootstrap). The theory behind it has been quantitively studied for about 50 years \[1\].

After that you'll need to balance the style, visibility, etc.

The original color is chosen to balance the visibility of the texts and the dropdown icon. Both of them can have two different colors with different lightness. The color harmony for all these cases \[2\] is achieved only through multiple trails. What I have learned so far is that the subtle issues do matter -- therefore I respect the ones that can get the issues right (like Bootstrap) and follow their leads.

As I have said, I understand everybody has his / her own favorite color. My focus here is to promote the reasoning behind the choices. I'm pretty open to the color schemes for the UI. I'm okay on changing the color if someone raises the concern that the colors can be misinterpreted -- as long as the choice that has been well thought through.

Picking the politically correct color, however, is not my focus and I sincerely believe that it should not be the focus of this jira either.

References:

1. Antal Nemcsics. Experimental Determination of Laws of Color Harmony. Part 1: Harmony Content of Different Scales with Similar Hue. In COLOR research and application, 2007.
2.Anders Hård, Lars Sivik. A Theory of Colors in Combination—A Descriptive Model Related to the NCS Color-Order System. In COLOR research and application, 1999., [~wheat9] Thanks for the input.  Not sure how to react.  That color is subjective I 'know' instinctively and this subjectivity is recognized and is at the root of the original question asked by me out on the mailing list where I solicit if I am the only one having the reaction that, "these colors seem way to close to the signature HWX colors".   It seemed to me like a pretty basic question and it shouldn't take color theory making an answer.

While you might ask that we avoid 'political correctness', as you call it, we do have an obligation to keep our work conflict-free, even though it require that we operate in areas in which we are inexpert: design or 'branding', to name two pertinent domains here.

Let me close this issue as LATER.  Here is why:

My original question gleaned one direct answer only if I am making a proper accounting and though the judgement was passed on a low-fidelity copy, a PNG screen shot, the opinion was similar to what I had posited, that the banner color is 'darker' (I'll not infer any more than this).  My survey out on the mailing list has been distorted so I do not expect any more opinions to come in via that channel.  Asking the question here a few more times has not elicited any additional opinions.  I'm not in the game of committing patches unless clean agreement.  That is lacking here.

Let me also close this issue because this arena is a minefield whether it is engineers making design choices (though I like the orange too and counting my vote, it has 4x+1) but also, this is a minefield in that we do not yet seem up to talking about the issue in a civil manner.

Finally I'm closing this issue because I don't care that much about the color, whether or which, not enough to drive further along this contrib.  I was just wondering...

This issue has been good in that the provenance of the chosen color has been surfaced and can be put under the nose of anyone who might have my reaction in the future.  I also now know who I need to consult when color stumped going forward.

Thanks all for your contribs here., Just to show how *inane* this is jira is, here are the colors measurements of Hortonwork's green, Cloudera Blue, and the original color using Mac's digital color meter:

|| Attribute || Hortonworks Green || HDFS Color || Cloudera Blue ||
| L | 69.52 | 33.94 | 34.4 |
| A | -44.68 | -22.34 | -17.68 |
| B | 60.91 | 26.88 | -19.98 |

so Hortonworks Green - HDFS Color = 35.58 + 22.34 + 34.03 = 91.95
and Cloudera Blue - HDFS Color = 0.46 + 4.66 + 46.86 = 51.98

Clearly we need to make the color greener to denote additional stability., Well, I am not even sure why the colors are set by PNG background file to start with. HDFS UI doesn't carry on any graphical elements and all the coloring stuff should be controlled via a CSS of some kind. Hence, anyone can tweak for their own liking., [~owen.omalley], you should leave Oozie's logo color outside of this discussion. If you have any concern please bring it directly to the Oozie community and/or Oozie PMC. Though, before you do so, let me remind you -in case you forgot or didn't know- that Oozie's logo was created sometime in 2009 by Yahoo employees (which incidentally were not involved in Oozie development) and they may have not even been aware of Cloudera's existence then., [~owen.omalley] Your "gang colors" dissection seems to be missing connecting argument.]