[Am also hitting this issue. Is there any workaround/fix ?, Could run mvn package successfully by changing tomcat version to "6.0.30" in hadoop-hdfs-project/hadoop-hdfs-httpfs/pom.xml.
 , I've just downloaded 32 from apache and it is not corrupt.

Can you try deleting the contents of the hadoop-hdfs-project/hadoop-hdfs-httpfs/downloads/ and try again?

, I'have downloaded apache-tomcat-6.0.32 from http://archive.apache.org/dist/tomcat/tomcat-6/v6.0.32/bin/apache-tomcat-6.0.32.tar.gz but there is some problem in doing untar.Seems that the tomcat distribution is corrupted.While doing untar i came across the below issue
gzip: stdin: unexpected end of file
tar: Unexpected EOF in archive
tar: Error is not recoverable: exiting now, Hi,
as per the workarounds suggested i have removed contents from hadoop-hdfs-project/hadoop-hdfs-httpfs/downloads/ and changed the tomcat distribution to 6.0.30 still i am facing the same issue.Can anyone suggest what is the workaround for this issue.
gzip: stdin: unexpected end of file
tar: Unexpected EOF in archive
tar: Error is not recoverable: exiting now, I don't know if this will help but the pom.xml file under hadoop-hdfs-httpfs has the following content:

-----------------
          <plugin>
            <groupId>org.apache.maven.plugins</groupId>
            <artifactId>maven-antrun-plugin</artifactId>
            <executions>
              <execution>
-----------------

I noticed that the maven-antrun-plugin version is not specified.  I tried modifying the aforementioned pom.xml as follows:

---------------------
          <plugin>
            <groupId>org.apache.maven.plugins</groupId>
            <artifactId>maven-antrun-plugin</artifactId>
            <version>1.7</version> <!-- ADDED version specification -->
            <executions>
              <execution>
---------------------

and low and behold the build succeeded.  I also checked that the antrun plugin was defaulting to 1.3 if not specified as above, so I am suspecting an antrun plugin issue, but I maybe wrong.]