[Patch to address the problem.
It can't be verified until HDFS-1150 is committed to the trunk, I have verified that the patch works for current HDFS trunk despite that HDFS-1150's patch for trunk was a little different than for y20. So, the patch is still valid.

The reason for the modification is as follows: the call to the original constructor with two parameters has been replaced with call to the new one 
{noformat}
      return new DataNode(conf, dirs, resources);
{noformat}
While this is a totally compatible change from the Java perspective, one of Herriot aspects was bound to the 'call to the constructor with 2 params' and has been broken as the result of the change, Looks reasonable. +1 pending Hudson (assuming he showed up today...)., I've seen other AspectJ related test failures, many due to the same reason (method signatures got changed without changing the AspectJ matching logic). Do AspectJ based tests get run on Hudson (or required to pass)?, Like HDFS-1150 it affects only 0.22, bq. I've seen other AspectJ related test failures, many due to the same reason (method signatures got changed without changing the AspectJ matching logic). Do AspectJ based tests get run on Hudson (or required to pass)? 

I believe you have confused this for fault injection tests. The latter are executed as a part of secondary build, but not the patch build. To prevent braking of the bindings between the code and test framework code (Herriot) I have HADOOP-6786 which still pending {{test-patch}} verification. That JIRA will include the guarantees that a patch doesn't break existing bindings for the test framework., Although, test-patch doesn't verify instrumented build's binding (pending HADOOP-6786) I'll submit this for the sake of the process., Cos, Hudson does not work. Since this is a compilation bug, could you please just go ahead and commit it? , Per Hairong request and considering that this patch has been already verified in y20 release as  working I have just committed it to unblock further HDFS development in trunk., Integrated in Hadoop-Hdfs-trunk-Commit #370 (See [https://hudson.apache.org/hudson/job/Hadoop-Hdfs-trunk-Commit/370/])
    HDFS-1157. Modifications introduced by HDFS-1150 are breaking aspect's bindings. Contributed by Konstantin Boudnik
]