[This is present in 23 and trunk as well, it turns out., +1 pending Hudson., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12516245/hdfs-3019.txt
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    -1 javac.  The patch appears to cause tar ant target to fail.

    +1 eclipse:eclipse.  The patch built with eclipse:eclipse.

    -1 findbugs.  The patch appears to cause Findbugs (version 1.3.9) to fail.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed the unit tests build

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-HDFS-Build/1914//testReport/
Console output: https://builds.apache.org/job/PreCommit-HDFS-Build/1914//console

This message is automatically generated., Apparently the patch needs some alteration against trunk (I'd tested against the HA branch earlier). I'll look into this and upload a new patch soon., Looks like this issue is only on the HA branch. The test passes OK on trunk as is. I'll commit to HA branch based on Aaron's earlier +1., Integrated in Hadoop-Hdfs-HAbranch-build #92 (See [https://builds.apache.org/job/Hadoop-Hdfs-HAbranch-build/92/])
    HDFS-3019. Fix silent failure of TestEditLogJournalFailures. Contributed by Todd Lipcon. (Revision 1294772)

     Result = UNSTABLE
todd : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1294772
Files : 
* /hadoop/common/branches/HDFS-1623/hadoop-hdfs-project/hadoop-hdfs/CHANGES.HDFS-1623.txt
* /hadoop/common/branches/HDFS-1623/hadoop-hdfs-project/hadoop-hdfs/src/main/java/org/apache/hadoop/hdfs/server/namenode/FSEditLog.java
]