[Due to the internal layout changes introduced by the protobuf-based fsimage, OIV processing program consumes excessive amount of memory. For example, in order to export the fsimage in size of 8GB, it should have taken about 85GB memory which is really not reasonable and impacted performance of other services badly in the same server.

To resolve above problem, I submit this patch which will reduce memory consumption of OIV LSR processing by about half. And the solution is very simple. Instead of holding the whole deserialized INode object in memory, this patch just holds the attribute `name` of INode as node of the tree structure in heap.
, We do this with the fsimage_oiv/oiv_legacy that was added in HDFS-6293. The memory requirement is constantly small regardless of the size of fsimage. Is there any reason not to use it?, Can you please keep your changes minimal and make the coding style consistent?, {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12663633/HDFS-6914.patch
  against trunk revision .

    {color:red}-1 patch{color}.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-HDFS-Build/7724//console

This message is automatically generated., Do we really want to target this to 2.5.1? If not, I would suggest targetting 2.6. , Targeting 2.6.0. Also, the fixVersion is to be set at commit time by the person committing., [~haoch], do you mind if I take this jira and drive it forward?, [~wheat9] I found that Delimited processor has been removed from OfflineImageViewerPB in latest trunk. Does it still have value to move forward to apply this patch?, Clean code to keep changes minimal and make the coding style consistent, [~kkambatl] thanks for the remind :), {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12671201/HDFS-6914.v2.patch
  against trunk revision dff95f7.

    {color:red}-1 patch{color}.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-HDFS-Build/8202//console

This message is automatically generated., The fix is still useful in the web-based offlineimageviewer introduced in HDFS-5978. Can you please apply the same idea to HDFS-5978?, Sure, I am willing if it helps, but this solution is for streaming batch exporting based on two phases : 
1) in the first phase, it will hold the attribute `name` of INode as node of the tree structure in heap 
2) in the second phase, it will traverse all INodes one by one as stream.

This is the reason why it can save most of the memory consumption. But as to the web-based offlineimageviewer, it wants to support reactive realtime requests so it should always hold full information i. e. all INodes in memory where the huge memory consumption issue can't be prevented. I am not sure whether it makes sense here ?
, GitHub user haoch opened a pull request:

    https://github.com/apache/hadoop-common/pull/25

    HDFS-6914. Resolve huge memory consumption Issue with OIV processing PB-based fsimages

    For better managing and supporting a lot of large hadoop clusters in production, we internally need to automatically export fsimage to delimited text files in LSR style and then analyse with hive or pig or build system metrics for real-time analyzing. 
    
    However  due to the internal layout changes introduced by the protobuf-based fsimage, OIV processing program consumes excessive amount of memory. For example, in order to export the fsimage in size of 8GB, it should have taken about 85GB memory which is really not reasonable and impacted performance of other services badly in the same server.
    
    To resolve above problem, I submit this patch which will reduce memory consumption of OIV LSR processing by 50%.

You can merge this pull request into a Git repository by running:

    $ git pull https://github.com/haoch/hadoop-common HDFS-6914-branch-2.4.1

Alternatively you can review and apply these changes as the patch at:

    https://github.com/apache/hadoop-common/pull/25.patch

To close this pull request, make a commit to your master/trunk branch
with (at least) the following in the commit message:

    This closes #25
    
----
commit 340e333f627b3d64c9463819da04f97a3deecb6b
Author: Chen,Hao <cn.haochen@gmail.com>
Date:   2014-09-26T09:23:24Z

    HDFS-6914. Resolve huge memory consumption Issue with OIV processing PB-based fsimages

----
, Github user haoch closed the pull request at:

    https://github.com/apache/hadoop-common/pull/25
, \\
\\
| (x) *{color:red}-1 overall{color}* |
\\
\\
|| Vote || Subsystem || Runtime || Comment ||
| {color:red}-1{color} | patch |   0m  0s | The patch command could not apply the patch during dryrun. |
\\
\\
|| Subsystem || Report/Notes ||
| Patch URL | http://issues.apache.org/jira/secure/attachment/12671201/HDFS-6914.v2.patch |
| Optional Tests | javadoc javac unit findbugs checkstyle |
| git revision | trunk / f1a152c |
| Console output | https://builds.apache.org/job/PreCommit-HDFS-Build/10678/console |


This message was automatically generated., \\
\\
| (x) *{color:red}-1 overall{color}* |
\\
\\
|| Vote || Subsystem || Runtime || Comment ||
| {color:red}-1{color} | patch |   0m  0s | The patch command could not apply the patch during dryrun. |
\\
\\
|| Subsystem || Report/Notes ||
| Patch URL | http://issues.apache.org/jira/secure/attachment/12671201/HDFS-6914.v2.patch |
| Optional Tests | javadoc javac unit findbugs checkstyle |
| git revision | trunk / f1a152c |
| Console output | https://builds.apache.org/job/PreCommit-HDFS-Build/10698/console |


This message was automatically generated., Moving bugs out of previously closed releases into the next minor release 2.8.0., | (x) *{color:red}-1 overall{color}* |
\\
\\
|| Vote || Subsystem || Runtime || Comment ||
| {color:blue}0{color} | {color:blue} reexec {color} | {color:blue}  0m  0s{color} | {color:blue} Docker mode activated. {color} |
| {color:red}-1{color} | {color:red} patch {color} | {color:red}  0m  5s{color} | {color:red} HDFS-6914 does not apply to trunk. Rebase required? Wrong Branch? See https://wiki.apache.org/hadoop/HowToContribute for help. {color} |
\\
\\
|| Subsystem || Report/Notes ||
| JIRA Issue | HDFS-6914 |
| JIRA Patch URL | https://issues.apache.org/jira/secure/attachment/12671201/HDFS-6914.v2.patch |
| Console output | https://builds.apache.org/job/PreCommit-HDFS-Build/18082/console |
| Powered by | Apache Yetus 0.5.0-SNAPSHOT   http://yetus.apache.org |


This message was automatically generated.

]