[Attached patch fixed above issues.

Help message: 

* Before : {noformat} $ bin/hdfs dfsadmin -help -setSpaceQuota
-setSpaceQuota <quota> <dirname>...<dirname>: Set the disk space quota <quota> for each directory <dirName>.
                The directory quota is a long integer that puts a hard limit
                on the number of names in the directory tree.
                Quota can also be speciefied with a binary prefix for terabytes,
                petabytes etc (e.g. 50t is 50TB, 5m is 5MB, 3p is 3PB).
                [...]  {noformat}

 * After : {noformat} $ bin/hdfs dfsadmin -help setSpaceQuota
-setSpaceQuota <quota> <dirname>...<dirname>: Set the disk space quota <quota> for each directory <dirName>.
                The space quota is a long integer that puts a hard limit
                on the total size of all the files under the directory tree.
                The extra space required for replication is also counted. E.g.
                a 1GB file with replication of 3 consumes 3GB of the quota.

                Quota can also be speciefied with a binary prefix for terabytes,
                petabytes etc (e.g. 50t is 50TB, 5m is 5MB, 3p is 3PB).
                [...] {noformat}, This conflicts with HADOOP-5862. will wait for it to be committed before updating the patch for trunk and 0.20.
, Patch for new hdfs trunk.
, +1
looks good, Thanks Boris.

Updated patch fixes TestHDFSCLI.  This test verifies part of the help message., Patch for 0.20/core-trunk., test-patch (0.20 patch):

     [exec] +1 overall.
     [exec]
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec]
     [exec]     +1 tests included.  The patch appears to include 4 new or modified tests.
     [exec]
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec]
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec]
     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs warnings.
     [exec]
     [exec]     +1 Eclipse classpath. The patch retains Eclipse classpath integrity.
     [exec]
     [exec]     +1 release audit.  The applied patch does not increase the total number of release audit warning, Patch for 0.20 is attached. The patch for old trunk does not  apply to 0.20., I just committed this.]