[Same thing occurs in TestNodeCount, Is it actually breaking builds at this point? Does findbugs raises warnings about it? If so we should mark it a blocker., Nope, I've never seen it actually deadlock a test. JCarder just reports it as a potential deadlock spot if the threads interleaved differently., Moved to 0.23, Added FSNameSystem.write{Lock|Unlock} arount the synchronized heartbeats.  Added the same fix for TestHeartbeatHandling and TestNodeCount., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12468210/HDFS-863.patch
  against trunk revision 1057414.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 9 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed these core unit tests:


    -1 contrib tests.  The patch failed contrib unit tests.

    +1 system test framework.  The patch passed system test framework compile.

Test results: https://hudson.apache.org/hudson/job/PreCommit-HDFS-Build/103//testReport/
Findbugs warnings: https://hudson.apache.org/hudson/job/PreCommit-HDFS-Build/103//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://hudson.apache.org/hudson/job/PreCommit-HDFS-Build/103//console

This message is automatically generated., The results of running ant test.   
Skipped TestLargeDirectoryDelete since it stalled during that test.
    [junit] Test org.apache.hadoop.hdfs.TestHDFSServerPorts FAILED
    [junit] Test org.apache.hadoop.hdfs.server.namenode.TestStorageRestore FAILED

BUILD FAILED
/home/kgoodhope/workspace/hadoop-hdfs-trunk/build.xml:735: Tests failed!

Total time: 100 minutes 3 seconds
, Seems the new writeUnlock() calls should be inside a finally{} clause, no? Otherwise I fear we might get a test timeout if one of these functions throws an exception (since the minicluster wouldn't be able to shutdown if the writelock is left held), Agreed, and done.  Reran tests with the following results

    [junit] Test org.apache.hadoop.hdfs.server.namenode.TestStorageRestore FAILED
    [junit] Test org.apache.hadoop.hdfs.TestFileConcurrentReader FAILED
    [junit] Test org.apache.hadoop.hdfs.server.namenode.TestNNThroughputBenchmark FAILED

Skipped src/test/hdfs/org/apache/hadoop/hdfs/server/namenode/TestLargeDirectoryDelete.java since last time that test stalled., Hi Ken. Looks good except for one nit - there are some hard tab characters (eg TestNodeCount.java:117). The style guide is 2-space indentation. Mind reformatting those?, Thought I caught all of those, but obviously not.  Found a few more and removed them as well.  Thanks., Finally got my auto format set up right and it found a couple more issues my eyes missed.  Only formatted the sections I worked on., +1, Trunk isn't compiling due to a Common dependency, but by manually installing a new Common jar into the cache, I verified that this compiles.  I've committed this.  Resolving as fixed.  Thanks, Ken!, Integrated in Hadoop-Hdfs-trunk-Commit #539 (See [https://hudson.apache.org/hudson/job/Hadoop-Hdfs-trunk-Commit/539/])
    , Integrated in Hadoop-Hdfs-trunk #643 (See [https://builds.apache.org/hudson/job/Hadoop-Hdfs-trunk/643/])
    ]