[Attaching the patch, # TestFSImageUpgrade
#* is missing banner. 
#* Should we just put this in one of the existing tests?
#* Why do you need null and empty check in the tests if you are testing for startsWith("CID")
#* Do we need a test to check block pool ID is set?
#* Instead of assertTrue, use assertEquals where possible.
#* Please split the tests into testUpgradeFrom204, testUpgradeFrom22 and testUpgradeCurrentRelease. Also this test does not really do upgrade. Should we rename the test method.
#* There are few lines repeated every where. You could move it into a separate method.
# FSImage.java
#* Is it better to to have two methods setBlockPoolID() and setClusterID()?
#* "Try to set the clusterid and blockpoolid for the upgrade." Why Try to?
#* It is better to add the description in comments of what is happening in one place instead of spread all over. You may also want to move startOpt == StartupOption.UPGRADE into trySetClusterIDAndBlockPoolID().
, Thanks for the review, Suresh.
My comments inline.
 
1.1 Missing banner - done.
1.2 This method is package protected, this unit test just test this function instead of using time consuming MiniDFSCluster.
1.3 Removed the null and empty checks.
1.4 BoolpoolID is autogenerated. Now i have modified the tests to not mock this. 
1.5 Added assertEquals where necessary
1.6 Made multiple tests

2.1 Since the setBlockPoolID() and setClusterID() are in NNStorage, i moved this function to this class now solves this problem.
2.2 renamed the function
2.3 comments moved outside the function and moved the if condition inside the method.

Attaching the patch with these changes., Attached the patch., Done some more minor cleanup related to comments and adding more description to test class.

Please find the attached patch., +1 for the change, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12481981/HDFS-2030-3.patch
  against trunk revision 1134031.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    -1 findbugs.  The patch appears to introduce 2 new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed these core unit tests:
                  org.apache.hadoop.cli.TestHDFSCLI

    +1 contrib tests.  The patch passed contrib unit tests.

    +1 system test framework.  The patch passed system test framework compile.

Test results: https://builds.apache.org/job/PreCommit-HDFS-Build/756//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-HDFS-Build/756//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-HDFS-Build/756//console

This message is automatically generated., Findbugs warning and TestHDFSCLI is unrelated to this patch., I committed the patch. Thank you Bharath., Integrated in Hadoop-Hdfs-trunk-Commit #746 (See [https://builds.apache.org/job/Hadoop-Hdfs-trunk-Commit/746/])
    , Integrated in Hadoop-Hdfs-trunk #699 (See [https://builds.apache.org/job/Hadoop-Hdfs-trunk/699/])
    ]