[This was found by Findbugs on the merge patch in HDFS-5260.  Here is a patch that adds the {{equals}} implementation.

I also corrected a minor Javadoc warning.

The test-patch run on HDFS-5260 also reported new javac warnings.  These are due to use of internal Sun APIs for {{munmap}}, and there isn't any way for us to suppress them., [~cmccabe] or [~andrew.wang], how does this patch look?  If it looks good to you, I'll commit to HDFS-4949, and then prep a new merge patch for HDFS-5260., +1 thanks Chris. Since it's a final class, ok to use casting., Thanks for the review, Andrew.  I've committed this to the HDFS-4949 branch., I'm pretty sure FindBugs' next complaint will be that we implement {{equals}}, but not {{hashCode}}.  Of course we don't use any of those methods... sigh.  It might almost be worth adding a suppression here., Right you are, Colin.  Do you mind if I tack an addendum on this issue?

This patch adds {{hashCode}} and also addresses a warning about checking for null in {{equals}}.  I prefer this over adding suppressions, because even if {{TreeMap}} doesn't call these methods now, it's possible we could switch data structures, or it's possible that future JDK versions of {{TreeMap}} will start calling them, and it could be challenging to diagnose.  Can I commit this?

My local run of Findbugs came back clean, so I expect this is the last of it., Using {{HashCodeBuilder}} and {{EqualsBuilder}} makes it a lot easier to add these methods.  So I don't really mind.  I agree that adding suppressions is not ideal.

+1 pending Jenkins., oh, I see that this is for the HDFS-4949 branch.  Then you don't need a Jenkins run.  Thanks for testing this with Findbugs., +1, {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12605398/HDFS-5266.addendum.patch
  against trunk revision .

    {color:red}-1 patch{color}.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-HDFS-Build/5057//console

This message is automatically generated., I committed the addendum patch to the HDFS-4949 branch.  Thanks again for the reviews., FAILURE: Integrated in Hadoop-Hdfs-0.23-Build #802 (See [https://builds.apache.org/job/Hadoop-Hdfs-0.23-Build/802/])
svn merge -c 1545322 merging from trunk to branch-0.23 to fix HDFS-5266. Datanode cannot roll back to previous layout version. (kihwal: http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1545326)
* /hadoop/common/branches/branch-0.23/hadoop-hdfs-project/hadoop-hdfs/CHANGES.txt
* /hadoop/common/branches/branch-0.23/hadoop-hdfs-project/hadoop-hdfs/src/main/java/org/apache/hadoop/hdfs/server/datanode/DataStorage.java
* /hadoop/common/branches/branch-0.23/hadoop-hdfs-project/hadoop-hdfs/src/test/java/org/apache/hadoop/hdfs/TestDFSRollback.java
]