[This patch should fix the bug., I like Raghu's suggestion, which is to simply set a boolean flag in the catch clause (the clause has to be moved to the outset) and add a checking of the flag to the if (Thread.interrupted()) {} block. That way the exit logic is easier to understand (with the comments there). Having the exit logic in one place also facilitates adding further checking on the reason of the interrupt (i.e., local error or downstream error)., Ok, whatever is easier for your future change, I will do it for you., +1 for the patch., All unit tests passed. Test patch result:
     [exec] +1 overall.
     [exec]
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec]
     [exec]     -1 tests included.  The patch doesn't appear to include any new or modified tests.
     [exec]                         Please justify why no new tests are needed for this patch.
     [exec]                         Also please list what manual steps were performed to verify this patch.
     [exec]
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec]
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec]
     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs warnings.
     [exec]
     [exec]     +1 release audit.  The applied patch does not increase the total number of release audit warnings.

Unit test is not included because HDFS-624 exposed the bug and with this patch the previously failed test is passed.
, I've just committed this., Integrated in Hadoop-Hdfs-trunk-Commit #57 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Hdfs-trunk-Commit/57/])
    , Integrated in Hadoop-Hdfs-trunk #98 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Hdfs-trunk/98/])
    , No new unit tests were added because it was found with TestFileAppend3#TC7, which can act as a regression test., Integrated in Hdfs-Patch-h2.grid.sp2.yahoo.net #20 (See [http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h2.grid.sp2.yahoo.net/20/])
    ]