[A few warnings can be useful for debugging

From NN
=======
2011-09-30 18:58:11,920 WARN org.mortbay.log: /data/user/hadoopqa/input1/part-00000: java.io.IOException: Security
enabled but user not authenticated by filter

But the same user can do distcp over hdfs:// successfully

, Yes, the selected token isn't being set and passed in the request.  Agreed it's not easy to know the error w/o looking at the NN's logs., Fix to call setDelegationToken with a token located in the cache.

Move token initialization into a new method.  Update initialize method to call the token init.

Using aforementioned change to write unit tests to verify that the token is set, and that the correct token is set., Hftp tests pass.  Didn't run full suite since nothing else stresses hftp code path., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12497239/HDFS-2392.patch
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-HDFS-Build/1325//console

This message is automatically generated., +1 for the patch. ,      [exec] +1 overall.  
     [exec] 
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec] 
     [exec]     +1 tests included.  The patch appears to include 3 new or modified tests.
     [exec] 
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec] 
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec] 
     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.
, Committed to 205,206., Thanks to Daryn for the patch., Is this also needed in trunk, or can we resolve it?  Thanks., I'll include it in the trunk merge of HADOOP-7510 since it was an oversight in that jira's changes., Closed upon release of 0.20.205.0]