[Hi [~jucaf], I'm not a security expert. But looks like the error msg "No common protection layer between client and server" is caused by different saslQOP values on server (JournalNode) and client (NameNode) of the RPC protocol. Have you set the same value of "hadoop.rpc.protection" (e.g., auth-conf) in your NNs and all the JournalNodes?, [~jingzhao]
In my configuration I'm running JN in host1 host2 and host3 and NN in host1 and host2. Sharing core-site.xml and hdfs-site.xml. So there are only one hadoop.rpc.protection (only with authenticate it works). Also add that it works perfectly with nfs, instead of QJM of course, so it tell us everything is working perfectly but JNs., There are multiple tests covering this feature (i.e., wire-encryption over RPC), therefore I believe that it might be a configuration error.

Can you post your configuration?, [~jucaf], please provide the information required for verifying if this is indeed a bug. I will close this jira after a week or so, if information required is not posted to the jira., Also in my bash_profile I have export HADOOP_OPTS="$HADOOP_OPTS -Djava.security.auth.login.config=/opt/hadoop/etc/hadoop/jaas.conf"

Do you need more configurations or environment parameters?, [~wheat9], can you please comment on this issue?, [~jucaf], can you post your configuration for both the journalnode and the namenode? You can get the configuration by accessing {{http://<host-port>/conf}}., I can't access to any http/https url because it fails on start time, I attached xml files on the issue., Config files from url, sorry [~wheat9] I could do it accessing to the URL before namenodes go down, journalnodes doesn't go down. It was my mistake, Why has being marked as closed? I wasn't able to run QJM + SSL, This seems to be working just fine on my 2.5.0 cluster. Both JN and NN have the same hadoop.rpc.protection configs and thereby avoids the error.

Unless you're still facing this [~jucaf], I'd propose we close this as 'Cannot Reproduce'.]