[If the 'fs' is not an instance of DistributedFileSystem the current code prints an error and returns with an exit code. The patch changes to throw IllegalArgumentException. I believe DFSAdmin#run will catch this exception and still print just the error. Does it make sense to add/modify a unit test to make sure an error code is returned in case of this error?

Patch looks good otherwise., You are right, now we throw the exception and run() catches it.  And it is where the returned code is set to -1.
I've added a test for return code for invalid (no DFS) file system., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12476271/HDFS-1824-1.patch
  against trunk revision 1091874.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    -1 javac.  The patch appears to cause tar ant target to fail.

    -1 findbugs.  The patch appears to cause Findbugs (version 1.3.9) to fail.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed these core unit tests:


    -1 contrib tests.  The patch failed contrib unit tests.

    -1 system test framework.  The patch failed system test framework compile.

Test results: https://hudson.apache.org/hudson/job/PreCommit-HDFS-Build/362//testReport/
Console output: https://hudson.apache.org/hudson/job/PreCommit-HDFS-Build/362//console

This message is automatically generated., The patch looks good. +1
Please address the hudson failures.
, Failures from the comment above are caused by the fact that this change required changes in Common which were not committed yet.
I ran test-patch and tests manually and all passed., committed to trunk., Integrated in Hadoop-Hdfs-trunk-Commit #594 (See [https://hudson.apache.org/hudson/job/Hadoop-Hdfs-trunk-Commit/594/])
    HDFS-1824. delay instantiation of file system object until it is needed (linked to HADOOP-7207)
, not for commit. For previous version., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12476394/HDFS-1824-1-22.patch
  against trunk revision 1092534.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    -1 patch.  The patch command could not apply the patch.

Console output: https://hudson.apache.org/hudson/job/PreCommit-HDFS-Build/372//console

This message is automatically generated., Integrated in Hadoop-Hdfs-trunk #643 (See [https://builds.apache.org/hudson/job/Hadoop-Hdfs-trunk/643/])
    ]