[Thanks for the report Stephen!

In snapshot .snapshot is actually not a directory and just used to represent a snapshot path. Currently we allow users to use "ls /tmp/.snapshot" for listing all snapshots of the directory /tmp, but users will get exception if they treat ".snapshot" as a normal directory in other commands. Maybe we should provide more clear error msg to users., Thanks for the clarification, Jing. I see that _dfs -count_ of /tmp does take into account the quotas contributed by its snapshots., Yeah, snapshots are taken into account when calculating quotas. Specifically, each snapshot diff, which is generated for a file/directory to record the difference between its current and previous states, causes a +1 on the namespace quota. , Maybe in the future, we can support such functionality as counting the quota usage for snapshots under a specific directory. And at that time we can add capability to process commands like "dfs -count /tmp/.snapshot". However, the rename operations may make this computation challenging., This should be resolved as invalid. Jing, we should perhaps add more info to clarify this?, Yes, I will check the snapshot document to make sure we mention ".snapshot" is not a valid directory. 
[~schu], I will mark this as invalid first. Feel free to create a new jira if you think to provide more accurate error msg to end users is necessary., ".snapshot" is not a directory thus commands such as "count" and "du" do not work on path ending with ".snapshot"., Hey Jing, not sure I agree with this reasoning. Why shouldn't `hadoop fs -count' work on a '.snapshot' pseudo-directory, just as it does on a real directory? I'd think it would just add up all of the files/space consumed in all of the snapshots under that pseudo-directory and report that back. I'd think that basically all read-only commands should work, much as they do in the special directories '.zfs' and '.snapshot' in ZFS and WAFL, respectively.

Also, note that, contrary to your last comment, `hadoop fs -du' does appear to currently work on a '.snapshot' directory:

{noformat}
$ hadoop fs -du .snapshot
3338  .snapshot/s20130528-165940.694
3338  .snapshot/s20130528-170045.101
3338  .snapshot/s20130528-170828.222
{noformat}

Though this output is not quite correct, since in these snapshots only the last one actually contains any files which have non-zero space, but they're all showing 3338 bytes consumed:

{noformat}
$ hadoop fs -ls .snapshot/*
Found 2 items
drwxr-xr-x   - atm atm          0 2013-05-28 16:56 .snapshot/s20130528-165940.694/bar
drwxr-xr-x   - atm atm          0 2013-05-28 16:56 .snapshot/s20130528-165940.694/foo
Found 2 items
drwxr-xr-x   - atm atm          0 2013-05-28 16:56 .snapshot/s20130528-170045.101/bar
drwxr-xr-x   - atm atm          0 2013-05-28 16:56 .snapshot/s20130528-170045.101/foo
Found 3 items
-rw-r--r--   1 atm atm       3338 2013-05-28 17:08 .snapshot/s20130528-170828.222/.bashrc
drwxr-xr-x   - atm atm          0 2013-05-28 16:56 .snapshot/s20130528-170828.222/bar
drwxr-xr-x   - atm atm          0 2013-05-28 16:56 .snapshot/s20130528-170828.222/foo
{noformat}, Hi Aaron, thanks for the comments! 

bq. I'd think it would just add up all of the files/space consumed in all of the snapshots under that pseudo-directory and report that back.
Agree. I also mentioned this in my previous comment "we can support such functionality as counting the quota usage for snapshots under a specific directory. And at that time we can add capability to process commands like "dfs -count /tmp/.snapshot"." :)

The main challenge for counting quota usage by snapshots is brought by rename. Actually we supported such functionality before by extending INode#computeContentSummary. But because the rename operation can break the original calculation we removed that part first. I will work on this later in a separate jira.

bq. I'd think that basically all read-only commands should work, much as they do in the special directories '.zfs' and '.snapshot' in ZFS and WAFL, respectively.
Yeah, I think we should support this. Currently we modify the FSDirectory#getListing to support "ls". We can do similar stuff for other commands. But maybe we can also provide a set of snapshot-related tools for similar functionalities. Still let's do this in separate jiras., bq. Also, note that, contrary to your last comment, `hadoop fs -du' does appear to currently work on a '.snapshot' directory:

I would rather turn it off.

I think .snapshot is not a directory. Lets not try to make it like one for administrative commands and add complexity. But if anyone wants to pursue it, lets do it in a separate jira. As it stand currently, the functionality expected by this jira is not supported.]