[Patch for this jira is going to assume that hadoop-common third party jar files can be referenced from HADOOP_HOME/lib until HADOOP-6255 and proposed HADOOP_PREFIX take place.  Where HADOOP_HOME is the PREFIX directory of hadoop-common-0.2x.y = hadoop-hdfs-0.2x.y = hadoop-mapred-0.2x.y., * Changed ivy configuration to setup third party jar file for compile profile.
* common profile contains only common-daemon to be included in HADOOP_HOME/lib.
, Remove packaging of duplicated third party jar files, Though I understand the goal is to separate the hdfs only dependencies for easier dedup, it seems to me that if you keep the common profile as is and add an hdfs profile for common-daemon. The patch would be smaller and less confusing (the common profile now contains hdfs only dependencies and the compile profile is actually from common.), Revise patch to add hdfs ivy configuration.  Thanks Luke!, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12479007/HDFS-1917.patch
  against trunk revision 1102153.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    -1 findbugs.  The patch appears to introduce 1 new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed these core unit tests:
                  org.apache.hadoop.cli.TestHDFSCLI
                  org.apache.hadoop.hdfs.server.namenode.TestBlocksWithNotEnoughRacks
                  org.apache.hadoop.hdfs.TestDFSShell
                  org.apache.hadoop.hdfs.TestDFSStorageStateRecovery
                  org.apache.hadoop.hdfs.TestFileConcurrentReader
                  org.apache.hadoop.tools.TestJMXGet

    +1 contrib tests.  The patch passed contrib unit tests.

    -1 system test framework.  The patch failed system test framework compile.

Test results: https://builds.apache.org/hudson/job/PreCommit-HDFS-Build/506//testReport/
Findbugs warnings: https://builds.apache.org/hudson/job/PreCommit-HDFS-Build/506//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/hudson/job/PreCommit-HDFS-Build/506//console

This message is automatically generated., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12479013/HDFS-1917-1.patch
  against trunk revision 1102467.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 1 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed these core unit tests:
                  org.apache.hadoop.cli.TestHDFSCLI
                  org.apache.hadoop.hdfs.TestDFSStorageStateRecovery
                  org.apache.hadoop.hdfs.TestFileConcurrentReader
                  org.apache.hadoop.tools.TestJMXGet

    +1 contrib tests.  The patch passed contrib unit tests.

    +1 system test framework.  The patch passed system test framework compile.

Test results: https://builds.apache.org/hudson/job/PreCommit-HDFS-Build/507//testReport/
Findbugs warnings: https://builds.apache.org/hudson/job/PreCommit-HDFS-Build/507//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/hudson/job/PreCommit-HDFS-Build/507//console

This message is automatically generated., Quote from HDFS-1903:

These test changes correspond to changes in HADOOP-7267. The TestHDFSCLI and TestDFSShell errors occurred because the build started before the hadoop bug was committed. The flux in these tests should wind down in a few days.

The test fail is not related to this patch., +1 patch looks good., I have committed this.  Thanks, Eric!, Not sure why the testbot didn't catch this, but it looks like this commit broke the system test compilation. Seeing "Reference ivy-hdfs.classpath not found." when I run ant test-system. Reverting this patch locally fixes it., Jolly points out that making ivy-retrieve-common depend on ivy-retrieve-hdfs fixes the issue. Does that seem right to you guys?, Todd, good catch.  Filed HDFS-1938 and Eric is looking at it., ivy-retrieve-common should not depends on ivy-retrieve-hdfs.  It becomes a circular dependency.  It looks like ivy-retrieve-hdfs is not initialized when calling test-system.  I will track it down, thanks Todd., Integrated in Hadoop-Hdfs-trunk-Commit #658 (See [https://builds.apache.org/hudson/job/Hadoop-Hdfs-trunk-Commit/658/])
    , Integrated in Hadoop-Hdfs-trunk #673 (See [https://builds.apache.org/hudson/job/Hadoop-Hdfs-trunk/673/])
    ]