[Patch for Y20S. Not for commit here., A couple of comments on the patch:
* hdfs_permissions_guide.xml and hdfs_default.xml has documentation for "dfs.permissions.supergroup". It should be modified/removed.
* TestMapredSystemDir sets a value for the configuration "dfs.permissions.supergroup". The same should be removed.

Other code changes look good to me., +1 for the patch. Documentation needs to be updated to describe new config param dfs.cluster.administrators in hdfs_permissions_guide.xml. , Updated patch for Y20S, Patch for trunk. , -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12449311/hdfs-1130-trunk.patch
  against trunk revision 962908.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h2.grid.sp2.yahoo.net/215/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h2.grid.sp2.yahoo.net/215/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h2.grid.sp2.yahoo.net/215/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h2.grid.sp2.yahoo.net/215/console

This message is automatically generated., Code changes in the patch look good. 
But some tests in MapReduce project (e.g. TestMRCLI) would fail after this patch. We should raise a follow up jira in MapReduce parallelly to remove "dfs.permissions.supergroup" and fix the testcases., This is an updated patch for trunk that mirrors the Y20 patch. For now, I think we should just do this, and have the changes to do with dfs.permissions.supergroup handled in a separate jira., In Y20 patch, I see that the user who started the NameNode/DataNode is added to the admin ACL. But the trunk's version takes it only from the configuration "dfs.cluster.administrators". Shall we add the user who started the NameNode/DataNode to the admin ACL?, Yeah in the Y20S patch, i had added the user who starts the NN/DN to the admin ACL. But now I don't think that's required. Typically, this user would already be part of the group configured in the dfs.cluster.administrators ACL. , Trying hudson again, +1Patch looks good., I just committed this. (all tests/test-patch passed with the patch)., Integrated in Hadoop-Hdfs-trunk-Commit #370 (See [https://hudson.apache.org/hudson/job/Hadoop-Hdfs-trunk-Commit/370/])
    ]