[Patch to use defined addr, for Y!20. Trunk patch soon..., Patch for trunk.  Exactly the same as the 20 patch, which we've tested manually extensively here.  This code is buried quite deep in the guts of the secondary namenode; I think a new unit test isn't feasible here, without a serious, potentially destabilizing refactor.  I'd like to go ahead without one.

This issue occurs, and prevents the 2ndNN from functioning correctly, when a machine is running on a secure cluster and using IP aliasing to run as a different host than is returned from getLocalHost.  The NN will attempt to connect to the local host (say 192.168.0.1) rather than the alias (say secure-2nn), and this will fail the Kerberized SSL authentication and prevent the merged image from being downloaded., Submitting patch.  , This should be fine without new unit tests.  It has been tested both directly and indirectly., # You might want also to remove the import of {{InetAddress}}, as it is not used anywhere after the change.
# The same code is used in {{Checkpointer.uploadCheckpoint()}}, which is a part of {{BackupNode}}. Should we replace it there as well?, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12446514/HDFS-1080-trunk.patch
  against trunk revision 951555.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h5.grid.sp2.yahoo.net/399/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h5.grid.sp2.yahoo.net/399/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h5.grid.sp2.yahoo.net/399/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h5.grid.sp2.yahoo.net/399/console

This message is automatically generated., Updated patch per Konstantin's comments. Checkpointer needed a bit more work to get the relevant information to the right to the needed function, but should work exactly the same.  I'm going to open a JIRA to combine this code duplication until the 2ndarryNN is removed.  

Konstantin pointed out that this will be an incompatible change in that, were one specifying localhost as the 2nd/CP Nodes' address and relying on that value to be resolved on the node.  For now on, one will need to specify the exact address to use, which is much more correct in my opinion, particularly on production systems that may rely on IP aliasing.  I'll mark this as incompatible., +1. 
Yes, this is incompatible in the sense that currently NN and SNN can communicate if SNN uses local host - the default value for its http address, while after the patch they wont be able to. I also think this is a correct behavior. We should clearly mark this in release notes., Re-submitting to Hudson for new patch., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12446633/HDFS-1080-trunk-1.patch
  against trunk revision 952861.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h5.grid.sp2.yahoo.net/402/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h5.grid.sp2.yahoo.net/402/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h5.grid.sp2.yahoo.net/402/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h5.grid.sp2.yahoo.net/402/console

This message is automatically generated., Failed tests are unrelated.  I'm going to go ahead and commit this., I've committed this.  Resolving as fixed., Integrated in Hadoop-Hdfs-trunk-Commit #310 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Hdfs-trunk-Commit/310/])
    ]