[The problem occurs because -server option was in the wrong place.
The patch fixes the problem by removing -server option if present and then adding it in the correct place., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12526234/hdfs-jsvc.patch
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-HADOOP-Build/976//console

This message is automatically generated., +1
I just committed this to branch 0.22.1. Thank you Benoy., Integrated in Hadoop-Hdfs-22-branch #131 (See [https://builds.apache.org/job/Hadoop-Hdfs-22-branch/131/])
    HDFS-3402. Fix hdfs script for secure datanodes. Contributed by Benoy Antony. (Revision 1346210)

     Result = FAILURE
shv : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1346210
Files : 
* /hadoop/common/branches/branch-0.22/hdfs/CHANGES.txt
* /hadoop/common/branches/branch-0.22/hdfs/bin/hdfs
, The error occurs on 1.1 also, attaching the patch for 1.1, Benoy, quick question - what does the following change do:
> HADOOP_OPTS=${HADOOP_OPTS#-server}
, Ok found the answer in bash parameter expansion. Question is, it only removes "-server" if HADOOP_OPTS starts with that. Else it leaves it alone. Is that intended?, I think, you are right. That was not intended.  I'll fix the patch to remove "-server" properly  and not just from start., Benoy, you just need this right:
> HADOOP_OPTS=${HADOOP_OPTS/-server/}, yes, the proposed change works. I have tested it. 

Attaching the new patch with the proposed change., +1 for the patch. Committed it to branch-1. Thank you Benoy., Closed upon release of Hadoop 1.2.0.]