[Full log attached., This is a regression caused by HDFS-1071, edited issue summary - this isn't from one of the AOP-based FI tests - it's just fault injection using Mockito from a normal unit test, Seems the first problem is that the faulty image delegates back to itself rather than the original image, so you get a stack overflow. After fixing that, the test still fails., This patch fixes it for me., +1 patch looks good., Could anybody please explain the problem and the solution. A don't understand it from the comments above., Sure, no problem. This test uses a mockito "spy" object to inject some code right before the saveFSImage call. In some cases we want to call through to the original saveFSImage, in other cases we just want to throw an exception. For whatever reason, an incorrect change was made in HDFS-1071 which made the "call through" case call through to the same spy object rather than the unmodified class, so of course it infinitely recursed and blew out the stack. The patch switches to using the more "proper" way of doing this in Mockito - the callRealMethod() function., Thanks for clarifications, Todd. I was not sure if the new code broke the test itself or the feature it is testing. Now I understand it the test problem., +1. Tested on my box: testCrashWhileSavingSecondImage() fails without the patch, but passes with it., anyone want to commit?, {noformat}
     [exec] 
     [exec] +1 overall.  
     [exec] 
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec] 
     [exec]     +1 tests included.  The patch appears to include 3 new or modified tests.
     [exec] 
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec] 
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec] 
     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.
     [exec] 
     [exec]     +1 release audit.  The applied patch does not increase the total number of release audit warnings.
     [exec] 
     [exec]     +1 system test framework.  The patch passed system test framework compile.
     [exec] 
{noformat}, I have just committed this to trunk. Thanks Todd!

The patch doesn't apply to 0.22. Moreover, in 0.22 this test passes on my machine. Please let me know if this patch (with minor variation) is applicable for 0.22 as well., Just in case the modification of the patch for 0.22 in case it needs to be committed as well., Hey Cos,

Looks like we were working at the same time, I already backported it to 22 (which is why you probably saw that the patch didn't apply).

Thanks,
Eli, Please disregard my last comment about 0.22 - looks like Eli has merged the commit to 0.22 almost concurrently, although it seemed unnecessary., Integrated in Hadoop-Hdfs-22-branch #35 (See [https://builds.apache.org/hudson/job/Hadoop-Hdfs-22-branch/35/])
    ]