[Brian,

Apologies for coming in very late. Nice patch, thanks!

Given (2), is (1) unnecessary?, Thanks for taking a look; yeah, you're right that (2) alone is enough to fix the issue.

I've attached an updated patch which only does that; I also fixed the paths so that it applies against hadoop trunk. Thanks!, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12509341/patch.fuse-dfs.kernel
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 javadoc.  The javadoc tool appears to have generated 20 warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 eclipse:eclipse.  The patch built with eclipse:eclipse.

    -1 findbugs.  The patch appears to introduce 1 new Findbugs (version 1.3.9) warnings.

    -1 release audit.  The applied patch generated 1 release audit warnings (more than the trunk's current 0 warnings).

    -1 core tests.  The patch failed these unit tests:
                  org.apache.hadoop.hdfs.TestDatanodeBlockScanner

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-HDFS-Build/1752//testReport/
Release audit warnings: https://builds.apache.org/job/PreCommit-HDFS-Build/1752//artifact/trunk/patchprocess/patchReleaseAuditProblems.txt
Findbugs warnings: https://builds.apache.org/job/PreCommit-HDFS-Build/1752//artifact/trunk/hadoop-hdfs-project/patchprocess/newPatchFindbugsWarningshadoop-hdfs.html
Console output: https://builds.apache.org/job/PreCommit-HDFS-Build/1752//console

This message is automatically generated., Awesome! I'm in process of testing this out manually right now and I'll commit it in once I have the {{ro}} mount working!

Thanks again for this neat addition :), cancelling patch, as it no longer applies, duplicate of HDFS-4139 from 2012]