[Thanks for reporting this issue. [~arpitagarwal] while fixing this issue, we should add a unit test for this condition to make sure we catch this type of issue. , Thanks for reporting Fengdong! I am taking a look., [~azuryy] Was this an upgrade or a freshly formatted cluster? I am not sure how we got an image with a zero {{LastAllocatedBlockId}}. I'll see if I can repro it.

Thanks., Hi Arpit,

I will add some reprduce steps here shortly., A quick feedback is that: I upgraded the cluster from 2.0.5-alpha to the trunk., Hi Arpit,

I am already have a HA cluster(LayoutVersion=-43), and I don't want to upgrade, because upgrade under HA is complicated. 

AFAIK, upgrade under HA cluster including:
1) stop-dfs
2) replace core-site.xml hdfs-site.xml with Non-HA xmls.
3) merge edit logs from standby NN to active NN
4) start-dfs  -upgrade
5) stop-dfs
6) revert core-site.xml and hdfs-site.xml(HA)
7) initializeSharedEdits
8) start-dfs

So, I did some hack in the trunk codes, like following:
{code}
-    OPTIMIZE_SNAPSHOT_INODES(-45, -43,
+    OPTIMIZE_SNAPSHOT_INODES(-43, -43,
         "Reduce snapshot inode memory footprint", false),
-    SEQUENTIAL_BLOCK_ID(-46, "Allocate block IDs sequentially and store " +
-        "block IDs in the edits log and image files");
+    SEQUENTIAL_BLOCK_ID(-43, -43, "Allocate block IDs sequentially and store " +
+        "block IDs in the edits log and image files", false);
{code}

after that, I saw the above errors.

but now, I revert LayoutVersion.java, and upgraded cluster(eight steps I mentions at first)

It works, no Exceptions.

So we can close this issue with "not a problem". but I want to know:

Am I right for these eight steps during upgrade?(from one HA verson to another HA version, such as from LayoutVersion -43 to -46)



, 

After I read the code, I don't think this issue is caused by my 'hack'., I want to add more of my further tests:

HDFS-4645 commited version in the trunk is :r1500580 ,then I checked out r1500194 from the trunk, just before HDFS-4645 checked in.

then I am also do some hack:
{code}
--- hadoop-hdfs-project/hadoop-hdfs/src/main/java/org/apache/hadoop/hdfs/protocol/LayoutVersion.java    (revision 1500194)
+++ hadoop-hdfs-project/hadoop-hdfs/src/main/java/org/apache/hadoop/hdfs/protocol/LayoutVersion.java    (working copy)
@@ -101,7 +101,7 @@
     SNAPSHOT(-43, "Support for snapshot feature"),
     RESERVED_REL1_3_0(-44, -41,
         "Reserved for release 1.3.0", true, ADD_INODE_ID, SNAPSHOT),
-    OPTIMIZE_SNAPSHOT_INODES(-45, -43,
+    OPTIMIZE_SNAPSHOT_INODES(-43, -43,
         "Reduce snapshot inode memory footprint", false);
{code}

then I "start-dfs.sh", everything looks good to me.

so we cannot close this issue currently.
, Hi Fengdong,

This doesn't look like a good way to force the upgrade. By overriding the image version the namenode will attempt to read fields that do not exist in the image and it will corrupt the namenode state. Even if you don't hit an assertion right away your namenode state is unpredictable.

The repro steps you specified earlier look mostly correct. Step 3 should not be necessary. You can run the upgrade step offline on a pseudo cluster without changing your production configurations., Hi Fengdong,

   After your hacking 
{code}
+    SEQUENTIAL_BLOCK_ID(-43, -43, "Allocate block IDs sequentially and store " +
+        "block IDs in the edits log and image files", false);
{code}

   when loading your old fsimage, the code below will be executed (in FSImageFormat#load):
{code}
   if (LayoutVersion.supports(Feature.SEQUENTIAL_BLOCK_ID, imgVersion)) {
     // read the starting generation stamp for sequential block IDs
     genstamp = in.readLong();
{code}

   and actually in your old fsimage, there is no such a long value written in your fsimage. And this causes the error you saw., bq.The repro steps you specified earlier look mostly correct. Step 3 should not be necessary. 
Arpit, 
I think step 3 is necessary, otherwise name node complain "cannot find edlit logs with txid from xxx"

bq.and actually in your old fsimage, there is no such a long value written in your fsimage. And this causes the error you saw.
Jing,
yes, this is the root cause. I'll test it futher today., > ... then I am also do some hack ...

Fengdong, we cannot change the layout version number.  Otherwise, your fsimage won't be compatible with trunk.

> So we can close this issue with "not a problem". ...

Sure, let's close this., bq. The repro steps you specified earlier look mostly correct. Step 3 should not be necessary.

Arpit, yes, step 3 is not necessary after I test. but we must do upgrade on the active NN. I added step3 here just because I upgraded on the standby NN last time.


Let's close this issue with "not a problem". Thanks all.
]