[This should be fixed in all three current branches. As mentioned in the description, it can prevent the write pipeline from recovering since ClientDatanodeProtocol and InterDatanodeProtocol won't be able to connect., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12434614/hdfs-894.txt
  against trunk revision 905760.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 2 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h2.grid.sp2.yahoo.net/111/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h2.grid.sp2.yahoo.net/111/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h2.grid.sp2.yahoo.net/111/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h2.grid.sp2.yahoo.net/111/console

This message is automatically generated., Failed test seems unrelated., Filed HDFS-953 for the testpatch failure seen above.

I think this is ready to commit., +1, The code looks good. But since this is not a regression (and datanodes typically re-register with the same ipcPort) can we put this patch only in trunk?, bq. datanodes typically re-register with the same ipcPort

Unless you've configured the datanode IPC port to 0 - I do this on my test clusters on shared hardware, for example.

bq. this is not a regression

true enough. I find it an obvious enough bug that causes big problems when binding to port 0, that we should put it in all branches. But if you disagree, trunk's fine., I've just committed this. Thanks Todd!, Integrated in Hadoop-Hdfs-trunk-Commit #193 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Hdfs-trunk-Commit/193/])
    , Integrated in Hdfs-Patch-h2.grid.sp2.yahoo.net #146 (See [http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h2.grid.sp2.yahoo.net/146/])
    , Integrated in Hadoop-Hdfs-trunk #275 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Hdfs-trunk/275/])
    ]