[The test verifies the correct behavior of the client when one of data-nodes involved in data-transfer pipeline fails.
The client creates a pipeline, then the last data-node is shutdown, and the test verifies that file {{close()}} does not succeed.
The problem is that when the client detects the pipeline is broken it turns on the retry logic, which contacts the name-node and allocates a new block. The name-node at that time has only 2 data-nodes remaining, and therefore is unable to allocate three locations for the block. It throws an exception:
{code}
IOException File /TestFileCreation/dhrubashutdown could only be replicated to 2 nodes, instead of 3
{code}
If the exception is thrown when the test tries to close the file it passes. If the exception is thrown before the close the test fails, although printed message says "testFsCloseAfterClusterShutdown successful"., This patch 
# changes number of data-nodes to 4 from 3 in order to avoid the exception from the name-node;
# corrects messages;
# closed the file system in the final section., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12416115/TestFileCreate.patch
  against trunk revision 802972.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-vesta.apache.org/56/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-vesta.apache.org/56/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-vesta.apache.org/56/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-vesta.apache.org/56/console

This message is automatically generated., +1 looks good to me., Unfortunately, TestFileCreation.testFsCloseAfterClusterShutdown failed after the patch., Cannot reproduce it though yet., The assertion in line 887 failed.
{noformat}
junit.framework.AssertionFailedError: Failed to close file after cluster shutdown
	at org.apache.hadoop.hdfs.TestFileCreation.testFsCloseAfterClusterShutdown(TestFileCreation.java:887)
{noformat}
We may print out the exception for a better understanding the problem.  See below
{code}
      boolean hasException = false;
      try {
        out.close();
        System.out.println("testFsCloseAfterClusterShutdown: Error here");
      } catch (IOException e) {
        hasException = true;
//print out the IOException e here.
      }
      assertTrue("Failed to close file after cluster shutdown", hasException);  //line 887
      System.out.println("testFsCloseAfterClusterShutdown successful");
{code}
, test, This patch does indeed cause testFsCloseAfterClusterShutdown to fail for me:
{noformat}4893 Testcase: testFsClose took 3.137 sec
4894 Testcase: testFsCloseAfterClusterShutdown took 2.751 sec
4895   FAILED
4896 Failed to close file after cluster shutdown
4897 junit.framework.AssertionFailedError: Failed to close file after cluster shutdown
4898   at org.apache.hadoop.hdfs.TestFileCreation.testFsCloseAfterClusterShutdown(TestFileCreation.java:851){noformat}
Canceling patch for Konstanin to update, although I don't believe we've seen this problem for a while, so may we can just close this issue?, I think this become stale.  Resolving as not-a-problem.]