[The patch addresses the problem and moves the pointcut's binding to a different location, which seems to be satisfactory., Cos, thanks for catching this. What I did in HDFS-537 was that I moved createBlockWriteStream from FSDataset to ReplicaInPipeline., This version of the patch represents a way better fix of the problem, The result of test-patch execution on my machine:

+1 overall.  
    +1 @author.  The patch does not contain any @author tags.
    +1 tests included.  The patch appears to include 3 new or modified tests.
    +1 javadoc.  The javadoc tool did not generate any warning messages.
    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
    +1 findbugs.  The patch does not introduce any new Findbugs warnings.
    +1 release audit.  The applied patch does not increase the total number of release audit warnings.
, The patch is ready, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12420384/HDFS-597.patch
  against trunk revision 819713.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h2.grid.sp2.yahoo.net/13/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h2.grid.sp2.yahoo.net/13/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h2.grid.sp2.yahoo.net/13/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h2.grid.sp2.yahoo.net/13/console

This message is automatically generated., The test results page doesn't have any {noformat}
-1 core tests. The patch failed core unit tests.
{noformat}

doesn't show any failing tests at all. Is it a test-patch problem of some kind? I'll run all tests locally one more time to reassure  that the patch is Ok, +1, The patch cannot be applied.  Cos, could you syn it with trunk?, Thank you so much for your help, Nicholas!, It suppose to be for Append branch, not trunk., You are right, Cos.  I have committed it to the Append Branch.  Thanks!]