[Patch for Y20. Not for commit., Some minor changes., Updates HsFtpFileSystem.. Patch for Y20. Not for commit here., This patch is a bugfix on top of the distcp-hftp.2.patch., The delegation token should be fetched by distcp client, not by HftpFilesystem (or HsftpFilesystem)., ugi over http fix. for previous version, not for commit, Patch adding a bugfix in the last patch that Boris attached., for prev version, not for Commit, for prev. version. fix for the patch., Bugfix for handling null tokens (for Y20S), Attaching a patch that makes long running servers using hftp work. Also has some refactoring in the MR code to do with handling of delegation tokens. Patch for Y!20S., Attaching a patch that fixes a problem in SecurityUtil.buildDTServiceName to do with handling of null host in the URI. Patch for Y20S. , patch for trunk
includes:
1007-bugfix.patch
HDFS-1007-BP20-fix-3.patch
distcp-hftp-2.1.1.patch
distcp-hftp.2.1.patch
distcp-hftp.2.patch, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12449130/HDFS-1007-1.patch
  against trunk revision 962696.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 javadoc.  The javadoc tool appears to have generated 1 warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    -1 findbugs.  The patch appears to introduce 1 new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h5.grid.sp2.yahoo.net/429/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h5.grid.sp2.yahoo.net/429/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h5.grid.sp2.yahoo.net/429/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h5.grid.sp2.yahoo.net/429/console

This message is automatically generated., fixed javadoc and findbug warnings
Ran all the tests - all passed (except TestHdfsTrash).

There are not tests in this patch. It will be tested by the test in TestTokenCache (in MR)., Looks fine. Is the MR patch going to test hftp end-to-end (via distcp) ?, TestTokenCache will test getting delegation token over HTTP...

, merged with trunk, committed to trunk, Integrated in Hadoop-Hdfs-trunk-Commit #342 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Hdfs-trunk-Commit/342/])
    HDFS-1007.  HFTP needs to be updated to use delegation tokens
, Integrated in Hadoop-Hdfs-trunk-Commit #370 (See [https://hudson.apache.org/hudson/job/Hadoop-Hdfs-trunk-Commit/370/])
    ]