[I have attached a patch for trunk., {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12592723/HDFS-5002.patch
  against trunk revision .

    {color:green}+1 @author{color}.  The patch does not contain any @author tags.

    {color:red}-1 tests included{color}.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    {color:green}+1 javac{color}.  The applied patch does not increase the total number of javac compiler warnings.

    {color:green}+1 javadoc{color}.  The javadoc tool did not generate any warning messages.

    {color:green}+1 eclipse:eclipse{color}.  The patch built with eclipse:eclipse.

    {color:green}+1 findbugs{color}.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    {color:green}+1 release audit{color}.  The applied patch does not increase the total number of release audit warnings.

    {color:green}+1 core tests{color}.  The patch passed unit tests in hadoop-hdfs-project/hadoop-hdfs.

    {color:green}+1 contrib tests{color}.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-HDFS-Build/4667//testReport/
Console output: https://builds.apache.org/job/PreCommit-HDFS-Build/4667//console

This message is automatically generated., No new tests added because this only removed a field which is no longer refered., Hi Kousuke,

   Thanks for the patch! Looks like TestHftpFileSystem.java and NameNodeHttpServer.java are still using the configuration property "dfs.https.port" (but directly using the string). So instead of removing the key from DFSConfigKeys, shall we replace the property string with DFS_HTTPS_PORT_KEY in those two java files? , Hi Jing,

Thank you for your comment!
the newer field "DFS_NAMENODE_HTTPS_PORT_KEY" in DFSConfigKeys are also set to "dfs.https.port".
So, I think we should do two things.

1. Removing older field "DFS_HTTPS_PORT_KEY".
2. Replacing the "dfs.https.port" which is in that two java files into DFS_NAMENOdE_HTTPS_PORT_KEY

Or, should I just only replace without removing?, bq. 1. Removing older field "DFS_HTTPS_PORT_KEY".
bq. 2. Replacing the "dfs.https.port" which is in that two java files into DFS_NAMENOdE_HTTPS_PORT_KEY

Yes, I think we can do this. Could you please provide a patch for this? Thanks!, Sure.
I also create a jira HDFS-5007 to replace hard corded property key and I keep the patch for removing., This issue will be implemented in HDFS-5007.]