[In the secure mode, browsedirectory.jsp needs a delegation token. dfsnodelist.jsp does not pass a delegation token.  The fix was to change the link point to nn_browsedfscontent.jsp. Modified nn_browsedfscontent.jsp  to accept a datanode . If datanode is present, nn_browsedfscontent.jsp redirects to it with delegation token. If datanode is not present, then nn_browsedfscontent.jsp  picks a random datanode and redirects to it., We could save a redirect if dfsnodelist itself gets a delegation token, just like nn_browsedfscontent.jsp and sticks it to browsedirectory.jsp url?

I think similar issue exists in the trunk as well, please provide a patch for trunk as well., What user would they get the delegation token for? Should they not be using SPNEGO and making the client provide kerberos credentials?, To Jitendra's comment: 
That was my first approach to solve the problem. Then I hit on a corner case. The namenode was in safe mode. The call to getDelegationToken failed and page displayed an error. I fixed this by invoking getDelegationToken () only if the namenode is out of safe mode.  
But then these links won't work any more unless the page is refreshed.  

To avoid these inconsistencies, I used the rediect. , Since the link is not broken in insecure clusters, I can do the redirection conditionally so that in in-secure clusters the link points directly to browsedirectory.jsp

I'll make this change and upload the new patch. I'll also test this in trunk and provide a patch for trunk if required., To Arpit's comment, 

The delegation token is retrieved for the user who is using the WEBUI using his/her credentials. , I may be misreading your comments, but I don't understand how this works when the NN isn't out of safe-mode?  You mention the links work after a refresh?  I'm glad you are looking into the problem since it's an annoyance that hasn't been a high even priority for me to fix!, My recent patch 1.1 is based on HTTPS patch, Attaching the patch based on the MAPREDUCE-4661 codebase.
It also keeps the old behavior  with insecure cluster.
, When NN is in safe-mode, the links will not work as no delegation token can be generated. It throws an exception indicating that NN is in safemode.
, I understand the refresh part now.  Could you avoid the redirect if the NN is _not_ in safe-mode?  As for SPNEGO, I think the client does SPNEGO auth to the DN, but the token is for the DN to communicate with the NN.

You should be able to use the current user's ugi to get the token because that will reflect the SPNEGO auth'ed user.  It would have the downside to the token being displayed in every DN link on the NN's node list, but the token is display in the link when at the DN anyway.  On the upside, it would prevent a new token being generated every time the user clicks a link to a DN., That will be a good optimization, Daryn. It will avoid one hit on the NN in the general case (when NN s not in safe-mode). Thanks for the suggestion and I will update the patch., Daryn, I think the current version is fine for now and we could create a new jira for the follow on.

Otherwise, this looks good to me. +1, +1 If Benoy hasn't already made a new patch, I'm fine with another jira., Benoy, this patch does not apply to branch-1 any more. Can you please rebase it?, Seems like this is an important patch.  Can you-all please get it in to branch-1?  Thanks!, Attaching the patch without dependency on MAPREDUCE-4661, Changed Target Version to 1.3.0 upon release of 1.2.0. Please change to 1.2.1 if you intend to submit a fix for branch-1.2., As [~aw] pointed out, it is unlikely that there will be another 1.x release for now. This is not an issue in the 2.x releases. Closing this jira as "Not a Problem"]