[Thanks [~liaoyuxiangqin] for reporting this. This could relate to HDFS-8898 which returns a cached quota usage with the new getQuotaUsage() API from INode directly without recursive traversal and recalculate like getContentSummary() API.

Before HDFS-8898, the "hdfs dfs -count" CLI uses getContentSummary(),  which is expensive because it always walks the whole sub-tree to recalculate quota and usage. This guarantees the correctness no matter the order of step 3 and 4.

After HDFS-8898, we switch to use the getQuotaUsage() API for "hdfs dfs count" CLI, the cached INode quota usage for storage type will be 0 if you don't set storage policy before storage type quota.

This is because the storage type usage is strongly tied to the storage policy. If there is no storage policy set first, we will not be able to determine the quota usage for different storage type. As a result, 0 will be the default in this case.

I believe this is a transient incorrectness that can be fixed by one of the following three options. 

1. This is a corner case. Document the procedure to set storage policy first before set storage type quota. Otherwise, getQuotaUsage() API and "hdfs dfs count" CLI will return an inconsistent result. No fix needed.

2. The cached quota usage will be recalculated correctly any way upon next NN restart, no fix needed.

3. If we really want to allow setting storage type quota before setting storage policy, we can provide an option for "hdfs dfs count" CLI to use getContentSummary() to report the accurate usage.

cc: [~mingma], [~kihwal] for additional comments., Thanks [~xyao] review this and give detail reason explanations and many solutions. As above you proposed three options which can resolve the problem of  "hdfs dfs count" CLI return an inconsistent result, but because the incorrect remaining quota can't limit client continue write data  to HDFS, so that the  "hdfs dfs count" CLI may be return negative number for  remaining quota  after NN restarted. 
{noformat}
 SSD_QUOTA REM_SSD_QUOTA DISK_QUOTA REM_DISK_QUOTA ARCHIVE_QUOTA REM_ARCHIVE_QUOTA PROVIDED_QUOTA REM_PROVIDED_QUOTA PATHNAME
 none inf 6 G -3 G none inf none inf /hot
{noformat}]