[Hello Alexey

Can you provide some more info, e.g from browser dev tools such as firebug ? Check some more logs e.g from namenode. Otherwise we can not confirm if this is a valid bug. , # dpkg -l | grep hadoop
ii  hadoop-2-5-0-0-1245               2.7.3.2.5.0.0-1245                Hadoop is a software platform for processing vast amounts of data
ii  hadoop-2-5-0-0-1245-client        2.7.3.2.5.0.0-1245                Hadoop client side dependencies
ii  hadoop-2-5-0-0-1245-hdfs          2.7.3.2.5.0.0-1245                The Hadoop Distributed File System
ii  hadoop-2-5-0-0-1245-hdfs-namenode 2.7.3.2.5.0.0-1245                The Hadoop namenode manages the block locations of HDFS files
ii  hadoop-2-5-0-0-1245-mapreduce     2.7.3.2.5.0.0-1245                The Hadoop MapReduce (MRv2)
ii  hadoop-2-5-0-0-1245-yarn          2.7.3.2.5.0.0-1245                The Hadoop NextGen MapReduce (YARN)
ii  hadoop-client                     2.7.3.2.5.0.0-1245                hadoop-client is a virtual package that brings hadoop-2-5-0-0-1245-client as a dependency.
ii  hadoop-hdfs-namenode              2.7.3.2.5.0.0-1245                hadoop-hdfs-namenode is a virtual package that brings hadoop-2-5-0-0-1245-hdfs-namenode as a dependency.
ii  hadooplzo                         0.6.0.2.5.0.0-1245                hadooplzo is a virtual package that brings hadooplzo-2-5-0-0-1245 as a dependency.
ii  hadooplzo-2-5-0-0-1245            0.6.0.2.5.0.0-1245                Hadoop-LZO is a project to bring splittable LZO compression to Hadoop.
ii  hadooplzo-2-5-0-0-1245-native     0.6.0.2.5.0.0-1245                GPLed Compression Libraries for Hadoop, built at $DATE on $HOST

My browsers is firefox and chrome.
What logs are you interested in?, Firebugs or chrome develop tools, they will both give you some more information. And additionally, check if namenode log contains any suspicious error. The UI was supposed to show a warning dialog when there is communication errors, not sure what happened here. , This page appears only if a stopped all datanode., Hello Alexey

Can you attach a screen shot? Any logs (per my previous comments) ? , https://issues.apache.org/jira/browse/HDFS-9193  this is the case. It worked.]