[NameNode is not set keyid for hdfs client get token,when hdfs client getBlockLocations.so the keyid is random value, the keyid is not esixtes in datanode.so  datanode return invalide token to hdfs client, Hi liaowenrui, can you comment about how to reproduce this issue, or perhaps attach a patch with a test that reproduces this issue?

Also, can you comment about whether this issue actually caused you any problems other than seeing this message in the logs? I believe the behavior of the DFSClient when it receives this error is just to refetch a new BlockToken and then retry the request, so though you'll see this error in the logs it should actually be innocuous., 1.write a file
2.the file status is open
3.namenode is restart or HA switchover，
4.read the file,read it failure.bcause keyid is not exists in datanode., this patch is not right, I think datanode need store active NN and standby NN BlockKeys.do you think ?Aaron, Wouldn't the client get the InvalidAccessToken response, then go back to the new NameNode to get the new block key? ie you might see this warning in the logs somewhere, but the client should not actually fail to read the block., yes ,Todd.only when datanode token is diffrent from namenode,when Active namenode restart or Ha switchover.because datanode only store active Namenode token.but
the token is responsed to datanode by active NameNode and standby NameNode.so this issue is in datanode. do you think? Todd, pls check my patch,todd,thanks, {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12565451/HDFS-4404.patch
  against trunk revision .

    {color:red}-1 patch{color}.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-HDFS-Build/3859//console

This message is automatically generated., \\
\\
| (x) *{color:red}-1 overall{color}* |
\\
\\
|| Vote || Subsystem || Runtime || Comment ||
| {color:red}-1{color} | patch |   0m  0s | The patch command could not apply the patch during dryrun. |
\\
\\
|| Subsystem || Report/Notes ||
| Patch URL | http://issues.apache.org/jira/secure/attachment/12565451/HDFS-4404.patch |
| Optional Tests | javadoc javac unit findbugs checkstyle |
| git revision | trunk / f1a152c |
| Console output | https://builds.apache.org/job/PreCommit-HDFS-Build/10532/console |


This message was automatically generated.]