[the attached patch changed chooseDataNode() to return a new location from newly fetched list from namenode., attaching a new patch, which added a line at the beginning of the while loop in fetchBlockByteRange() to always get the latest block locations from cache. Also, removed old fetchBlockAt() and renamed fetchAndCacheBlockAt() to fetchBlockAt(). Always cache block locations when fetching. Thank Raghu for comments and discussions., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12411956/445-08.patch
  against trunk revision 790733.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 6 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-vesta.apache.org/0/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-vesta.apache.org/0/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-vesta.apache.org/0/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-vesta.apache.org/0/console

This message is automatically generated., +1. This is an important fix for clients that keep a file open for a long time (like HBase)., I just committed this. Thanks Kan., Integrated in Hadoop-Hdfs-trunk #23 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Hdfs-trunk/23/])
    . pread() does not pick up changes to block locations. (Kan Zhang via rangadi)
, Patch for Hadoop 20 added., Issue appeared during HBase testing.  This should be pulled into the branch-0.20-append branch.
, Here's a patch against the current 0.20-append branch (probably about the same as Jitendra's)]