[-1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12525971/HDFS-3383.patch
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 eclipse:eclipse.  The patch built with eclipse:eclipse.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed unit tests in hadoop-hdfs-project/hadoop-hdfs.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-HDFS-Build/2388//testReport/
Console output: https://builds.apache.org/job/PreCommit-HDFS-Build/2388//console

This message is automatically generated., Hey Trevor,

Is this still an issue now that we've converted over to cmake?

Thanks,
Eli, What branches will use cmake? I'm hoping to have 2.0.X (and ideally CDH4uX) build, not just trunk.

Also, I'm not able to build trunk right now. I get a maven dependency error I don't understand:

bq. Failed to execute goal on project hadoop-common: Could not resolve dependencies for project org.apache.hadoop:hadoop-common:jar:3.0.0-SNAPSHOT: The following artifacts could not be resolved: org.apache.hadoop:hadoop-annotations:jar:3.0.0-SNAPSHOT, org.apache.hadoop:hadoop-auth:jar:3.0.0-SNAPSHOT: Failure to find org.apache.hadoop:hadoop-annotations:jar:3.0.0-SNAPSHOT in http://nexus.calxeda.com:8081/nexus/content/groups/public was cached in the local repository, resolution will not be reattempted until the update interval of nexus has elapsed or updates are forced, Hey Trevor,
trunk and branch-2 both support cmake now, see HADOOP-8368. CDH4uX will use cmake as well.
Wrt the build failure I'd do a mvn clean and clear out your local m2 repo (~/.m2/repository) and try again, if that fails run mvn with the debug option and look for clues., Thanks, {{rm -rf ~/.m2/repository/}} fixed the maven issue. It may have gotten into a bad state since it failed initially and then I applied the patch from HADOOP-8370.

Switching to cmake seems to have reintroduced the failure from HDFS-1920:

cc1: error: unrecognized command line option '-m32'

It seems like I'll be treading water with such issues until we can get an ARM system into the automated build. :-(, I opened HADOOP-8538 for all instances of the -m32 issue.

With that fixed, I verified that this issue no longer occurs. If all active branches are using CMake, this issue can be closed. I don't know if this affects 1.x.
, Can this be committed to branch-1, since it has not been changed to use CMake?, Happy to review if you post a patch for branch-1., \\
\\
| (x) *{color:red}-1 overall{color}* |
\\
\\
|| Vote || Subsystem || Runtime || Comment ||
| {color:red}-1{color} | patch |   0m  0s | The patch command could not apply the patch during dryrun. |
\\
\\
|| Subsystem || Report/Notes ||
| Patch URL | http://issues.apache.org/jira/secure/attachment/12525971/HDFS-3383.patch |
| Optional Tests | javadoc javac unit |
| git revision | trunk / f1a152c |
| Console output | https://builds.apache.org/job/PreCommit-HDFS-Build/10522/console |


This message was automatically generated.]