[+1 patch looks good.

Please also provide a patch for Apache 0.22., Should the fixed version be 0.22 since HDFS-1109 is only committed to 0.22?, Patch for apache trunk., +1 patch looks good., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12450465/HDFS-1317-trunk.patch
  against trunk revision 967293.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h2.grid.sp2.yahoo.net/222/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h2.grid.sp2.yahoo.net/222/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h2.grid.sp2.yahoo.net/222/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h2.grid.sp2.yahoo.net/222/console

This message is automatically generated., All the failed tests are not caused by this patch. The related JIRA are listed below. 

TestBlockToken https://issues.apache.org/jira/browse/HDFS-1284
TestFileAppend4.testRecoverFinalizedBlock https://issues.apache.org/jira/browse/HDFS-1306
TestFileAppend4.testCompleteOtherLeaseHoldersFile https://issues.apache.org/jira/browse/HDFS-1306
TestHdfsProxy https://issues.apache.org/jira/browse/HDFS-1301

https://issues.apache.org/jira/browse/HDFS-1301 was not committed to trunk and it needs to be done. But even with that patch TestHdfsProxy is failing for me with "unauthorized for user x via x".  Investigating it., > https://issues.apache.org/jira/browse/HDFS-1301  was not committed to trunk and it needs to be done. But even with that patch TestHdfsProxy is failing for me with "unauthorized for user x via x". Investigating it.

Could you follow up on fixing TestHdfsProxy?, There is also a -1 on the tests.
"Please justify why no new tests are needed for this patch.
Also please list what manual steps were performed to verify this patch.", New test was not added for this patch, as changes were made to the Servlet filter.  Writing a unit test involved stubbing out HttpServletRequest and other servlet-api classes which is not worth the effort for the minor change of changing a regex pattern to be in sync with the changed contract.  Manually verified by deploying hdfsproxy on tomcat and tested that streamFile works. , I have committed this.  Thanks, Rohini!, Integrated in Hadoop-Hdfs-trunk-Commit #356 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Hdfs-trunk-Commit/356/])
    HDFS-1317. Remove the FILEPATH_PATTERN from hdfsproxy.AuthorizationFilter.  Contributed by Rohini Palaniswamy
]