[I guess currently the number is loaded first and the disk-space check is done later but we should be able to easily add a WARN when computing the after-reserve values. Would you like to contribute a patch for this Robert, against trunk?, I haven't really hacked on the hadoop source code and have almost no java fu, so it would be a pretty steep learning curve. If someone pointed me to the right place to look I could take a stab at it., made sure this is highlighted in the wiki entry http://wiki.apache.org/hadoop/CouldOnlyBeReplicatedTo ; it was there, but is now in its own bullet point. 

Presumably this test cluster only had one or two DNs, as the JT only wants one location to save its data. Perhaps the NN status should highlight the "no space left" situation more, it's certainly something you want an alert on in production., Added a warning message in FsVolumeImpl.java where it reads the latest capacity. I m creating the patch first time so not sure its the correct place to add the warning message., Hello Madhukara,

Please attach a proper diff that carries only the changes you have done. Your current diff is a total rewrite of file. Ensure you use unix newlines in your editor/save-actions/etc., in case that is what led to this., Fixed the patch file to have only changed code and converted new lines into UNIX, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12521306/HDFS-2964-1.patch
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 eclipse:eclipse.  The patch built with eclipse:eclipse.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed unit tests in .

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-HDFS-Build/2193//testReport/
Console output: https://builds.apache.org/job/PreCommit-HDFS-Build/2193//console

This message is automatically generated., This is just addition for log message so no need of test case., Thanks for the patch! Can you make sure to follow all code guidelines?

For instance, the if-else setup looks a little odd compared to the rest of the source base. For inline comments use // not /*. You can also place comments within the else-block rather than outside.

Otherwise looks good., Perhaps message can be better too:

> "Disk capacity is lower than reserved capacity"

Instead we may perhaps say: "Available disk capacity on <disk path> is lower than configured reserved space per volume (dfs.datanode.du.reserved)."

Thoughts?, +1 on this. I cleaned up the message to be more informative (print path and bytes being compared), and updated the patch for trunk.

Awaiting jenkins run., {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12707244/HDFS-2964-2.patch
  against trunk revision c906a1d.

    {color:green}+1 @author{color}.  The patch does not contain any @author tags.

    {color:red}-1 tests included{color}.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    {color:red}-1 javac{color:red}.  The patch appears to cause the build to fail.

Console output: https://builds.apache.org/job/PreCommit-HDFS-Build/10065//console

This message is automatically generated., {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12707253/HDFS-2964-3.patch
  against trunk revision c906a1d.

    {color:green}+1 @author{color}.  The patch does not contain any @author tags.

    {color:red}-1 tests included{color}.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    {color:green}+1 javac{color}.  The applied patch does not increase the total number of javac compiler warnings.

    {color:green}+1 javadoc{color}.  There were no new javadoc warning messages.

    {color:green}+1 eclipse:eclipse{color}.  The patch built with eclipse:eclipse.

    {color:green}+1 findbugs{color}.  The patch does not introduce any new Findbugs (version 2.0.3) warnings.

    {color:green}+1 release audit{color}.  The applied patch does not increase the total number of release audit warnings.

    {color:red}-1 core tests{color}.  The patch failed these unit tests in hadoop-hdfs-project/hadoop-hdfs:

                  org.apache.hadoop.tracing.TestTracing

Test results: https://builds.apache.org/job/PreCommit-HDFS-Build/10066//testReport/
Console output: https://builds.apache.org/job/PreCommit-HDFS-Build/10066//console

This message is automatically generated., On second thought, this should probably just be logged once given the number of calls made to that function regularly.]