[This patch uses a regular transfer instead of transferTo if we are on a 32bit JVM and the block size is >= Integer.MAX_INT. I also re-enables TestLargeBlock on 32bit.

ant test-patch output:

{code}
     [exec] +1 overall.  
     [exec] 
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec] 
     [exec]     +1 tests included.  The patch appears to include 3 new or modified tests.
     [exec] 
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec] 
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec] 
     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.
     [exec] 
     [exec]     +1 release audit.  The applied patch does not increase the total number of release audit warnings.
     [exec] 
     [exec]     +1 system test framework.  The patch passed system test framework compile.
{code}, This line needs to go to for it become unused import 
{code}
import static org.junit.Assume.assumeTrue;
{code}

Rest looks ok to me. Have you ran the rest of HDFS tests with this patch?, Removed the unused import. run-commit-test and run-smoke-test yield the same results as on a clean trunk. I'll post the full HDFS test results once they have completed., I have now run the complete set of HDFS tests. The only tests that fail are the ones that also fail on a clean trunk:

{code}
    [junit] Test org.apache.hadoop.hdfs.server.datanode.TestBlockRecovery FAILED
    [junit] Test org.apache.hadoop.hdfs.TestHDFSServerPorts FAILED
    [junit] Test org.apache.hadoop.hdfs.TestHDFSTrash FAILED (timeout)
    [junit] Test org.apache.hadoop.hdfs.server.namenode.TestBackupNode FAILED
    [junit] Test org.apache.hadoop.hdfs.server.namenode.TestStorageRestore FAILED
    [junit] Test org.apache.hadoop.hdfs.TestFileConcurrentReader FAILED (timeout)
    [junit] Test org.apache.hadoop.hdfs.server.balancer.TestBalancer FAILED
    [junit] Test org.apache.hadoop.hdfs.server.namenode.TestBlockTokenWithDFS FAILED
    [junit] Test org.apache.hadoop.hdfs.server.namenode.TestLargeDirectoryDelete FAILED (timeout)
    [junit] Test org.apache.hadoop.hdfs.server.datanode.TestBlockRecovery FAILED
{code}, Current trunk build [#513|https://hudson.apache.org/hudson/job/Hadoop-Hdfs-trunk/513/#showFailuresLink] has only 8 test cases failing from 5 tests. Some of the failures above are different from the trunk ones., All of the tests mentioned above fail on a clean check-out of trunk on my machine. Interestingly, TestBlockReport succeeds on my machine (but not on hudson)., Ok, that makes sense.

+1 patch looks good. I will commit it shortly unless someone has an objection., HDFS-1523 was committed to branch-0.22 and trunk. So, I believe this has to be applied to both as well., I have just committed this. Thanks Patrick. , Integrated in Hadoop-Hdfs-trunk #643 (See [https://builds.apache.org/hudson/job/Hadoop-Hdfs-trunk/643/])
    , Integrated in Hadoop-Hdfs-22-branch #35 (See [https://builds.apache.org/hudson/job/Hadoop-Hdfs-22-branch/35/])
    ]