[Draft patch. The idea is to read from HttpServletRequest when namenode url is 0.0.0.0.

As the MiniDFSCluster is hardcoded to bind to 127.0.0.1, it's not completely trivial to test., I think this is due to a misconfig.  The rpc-address key should be an actual ip/host:port.  There is a rpc-bind-host key that should be set to 0.0.0.0 for multihoming.  For more details, see:

http://hadoop.apache.org/docs/current/hadoop-project-dist/hadoop-hdfs/HdfsMultihoming.html

, Thanks for the pointer. You're right in >=2.5.0. In <2.5, the way to do was setting 0.0.0.0:8020, which leads to the issue described here.
And has the multihoming been tested with HFTP too?
, HI [~bperroud],

Thanks for reporting the issue. I once ran into the same issue myself, and found out the issue was incorrect setting. As [~daryn] pointed out, " The rpc-address key should be an actual ip/host:port. There is a rpc-bind-host key that should be set to 0.0.0.0 for multihoming". The rpc-bin-host key was introduced by HDFS-5128, which is at least in 2.3.0, if not earlier. IIRC, my testing with 2.3 was successful after fixing the setting. Thanks.


, Thanks [~yzhangal]. The funny part is that the configuration I reported is generated by Cloudera Manager. I opened in ticket internally and they'll followup with the CM team.
On my side I simply disabled the wildcard binding/multihoming which wasn't really required, and it's working fine. Thanks for the prompt answers anyway!, Hi [~bperroud],

Good to know that you had the workaround. When I ran into the same issue, I did identify and report the Cloudera Manager problem, which was fixed in newer version of Cloudera Manager. Thanks.

, Propose resolving this as 'Not a Problem' if there are no objections., Sounds fair to me, thanks!, Thanks guys.
, I catch this issue while trying to copy data between cdh4 and cdh5 clusters. Even if dfs.namenode.rpc-address explicitly set in hdfs-site.xml, Location returned by GET query to tcp/50070 has nnaddr=0.0.0.0:8020. And query to namenode tcp/50075 with this parameter leds to 500 error from daemon., Check that you didn't set dfs.namenode.rpc-address=0.0.0.0:8020 in your configuration.
Use the proper multihoming instead http://hadoop.apache.org/docs/current/hadoop-project-dist/hadoop-hdfs/HdfsMultihoming.html, dfs.namenode.rpc-address is explicitly set to single ip/port value. And it's recognized by 'hdfs getconf -confkey dfs.namenode.rpc-address'.]