[Same criticism also applies to {{#getLinkTarget}}. We qualify FileStatus paths everywhere right now, which I agree makes it painful for wrapper-FSes like {{ViewFileSystem}}., There are a ton of FileSystem operations that return paths.  If we're going to switch them all to return unresolve dpaths, that will also affect getFileStatus, listStatus, getLocatedFileStatus, resolvePath, listCorruptFileBlocks, globStatus, createSnapshot, etc.

Also, as we've discussed elsewhere, doing this would be a large performance regression, huge in some cases.

I really don't think we should do this unless we also do symlink resolution server-side to avoid doing N symlink resolution RPCs every time we use a path with N symlinks in it., This is a duplicate of the earlier HADOOP-9780.  I propose that we close this issue as duplicate and move the discussion to there.  If we do end up making this change, it will affect more than just HDFS, so it doesn't make sense to have this be an HDFS (as opposed to common JIRA) anyway., It's a dup in concept, but addressing the issue described will require a specific change to {{DistributedFileSystem}}'s {{getFileLinkStatus}} and {{getLinkTarget}} so I think it should stay open in addition to the common jira.

bq. [...] t will also affect getFileStatus, listStatus, getLocatedFileStatus, resolvePath, listCorruptFileBlocks, globStatus, createSnapshot, etc. [...] I really don't think we should do this unless we also do symlink resolution server-side to avoid doing N symlink resolution RPCs every time we use a path with N symlinks in it.

I think there's some misunderstanding.  The issue of whether the client is able to obtain the exact symlink target is orthogonal from whether the other methods return a {{FileStatus}} with a (un)qualified path., OK.  If I understand correctly, it sounds like you're proposing that {{getFileLinkStatus}} return symlinks with relative links as relative, rather than trying to qualify them.  I am +1 on this idea, but if we do it, we need to do it for all Filesystems, not just HDFS., Yes, that's correct.  The symlink target should simply be returned as-is.  Agreed that it should be the behavior for all filesystems.]