[Looks like the description of this JIRA should say "NameNode", not "DataNode", right?, Thanks Aaron, its Datanode , my bad, Also I have seen , this NullPointer exception can happen any of the scenarios,
like dfs -copyFromLocal/-put/-cp/-rm or distcp. Its not definitive. I have seen
this in many times in different occasions. But everytime it happens when I
try to simulate Disk Fail by changing permission of Data dir as 000, Rajit, what release is this happening. Could you please set the Affects Version/s with release where you found this problem., Suresh, thanks for correcting. I am seeing this in .20.205 unreleased version, This NPE was fixed in trunk as part of HDFS-1655. Cherry picking the NPE fix to create the patch for this JIRA., No tests were added due to the difficulty of testing a private method of a static inner class.,      [exec] -1 overall.  
     [exec] 
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec] 
     [exec]     -1 tests included.  The patch doesn't appear to include any new or modified tests.
     [exec]                         Please justify why no tests are needed for this patch.
     [exec] 
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec] 
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec] 
     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.
, See above comment on why no tests were provided. This patch should go into branch-0.20-security and branch-0.20-security-205., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12496504/HDFS-2359-branch-0.20-security.patch
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-HDFS-Build/1290//console

This message is automatically generated., +1 for the patch., I have committed this patch. Thank you Jonathan for the patch., Thanks, Suresh!, Closed upon release of 0.20.205.0]