[1. Setting isThreadSafe=false will cause these JSPs to be compiled to servlets that implement SingleThreadModel, which deprecated in servlet-api-2.4+ (we use servlet-api-2.5.), as it doesn't really ensure thread-safety in general. It's probably fine in this particular case (no static/session variables are used), if we are deprecating the 0.20 branches soon. 

2. Since we don't have word-tearing issues in conforming JVMs (esp. on x86), and that the locking totalInodes call is the issued first, it'll trigger a memory barrier, which makes the subsequent reads up to date enough for the stats displaying purpose.

3. Our new web framework makes this type errors impossible., Hi, Luke,
Thanks for the explanations and comments.  The third comment of yours,

3. Our new web framework makes this type errors impossible.

Are you referring to that after the JSP code refactoring, the problematic class variables have become function local variables, so that this type of errors are not possible any more?

It looks to me that you have agreed with this fix.  Since you are the expert on these issues, can you plus 1 on the Jira then?  This would make it pretty convincing. 

Regards,
Tanping
, Luke, this change is being done for 20 release only. On newer release, the JSPs have been cleaned up and this problem does not exist.

+1 for the patch for release 20., bq. 3. Our new web framework makes this type errors impossible. Are you referring to that after the JSP code refactoring, the problematic class variables have become function local variables, so that this type of errors are not possible any more?

Actually, it was just a shameless plug for my little web framework (currently being used in mapreduce.next), where you don't have to worry about instance variable thread-safety in controllers and views :)
, I committed the patch. Thank you Tanping., I'm confused by this commit. 

It looks like it was committed to branch-0.20-security but 0.20.203.1 is listed as the environment.  Was this actually supposed to get committed to branch-0.20-security-203 or both or what?, It should only be committed to branch-0.20-security only.  HDFS does not have a version that exact matches branch-20-security.  The closest was 0.20.203.1.  , Correct Fix Version/s: 
0.20.204 , Hadoop 0.20.204.0 was released.]