[This is related to MAPREDUCE-1935, Make that HDFS-1935, The subant calls in src/contrib/build.xml and src/contrib/build-contrib.xml suffer from the same problem. There is one antcall in build-contrib with the same., To build hdfs without Internet connectivity:
1) First do a build with connectivity or copy ~/.ivy2 from a machine where such build did succeed.
2) Set up a hand-full of files in a local repo to avoid download from Maven repo:
and have three files available:
/home/user/buildrepo/dist/commons/daemon/binaries/1.0.2/linux/commons-daemon-1.0.2-bin-linux-i386.tar.gz
/home/user/buildrepo/org/apache/ivy/ivy/2.1.0/ivy-2.1.0.jar
/home/user/buildrepo/org/apache/maven/maven-ant-tasks/2.0.10/maven-ant-tasks-2.0.10.jar
3) Before the build run these commands to copy the jars in place for ant to resolve (otherwise you have a bootstrap problem):
cp ${HOME}/buildrepo/org/apache/ivy/ivy/2.1.0/ivy-2.1.0.jar ${WORKSPACE}/hdfs/ivy/
cp ${HOME}/buildrepo/org/apache/maven/maven-ant-tasks/2.0.10/maven-ant-tasks-2.0.10.jar ${WORKSPACE}/hdfs/ivy/

3) Do a build of common (using similar tricks to this if needed) on common. Exectute the mvn-install target to publish your own version to the local Maven repo (~/.m2/repository).
4) Set these properties in your build.properties (version can be passed in from Jenkins as a parameter instead when this patch is applied. Build.properties can sit in user's home directory or in hdfs directory.

# Ivy dependency resolution instruction:
resolvers=internal

#you can increment this number as you see fit and/or pass the ${BUILD_NUMBER} from Jenkins
build.number=0
version=0.22-coolname-${build.number}
project.version=${version}
hadoop.version=${version}

# Note that hadoop-core from 0.20* branches is renamed to hadoop-common
hadoop-common.version=${version}
hadoop-hdfs.version=${version}

# Specify to not download ivy. When used, must provide ivy jar ourselves.
offline=true

# Instead of reaching out to Internet, pull ivy jar from local 
mvnrepo=file:${user.home}/buildrepo
# User by hadoop-common/hdfs and hadoop-common/mapreduce
mvn.repo=file:${user.home}/buildrepo, Should have used code markup as pound comment sign was translated to 1.'s., Build problem, marking as blocker., I have applied the patch to hdfs 0.22 and tried to build with and without network connection. Everything seems to be working properly. Contrib is building and I can create package.

+1 on the patch. I am going to commit it shortly.

I am not clear if HDFS-1935 needs to be in as well?, I have applied the patch to hdfs 0.22 and tried to build with and without network connection. Everything seems to be working properly. Contrib is building and I can create package.

+1 on the patch. I am going to commit it shortly.

I am not clear if HDFS-1935 needs to be in as well?, Hi,
Thanks for your mail. I'll be out of the office until Wednesday August 17th.
During this time I will not be checking my e-mail.
Thanks,
Joep
, I have committed it. Thanks Joep!, Integrated in Hadoop-Hdfs-22-branch #73 (See [https://builds.apache.org/job/Hadoop-Hdfs-22-branch/73/])
    HDFS-2211. Build does not pass along properties to contrib builds. Contributed by Joep Rottinghuis.

cos : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1154630
Files : 
* /hadoop/common/branches/branch-0.22/hdfs/src/contrib/build-contrib.xml
* /hadoop/common/branches/branch-0.22/hdfs/CHANGES.txt
* /hadoop/common/branches/branch-0.22/hdfs/src/contrib/build.xml
* /hadoop/common/branches/branch-0.22/hdfs/build.xml
]