[To be able to support ClientProtocol#create which only return HdfsFileStatus should be able to return LocatedBlock as done in ClientProtocol#append., {code}
  @Override
  public HdfsDataOutputStream create(Path f, FsPermission permission,
      boolean overwrite, int bufferSize, short replication, long blockSize,
      Progressable progress) throws IOException {
    return this.create(f, permission,
        overwrite ? EnumSet.of(CreateFlag.CREATE, CreateFlag.OVERWRITE)
            : EnumSet.of(CreateFlag.CREATE), bufferSize, replication,
        blockSize, progress, null);
  }
{code}


yes, It seems only fix in DistributedFileSystem and DFSClient, because FSNamesystem has been considered it.

startFileInternal
{code}
    boolean overwrite = flag.contains(CreateFlag.OVERWRITE);
    boolean append = flag.contains(CreateFlag.APPEND);
    if (isPermissionEnabled) {
      if (append || (overwrite && myFile != null)) {
        checkPathAccess(pc, src, FsAction.WRITE);
      } else {
        checkAncestorAccess(pc, src, FsAction.WRITE);
      }
    }

    if (!createParent) {
      verifyParentDir(src);
    }

    try {
      blockManager.verifyReplication(src, replication, clientMachine);
      boolean create = flag.contains(CreateFlag.CREATE);
{code}, bq. yes, It seems only fix in DistributedFileSystem and DFSClient, because FSNamesystem has been considered it.
I am not sure what you mean here. Assuming what you mean is, DFSClient and DistributedFileSystem does not handle it and FSNamesystem handles it, the right way to do this is DistributedFileSystem/DFSClient should call append or create based on the flags passed to them. Currently FSNamesystem has code that makes it look like it handles it. However there are some differences between append method and create. For example, create does not check if append feature is supported. It also cannot return LocatedBlock with last incomplete block. The FSNamesystem implementation is incorrect and incomplete., Hi Suresh. The create method in DistributedFileSystem uses CREATE or CREATE|OVERWRITE, based on the boolean parameter overwrite. Can you elaborate why do we need to use APPEND flag here, as we have another method for append?, Apologies. I was in the activity tab, and thought that there are no existing comments. I got the idea from the comments now., HDFS-11170 added builder style create() that supports APPEND flag. It seems this Jira is not needed any more?]