[Simple fix. I manually tested this by starting a pseudo-distributed cluster using this patch and without HADOOP_HOME set.

Without the patch the message "Hadoop common not found." is printed and the daemons don't start., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12475854/HDFS-1823.patch
  against trunk revision 1090357.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed these core unit tests:
                  org.apache.hadoop.hdfs.TestDFSShell
                  org.apache.hadoop.hdfs.TestFileConcurrentReader

    -1 contrib tests.  The patch failed contrib unit tests.

    +1 system test framework.  The patch passed system test framework compile.

Test results: https://hudson.apache.org/hudson/job/PreCommit-HDFS-Build/337//testReport/
Findbugs warnings: https://hudson.apache.org/hudson/job/PreCommit-HDFS-Build/337//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://hudson.apache.org/hudson/job/PreCommit-HDFS-Build/337//console

This message is automatically generated., Marking blocker since it's Hadoop and MapReduce counterparts are blockers., +1 

Btw should the message in the else clause we re-worked to "hadoop-config not found" or similar since it's looking for the config and not the common home?, I've committed this to branch 22 and trunk. We can handle the change to the message in a separate jira, if needed. Thanks Tom!, Integrated in Hadoop-Hdfs-trunk-Commit #604 (See [https://builds.apache.org/hudson/job/Hadoop-Hdfs-trunk-Commit/604/])
    HDFS-1823. start-dfs.sh script fails if HADOOP_HOME is not set. Contributed by Tom White
, Integrated in Hadoop-Hdfs-trunk #650 (See [https://builds.apache.org/hudson/job/Hadoop-Hdfs-trunk/650/])
    , Integrated in Hadoop-Hdfs-22-branch #41 (See [https://builds.apache.org/hudson/job/Hadoop-Hdfs-22-branch/41/])
    ]