[Following tests are failing: TestDatanodeBlockScanner, TestPipeline, TestReplication, TestBlockReport, TestDataNodeMXBean, TestBlockTokenWithDFS, TestCorruptFilesJsp, TestFsck, TestFiHFlush
, Attached patch fixes the unit test failures:
# ExtendedBlock#getBlockName() returns valid file name corresponding to the block.
# Some of the test methods accept ExtendedBlock instead of just a String for block file name. With this test methods make a local decision on how best to find the block file instead of callers of these methods., The getBlockName method in ExtendedBlock just calls getBlockName on the encapsulated block object. Since blockNames may not be unique across the block pools, two different ExtendedBlock objects can return same blockName. Could this be an issue?, > two different ExtendedBlock objects can return same blockName
This is correct. In order to handle this, future changes that include block pool in the directory hierarchy needs to be used to identify a unique block file. I have added TODO tags to address this in the future, when datanode block storage includes BPID in TestDatanodeBlock#corruptReplica() and MiniDFSCluster#corruptBlockOnDataNode(), Failed unit tests passed with this patch. Here is the testpatch result:
     [exec] +1 overall.  
     [exec] 
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec] 
     [exec]     +1 tests included.  The patch appears to include 26 new or modified tests.
     [exec] 
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec] 
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec] 
     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs warnings.
     [exec] 
     [exec]     +1 release audit.  The applied patch does not increase the total number of release audit warnings.
     [exec] 
     [exec]     +1 system tests framework.  The patch passed system tests framework compile.
, +1, I committed this change.]