[Hi Biju, did you wait 10.5 minutes for the default dead nodes timeout before checking these stats? Did you also compare the JMX stats with the display on the webui? I'd expect these to be the same, but we have had some issues here in the past., Thanks Andrew. By waiting for more than 10 mins, the entries were updated correctly. Reading through http://hadoop.apache.org/docs/r2.4.0/hadoop-project-dist/hadoop-hdfs/hdfs-default.xml the default datanode heartbeat seems to be dfs.heartbeat.interval - 3 secs. Is this a change coming up in 2.4? Is there a reason for the default 10.5 min wait time? , Hi Biju,

The 10.5 minute dead node timeout has been around for a while, it's different from the heartbeat. We want to wait a conservative amount of time before marking a node as dead, since that will start re-replication for all the blocks on that DN (very I/O and network intensive).

We do measure the "last heartbeat" time in places, and will mark a DN as "stale" if we haven't heard from it from a little while (e.g. 30s) but it's not yet dead. You could try looking at those metrics if you're interested in lower-latency detection methods.

If this is satisfactory, could we close this JIRA? Thanks Biju., Also, please feel free to email the hdfs-dev@ list with questions like this in the future :), Thanks Andrew. Will use the NumStaleDataNodes for lower latency detection. This was raised as a issue due to mis understanding the config parameters. I there a place we can document this information. Also can the 10.5 minutes configurable?

I am fine with closing the issue., I admit we don't have the greatest (any?) documentation for metrics. Typically I have to dig around in the code. The stale node feature I don't think has much in the way of docs either, so if you see a good place to add a mention, we'd happily take a docs patch.

The 10.5 mins is also somewhat configurable. It's calculated from this in DatanodeManager:

{code}
    this.heartbeatExpireInterval = 2 * heartbeatRecheckInterval
        + 10 * 1000 * heartbeatIntervalSeconds;
{code}

So if you adjust "dfs.namenode.heartbeat.recheck-interval" and "dfs.heartbeat.interval" you have some control., After discussion with Biju, we've decided that the stale nodes metric is satisfactory for this usecase.]