[The patch adds clover.jar file to the classpath before cluster components needed for libhdfs test are started., Patch looks good.  Btw the libhdfs test isn't new, same one that's been checked in for a while., Turns out that I've done the patch for the outdated version of the shell script. This new version is the same as before but put one of the lines to a different spot.

Also, I've ran {{test-patch}} locally and all seems to be ok:
{noformat}
There appear to be 125 release audit warnings before the patch and 125 release audit warnings after applying the patch.

+1 overall.
    +1 @author.  The patch does not contain any @author tags.
    +1 tests included.  The patch appears to include 4 new or modified tests.
    +1 javadoc.  The javadoc tool did not generate any warning messages.
    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
    +1 findbugs.  The patch does not introduce any new Findbugs warnings.
    +1 release audit.  The applied patch does not increase the total number of release audit warnings.
{noformat}

I've started {{ant clover test}} run locally and now it passes without a glitch, i.e. c++ compilation is went through and libhdfs test has passed. 
, Integrated in Hadoop-Hdfs-trunk-Commit #121 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Hdfs-trunk-Commit/121/])
    . libhdfs tests brakes code coverage runs with Clover. Contributed by Konstantin Boudnik
, I've just committed this., Integrated in Hdfs-Patch-h5.grid.sp2.yahoo.net #123 (See [http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h5.grid.sp2.yahoo.net/123/])
    . libhdfs tests brakes code coverage runs with Clover. Contributed by Konstantin Boudnik
, Still doesn't work in Hudson. Apparently, just adding clover.jar into the classpath doesn't solve the issue with script., Further investigation shows that {{test-libhdfs}} indirectly calls {{hadoop-config.sh}} which resets $CLASSPATH settings. Thus, it seems to be quite impossible or fix this issue with the current approach to the testing of {{libhdfs}}

The test has to be disabled until it is done without direct calls to Hadoop's startup scripts., This patch will completely disable the execution of {{test-c++-libhdfs}} if Clover is enabled, e.g. in code coverage runs. On the other hand, it will still run this test on non-instrumented code. It is a dirty hack but otherwise there's no way to run full code coverage build., Adding an info message to the clover.setup target., +1 code review, Have committed the second take of the fix., Integrated in Hdfs-Patch-h5.grid.sp2.yahoo.net #127 (See [http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h5.grid.sp2.yahoo.net/127/])
    , Integrated in Hadoop-Hdfs-trunk-Commit #128 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Hdfs-trunk-Commit/128/])
    , Integrated in Hdfs-Patch-h5.grid.sp2.yahoo.net #129 (See [http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h5.grid.sp2.yahoo.net/129/])
    , Integrated in Hadoop-Hdfs-trunk #159 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Hdfs-trunk/159/])
    , Integrated in Hdfs-Patch-h2.grid.sp2.yahoo.net #81 (See [http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h2.grid.sp2.yahoo.net/81/])
    ]