[aspectversion should as well be replaced with aspectj.version variable ; which is already defined in the ivy/libraries.properties., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12485672/HDFS-2138.PATCH
  against trunk revision 1144100.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-HDFS-Build/896//console

This message is automatically generated., Giri, patch doesn't apply to trunk. Looks like it has been against 0.22 considering from this line
<noformat>
-  <property name="project.version" value="0.22.0-SNAPSHOT"/>
<noformat>, Thanks Cos

I was fixing this on the MR-279 branch and uploaded the patch without realizing that this would not apply for trunk. 

HDFS-2138-trunk.patch will work with trunk. Could you pls take a look?, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12485768/HDFS-2138-trunk.patch
  against trunk revision 1144100.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed these core unit tests:
                  org.apache.hadoop.hdfs.TestHDFSTrash

    +1 contrib tests.  The patch passed contrib unit tests.

    +1 system test framework.  The patch passed system test framework compile.

Test results: https://builds.apache.org/job/PreCommit-HDFS-Build/901//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-HDFS-Build/901//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-HDFS-Build/901//console

This message is automatically generated., +1. lgtm.  The failure of unit test TestTrash.testTrashEmptier does not seem to be related to this change.  It is probably related to HDFS-7326, although the symptoms reported are slightly different., I have checked that correct version is set for the jar files. Everything works.
+1 Good stuff, Giri. Thanks for fixing this.
, Patch no longer applies.]