[This patch changes the # of replicas argument in hdfsOpenFile to 0, which the libhdfs documentation says should be whatever the default is for the Hadoop configuration., Submitting patch to Hudson.  I do not believe a test case is needed because of how straightforward the fix is and the fact that fuse-dfs is in contrib/, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12429027/HADOOP-856.patch
  against trunk revision 894233.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h5.grid.sp2.yahoo.net/163/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h5.grid.sp2.yahoo.net/163/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h5.grid.sp2.yahoo.net/163/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h5.grid.sp2.yahoo.net/163/console

This message is automatically generated., +1  Patch looks good., Forgot to mention that I ran ant test-c++-libhdfs with your patch and it passed., test-c++-libhdfs doesn't cover fuse so actually it shouldn't fail,  TestFuseDFS would cover this though it's not currently running (HDFS-780).  I tried this patch locally and it worked. , I've just committed this. Thanks Brian!, Integrated in Hadoop-Hdfs-trunk-Commit #210 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Hdfs-trunk-Commit/210/])
    . Hardcoded replication level for new files in fuse-dfs. Contributed by Brian Bockelman.
, Integrated in Hdfs-Patch-h2.grid.sp2.yahoo.net #146 (See [http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h2.grid.sp2.yahoo.net/146/])
    , Integrated in Hdfs-Patch-h5.grid.sp2.yahoo.net #302 (See [http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h5.grid.sp2.yahoo.net/302/])
    , Integrated in Hadoop-Hdfs-trunk #275 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Hdfs-trunk/275/])
    ]