[log a warning instead of throw an exception when secondaryNameNode failed during mkdir., Log a warning message instead of throw an exception when SecondareNameNode cannot mkdir., Three things:
# What happens if all directories are removed on SecondareNameNode?
# Why do you remove directories only if mkdir() fails? What if rename() fails before mkdir() for example.
# You cannot just remove a list entry while iterating, this will cause ConcurrentModificationException on the next iteration of the loop., >   1. What happens if all directories are removed on SecondareNameNode?

It's quite a problem, and do you think SecondaryNameNode should throw Exception or kill itself ?

>   2. Why do you remove directories only if mkdir() fails? What if rename() fails before mkdir() for example.

I think rename maybe should also be "try...catch"

>   3. You cannot just remove a list entry while iterating, this will cause ConcurrentModificationException 
>   on the next iteration of the loop.

oh. I am sorry for that, I will change its position.

I will modify it and upload another patch. And I wonder whether it is OK  if we only record this problem
in logfiles and ignore it., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12406238/secondarynamenode-startcp.patch
  against trunk revision 768376.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/243/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/243/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/243/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/243/console

This message is automatically generated., catch both mkdir and rename exceptions, and throw exception when all of the dirs are failed, Hi Konstantin,

I updated the patch to fix the above issue.

However, I do not satisfy with it yet:  if an exception is throwed, the checkpointing will be interrupted and the former closed editStreams of FSEditLog in SecondaryNameNode.startCheckpoint() would never be re-open again. 

Any suggestion?, Canceling patch. No longer applies by a long shot. There have been quite a few changes to the SNN since this patch's last revision; we should see if this is still a problem.  ]