[Patch version 1 for HDFS-2053.

The patch should apply to all branches to which the original HDFS-1377 patch has been applied to. See the ticket description for more details regarding "Fix Version/s"., Again, I am not sure how to properly identify the correct names of the versions.  For instance, the patch successfully applies to branch-0.20-security-204 but I am not sure whether this translates to version "0.20.204.0" in the dropdown list., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12481915/HDFS-2053_v1.txt
  against trunk revision 1133476.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-HDFS-Build/750//console

This message is automatically generated., New patch version, no properly using 'git diff --no-prefix' to generate it. Doh!, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12481918/HDFS-2053_v2.txt
  against trunk revision 1133476.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-HDFS-Build/751//console

This message is automatically generated., Hey Michael - thank you for the excellent report!

In summary, the condition used to warn in FSDirectory#computeContentSummary has a bug, it compares the cached value for the directory not to a computed value for that directory but to a computed value that includes the directory and it's siblings. 

The bug results in a spurious warning, it doesn't impact eg the correctness of quotas. Given this I think two things are reasonable:
# Remove the warning (which removes the bug)
# Compute the correct summary for just that directory (your patch)

The latter sounds good to me. Allocating a 4 long array for each level in the directory hierarchy isn't bad and this method isn't on a hot path.

Nit, I'd change array allocation to the following since we assume summary has len 4 and should be faster.

{noformat}
assert 4 == summary.length;
long[] subtreeSummary = new long[]{0,0,0,0}
{noformat}

Wrt testing how about right after space is calculated adding the following:

{noformat}
assert -1 == node.getDsQuota() || space == subtreeSummary[3];
{noformat}

Asserts are enabled by default when the tests are run, if TestQuota doesn't trigger this assert then add a test similar to what you did manullay which will trigger it.

Also, please generate a patch against trunk (HDFS-2053_v2.txt doesn't apply for me).

Thanks!, Hi Eli, many thanks for your quick reply and feedback!

FYI: I have integrated your suggestions into the patch. Currently I am waiting for "ant test" to finish to see whether {{TestQuota}} does indeed trigger this assert, and thus whether I actually need to add any special test to it.

@unit testing:
From what I have seen {{TestQuota#testSpaceCommands()}} would be the place to add a test for this issue, and {{dfs.getContentSummary().getSpaceConsumed(Path)}} would be the way to "indirectly" check the diskspace consumed by a directory and its children. It seems to be semantically equivalent to the actual {{INodeDirectory#computeContentSummary(long[])}} method I want to test but it appears to be several layers up the call stack [1]. Is this correct?

If so my test case using {{dfs.getContentSummary()}} would be basically:

1. Create parent dir + 3 subdirs {{A,B,C}}.
2. {{DFSTestUtil.createFile()}} a file of {a,b,c} * {{fileLength}} in {{A,B,C}}, respectively.
3. Test whether {{getSpaceConsumed()}} of {{A,B,C}} equals the expected value, i.e. {a,b,c} * {{fileLength}} * {{replication}}.
4. Test whether {{getSpaceConsumed()}} of the parent dir equals {a+b+c} * {{fileLength}} * {{replication}}.

I'm just asking since I'm not fully sure whether {{dfs.getContentSummary()}} would not mask etc. any hidden issues in the "lower level" method {{INodeDirectory.computeContentSummary()}}.

Best,
Michael



[1] {{FSDirectory#getContentSummary(String)}} seems to be the method that actually calls {{InodeDirectory#computeContentSummary(long[])}} at some point., Apologies for the slow reply!  You are correct about the test case, I think what you suggest would catch it. Will review the new patch when you post it.  Thanks, Eli , New version of the patch based on trunk, integrating Eli's feedback and unit test., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12483937/HDFS-2053_v3.txt
  against trunk revision 1140030.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

    +1 system test framework.  The patch passed system test framework compile.

Test results: https://builds.apache.org/job/PreCommit-HDFS-Build/847//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-HDFS-Build/847//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-HDFS-Build/847//console

This message is automatically generated., +1  looks good, Patch for branch-20 attached., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12484473/hdfs-2053_v3-b20.patch
  against trunk revision 1140707.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-HDFS-Build/861//console

This message is automatically generated., Integrated in Hadoop-Hdfs-trunk-Commit #763 (See [https://builds.apache.org/job/Hadoop-Hdfs-trunk-Commit/763/])
    HDFS-2053. Bug in INodeDirectory#computeContentSummary warning. Contributed by Michael Noll

eli : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1140707
Files : 
* /hadoop/common/trunk/hdfs/CHANGES.txt
* /hadoop/common/trunk/hdfs/src/test/hdfs/org/apache/hadoop/hdfs/TestQuota.java
* /hadoop/common/trunk/hdfs/src/java/org/apache/hadoop/hdfs/server/namenode/INodeDirectory.java
, I've committed this to trunk and branch-20 (after running the tests). Thanks Micahel!, You're welcome.  Thanks for the quick integration, Eli!, Integrated in Hadoop-Hdfs-trunk #710 (See [https://builds.apache.org/job/Hadoop-Hdfs-trunk/710/])
    HDFS-2053. Bug in INodeDirectory#computeContentSummary warning. Contributed by Michael Noll

eli : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1140707
Files : 
* /hadoop/common/trunk/hdfs/CHANGES.txt
* /hadoop/common/trunk/hdfs/src/test/hdfs/org/apache/hadoop/hdfs/TestQuota.java
* /hadoop/common/trunk/hdfs/src/java/org/apache/hadoop/hdfs/server/namenode/INodeDirectory.java
, Eli, can you please commit this to 0.20.s. This will be picked up when 0.20.205 branch is created., I've merged this to branch-0.20-security., Closed upon release of 0.20.205.0]