[Attaching the log from the precommit build. NN starts with 0 block, then initializes the repl queue, then 3 blocks are reported by the datanode.

The test makes assumption that by the time it acquires and releases the namesystem write lock, block report is processed completely and repl queues are initialized.  This is not true., This is related to HDFS-4001. The symptom seems different though., Kihwal, Chen, I started working on this yesterday and just found out it has been assigned to Chen. Here is the patch. There are basically some timing conditions that can make the test invalid:

1. Based on MiniDFSCluster setting, DN will send two blockReports, one for each storage. If the second blockReport came in after NameNodeAdapter.getSafeModeSafeBlocks and before BlockManagerTestUtil.updateState, the test will fail.
2. processMisReplicatedBlocks is async. To make sure it completes before the test gets the metrics, the test can wait until it completes.

Sorry, hope Chen hasn't spent much time on this. While the root causes have been identified, there are other ways to fix the test. Feel free to continue the work if necessary.

Thanks., Hi Ming, I am reviewing your code now., +1, patch looks good to me. I made a little bit change in patch format., Kindly reminder,  the next time, take JIRA before you start to work on it. , Reviewed the patch. LGTM
+1 (non binding), One note, you need to Submit the Patch once you upload the patch to get the HadoopQA Comment. I just did that., {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12639424/HDFS-5983-updated.patch
  against trunk revision .

    {color:red}-1 patch{color}.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-HDFS-Build/6631//console

This message is automatically generated., [~airbots], [~mingma] : Can any of you regenerate the patch and attach it to make sure it applies successfully?

Mit, Hi [~mitdesai]
This patch works on my machine and can be applied to trunk. I saw Hadoop trunk was broken this morning., Thanks, folks. It seems Arpit Agarwal has just fixed https://issues.apache.org/jira/browse/HDFS-6160 in a different way., Yes this is the same issue and [~mingma]'s diagnosis was spot on.

I searched for open Jiras on this failure and only saw HDFS-6160, my apologies for missing your work., Resolving since this should be fixed now., Already fixed by HDFS-6160. So Closing it.]