[It turns out that DFSOutputStream#flushInternal only waits for all acks are back but does not wait for the end of block message gets sent out. So the close may interrupt the sending of the end of block message and thus causes the error., This patch solves the problem by not interrupting the data stream if the dfs flle output stream is closed normally., I ran the test 20 times in a row and I did not see this error again., Patch looks good. I only have some comments on the names.

{code}
     // shutdown datastreamer and responseprocessor threads.
- private void closeThreads() throws IOException {
+ // interrupt datastreamer if forClose is true
+ private void closeThreads(boolean forceClose) throws IOException {
{code}
- The existing name "closeThreads" is hard to understand. It does not directly close any thread but actually close the socket and DataStreamer. How about change it to something like "closeInternal"?
- Typo in the comment: "forClose". I suggest renaming "forceClose" to "force"., I changed the parameter forceClose to be force. As to the method name closeThreads, I'd rather keep it as it is since it is not a newly introduced method and there is already a method called closeInternal., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12416934/closeDataStream1.patch
  against trunk revision 805652.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-vesta.apache.org/73/console

This message is automatically generated., +1 patch looks good., All unit tests are passed.

AntPatch result:
     [exec] -1 overall.
     [exec]
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec]
     [exec]     -1 tests included.  The patch doesn't appear to include any new or modified tests.
     [exec]                         Please justify why no new tests are needed for this patch.
     [exec]                         Also please list what manual steps were performed to verify this patch.
     [exec]
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec]
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec]
     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs warnings.
     [exec]
     [exec]     +1 release audit.  The applied patch does not increase the total number of release audit warnings.
     [exec]
, TestHDFSFileSystemContract#testOutputStreamClosedTwice tests the patch.

I've committed this.]