["During this time none of normal NN operations are possible"

how long was this period?, It clearly depends on NFS mount's timeout., ATM and I just brainstormed about this a little bit over some iced coffee. Though on the surface it doesn't look too hard to implement timeouts on namedir operations, it would actually have to be done in a lot of places (eg mkdirs/move calls on storage directories, writing edits, saving images, etc). Timing out some of these things isn't entirely straightforward, since the underlying calls aren't interruptible.

At some point we could attempt to tackle it, but looks like a complicated project. So, rather than trying to implement this in "software" for now, it's probably better to just recommend the proper NFS mount options when storing name dirs on NFS., I've noticed a failure during an unlock call that occurs AFTER a SD has been detected as a failed point. The unlock call went ahead and blocked via a native call to the NFS lock daemon - and since the NFS server was down, it just hung (odd that the timeout did not apply, probably an nfs lockd issue, but I do not feel its OK to unlock after a directory has caused a processIOError call)., bq. I've noticed a failure during an unlock call that occurs AFTER a SD has been detected as a failed point. The unlock call went ahead and blocked via a native call to the NFS lock daemon - and since the NFS server was down, it just hung (odd that the timeout did not apply, probably an nfs lockd issue, but I do not feel its OK to unlock after a directory has caused a processIOError call).

Disregard the above. It was cause of a lockd bug in an earlier release of CentOS as I'd suspected.

For:
bq. ATM and I just brainstormed about this a little bit over some iced coffee. Though on the surface it doesn't look too hard to implement timeouts on namedir operations, it would actually have to be done in a lot of places (eg mkdirs/move calls on storage directories, writing edits, saving images, etc). Timing out some of these things isn't entirely straightforward, since the underlying calls aren't interruptible.

Since the hang is in processIOError or a call like that that handles the dir-errors, lets have a timeout here instead? Should solve the same issue? Though if it was the case like above, a thread may hang forever.]