[Changed location to look for HDFS jar files., Updated HDFS dependent libraries., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12491184/HDFS-2277-1.patch
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed these core unit tests:


    +1 contrib tests.  The patch passed contrib unit tests.

    +1 system test framework.  The patch passed system test framework compile.

Test results: https://builds.apache.org/job/PreCommit-HDFS-Build/1135//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-HDFS-Build/1135//artifact/trunk/target/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-HDFS-Build/1135//console

This message is automatically generated., The code that uses build/ivy/lib needs to be updated to use target as well right?  Otherwise looks great., The current maven structure has bin scripts located in hadoop-hdfs/src/main/bin, and dependent jar files are not downloaded to target directory.  It doesn't seem possible to run directly from the source directory anymore after the maven structure change.  If community agrees, I will remove CLASSPATH construction for running from source directory.
, Yea, all the code that allows for running from source directories is really out of date now. I think we should remove all the related code entirely from common and hdfs (can do that in a separate jira). Shame to lose this feature but as you point out it's not a quick fix given the current state, we can file a separate jira to add it back if running from dev tarballs becomes too painful., It is a great convenience running from source directory for a more efficient dev cycle. I was able to do so by manually copying the classpath generated by
mvn dependency:build-classpath
into classpath. I don't know how much effort it is to include this feature programatically. So I don't vote either way.
, +1 to this change, it can proceed independently., If we are removing the ability to run hadoop from source perhaps we should have an umbrella JIRA to track this? I'm afraid I am not aware of one
, Filed HADOOP-7572 to restore running the daemons from source trees., I would personally be fine not being able to run from source checkouts as long as setting HADOOP_COMMON_HOME and HADOOP_HDFS_HOME to distinct directories generated by "mvn package -Pdist" still works. Has that scenario been tested with this change?, This change doesn't break running from source directories (it's already broken), in my comment I suggested Eric fixup those classpaths while he was fixing these ones here., +1. I'm happy with the filed jira. A few more things need to go into enabling that feature so this jira is perhaps not the best place for that anyway.

, 'mvn package -Pdist' creates the dist layout in 'target/<module>-<version>'

You can set the *_HOME & PATH to to the locations in 'target/<module>-<version>' & 'target/<module>-<version>/bin' and you achieve the same result.

And, on the plus side the scripts don't have to handle devel/dist mode, just dist mode.

The overhead of running 'mvn package -Pdist' (if you don't do use -Psrc and -Pdocs) is minimal (a few seconds if)., Reposting Alejandro's comment without the messed up formatting. Thanks Alejandro! You're a lifesaver

'mvn package \-Pdist' creates the dist layout in 'target/<module>\-<version>'

You can set the *_HOME & PATH to to the locations in 'target/<module>\-<version>' & 'target/<module>\-<version>/bin' and you achieve the same result.

And, on the plus side the scripts don't have to handle devel/dist mode, just dist mode.

The overhead of running 'mvn package -Pdist' (if you don't do use -Psrc and -Pdocs) is minimal (a few seconds if)., Given Alejandro's comment, clean up scripts to running in deployment model only., Removed legacy code for running from ant source build structure., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12491299/HDFS-2277-2.patch
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 2 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed these core unit tests:


    +1 contrib tests.  The patch passed contrib unit tests.

    +1 system test framework.  The patch passed system test framework compile.

Test results: https://builds.apache.org/job/PreCommit-HDFS-Build/1145//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-HDFS-Build/1145//artifact/trunk/target/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-HDFS-Build/1145//console

This message is automatically generated., This is closely related to HADOOP-7563.  Close this issue as part of HADOOP-7563.]