[Root cause of the error :

The delegation token is stored in the UGI tokens (map) and keyed to NameNode's RPC Hostname and port (8020).
Datanode tries to connect to the NameNode Service RPC hostname  and port (8030) . When the Client on DataNode looks for a token , it looks for a  token keyed with to NameNode Service RPC hostname  and port (8030). It does not find a match and hence cannot use delegation token for authentication. It falls back to Kerberos authentication, but do not have TGT for the user.

The fix is to use the NameNode's RPC address  (NOT service RPC) when browsing directory/block/tail via web. Patch is attached.
 
This is not a problem in trunk since the NameNode passes its own RPC address as a URL parameter when browsing directory. But adopting that scheme requires more changes.,  I noticed that StreamFile servlet might have similar issue because it uses namenode address in datanode which may not be the rpc address.
 I am worried there could be several places we might overlook where service address is being used. Also, the behavior is not clear if JspHelper on the namenode.
 Why is it difficult to backport the fix from trunk to the branch? Is it just because it is a bigger patch or because code structure has changed so much that branch-1 needs a different fix altogether?, Sorry , I didn't see this comment. 

The code structure is different and we need a much bigger change to fix this using the Hadoop 2 approach. Its not a simple backport. 

I am not sure about the use case of StreamFile and whether the same change needs to be made there.  Does it fall into the same category as the file system browsing by webui ? 

If so, I can make the same change and resubmit the patch. 
I checked all other places in the code where DataNode.getDataNode().getNameNodeAddr() is invoked and none of them require this change.

It will be great to get this committed as this is bug for sure.
, Hi Benoy - is the browsing functionality actually broken by this error or are you just seeing the error in the log?, Its broken.
We applied the attached patch to fix it on our clusters.
, Binoy, 
  JspHelper.namenodeAddr is a public static variable, which may be used in many places, changing that might break something else. Note that jsp files could also be referencing it where corresponding java files are auto-generated.
 A safer approach is to leave this variable as it is and introduce another variable like namenodeRpcAddr and use that other variable from the servlets that are responsible for this error. Does that make sense?
 If you are confident that it is not being used anywhere then we could consider changing it into a private variable., I agree with Jitendra.
In my opinion we should either: backport the change from Hadoop 2 or introduce the new variable in order to avoid unforeseen effects from use of this public static.
, This variable is used only in JSPs.

Please note that the change is not going to break any functionality. Instead of using the service RPC address, we are using RPC address for the webui access.  This is in line with the Hadoop 2.0 approach. It has been working fine in our clusters for last 3 months. 

The change is pretty simple.
If a cluster is using service RPC address, namenode address in JSPS is set to RPC address. 
If a cluster is not using service RPC address, there is no change.

Adding a new variable simply causes more changes for no real reason and is not tested by us., I see that JspHelper.namenodeAddr is being used only in following jsp's:
1) browseBlock.jsp
2) browseDirectory.jsp
3) tail.jsp

In all these cases it seems fine to use namenode rpc-address.
I am fine with this patch if you are sure that all these jsp's have been sufficiently tested in your clusters. If you have a running cluster, it should be possible to test these by clicking on various links in the web-ui., I have tested the above JSPs on our cluster and they work fine with these changes.
I verified that StreamFile has similar issue as mentioned by Jitendra. I am attaching the new patch which fixes the problem in  StreamFile., +1 for the patch., Please run test, javadoc, findbugs etc with the patch, I will commit once these results are available., I ran tests locally for Benoy Antony and all the tests passed with the patch. I've committed this to branch-1. Thanks for the work Boney! And thanks for the review Jitendra!]