[Filed HDFS-2062 so we'll catch this in the future., This looks like it may be a duplicate of HADOOP-7373, which I'll commit promptly., When ivy check out common jar file for HDFS project, it used to be placed in build/ivy/lib/Hadoop-Hdfs/common, but the project name is renamed by HDFS-560 to hadoop-hdfs.  This is part one of the breakage.  Part two is the test script is looking for hard coded hadoop-common jar file.  In neither cases, it is unrelated to bin/lib changes broke the libhdfs test.  , Patch to fix reference to hadoop-common jar file, and make sure the developer class path is setup correctly with ivy downloaded libraries., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12482110/HDFS-2063.patch
  against trunk revision 1134458.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed these core unit tests:
                  org.apache.hadoop.cli.TestHDFSCLI
                  org.apache.hadoop.hdfs.TestReadWhileWriting

    +1 contrib tests.  The patch passed contrib unit tests.

    +1 system test framework.  The patch passed system test framework compile.

Test results: https://builds.apache.org/job/PreCommit-HDFS-Build/769//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-HDFS-Build/769//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-HDFS-Build/769//console

This message is automatically generated., Thanks Eric. And apologies for miss-triaging!

+1 to your change. I had to make a small modification (attached) to pass VERSION as HADOOP_VERSION since VERSION is already defined by libhdfs so VERSION gets passed to the test as 0.1.0 (instead of eg 0.23.0-SNAPSHOT). With this change the libhdtest is back to running (and passing). , I've committed this. Thanks Eric., In case it wasn't obvious the test failures are unrelated., Thanks Eli. :), Integrated in Hadoop-Hdfs-trunk-Commit #746 (See [https://builds.apache.org/job/Hadoop-Hdfs-trunk-Commit/746/])
    , Integrated in Hadoop-Hdfs-trunk #699 (See [https://builds.apache.org/job/Hadoop-Hdfs-trunk/699/])
    ]