[h483_20090709.patch: fault injection tests

- implements Pipeline_FI_09, 10, 11 described in the test plan posted in HDFS-265.
- also contains codes for Pipeline_FI_14, 15, 16 but they are not yet completed.
, h483_20090713.patch: complete the tests Pipeline_FI_14, 15, 16.   Trunk passed Pipeline_FI_14 but failed Pipeline_FI_15, 16., This patch seems to contain some modifications of build.xml file which are part of resolved HDFS-475., h483_20090717.patch: updated with trunk., Although I am not completely sure about the future plans of the development of these tests, but it seems that the second parameter of DoosAction and OomAction hasn't been used by anything but  the constructor itself.
{noformat}
...
    final int index;

     DoosAction(String currentTest, int index) {
      this.currentTest = currentTest;
      this.index = index;
    }
...
{noformat}

and it seems to be the only reference to this member.

Also, it seems that non of newly created public methods/aspects have JavaDocs., > ... it seems to be the only reference to this member.
For the index, it is used in run(..) showed below for determining the pipeline position.
{code}
+    public void run(DataNode datanode) {
+      final Pipeline p = DataTransferTestUtil.getPipeline();
+      if (p.contains(index, datanode.dnRegistration)) {
+        throw new OutOfMemoryError("FI: " + currentTest
+            + ", datanode=" + datanode.dnRegistration.getName());
+      }
+    }
{code}
, +1 (conditional to the JavaDoc being added), h483_20090727.patch: updated with trunk., h483_20090730.patch: added a few more tests for non-responding datanodes and slow datanodes.

(Cos, will work on the javadoc later.), h483_20090731.patch: added javadoc and rewrote some codes for a better style.

Note that all the posted patches up to now contain only tests (from Pipeline_Fi_04 to Pipeline_Fi_16)., Looks good! Thanks for adding JavaDocs Nicholas., h483_20090806.patch: refactored the codes and updated with trunk., It turns out that trunk can pass Pipeline_Fi_06,07,12,14,15 among all the implemented tests.  I will post a separate patch, which includes the passed tests, in HDFS-451., Do you plan to split the current patch to include only failing test here? 'cause otherwise it will render a conflict IMO, > Do you plan to split the current patch to include only failing test here? ...
Yes, I will upload a new patch once HDFS-451 is committed., h483_20090709.patch: moved the failed tests to TestFiDataTransferProtocol2.
, "h483_20090709.patch" should be "h483_20090807.patch", May I suggest to use JUnit4 notations (e.g. @Test and org.junit imports) instead of JUnit3 (inheritance of TestCase and test methods naming convention)?, Would it be possible to make DataNodeAction's constructor to be at least {{protected}} so one can extends this class from another package's classes? , h483_20090807b.patch: updated with trunk., Submitting for testing Hudson.  Check whether the failed fault injection tests can fail the build., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12415910/h483_20090807b.patch
  against trunk revision 802264.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-vesta.apache.org/51/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-vesta.apache.org/51/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-vesta.apache.org/51/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-vesta.apache.org/51/console

This message is automatically generated., > -1 core tests. The patch failed core unit tests.

There are other unit tests failing.  So we cannot tells whether the failed fault injection tests can fail the build. , h483_20090810.patch: added pipeline_Fi_01,02,03 and changed to junit 4., Try Hudson again to see whether the failed fault injection tests can fail the build. , -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12416138/h483_20090810.patch
  against trunk revision 803337.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 15 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-vesta.apache.org/60/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-vesta.apache.org/60/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-vesta.apache.org/60/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-vesta.apache.org/60/console

This message is automatically generated., > Try Hudson again to see whether the failed fault injection tests can fail the build.

Great!  Got a -1 on core tests although the [test report|http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-vesta.apache.org/60/testReport/] does not show any failure.

Created HDFS-542 for fixing the test report., h483_20090818.patch: a few more tests and synced with trunk., shouldn't we use "import static org.junit.Assert.*;" instead?, > shouldn't we use "import static org.junit.Assert.*;" instead?

What's the difference?
, it's part of junit4 and has 2 more methods for arrays if i remember correctly., I think the rule of the thumb is to stay away from junit.framework imports when developing new tests. We are trying to get away from JUnit3 from now on., I changed TestFiDataTransferProtocol to junit 4 in HDFS-552.  Thanks, Kan and Cos for the advises., h483_20090819.patch: added two more tests and updated with trunk., h483_20090819b.patch: added Pipeline_Fi_31 - 35., Nicholas, since all sub tasks are resolved, can we close this? Did HDFS-101 also fix HDFS-264?, Yes, we should close this and HDFS-264.]