[Patch implements changes as described., submitting patch., +1
This patch does replace calls to getUserName() to getShortUserName() , -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12434446/HDFS-938.patch
  against trunk revision 903906.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 39 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h5.grid.sp2.yahoo.net/215/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h5.grid.sp2.yahoo.net/215/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h5.grid.sp2.yahoo.net/215/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h5.grid.sp2.yahoo.net/215/console

This message is automatically generated., I can't reproduce the test failures:
{noformat}Testsuite: org.apache.hadoop.hdfs.server.datanode.TestDataNodeMetrics
Tests run: 1, Failures: 0, Errors: 0, Time elapsed: 44.085 sec
---
Testsuite: org.apache.hadoop.hdfs.server.namenode.TestBackupNode
Tests run: 2, Failures: 0, Errors: 0, Time elapsed: 17.772 sec{noformat}
Contrib test failure is known bad cactus issue.
Going to commit., I have committed this.  Resolving., Integrated in Hadoop-Hdfs-trunk-Commit #184 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Hdfs-trunk-Commit/184/])
    . Replace calls to UGI.getUserName() with UGI.getShortUserName().
(jghoman)
, HDFS-938-BP20-1.patch: for previous version, not to commit, for previous version, not to commit
adds ivy dependency for jackson json library, For the contrib patch, the eclipse classpath hasn't been updated, leading to test-patch -1s., added eclipse.template/.classpath to include JSON libs, moving ivy configuration stuff to HADOOP-6544
, For the 938 backport, looks like you got all the references in HDFS.  Since this patch is being backported in three pieces, rather than the usual one, I have a question as to whether it's correct that org/apache/hadoop/security/TestGroupMappingServiceRefresh.java is being patched here?, address Jacob comments for HDFS-938-BP20-2.patch.
removed TestGroupMappingServiceRefresh.java changes.
, +1, Integrated in Hdfs-Patch-h2.grid.sp2.yahoo.net #146 (See [http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h2.grid.sp2.yahoo.net/146/])
    , Integrated in Hadoop-Hdfs-trunk #275 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Hdfs-trunk/275/])
    ]