[Currently dfsadmin has the following commands

{code}
Note: Administrative commands can only be run as the HDFS superuser.
           [-report]
           [-safemode enter | leave | get | wait]
           [-allowSnapshot <snapshotDir>]
           [-disallowSnapshot <snapshotDir>]
           [-saveNamespace]
           [-rollEdits]
           [-restoreFailedStorage true|false|check]
           [-refreshNodes]
           [-finalizeUpgrade]
           [-metasave filename]
           [-refreshServiceAcl]
           [-refreshUserToGroupsMappings]
           [-refreshSuperUserGroupsConfiguration]
           [-printTopology]
           [-refreshNamenodes datanodehost:port]
           [-deleteBlockPool datanode-host:port blockpoolId [force]]
           [-setQuota <quota> <dirname>...<dirname>]
           [-clrQuota <dirname>...<dirname>]
           [-setSpaceQuota <quota> <dirname>...<dirname>]
           [-clrSpaceQuota <dirname>...<dirname>]
           [-setBalancerBandwidth <bandwidth in bytes per second>]
           [-fetchImage <local directory>]
{code}, Also we should add an optional argument to take in the namenode hostname or dfs.ha.namenodes.${dfs.nameservices} value so the user can do admin operation on any namenode., > Also we should add an optional argument to take in the namenode hostname or dfs.ha.namenodes.

This is already available with -fs generic option.

> value so the user can do admin operation on any namenode.

Very good idea. If I understand it correctly:
- If -fs is specified the command is sent to that particular NameNode. 
- And by default to the active NN., Ah thanks Konstantin.

Yes by default we should always go to the active NN., For commands like -safemode and -metasave, currently the NN side's check is "OperationCategory.UNCHECKED" (since we should allow admin to do it on both active and standby NN), thus the client will not get a StandbyException if it goes to the SBN. In that case, it is difficult for the client to make sure it goes to the "currently active" NN. Even if the client first calls an operation such as "getFileInfo" before it makes the real call (to trigger its own failover), NN failover may happen between the interval of two client operations.

So given that we can use -fs option to specify which NN to connect to, I think maybe we do not need to do anything here., hdfs dfsadmin -safemode enter 
This command's result is first namenode(it doesn't matter that active) status changes to safemode. I think should be changed active namenode or both.

hdfs dfsadmin -fs hdfs://CLUSTERNAME -safemode enter
This command's result is same.

Is it correct?

I performed in r2.2.0, [~yunsh], you need to specify specific NN URI in the -fs option, i.e., instead of "-fs hdfs://CLUSTERNAME", you may want to use "-fs hdfs://NN2_HOST:NN2_PORT" if you want to put NN2 into safemode., [~jingzhao], thanks for your answers.
I known -fs option and it works well.
But, I think "dfsadmin" command should be affect active namenode when I don't specify specific NN URI or use "-fs hdfs://CLUSTERNAME".
Currently, it affect first namenode that doesn't matter active or standby., The issue is that it is hard to make sure the safemode command is sent to the active NameNode (see my above [comment|https://issues.apache.org/jira/browse/HDFS-5147?focusedCommentId=13759739&page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel#comment-13759739]). But to send commands to both NNs may be an option., For getting the safemode status from active namenode we have an option. 
see {{DistributedFileSystem#isInSafeMode()}}
{code}  public boolean isInSafeMode() throws IOException {
    return setSafeMode(SafeModeAction.SAFEMODE_GET, true);
  }{code}

here {{isChecked}} is passed as true, then StandByException is thrown from Standby and request will be processed only at the Active NN.

Same we can have in DFSAdmin call to setSafeMode, may be based on some flag if required.

Similar changes can be done for other RPCs also which needs to be processed only at the ActiveNN.



, Adding to above comment, 
in NameNodeRpcServer checks for handled based on the flag passed.
{code}  @Override // ClientProtocol
  public boolean setSafeMode(SafeModeAction action, boolean isChecked)
      throws IOException {
    OperationCategory opCategory = OperationCategory.UNCHECKED;
    if (isChecked) {
      if (action == SafeModeAction.SAFEMODE_GET) {
        opCategory = OperationCategory.READ;
      } else {
        opCategory = OperationCategory.WRITE;
      }
    }
    namesystem.checkOperation(opCategory);
    return namesystem.setSafeMode(action);
  }{code}, Good idea, [~vinayrpet]! I will check it later following your ideas. Also please feel free to assign this jira to yourself if you want to work on this. , But for some admin commands, such refresh ACL, it should be execute on both ANN and SNN, otherwise, standby NN doesn't know the latest ACL after failover.

, Yeah, for commands like -refreshNodes we may want to send the request to both NN., Relating the HDFS-3507 where the DFS#isInSafeMode() is made to communicate to only Active NameNode.]