[This jira is not necessary. The conflict code was only in 0.20.203. Post upgrade to later releases the conflicting opcode is not used. I am closing than as Won't Fix. Reopen if you disagree., BTW a comment to relevant to my previous comment - https://issues.apache.org/jira/browse/HDFS-1842?focusedCommentId=13021839&page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel#comment-13021839, I disagree. There are people running systems with LV -19 which has the conflicted opcodes. Currently if you run OEV on these logs, you end up getting errors because it reads delegation token ops as eg symlink ops. If we don't support OEVing a given LV, we should raise an error., Todd, can you tell me which apache release the LV -19 is from. Saves me time, since you have already done this analysis., Suresh,

{code}
hadoop-branch-1 $ grep -r LAYOUT_VERSIONS_203 src/
src/hdfs/org/apache/hadoop/hdfs/server/common/Storage.java:  public static final int[] LAYOUT_VERSIONS_203 = {-19, -31};
{code}, @Eli, not sure if you saw my previous comment:
bq. The conflict code was only in 0.20.203. Post upgrade to later releases the conflicting opcode is not used.

Given that a tool that works with the opcodes seems unnecessary, since the problem is only in 0.20.203 alone. Even the editlog code does not handle these conflicts in 0.20.204. We make users save namespace to work around it., bq. We make users save namespace to work around it

That's the same proposal here: we error out with "Sorry, you cannot use the OEV on an edit log from this version of Hadoop." Instead of erroring out with "EofException" while trying to read a symlink target, which makes people think the log itself is corrupt., bq. That's the same proposal here
Sorry, that was not clear to me by the title or description. Perhaps we could change them for better clarity., bq. That's the same proposal here: we error out with "Sorry, you cannot use the OEV on an edit log from this version of Hadoop." Instead of erroring out with "EofException" while trying to read a symlink target, which makes people think the log itself is corrupt.

Seems reasonable to me.]