[This patch fixes and lets artifact publishing to the both staging and the snapshot repository.

ant mvn-install    Would install artifact to the local filesystem. (maven cache)
ant mvn-deploy -Drepo=staging -Dversion=<version>       Would let the artifacts published to the apache staging repo.
ant mvn-deploy      Would let the artifacts to the snapshot repo

mvn-deploy to the stating requires gpg signing., I have skimmed the patch - looks good at the first sight. Will give it a better run-over tomorrow., Thanks for working on this, Giri. I tried to upload some artifacts to the staging repository but got the following error when I tried to "close" the release:

{noformat}
Staging Signature Validation

    -Missing Signature: '/org/apache/hadoop/hadoop-hdfs-instrumented/0.22.0/hadoop-hdfs-instrumented-0.22.0-sources.jar.asc' does not exist for 'hadoop-hdfs-instrumented-0.22.0-sources.jar'.
    -Invalid Signature: '/org/apache/hadoop/hadoop-hdfs-instrumented/0.22.0/hadoop-hdfs-instrumented-0.22.0.jar.asc' is not a valid signature for 'hadoop-hdfs-instrumented-0.22.0.jar'.
    -Missing Signature: '/org/apache/hadoop/hadoop-hdfs-test/0.22.0/hadoop-hdfs-test-0.22.0-sources.jar.asc' does not exist for 'hadoop-hdfs-test-0.22.0-sources.jar'.
    -Invalid Signature: '/org/apache/hadoop/hadoop-hdfs-test/0.22.0/hadoop-hdfs-test-0.22.0.jar.asc' is not a valid signature for 'hadoop-hdfs-test-0.22.0.jar'.
    -Invalid Signature: '/org/apache/hadoop/hadoop-hdfs/0.22.0/hadoop-hdfs-0.22.0.jar.asc' is not a valid signature for 'hadoop-hdfs-0.22.0.jar'.
    -Missing Signature: '/org/apache/hadoop/hadoop-hdfs/0.22.0/hadoop-hdfs-0.22.0-sources.jar.asc' does not exist for 'hadoop-hdfs-0.22.0-sources.jar'.
    -Invalid Signature: '/org/apache/hadoop/hadoop-hdfs-instrumented-test/0.22.0/hadoop-hdfs-instrumented-test-0.22.0.jar.asc' is not a valid signature for 'hadoop-hdfs-instrumented-test-0.22.0.jar'.
    -Missing Signature: '/org/apache/hadoop/hadoop-hdfs-instrumented-test/0.22.0/hadoop-hdfs-instrumented-test-0.22.0-sources.jar.asc' does not exist for 'hadoop-hdfs-instrumented-test-0.22.0-sources.jar'.
{noformat}

I think that the sources.jar.asc is overwriting the jar.asc file. This can be fixed by adding a {{classifier="sources"}} attribute to attach element. I made this change in the attached patch, and the "close" was successful., I have verified that Tom's latest patch represents the essence of HADOOP-6954 on top of the original one.
+1 patch looks good., Here's an updated patch with the commented-out section removed. I ran test-patch manually:

{noformat}
[exec] -1 overall.  
[exec] 
[exec]     +1 @author.  The patch does not contain any @author tags.
[exec] 
[exec]     -1 tests included.  The patch doesn't appear to include any new or modified tests.
[exec]                         Please justify why no new tests are needed for this patch.
[exec]                         Also please list what manual steps were performed to verify this patch.
[exec] 
[exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
[exec] 
[exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
[exec] 
[exec]     +1 findbugs.  The patch does not introduce any new Findbugs warnings.
[exec] 
[exec]     +1 release audit.  The applied patch does not increase the total number of release audit warnings.
[exec] 
[exec]     +1 system tests framework.  The patch passed system tests framework compile.
{noformat}

I sucessfully published to both local and staging repos with this patch. I'll commit this soon unless there is any more feedback., Except for a couple extra long lines and some redundant white spaces at the end of the lines patch looks good, I've just committed this. Thanks Giri!]