[Patch to fix LAST_PRE_FEDERATION_LAYOUT_VERSION, I patched too soon... this allows the upgrade and initial startup. But, then, on next start, the NN fails with:

org.apache.hadoop.hdfs.server.common.InconsistentFSStateException: Directory /tmp/name1 is in an inconsistent state: file VERSION has no block pool Id.
, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12478896/hdfs-1919.txt
  against trunk revision 1102094.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed these core unit tests:
                  org.apache.hadoop.cli.TestHDFSCLI
                  org.apache.hadoop.hdfs.TestDFSShell
                  org.apache.hadoop.hdfs.TestDFSStorageStateRecovery
                  org.apache.hadoop.hdfs.TestFileConcurrentReader
                  org.apache.hadoop.tools.TestJMXGet

    +1 contrib tests.  The patch passed contrib unit tests.

    +1 system test framework.  The patch passed system test framework compile.

Test results: https://builds.apache.org/hudson/job/PreCommit-HDFS-Build/488//testReport/
Findbugs warnings: https://builds.apache.org/hudson/job/PreCommit-HDFS-Build/488//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/hudson/job/PreCommit-HDFS-Build/488//console

This message is automatically generated., Was this caused by the federation branch merge?  What testing was done on that before merge?, There are plenty of upgrade related tests already in unit tests that cover lot of upgrade related tests and they do pass. Manual tests are done for upgrade from 203. Will do some tests related to upgrade from 0.22 - currently 0.22 is not a released software and I have not focused on testing that upgrade.

I can take over this bug., Todd, can you attach the log for next restart of NN where you got an exception., Hi Suresh. I'm reassigning this to you.

Unfortunately I don't have the log handy anymore, but you can easily reproduce by formatting the NN with 0.22, then running hadoop namenode -upgrade with trunk. It will start OK, but if you ^C and start again, it will fail with missing blockpool ID., I do not see any restarts failing. Perhaps you did not clean build and the static LV was not updated in some classes.

However, I do see that bumping up the layout version for 203, 22 and trunk (from HDFS-1842 and HDFS-1824) has caused problems with some of the version checks for new fsimage scheme of loading and checksum of edits etc. I will change the title of this bug and fix them., Cannot reproduce after HDFS-1936 fixed layout version issues.]