[I don't think it's an issue. SIGTERM comes from the outside. The signal is probably emitted by some script, command, or daemon process., Please use the mailing list for future discussions of this nature., i tried read all system log files , and cut off login all user who ssh to this server , but nothing change ( it still killed ), I changed to use ubuntu 14 and everything 's okie now, Then it could be linux OOM killer., [~walter.k.su] [~tuyuri] [~kihwal]
How to resolve this issue, I face the same issue. the datanode shutdown. what is the key reason., [~kihwal] OOM Killer use SIGKILL.  does not use SIGTERM.

I also face this issue. 
I have monitored all signal in the system using https://sourceware.org/systemtap/examples/lwtools/killsnoop-nd.stp
according to signal monitoring tool, when datanode suddenly shutdown (also emitted log SIGTERM),  NO ocurr SIGTERM.

my environmental is 
CentOS 6.7
jdk 1.7.0_80
hadoop 2.7.1
has 400 nodes.
, if user of DataNode is same with NodeManager, maybe it is related with YARN-4459
, I checked the oom killer code and it is SIGKILL as you pointed out. It might have used SIGTERM in the ancient versions. This wouldn't have been caught by the sys call snooping, as it does not involve any. It sure looks like something else sending SIGTERM to the datanode process. I looked over the openjdk8 source but couldn't find anything raising SIGTERM for itself to shutdown.  Whoever the sender is, you should be able to catch it with the systemtap instrumentation.

We have had similar issues due to stale pid files, but that can't be it if no service was (re)started at that time. 

bq. if user of DataNode is same with NodeManager, maybe it is related with YARN-4459
Are you saying that your cluster is configured this way? If so, I agree YARN-4459 is a good candidate. If not, we are back to square one.  In any case, the systemtap instrumentation should help identifying the source of the signal., Yes. my cluster was configured same user of DataNode and Nodemanager due to my infrastructure have some limitation.
anyway I have figured it out using YARN-4459.

[~kihwal] Thank you for your advice.]