[When the SafeModeMonitor thread exists, it rechecks to see if fsRunning is false. if fsRunning is false, then do not leave safemode, just exit. , Good catch Dhruba, 

One minor correction, Could you please correct errors in Log message.

bq.NameNode isbeing shutdow, quitting SafeModeMonitor thread. , I had attached an older version of this patch. here is the most updated version., Thanks Ravi, can you pl review the new patch file?, Can somebody pl review this minor patch?, +1. Looks good.
        ~Don't see errors in the log message.~
, Thanks for the review Konstantin, I will commit this patch., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12444239/NNsafemodeMonitor.txt
  against trunk revision 947204.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h2.grid.sp2.yahoo.net/180/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h2.grid.sp2.yahoo.net/180/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h2.grid.sp2.yahoo.net/180/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h2.grid.sp2.yahoo.net/180/console

This message is automatically generated., I just committed this. , Integrated in Hadoop-Hdfs-trunk-Commit #327 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Hdfs-trunk-Commit/327/])
    HDFS-1145. When NameNode is shutdown it does not try to exit
safemode anymore. (dhruba)
]