[h534_20090810.patch: add avro jar to ivy., Try hudson., Thanks, Suresh, who pointed out that the previous patch won't work if the arvo jar file is not in the cache.

h534_20090810b.patch: updated ivysettings.xml as the patch in HADOOP-6120., +1. I have also tested this change and it fixed many of test failures..., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12416128/h534_20090810b.patch
  against trunk revision 802972.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-vesta.apache.org/54/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-vesta.apache.org/54/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-vesta.apache.org/54/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-vesta.apache.org/54/console

This message is automatically generated., Can you define a variable for the Avro version number in ivysettings.xml and reference it in the "rev" field in ivy.xml? This would be more consistent with the rest of the file., HDFS doesn't depend on Avro directly, Common does, so really we should be using Ivy's transitive dependency support (so that by depending on Common, Ivy will pull in the jars that Common depends on, such as Avro, Jets3t, etc). This requires HADOOP-5107, so the approach in this issue is fine in the meantime., > Can you define a variable for the Avro version number in ivysettings.xml and reference it in the "rev" field in ivy.xml? This would be more consistent with the rest of the file.

Sure.  I guess you mean libraries.properties instead of ivysettings.xml.  Thank you for the hints, Tom.

h534_20090811.patch: define a version variable, > HDFS doesn't depend on Avro directly, Common does, so really we should be using Ivy's transitive dependency support (so that by depending on Common, Ivy will pull in the jars that Common depends on, such as Avro, Jets3t, etc). This requires HADOOP-5107, so the approach in this issue is fine in the meantime.

Then, I will commit h534_20090810b.patch which has passed Hudson.
- no new tests since this is an ivy change.
- TestHDFSTrash is not related., I have committed this.  (also updated hadoop-core-0.21.0-dev.jar and hadoop-core-test-0.21.0-dev.jar)
, bq. I guess you mean libraries.properties instead of ivysettings.xml.

Yes, I did., Integrated in Hadoop-Hdfs-trunk #47 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Hdfs-trunk/47/])
    . Include avro in ivy.
]