[This is better as a DEBUG log since it may get called repeatedly for recovery blocks?, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12478501/HDFS-977.r1.diff
  against trunk revision 1127390.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/hudson/job/PreCommit-HDFS-Build/622//console

This message is automatically generated., Can you re-upload as a -p0 patch?, Sorry about that!, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12480430/HDFS-977.r2.diff
  against trunk revision 1127390.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed these core unit tests:
                  org.apache.hadoop.hdfs.TestDFSStorageStateRecovery

    +1 contrib tests.  The patch passed contrib unit tests.

    +1 system test framework.  The patch passed system test framework compile.

Test results: https://builds.apache.org/hudson/job/PreCommit-HDFS-Build/624//testReport/
Findbugs warnings: https://builds.apache.org/hudson/job/PreCommit-HDFS-Build/624//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/hudson/job/PreCommit-HDFS-Build/624//console

This message is automatically generated., Log level change - No TCase required., Committed to trunk and 0.22. Thanks Harsh!

P.S. No need to fill in "release note" for small changes like this that users don't need to know about when upgrading. It's mostly meant for new features or changes an operator/user should really be aware of., Integrated in Hadoop-Hdfs-trunk-Commit #696 (See [https://builds.apache.org/hudson/job/Hadoop-Hdfs-trunk-Commit/696/])
    , Integrated in Hadoop-Hdfs-trunk #682 (See [https://builds.apache.org/hudson/job/Hadoop-Hdfs-trunk/682/])
    HDFS-977. DataNode.createInterDataNodeProtocolProxy() guards a log at the wrong level. Contributed by Harsh J Chouraria.

todd : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1128986
Files : 
* /hadoop/hdfs/trunk/src/java/org/apache/hadoop/hdfs/server/datanode/DataNode.java
* /hadoop/hdfs/trunk/CHANGES.txt
, Todd, I see few commits to 0.22 that are not blockers. We should be committing only blockers to 0.22 at this time right? Any other content requires a vote.

BTW HDFS-1954 that was committed might have resulted in failed TestMissingBlocksAlert failing., Integrated in Hadoop-Hdfs-22-branch #61 (See [https://builds.apache.org/hudson/job/Hadoop-Hdfs-22-branch/61/])
    ]