[downgrading to minor and marking as 0.23+ only -I'm assuming that is the case. If the original submitter of the issue could state their release version, that would help, root cause looks like HDFS-1594, source of HDFS-1594 lists the parameters
{code}
+  public static final String  DFS_NAMENODE_DU_RESERVED_KEY = "dfs.namenode.resource.du.reserved";
+  public static final long    DFS_NAMENODE_DU_RESERVED_DEFAULT = 1024 * 1024 * 100; // 100 MB
{code}

What could be done is add a wiki entry on the topic and have the log entry point to it., Can you please give me steps to change value. I read the HDFS-1594 but didn't get how to fix ? Can anybody give me simple steps ?

Thanks,
, version is 

Hadoop 2.0.0-cdh4.1.2, The Apache JIRA is not for user help but only for confirmed bug reports. Please send usage help requests such as your questions to user@hadoop.apache.org.

I'm resolving this as Invalid; lets carry forward on your email instead. Many have already answered you there. The key to tweak the default is dfs.namenode.resource.du.reserved., Thanks Harsh, Do I need to add parameters in hdfs-site.xml and restart
service namenode.

+  public static final String  DFS_NAMENODE_DU_RESERVED_KEY =
"dfs.namenode.resource.du.
reserved";
+  public static final long    DFS_NAMENODE_DU_RESERVED_DEFAULT = 1024 *
1024 * 100; // 100 MB




, it is not fixed yet as my root partition has space in GB's 

/dev/mapper/vg_operamast1-lv_root
                       50G   33G   14G  71% /
, Again, I'm closing this issue
# JIRA is not the place to deal with what is currently believed to be a config problem affecting a single user.
# Hadoop 2.0.0-cdh4.1.2 is not an ASF release: you need to take it up with Cloudera via their support channels, both paid and mailing list.
# If it is found to be something in the apache codebase then they can file a replicable bug here which we can all fix together.
# 'critical' is reserved for issues that are considered risks to data across multiple clusters. This may be critical for you, but given it works for everyone else, minor.

Please, please, please don't use JIRAs for these kind of problems -it's like asking Linus for help getting networking right on your ubuntu laptop., See also http://wiki.apache.org/hadoop/InvalidJiraIssues]