[Thanks [~rakeshr] for creating the Jira and [~daryn] for reviewing (re-encryption essentially :)).

On re-encryption we chose not to change snapshots due to the immutable nature of snapshots (old edek can still work if the ez key version is still there). Good point about permissions, perhaps since this is enforced to be hdfs superuser role we can skip perm checks..., Thank you [~xiaochen] for the quick reply. I understand that {{snapshot}} handling is not required in edek logic, so we will take care this condition specifically to sps., I think it's also arguable whether snapshots should be supported for sps. What's the use case where we need to support snapshot on sps?

The major consideration for re-encryption is snapshots are supposed to be immutable (at least not to further complicate the semantic), and simplicity of code / test / support., Good points, highlighting some major issues.  I have no intention of ever using snapshots so I'll not push for full snapshot support.  I understand how incredibly difficult it is to deal with snapshots.  We just can't make it fail horribly.

Opinions:

SPS should handle snapshots.  If I change the storage of a hot storage directory to cold or archive, does it make sense for only files in the current snapshot to be moved?  Deleted files in prior snapshots are certainly no more important and I'd expect them to be moved.

It's only important to me that namesystem mutation doesn't cause errors because I might actually use storage types.
{quote}The major consideration for re-encryption is snapshots are supposed to be immutable (at least not to further complicate the semantic), and simplicity of code / test / support.
{quote}
Re-encryption should definitely handle snapshots. _That was a terrible design choice_.  Changing the EDEK of a snapshot file does not violate its immutability.  Rolling a key secret is a security measure.

Consider this scenario: 90-day data retention.  Keys rolled weekly.  Only 2 active keys.  Need to recover data from 2 weeks and 1 day ago.  Can access current but not snapshot files?   I would be furious if I actually used snapshots.

Both cases are illustrating why directory crawls are a terrible idea, esp. when it comes to snapshots. :( 

 

 , Thanks for the thoughts Daryn.

Filling in some more info on snapshots: I recently tried on HDFS-13021 but it appears feature matrix of snapshots with other stuff is complicated and various case-by-case... (no intention to discuss that one :))

I agree with your take on the problem(s) in general, OTOH there are also cases that's debatable. For SPS, it gets tricky if the change was the other way round (moving a current file to be hot with no intention of making all backups hot). For re-encryption, good point. I didn't realize the fact that it can be (rightfully) considered immutable.

Our decision at that time was: emergency key rolling will have to delete old snapshots for security; old keys should be kept long enough to allow reading from snapshots. It would be great if it gets smarter in v2 and relax this dependency...]