[Please review updated doc.

Changed all instances of "hadoop fs" to "hdfs dfs"

Note:  Should the doc title be changed?  
From -  File System Shell Guide
To -  Distributed File System Shell Guide



, No, we shouldn't change the title of the docs. These commands work for any type of File System (DFS, Local FS, S3 FS and so on)., For review:

(1) File System Shell Guide - Updated the Overview section 

(2) HDFS Users Guide - Updated the Shell Commands section - changed "hadoop -fs" to "hdfs -dfs" and added link to File System Shell Guide

Note: These changes will be committed when I create the JIRAs for the hadoop doc split later this week.

Thanks/C, bq. Changed all instances of "hadoop fs" to "hdfs dfs"

I think "hadoop fs" is better since it is filesystem agnostic. As Boris points out, the commands work for any type of filesystem., This JIRA was created to make sure the documentation matched the current implementation.
Otherwise I agree with Tom.
 , Changes suggested by Boris are included in JIRA HDFS-574.
Thanks/C, Here are s/hadoop /hdfs /g updates for HDFS docs. All references I could manage to read and find., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12504395/HDFS-557.patch
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    +0 tests included.  The patch appears to be a documentation patch that doesn't require tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed these unit tests:
                  org.apache.hadoop.fs.viewfs.TestViewFsHdfs

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-HDFS-Build/1604//testReport/
Console output: https://builds.apache.org/job/PreCommit-HDFS-Build/1604//console

This message is automatically generated., I think the mkdir, rmr, cat commands should be "hadoop fs" instead of "hdfs dfs", Todd,

I can make that change. However, these shell guides seem to have been booted out of the doc-gen path today on trunk. New docs seem to be in a different (.apt.vm) format and may require a full porting done first.

I'll look for existing JIRAs for that and file some instead if not present., {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12504395/HDFS-557.patch
  against trunk revision .

    {color:red}-1 patch{color}.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-HDFS-Build/6773//console

This message is automatically generated., It's actually worse than this...

Looking at http://hadoop.apache.org/docs/r2.4.1/hadoop-project-dist/hadoop-common/CommandsManual.html, all kinds of stuff get run from the hadoop command.

This really needs to get fixed.]