[The 'hadoop' command is still supported, and will give users time to move to 'hdfs' over time - is that an acceptable solution? What do others think?, The hadoop command is still supported, but there are lots of places on the net where hdfs is used as an alias for 'hadoop dfs'.  If someone doesn't know/how to actually create that shell alias, the fact that the hadoop command is there will be irrelevant.

, Hey Allen,

Can you point to places on the net where the hdfs alias is used? It hasn't been as common in environments in which I've worked. I'm afraid we're optimizing for a potential use case rather than a real use case. In any case, as you pointed out in IRC, if a user has an alias for hdfs, that will take precedence over their PATH setting, so it's unlikely that they'll get bitten too hard.

Thanks,
Jeff, I know it is all over Y!'s and LI's wiki pages and internal (and sometimes external) presentations.  A more public one is this one:

http://blog.rapleaf.com/dev/2009/11/17/command-line-auto-completion-for-hadoop-dfs-commands/, I'd like to downgrade this from a blocker for 0.21. Users with a 'hdfs' alias can call the hdfs script by specifying the path (e.g. 'bin/hdfs') or remap the alias (to e.g. 'hfs' for 'hadoop fs')., Then you might as well close it at wont fix, and we can start fixing our infrastructure, documentation, and/or just build our own distributions to make this go away...

...because once you ship this, it will be too late to fix it.  :(

Ideally, though, these admin commands shouldn't even be in bin.  This problem (and lots of others) could go away simply by moving these commands to sbin so they are out of the standard user's path., Are there others who agree with Allen on this?

I see two ways this disagreement could be resolved:
 # a patch can be submitted and we can vote on committing it to trunk (through the normal review process)
 # a release candidate can be rolled and we can vote on whether it's acceptable

For (1) we need a patch.  Allen?  For (2) we need a release candidate, which Tom will likely provide soon.
]