[+1, looks good to me., I should have mentioned earlier, please add a test for this., Does this change not also need to be made on trunk?

Also, please run the full HDFS test suite before committing this., Trunk doesn't have this problem. , More test case is added in the new patch., I ran test-core and it passed., +1, {noformat}
     [exec] -1 overall.  
     [exec] 
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec] 
     [exec]     +1 tests included.  The patch appears to include 3 new or modified tests.
     [exec] 
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec] 
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec] 
     [exec]     -1 findbugs.  The patch appears to introduce 7 new Findbugs (version 1.3.9) warnings.
{noformat}
The findbugs warnings are not related to the patch.  The result is the same for an empty patch., Patch largely looks good, Brandon. A few comments:

# removeStorageAccess, restoreAccess, and numStorageDirs can all be made private
# numStorageDirs can be made static
# Rather than do set(Readable/Executable/Writable), use FileUtil.chmod(...).
# Please put the contents of the test in a try/finally, with the calls to shutdown the cluster and the 2NN in the finally block.
# Some lines are over 80 chars.
# No need for the numDatanodes variable - it's only used in one place.
# Instead of "xwr" use "rwx", which I think is a more common way of describing permissions., I have committed this.  Thanks Brandon!, Oops, sorry Aaron.  I did not see your new comment.  I started committing the patch right after I posted the test-patch result.  I will file a JIRA to address your comments., Nicholas, why weren't my comments addressed before commit?, Haha - looks like our comments raced with each other. :)

Thanks for filing the JIRA to address the comments., Appreciate your understanding!  Filed HDFS-3131., Closed upon release of Hadoop-1.0.3.]