[In r1171892, after Devaraj's merge (HADOOP-7637), TestHdfsProxy started working again. But TestSleepJob is still failing, probably due to a different reason. Previously, they were failing because they couldn't find the jersy sevelet container class added by the webhdfs (HDFS-2284)., Hi Kihwal, there are two classes, org.apache.hadoop.mapreduce.TestSleepJob and org.apache.hadoop.mapred.gridmix.TestSleepJob, which TestSleepJob are you referring to?

For org.apache.hadoop.mapreduce.TestSleepJob, it was not committed to 0.20s until rev 1169585 according to the [svn log|http://svn.apache.org/viewvc/hadoop/common/branches/branch-0.20-security/src/test/org/apache/hadoop/mapreduce/TestSleepJob.java?view=log].  It was neither in rev 1167444 nor rev 1167663.  So it could not be failed in these revisions.  BTW, it is a mapreduce test program but not a unit test.

For org.apache.hadoop.mapred.gridmix.TestSleepJob, I ran it and it did not fail., From [build #16|https://builds.apache.org/view/G-L/view/Hadoop/job/Hadoop-0.20.205-Build/16/testReport/org.apache.hadoop.mapreduce/TestSleepJob/initializationError/], I believe you are referring to org.apache.hadoop.mapreduce.TestSleepJob.  It is not a unit test so that it cannot be initialized by the junit framework., > For org.apache.hadoop.mapred.gridmix.TestSleepJob, I ran it and it did not fail.

It actually failed.  The required Jersey libraries were missing., h2342_20110922_0.20s.patch: add Jersey libraries to ivy.xml files in contrib., Thanks, Nicholas. The patch looks good. Do we have a similar issue in trunk? 
+1 for this patch going to 0.20-security and 0.20.205., Committed to 0.20-security and 0.20.205.  Thanks, Nicholas!

Leaving Jira open for possible 0.23 patch., Matt, thanks for committing the patch.  Trunk does not have such problem.  I think the rpm work has improved the ivy dependency so that we don't have to change contrib ivy.xml files for the libraries used in HDFS.

Closing this., This issue is related to ivy and is not applicable to trunk., Closed upon release of 0.20.205.0]