[Hi Suresh, I have just attached a back-port patch here. Could you please take a look., Uma, the ported patch looks good. One minor issue - {{Perform small deletes right away}} in FSNamesystem.java should move to the synchronized section. Can HDFS-2815 patch be applied on top of this?, Thanks a lot Suresh for the review!
True, I should have put that inside synchronization block for small deletes. As anyway there should not be harm and going remove that part in side lock with HDFS-2815, I did not take that movement seriously.

Moved that smaller deletes code inside synchronization. Code wise it should be sync with HDFS-2815 now. as folder structure is diff than trunk it is not possible to apply directly right. SO, I will generate one in HDFS-2815 after you commit this.

Thanks 
Uma

 , Hi Suresh, could you please take a look on this for review?, Uma sorry for the delay in reviewing this. +1 for the patch., Rebased the patch on latest branch-1, I committed the patch. Thank you Uma., Oh, I have just seen the comments.
{quote}
Uma sorry for the delay in reviewing this. +1 for the patch.
{quote}
No problem :-). Thanks a lot, Suresh for the reviews.
Also thanks for rebasing it. I will to get a patch for HDFS-2815 today in some time., Currently small deletion is determined by the constant BLOCK_DELETION_INCREMENT:
{code}
+      deleteNow = collectedBlocks.size() <= BLOCK_DELETION_INCREMENT;
{code}
I wonder if there is use case where the increment should be configurable., when I added this in trunk, I was not sure if there is a usecase. The whole idea was to give up lock once deleting some number of blocks. So the number currently is arbitrary., @Ted,
Yes, I was also in the same lines as Suresh said about that parameter. Not sure about any usecase for getting some advantage by making it configurable.

Do you have any usecase, where we may get some advatages by tuning that parameter? If yes, feel free to file a JIRA, we can discuss about it there.Thanks a lot, Ted for taking a look on it.

Thanks,
Uma, included in branch-1.1, Closed upon release of 1.1.1.]