[The patch fixes the synchronization for the renewer thread and has the test case shut down the threads *before* the namenode., Hi Owen. Is this issue not present in trunk? Seems like this is a branch-0.20-only patch., Rename Owen's patch as branch-1.0 patch., Candidate patch for trunk.  Haven't had adequate time to test it yet, but we'll let test-patch run on it., +1 on Owen's patch for branch-1 and branch-1.0.  Committing to same.

Leaving Jira open for completion of corresponding patch to trunk., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12525804/HDFS-3374.patch
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 1 new or modified test files.

    -1 javadoc.  The javadoc tool appears to have generated 2 warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 eclipse:eclipse.  The patch built with eclipse:eclipse.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed unit tests in hadoop-common-project/hadoop-common hadoop-hdfs-project/hadoop-hdfs.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-HDFS-Build/2384//testReport/
Console output: https://builds.apache.org/job/PreCommit-HDFS-Build/2384//console

This message is automatically generated., Why does this merit an exception to the policy that we commit things to trunk first and the maintaining branch only after it is in trunk?, This is still only in branch-1 and not in trunk. Any plans to forward port?

Also, jcarder noticed that this added a lock order inversion:
- FSNamesystem.saveNamespace (holding FSN lock) calls DTSM.saveSecretManagerState (which takes DTSM lock)
- ExpiredTokenRemover.run (holding DTSM lock) calls rollMasterKey calls updateCurrentKey calls logUpdateMasterKey which takes FSN lock

So if there is a concurrent saveNamespace at the same tie as the expired token remover runs, it might make the NN deadlock.
, The synchronization inside  ExpiredTokenRemover.run() is unnecessary and could cause the deadlock. 

Uploaded a trunk patch to fix the test case.
I will upload a branch-1 patch to remove the synchronization in ExpiredTokenRemover.run()., {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12567460/HDFS-3374.trunk.patch
  against trunk revision .

    {color:green}+1 @author{color}.  The patch does not contain any @author tags.

    {color:green}+1 tests included{color}.  The patch appears to include 1 new or modified test files.

    {color:green}+1 javac{color}.  The applied patch does not increase the total number of javac compiler warnings.

    {color:green}+1 javadoc{color}.  The javadoc tool did not generate any warning messages.

    {color:green}+1 eclipse:eclipse{color}.  The patch built with eclipse:eclipse.

    {color:green}+1 findbugs{color}.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    {color:green}+1 release audit{color}.  The applied patch does not increase the total number of release audit warnings.

    {color:red}-1 core tests{color}.  The patch failed these unit tests in hadoop-hdfs-project/hadoop-hdfs:

                  org.apache.hadoop.hdfs.server.datanode.TestBlockRecovery

    {color:green}+1 contrib tests{color}.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-HDFS-Build/3925//testReport/
Console output: https://builds.apache.org/job/PreCommit-HDFS-Build/3925//console

This message is automatically generated., bq. I will upload a branch-1 patch to remove the synchronization in ExpiredTokenRemover.run().
Can you please do this in a separate jira?, Sure. Created HDFS-4466 to remove the possible deadlock in branch-1., The race condition in TestDelegationToken doesn't exist in trunk or 2.0.
This is because of the changed introduced in HDFS-2579 though HDFS-2579 was intended to fix a different issue. 

In trunk and 2.0, the editlog write(logUpdateMasterKey) is protected by a noInterruptsLock object. , +1 for the trunk patch., Please ignore the trunk patch. The test issue doesn't exist in either trunk or 2.0.]