[Reason is did not shutdown the MiniDFSCluster in the TestWriteConfigurationToDFS.testWriteConf().

Because of this all next test cases  are failing by giving the exception message " Cant remove the storage directory xxxx ", attached the patch for review., Hey Uma, patch looks pretty good. One small comment:

# I think you should leave in the "{{os.close()}}" call, and then just set {{os}} to null. I say that because relying only on {{IOUtils.cleanup(...)}} to do the close will swallow a legitimate error.

I'll commit it pending that issue being addressed and Hudson results., Hi Aaron,
Thanks alot for taking a look.
{quote}
I think you should leave in the "os.close()" call, and then just set os to null. I say that because relying only on IOUtils.cleanup(...) to do the close will swallow a legitimate error.
{quote}
Got you.:-) . you are suggesting the similar(HADOOP-7090) pattern right? I thought IOUtils.cleanup will be enough for tests. You are right, Even in tests, this will be good approach to follow.Otherwise we may not know some of the exceptions while closing, due to suppression in IOUtils..cleanup.

Patch incorporates Aaron comments.
, Thanks a lot, Uma. Latest patch looks good.

Hudson seems to be down at the moment, but I'll commit it pending those results., Re Submitted the same patch to trigger Hudson., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12486711/HDFS-2152-1.patch
  against trunk revision 1147359.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 5 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

    +1 system test framework.  The patch passed system test framework compile.

Test results: https://builds.apache.org/job/PreCommit-HDFS-Build/954//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-HDFS-Build/954//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-HDFS-Build/954//console

This message is automatically generated., Thanks Aaron,
I have resubmitted the patch to trigger Hudson.
Now hudson result also available.
Can you please have a look., I've just committed this. Thanks Uma., Integrated in Hadoop-Hdfs-trunk-Commit #790 (See [https://builds.apache.org/job/Hadoop-Hdfs-trunk-Commit/790/])
    HDFS-2152. TestWriteConfigurationToDFS causing the random failures. (Uma Maheswara Rao G via atm)

atm : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1147762
Files : 
* /hadoop/common/trunk/hdfs/CHANGES.txt
* /hadoop/common/trunk/hdfs/src/test/hdfs/org/apache/hadoop/hdfs/TestWriteConfigurationToDFS.java
, Integrated in Hadoop-Hdfs-trunk #728 (See [https://builds.apache.org/job/Hadoop-Hdfs-trunk/728/])
    HDFS-2152. TestWriteConfigurationToDFS causing the random failures. (Uma Maheswara Rao G via atm)

atm : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1147762
Files : 
* /hadoop/common/trunk/hdfs/CHANGES.txt
* /hadoop/common/trunk/hdfs/src/test/hdfs/org/apache/hadoop/hdfs/TestWriteConfigurationToDFS.java
]