[New TestByteRangeInputStream for branch-2 to fix test failure. It's the same test as the trunk version., {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12668811/HDFS-7049-branch-2.patch
  against trunk revision 43b0303.

    {color:red}-1 patch{color}.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-HDFS-Build/8032//console

This message is automatically generated., Hi [~jyu@cloudera.com]. Thanks for merging this fix and creating the patch.

The patch doesn't apply because it has the 'a/' and 'b/' at the beginning of the filepaths. I downloaded the patch, removed those strings from the filepaths, and I was able to apply the patch cleanly to branch-2. The test also passes cleanly with no NPE.

Once you make that change to the patch, it looks good to me., Sorry, I forgot to mention that in order to avoid the 'a/' and 'b/' prefix problem, you can use {{git diff --no-prefix}} when creating the patch., Thanks Eric for reviewing. here is a new patch generated with {{git diff --no-prefix}}, {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12669904/HDFS-7049-branch-2.002.patch
  against trunk revision 6434572.

    {color:red}-1 patch{color}.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-HDFS-Build/8097//console

This message is automatically generated., Looks like Hadoop QA tried to apply the patch to trunk, but this patch is just for branch-2., bq. Looks like Hadoop QA tried to apply the patch to trunk,
Yes, Hadoop QA always tests the patch on trunk.
+1 (non-binding). The test code is the same as trunk, and the test passed on my environment.
[~wheat9], would you please review the patch?, +1, I've committed the patch to branch-2. Thanks [~jyu@cloudera.com] for reporting the issue and fixing it., Thanks all for reviewing.]