[Here's the fix. The idea is quite simple: do not execute 'smoke' nor 'commit' targets if {{-Dtestcase}} is set., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12450027/HDFS-1311.patch
  against trunk revision 966031.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h2.grid.sp2.yahoo.net/221/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h2.grid.sp2.yahoo.net/221/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h2.grid.sp2.yahoo.net/221/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h2.grid.sp2.yahoo.net/221/console

This message is automatically generated., Test failures are unrelated and intermittent. 
The patch doesn't have any tests included because this is a build modification., +1 patch looks good., I have just committed this., Integrated in Hadoop-Hdfs-trunk-Commit #349 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Hdfs-trunk-Commit/349/])
    HDFS-1311. Running tests with 'testcase' cause triple execution of the same test case. Contributed by Konstantin Boudnik.
, Backport patch for y20. Not to commit here., Review comment from Nicholas:

{quote} Thanks for explaining the details to me.
+1 your patch looks good...
Nicholas
{quote}]