[Hi Brahma,
Thanks for filing this. 
There is one more place where namenode will enter to safemode even though it is standby.

in FSNamesystem.SafeModeInfo.needEnter() we need to change as follows

before fix
{code:java}    private boolean needEnter() {
      return (threshold != 0 && blockSafe < blockThreshold)
          || (getNumLiveDataNodes() < datanodeThreshold)
          || (!nameNodeHasResourcesAvailable());
    }{code}

after fix
{code:java}private boolean needEnter() {
      return (threshold != 0 && blockSafe < blockThreshold)
          || (getNumLiveDataNodes() < datanodeThreshold)
          || (!nameNodeHasResourcesAvailable() && !isInStandbyState());
    }{code}

I will upload a patch for the same in sometime , Attaching the patch with above mentioned changes, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12532503/HDFS-3526.patch
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 1 new or modified test files.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    -1 javadoc.  The javadoc tool appears to have generated 13 warning messages.

    +1 eclipse:eclipse.  The patch built with eclipse:eclipse.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed unit tests in hadoop-hdfs-project/hadoop-hdfs.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-HDFS-Build/2671//testReport/
Console output: https://builds.apache.org/job/PreCommit-HDFS-Build/2671//console

This message is automatically generated., {noformat}-1 javadoc. The javadoc tool appears to have generated 13 warning messages.{noformat}

Is unrelated to current patch., Hi Vinay, I'm not sure I agree with the premise of this JIRA. The issue that precipitated HDFS-2914 was that if the shared edits dir temporarily disappeared, the Standby NN should not enter safemode. If the standby starts up fresh and its disks are full, I see no reason it shouldn't go into safemode. Thoughts?, Resolving as "Not a Problem" as per Aaron's comment.]