[Thanks for catching this issue Juan! The HDFS-6632 patch was done on trunk where the HftpFileSystem was removed, so the patch doesn't do anything about the removed HftpFileSystem. Since 2.5 still supports HftpFileSystem, and HDFS-5321 modified HftpFileSystem there, this modificaiton does need to be reverted in 2.5.



, this patch is for 2.5. , {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12658938/HDFS-6793.patch
  against trunk revision .

    {color:red}-1 patch{color}.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-HDFS-Build/7509//console

This message is automatically generated., Previous one is not generated properly., {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12658940/HDFS-6793.patch
  against trunk revision .

    {color:red}-1 patch{color}.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-HDFS-Build/7510//console

This message is automatically generated., Hi [~jyu@cloudera.com], 

Thanks for the work here, I reviewed the latest patch and it looks good to me. Couple of small suggestions, since this is for branch 2 ONLY (it should be applied to both branch2 and branch2.5):
- since we don't expect jenkins test to pass on trunk, suggest to run a local jenkins test against branch2 or branch2-5 with the change. or maybe you have already done.
- it's better to have "branch-2" in the patch name, so it's easier for people to see when looking at it in the future. 



, One more, when uploading multiple versions of patches, it's recommended to have a version number in the patch name. Thanks.
, Thanks for the review. I verified related unit test against branch 2.5.
rename the patch for branch2, {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12658943/HDFS-6793.branch2.patch
  against trunk revision .

    {color:red}-1 patch{color}.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-HDFS-Build/7512//console

This message is automatically generated., Raising this up to a blocker, it has compat implications., +1 LGTM, I'll commit this to branch-2, branch-2.5, branch-2.5.0 momentarily., Committed this through, thanks for the patch Juan and thanks Yongjun for reviewing., Many thanks Andrew!
, Thanks Andrew and Yongjun!]