[I don't understand your description of the problem. I've tested getting, renewing and canceling delegation tokens for both hdfs and hftp. Can you provide more detail about what you tried and what happened?, I did not actually see/test for this possible issue.  It's based on reading the code while ensuring that the changes are compatible with the ip->host change.  The multiple code paths for the token's service manipulation is a bit tricky.  Did you also test the cases where a {{HarFileSystem}} is directly instantiated, that it works when it acquires the token itself and schedules its own renewal?, I tried the case of using HftpFileSystem, both directly from the command line:

{quote}
% hadoop fs -ls hftp://nn:hp/my-dir
% hadoop fs -cat hftp://nn:hp/my-file
% hadoop distcp hftp://nn:hp/my-dir hdfs://nn:rp/copy-dir
{quote}

During the distcp job, I ensured that the JobTracker successfully renewed both the hdfs and hftp tokens.

I also tried hftp with a token that I acquired using fetchdt using both http and rpc.

{quote}
% hadoop fetchdt --webservice https://nn:shp my.tok
% export HADOOP_TOKEN_FILE_LOCATION my.tok
% hadoop fs -ls hftp://nn:hp/my-dir
% hadoop fs -cat hftp://nn:hp/my-file
% (repeat with rpc token)
{quote}, I also don't understand your reference to the HarFileSystem. Are you talking about har using an underlying hftp file system?, Oh, I think I see the source of the confusion. The Hftp file system copies the token and changes the *copy*., (Ack, I was reviewing har changes this morning.  I meant hftp)

The use case is: Hftp finds an hdfs token.  The service is the rpc port. The token is passed to {{setDelegationToken}}.  {{renewToken}} is set to the original token, which contains the rpc port.  Then a copy of the token is made with the kind/service squished to hdfs.  Hftp's renewer will use the unchanged token in {{renewToken}}, which contains the rpc port instead of the http port., Oh, and did the {{FsShell}} commands run long enough to see the token renew?  I suppose you'd have to drop the token expiration to a low value to force it to renew while catting a big file.  It would probably be easier to write a test program that just instantiates {{HftpFileSystem}} and goes to sleep.  Then watch the renewals occur., As long as the kind and service are set together, it works. If the original token is a hdfs delegation token and the service is the rpc port, the renewal will use the rpc renewal.]