[Instead of fixing this bug, I suggest you check out the new web UI in branch-2., Similar issue exists while browsing tail.jsp , browseBlock.jsp, block_info_xml.jsp from NN UI, Attaching a fix in the patch which will cover my scenario and also other scenario's reported .please review it, {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12620319/HDFS-5687-0001.patch
  against trunk revision .

    {color:red}-1 patch{color}.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-HDFS-Build/5790//console

This message is automatically generated., I think this scheme prefix was removed by HDFS-5308. We have to see why that resolving prefix is including nn addr also.

[~wheat9], could you please comment on this?  

{quote}
Instead of fixing this bug, I suggest you check out the new web UI in branch-2.
{quote}
Until we completely remove/deprecate old UI stuff, we have to fix this bugs I think., bq. We have to see why that resolving prefix is including nn addr also.

The motivation behind HDFS-5308 was to support both HTTP and HTTPS in the JSP web UI. That way the code does not need to track whether the client is using HTTP or HTTPS.

bq. Until we completely remove/deprecate old UI stuff, we have to fix this bugs I think.

Patches are welcome :-). However, the impact of this bug is minimal since the new Web UI will become the default UI in the next release. There might be better uses of the time. I'll start the discussion of deprecating JSP again., {
However, the impact of this bug is minimal since the new Web UI will become the default UI in the next release. There might be better uses of the time. I'll start the discussion of deprecating JSP again.
}

In the new web UI these jsp pages are not working correctly

while browsing tail.jsp , browseBlock.jsp, block_info_xml.jsp from NN UI
some issues are coming,so that's why i raised this jira,can u verify that jsp pages once, bq. In the new web UI these jsp pages are not working correctly

There are no JSP pages in the new web UI -- all JSP pages belong to the old UI. The new web UI is completely based on JavaScript. Please see HDFS-5333 for more details., {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12620319/HDFS-5687-0001.patch
  against trunk revision .

    {color:red}-1 patch{color}.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-HDFS-Build/6640//console

This message is automatically generated., {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12620319/HDFS-5687-0001.patch
  against trunk revision .

    {color:red}-1 patch{color}.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-HDFS-Build/7642//console

This message is automatically generated., This issue is no longer a problem as the JSP UI has been removed., Closing tickets that are already part of a release.]