[We are still seeing this: http://hudson.zones.apache.org/hudson/view/Hadoop/job/Hadoop-Hdfs-trunk/57/testReport/org.apache.hadoop.hdfs.server.namenode.metrics/TestNameNodeMetrics/testCorruptBlock/, I will work on this next week, Previous test expects {{pendingReplicationBlocks}} and {{scheduledReplicationBlocks}} metrics to be incremented by 1, when a block is corrupted. The update of these metrics varies in time as it depends on replication processing and interaction between nodes. Removing testing for {{pendingReplicationBlocks}} and {{scheduledReplicationBlocks}} metrics to handle this uncertainty that could trigger intermittent test failures.

Additional changes:
# Instead of starting and shutting down cluster in Test {{setUp()}} and {{tearDown()}}, an instance of cluster is started in each test. This will help in starting the cluster with required number of nodes (instead of every test having to use the same setup).
# Change the name of the files created in tests to the test names to make debugging of failures easy., Updated patch deletes an unused import., I think the test failed because it expects {{pendingReplicationBlocks}} and {{scheduledReplicationBlocks}} metrics to be reduced to 0 from 1, when the block is deleted. However, when a block is deleted, only {{corruptReplicas}} data structure is updated synchronously, while {{pendingReplicationBlocks}} isn't. If {{pendingReplicationBlocks}} is also synchronously updated, both {{pendingReplicationBlocks}} and {{scheduledReplicationBlocks}} metrics verification should be successful since they are updated at the same time as the {{corruptReplicas}} metrics. The question is whether we want to update {{pendingReplicationBlocks}} data structure synchronously. Can someone familiar with FSNamesystem comment on this?, I don't see the reason why {{pendingReplicationBlocks}} needs to be updated synchronously. If so, +1 for the patch., Got a different failure case:
{noformat}
Testcase: testCorruptBlock took 2.684 sec
	FAILED
expected:<1> but was:<0>
junit.framework.AssertionFailedError: expected:<1> but was:<0>
	at org.apache.hadoop.hdfs.server.namenode.metrics.TestNameNodeMetrics.testCorruptBlock(TestNameNodeMetrics.java:114)
{noformat}
The following is the one Gary mentioned earlier.
{noformat}
expected:<0> but was:<1>
junit.framework.AssertionFailedError: expected:<0> but was:<1>
	at org.apache.hadoop.hdfs.server.namenode.metrics.TestNameNodeMetrics.testCorruptBlock(TestNameNodeMetrics.java:118)
{noformat}
, This test has not been failing for a long time. Will create a new jira if it occurs again with the patch attached to this jira.]