[The patch removes the delegation token parameter in the url if security is not enabled., ant test was run manually. All tests pass except TestHDFSTrash which is unrelated.

test-patch results:

     [exec] -1 overall.  
     [exec] 
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec] 
     [exec]     -1 tests included.  The patch doesn't appear to include any new or modified tests.
     [exec]                         Please justify why no new tests are needed for this patch.
     [exec]                         Also please list what manual steps were performed to verify this patch.
     [exec] 
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec] 
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec] 
     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs warnings.
     [exec] 
     [exec]     +1 release audit.  The applied patch does not increase the total number of release audit warnings.
, The path was manually tested on trunk in both secure and insecure mode., New patch..added a unit test., Can you please check both the code paths in the unit test? Looks fine otherwise, Updated unit test., I understand that security remains enabled in the added unit test since a previous test sets it to kerberos. But it is safer to explicitly enable it in the beginning of the test you added., Updated the unit test addressing the comment., I just committed this. Thanks, Jitendra!, Patch for y20 branch., Integrated in Hadoop-Hdfs-trunk-Commit #370 (See [https://hudson.apache.org/hudson/job/Hadoop-Hdfs-trunk-Commit/370/])
    , for previous version, not for commit , made JspHelper.SET_DELEGATION package private, and replaces all calls with JspHelper.getDelegationTokenUrlParam(t), Minor comment: In trunk version of the patch, please remove unneeded imports in JspHelper - DatanodeJspHelper and WritableUtils.

+1 for both the patches.
, addressed comment by Suresh., added TestJspHelper, committed to trunk, Integrated in Hadoop-Hdfs-trunk-Commit #374 (See [https://hudson.apache.org/hudson/job/Hadoop-Hdfs-trunk-Commit/374/])
    ]