[h1625_20110228.patch: ignore numbers, I also have encountered this problem.  Here is a patch.

h1625_20110228.patch: ignore numbers, +1 patch looks good. 
A not: shall {{System.out.println}} be replace with a logger debug calls or removed all together?, Thanks Cos for the review.

h1625_20110301.patch: removed println., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12472336/h1625_20110301.patch
  against trunk revision 1075571.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed these core unit tests:
                  org.apache.hadoop.hdfs.TestFileConcurrentReader

    -1 contrib tests.  The patch failed contrib unit tests.

    +1 system test framework.  The patch passed system test framework compile.

Test results: https://hudson.apache.org/hudson/job/PreCommit-HDFS-Build/221//testReport/
Findbugs warnings: https://hudson.apache.org/hudson/job/PreCommit-HDFS-Build/221//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://hudson.apache.org/hudson/job/PreCommit-HDFS-Build/221//console

This message is automatically generated., I have committed this., Integrated in Hadoop-Hdfs-trunk-Commit #549 (See [https://hudson.apache.org/hudson/job/Hadoop-Hdfs-trunk-Commit/549/])
    HDFS-1625. Ignore disk space values in TestDataNodeMXBean.
, I forgot to say that the failed tests are obviously not related to this.

Created HDFS-1679 for TestFileConcurrentReader., Committed also to Federation Branch., Integrated in Hadoop-Hdfs-trunk #643 (See [https://builds.apache.org/hudson/job/Hadoop-Hdfs-trunk/643/])
    , Integrated in Hadoop-Hdfs-22-branch #35 (See [https://builds.apache.org/hudson/job/Hadoop-Hdfs-22-branch/35/])
    ]