[This patch implements the proposed change.  O_RDWR will work in a few cases; fuse-dfs respond with an error when you try to do a forbidden operation (such as writing to an existing file) instead of when you open it in the wrong mode.

This is important for our community as it allows users to "rsync" from a remote system into HDFS; primarily, I am trying to get the patch and its licensing documented., +1 Patch looks good to me, tested locally. Will have to revisit when fuse-dfs supports appends. Updated HDFS-861 to indicate this test needs to be added when TestFuseDFS is revived., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12429048/HDFS-861.patch
  against trunk revision 899456.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h5.grid.sp2.yahoo.net/190/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h5.grid.sp2.yahoo.net/190/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h5.grid.sp2.yahoo.net/190/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h5.grid.sp2.yahoo.net/190/console

This message is automatically generated., I've just committed this. Thanks Brian!

(The test failure is unrelated.), Integrated in Hadoop-Hdfs-trunk-Commit #212 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Hdfs-trunk-Commit/212/])
    . fuse-dfs does not support O_RDWR. Contributed by Brian Bockelman.
, Integrated in Hdfs-Patch-h2.grid.sp2.yahoo.net #146 (See [http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h2.grid.sp2.yahoo.net/146/])
    , Integrated in Hdfs-Patch-h5.grid.sp2.yahoo.net #302 (See [http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h5.grid.sp2.yahoo.net/302/])
    , Integrated in Hadoop-Hdfs-trunk #275 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Hdfs-trunk/275/])
    ]