[This is only a problem on branch-1.  The branch-1 code closes {{DFSClient}} before removing from the cache:

{code}
  public void close() throws IOException {
    try {
      super.processDeleteOnExit();
      dfs.close();
    } finally {
      super.close();
    }
  }
{code}

It's not a problem on trunk, because the trunk version removes from the cache before closing the {{DFSClient}}:

{code}
  @Override
  public void close() throws IOException {
    try {
      dfs.closeOutputStreams(false);
      super.close();
    } finally {
      dfs.close();
    }
  }
{code}
, Here is a patch that switches the order of operations in {{DistributedFileSystem#close}}.  It calls the superclass to remove the cache entry first before closing the contained {{DFSClient}}.

I did a full test run, and the only failure was {{TestBalancerWithNodeGroup}}.  This is unrelated, because the test is known to fail intermittently.

Here is the output from test-patch.  The Findbugs warnings are unrelated.  This patch only touches {{DistributedFileSystem#close}}, and none of the warnings were reported in that method.  BTW, I reported a bug in "ant test-patch" in HADOOP-9965, and the workaround is to revert HADOOP-9573 locally.

     [exec] -1 overall.  
     [exec] 
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec] 
     [exec]     -1 tests included.  The patch doesn't appear to include any new or modified tests.
     [exec]                         Please justify why no tests are needed for this patch.
     [exec] 
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec] 
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec] 
     [exec]     -1 findbugs.  The patch appears to introduce 22 new Findbugs (version 1.3.9) warnings.
, Thanks Chris for addressing this. Sounds good to me. +1, Should we remove super.processDeleteOnExit()?  FileSystem.close() already has it., [~szetszwo], good idea.  Here is version 2 of the patch, with {{super.processDeleteOnExit()}} removed.  I'll put it through another full test run overnight and report back here with the results., +1 patch looks good.  Thanks Chris., Thanks, Nicholas.  Tests passed with the new version of the patch too.

[~xifang], are you still +1 for version 2 of the patch?  If so, then I'll commit this later today., Thanks Chris, that makes sense. +1, I have committed this to branch-1 and branch-1-win.  Thanks to Xi and Nicholas for code reviews.]