[-1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12503161/HDFS-2547.patch
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed these unit tests:
                  org.apache.hadoop.hdfs.TestFileAppend
                  org.apache.hadoop.hdfs.TestDFSRemove
                  org.apache.hadoop.hdfs.TestFileAppend2
                  org.apache.hadoop.hdfs.TestBalancerBandwidth

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-HDFS-Build/1550//testReport/
Console output: https://builds.apache.org/job/PreCommit-HDFS-Build/1550//console

This message is automatically generated., The ReplicationTargetChooser comments are incorrect, and lead to this confusion. Resolving as invalid. The documented behavior is correct for all of the common cases., Hey Harsh, seems like we should fix the comments then. Want to re-title/re-open this JIRA for that purpose?, Aaron,

{{BlockPlacementPolicyDefault}} has proper comments in it, on trunk. It was 0.20's ReplicationTargetChooser that threw me off there. Reopening to fix against 0.20., Updating title/topic for 0.20, New patch that changes comments and fixes a typo., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12503369/HDFS-2547.patch
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-HDFS-Build/1553//console

This message is automatically generated., +1, patch looks good to me., Thanks Aaron for your persistence on this one. Committed to branch-1., Closed upon release of Hadoop-1.1.0.]