[I have [posted|https://issues.apache.org/jira/browse/HDFS-1496?focusedCommentId=12988372&page=com.atlassian.jira.plugin.system.issuetabpanels%3Acomment-tabpanel#action_12988372] some analysis of HADOOP-4885. It is likely to invalidate this JIRA unless it is totally incorrect , I've looked at testStorageRestore failure. Seems like the problem is that when we are trying to restore a storage dir, we format it , which always saves the current in-memory state into a new fsimage. So instead we should restore a storage without storing creating new fsimage. It will be copied from the CheckPoint.
Here is a patch for trunk to do it. Please review., +1 patch seems to be legit and it sure fixes HDFS-1496
, attemptRestoreRemovedStorage is now only ever called with its boolean argument true. Let's remove that argument.

Aside from that seems to make sense., removed parameter for attemptRestoreFailedStorage as suggested by Todd, +1 pending usual validation or local tests run., yep, looks good to me also. Thanks a bunch, Boris. With any luck we'll be back to green next week!, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12470307/HDFS-1602-1.patch
  against trunk revision 1067288.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    -1 release audit.  The applied patch generated 2 release audit warnings (more than the trunk's current 0 warnings).

    -1 core tests.  The patch failed these core unit tests:
                  org.apache.hadoop.hdfs.server.datanode.TestBlockReport
                  org.apache.hadoop.hdfs.TestFileConcurrentReader

    -1 contrib tests.  The patch failed contrib unit tests.

    +1 system test framework.  The patch passed system test framework compile.

Test results: https://hudson.apache.org/hudson/job/PreCommit-HDFS-Build/150//testReport/
Release audit warnings: https://hudson.apache.org/hudson/job/PreCommit-HDFS-Build/150//artifact/trunk/patchprocess/patchReleaseAuditProblems.txt
Findbugs warnings: https://hudson.apache.org/hudson/job/PreCommit-HDFS-Build/150//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://hudson.apache.org/hudson/job/PreCommit-HDFS-Build/150//console

This message is automatically generated., included test is testStorageRestore

I manually ran 'failed' core tests - they all passed.

Release audit warnings are not relevant to this patch (editsStored.xml), +1, committed to trunk., This should go at least to 0.22 as the original code was introduced in 0.21., FWIW, TestBlockRecovery.testErrorReplicas failed (timed out). This is in the same class as the fixed test I think. Search console for failure: https://hudson.apache.org/hudson/job/Hadoop-Hdfs-trunk-Commit/537/console

Re-running build again.
, bq. FWIW, TestBlockRecovery.testErrorReplicas failed (timed out)
This JIRA is about TestStorageRestore.

Boris, would you like to backport it to 0.22 at least? The ticket needs to be closed., Integrated in Hadoop-Hdfs-trunk-Commit #539 (See [https://hudson.apache.org/hudson/job/Hadoop-Hdfs-trunk-Commit/539/])
    , Patch for 0.22, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12470731/HDFS-1602v22.patch
  against trunk revision 1068968.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://hudson.apache.org/hudson/job/PreCommit-HDFS-Build/158//console

This message is automatically generated., +1 on patch for 22, Integrated in Hadoop-Hdfs-trunk-Commit #540 (See [https://hudson.apache.org/hudson/job/Hadoop-Hdfs-trunk-Commit/540/])
    Reordering. Patch for HDFS-1602 is committed into release 0.22
, Integrated in Hadoop-Hdfs-trunk #643 (See [https://builds.apache.org/hudson/job/Hadoop-Hdfs-trunk/643/])
    , Integrated in Hadoop-Hdfs-22-branch #35 (See [https://builds.apache.org/hudson/job/Hadoop-Hdfs-22-branch/35/])
    ]