[Here's a patch for 0.22, which should also apply cleanly to trunk. No tests are included, but I can confirm that the presence of this patch fixes the {{TestFiRename}} test which had been broken on branch-0.22 since the commit of HADOOP-7287., +1  pending Hudson, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12480475/hdfs-2000-22.0.patch
  against trunk revision 1127759.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed these core unit tests:
                  org.apache.hadoop.hdfs.TestDFSStorageStateRecovery
                  org.apache.hadoop.hdfs.TestQuota

    +1 contrib tests.  The patch passed contrib unit tests.

    +1 system test framework.  The patch passed system test framework compile.

Test results: https://builds.apache.org/hudson/job/PreCommit-HDFS-Build/626//testReport/
Findbugs warnings: https://builds.apache.org/hudson/job/PreCommit-HDFS-Build/626//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/hudson/job/PreCommit-HDFS-Build/626//console

This message is automatically generated., No tests are included, but I can confirm that the presence of this patch fixes the TestFiRename test which had been broken on branch-0.22 since the commit of HADOOP-7287.

I'm pretty sure the failed tests are unrelated., The TestQuota timeout is unrelated., I've committed this to 22 and trunk. Thanks atm!, Integrated in Hadoop-Hdfs-trunk #678 (See [https://builds.apache.org/hudson/job/Hadoop-Hdfs-trunk/678/])
    HDFS-2000. Missing deprecation for io.bytes.per.checksum. Contributed by Aaron T. Myers

eli : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1127819
Files : 
* /hadoop/hdfs/trunk/src/java/org/apache/hadoop/hdfs/HdfsConfiguration.java
* /hadoop/hdfs/trunk/CHANGES.txt
, Integrated in Hadoop-Hdfs-trunk-Commit #688 (See [https://builds.apache.org/hudson/job/Hadoop-Hdfs-trunk-Commit/688/])
    , Integrated in Hadoop-Hdfs-22-branch #61 (See [https://builds.apache.org/hudson/job/Hadoop-Hdfs-22-branch/61/])
    ]