[Gopal, perhaps we can also revisit the default and change it as well., Gopal, I agree, we are ignoring the buffer size. also I have seen similar/same issue HDFS-3953

But we have a configured property to increase packet size right? 
{code}
 public static final String  DFS_CLIENT_WRITE_PACKET_SIZE_KEY = "dfs.client-write-packet-size";
  public static final int     DFS_CLIENT_WRITE_PACKET_SIZE_DEFAULT = 64*1024;
{code}

are you suggesting that, use user provided buffer instead of packetsize configured? could you please clarify?
And yes, having more smaller writes can hit the disk iops overhead, as we will allow concurrent disk writes.
Worth revisiting the default sizes as Suresh suggested.
, The property is global, which makes it impossible for a client to open streams of varying buffers.

I am suggesting using the buffersize argument in fs.create() to produce a suitable packetsize for that stream.

Right now for hadoop-1.x, my math says 

{code}

bufferSize &= ~bytesPerChecksum

writePacketSize = (bufferSize - bytesPerChecksum) 
                  + checksumSize * ((bufferSize - bytesPerChecksum)/bytesPerChecksum) 
                  + bytesPerChecksum/checksumSize + PKT_HEADER_LEN + SIZE_OF_INTEGER
{code}

which is where the 1056405 derives from 1048576 (i.e contains exactly aligned 1048576 byte writes to block & 8192 byte checksum writes).

Working on a patch, will put it up for review., Ok, make sense. Thanks for working on this Gopal.
, I'm a little surprised that increasing buffer size from 64k to 1M would make a 15% difference in throughput. Could you post a complete example benchmark that demonstrates the effect?  Your {{map(\)}} makes sense, but I don't want to flesh it out with code that "makes sense" to me but might be different from how you're testing.

What kernel precisely are you observing this on?  RHEL5 has merged a fair number of IO performance-bug-fixes over the years.

Does the issue reproduce on a more modern kernel, such as RHEL6?  (I would be happy to test this case for you given a working example.), My benchmark code.

Or alternatively checkout git@gist.github.com:fe319436b880026cbad4.git, I agree that the kernels should be doing IO merging and handle concurrent disk-writes well, because they have global knowledge of I/O patterns. Ideally, the userland code should just let that be and write large, page aligned chunks of data & let the kernel do the actual magic.

In this case, the userland layer is actually being unnecessarily chatty on syscalls. I'd hazard a guess that the performance boost is simply due to the reduced number of syscalls & from letting the kernel do fewer wake-ups of threads running CPU bound code (check-sums and such).

Before I benchmarked it, I was more annoyed about the fact that the system out-right overrides my buffer settings (a decent tunable, if you will).

I don't think the 15% number directly translates into any other benchmark, this obviously highlights the DFS writes & without any other operations in the middle.

This was tested on an RHEL 5.5 box on EC2 (with 4 EBS volumes backing hdfs).

2.6.18-194.32.1.el5xen #1 SMP

A real bare metal box would behave differently  (I've ordered a new SSD backed box, it'll arrive in parts & get all working by next week I guess).

In the mean time, if you can bench this on some real hardware, I'll have some foundation to my theories (beyond averaging stuff on EC2)., DFS client patch to support buffersize.

PS: how do I write a test for this?, Since it was suggested to me that the 64kb number was related to the max TCP packet size, I tried to run a 3 node cluster (+1 name node) on EC2 (with hadoop 1.0.3) to pull in all the replication & network factors.

The results are pretty similar - I planned to do 10 runs writing 64x1Gb of data, each map controlled by a single file with a single name (like TestDFSIO). Every map was data-local as there were 3 data nodes and replication level of 3.

Six runs had at least one failed job, so they were skipped for results.

||timestamp||65536||1056252||
|1350932059|945599|863490|
|1350936449|998821|930685|
|1350956097|1290333|1004663|
|1350958583|1118328|1096637|

So this is not merely about the disk IOPS, but about the overall system doing fewer syscalls., dfs write packet size is currently a global tunable - turn this into a per-stream tunable, {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12549678/HDFS-4090-dfs%2Bpacketsize.patch
  against trunk revision .

    {color:green}+1 @author{color}.  The patch does not contain any @author tags.

    {color:red}-1 tests included{color}.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    {color:green}+1 javac{color}.  The applied patch does not increase the total number of javac compiler warnings.

    {color:green}+1 javadoc{color}.  The javadoc tool did not generate any warning messages.

    {color:green}+1 eclipse:eclipse{color}.  The patch built with eclipse:eclipse.

    {color:green}+1 findbugs{color}.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    {color:green}+1 release audit{color}.  The applied patch does not increase the total number of release audit warnings.

    {color:red}-1 core tests{color}.  The patch failed these unit tests in hadoop-hdfs-project/hadoop-hdfs:

                  org.apache.hadoop.hdfs.server.blockmanagement.TestUnderReplicatedBlocks

    {color:green}+1 contrib tests{color}.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-HDFS-Build/3395//testReport/
Console output: https://builds.apache.org/job/PreCommit-HDFS-Build/3395//console

This message is automatically generated., Redoing patch due to potential for buffer bloat & OOM on the data node end of the system.

Will update patch with an upper-bound as well.]