[Patch obsoletes userClass attribute in ldap (referred in LdapIpDirFilter). 

Namenode figures out the applicable group for the user. This is not required to be done explicitly in hdfsproxy.

Backport 20 (HDFS-1010-bp-y20.patch); This is now retrieved directly from the system (through shell). Not for commit, Patch for HDFS-481 need to be applied before this patch, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12439267/HDFS-1010-bp-y20.patch
  against trunk revision 925004.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    -1 patch.  The patch command could not apply the patch.

Console output: http://hudson.zones.apache.org/hudson/job/Hdfs-Patch-h5.grid.sp2.yahoo.net/273/console

This message is automatically generated., Backport patch. Not for commit. Removed reference to userClass attribute. , Note: Patch for HDFS-481 and HDFS-1009 need to be applied before this patch can be applied.

Output from test-patch & test-contrib

     [exec] +1 overall.  
     [exec] 
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec] 
     [exec]     +1 tests included.  The patch appears to include 3 new or modified tests.
     [exec] 
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec] 
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec] 
     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs warnings.
     [exec] 
     [exec]     +1 release audit.  The applied patch does not increase the total number of release audit warnings.

test-contrib:

   [cactus] Tomcat 5.x is stopped

BUILD SUCCESSFUL
Total time: 4 minutes 35 seconds
, +1, I have committed this.  Thanks, Srikanth!, Integrated in Hadoop-Hdfs-trunk-Commit #233 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Hdfs-trunk-Commit/233/])
    . hdfsproxy: Retrieve groups from UnixUserGroupInformation instead of LdapEntry.  Contributed by Srikanth Sundarrajan
]