[Fixtures in TestStreamingExitStatus properly refactored. , Once successful - need to revisit the test fixtures  of Streaming to make sure the cleanup happens appropriately in their respective tearDown()  and not as a stop-gap measure in setUp() methods. , See MAPREDUCE-1155, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12429132/MAPREDUCE-1346.patch
  against trunk revision 894165.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 6 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h3.grid.sp2.yahoo.net/245/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h3.grid.sp2.yahoo.net/245/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h3.grid.sp2.yahoo.net/245/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h3.grid.sp2.yahoo.net/245/console

This message is automatically generated., Thanks Todd. Then - I believe this can be closed as duplicate?, I think so - if you could review MAPREDUCE-1155 that would be great :) I didn't make the tests _good_, but it should be a small improvement ;-), Leaving this open to revisit text fixtures of contrib/streaming after MAPREDUCE-1155 is committed. , I believe it should read 'test fixtures'? , oops.yes - i meant 'test' fixtures , The patch no longer applies. Please update or mark as duplicate as appropriate]