[Patch for MR-279 branch, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12483611/MAPREDUCE-2618.patch
  against trunk revision 1138301.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/412//console

This message is automatically generated., As stated, this patch is for the MR-279 branch, so the above output does not apply., Jeffrey, there's a unit test failure after applying the patch - TestMRApp.
Also, does checkJobCompleteSuccess need to be public? logJobHistory() could be renamed to logJobHistoryFinishedEvent()

Thx
, I thought I had run all the tests, but apparently I didn't pay enough attention to the results...

I originally made checkJobCompleteSuccess public for testing, but I changed things so it does only need to be package-scoped now - good catch.
I renamed logJobHistory as you recommended.

Thanks for the review!  I'll submit an updated patch soon., New patch addresses Siddharth's comments.

The failing unit test was actually testing the condition this patch reverses.  I modified that test and removed the equivalent test I had placed in my new tests., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12483631/MAPREDUCE-2618-v2.patch
  against trunk revision 1138301.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 6 new or modified tests.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/414//console

This message is automatically generated., Thanks Jeffrey.
+1, looks good., Tested against MR-279 head. Committed to MR-279. Thanks Jeff! Thanks Seth for reviewing!]