[-1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12502860/MAPREDUCE-3374.patch.txt
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/1267//console

This message is automatically generated., Hi Roman, thanks for contributing this patch.  Please run test-patch manually against branch-0.20-security-205, and paste in the result evaluation as a comment in this Jira. Thanks., Attaching a log from running test-patch. Please let me know if you want any additional details., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12503108/log.gz
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/1285//console

This message is automatically generated., Here's the piece we needed:


-1 overall.  

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version ) warnings.

Since this patch is for build code, agree unit tests are inapplicable.  Therefore test-patch passes.
The unit tests are not run by normal developer invocation of test-patch, but this patch is unlikely to affect the way task-controller runs, so we'll let that pass too.

The patch makes sense to me.
+1 for code review.  Please commit to branch-0.20-security and branch-0.20-security-205.
Thanks!, Committed to branch-0.20-security and branch-0.20-security-205., Closed upon release of version 1.0.0.]