[this patch adds tests for HADOOP-6097. 
, This looks good. Is it worth adding a comment in the test to say it's testing HARs containing files with "escape-worthy characters" in their names? (Minor nit: there's an error in the line {{assertTrue("Should read 6 bytes.", readBytes == 8);}})

Also, are you planning on adding a test for the LineReader reset part of HADOOP-6097?, thanks tom....let me see if I can come up with a test case for the LineReader reset. I did forget adding a test case for that.  I probably file that as part of this patch. , this patch adds one more tests on caching of har schema and fixes issues pointed to by Tom. This does not include the LineReader reset test case as I found out that it is very hard to reproduce. It requires that a lot of files hash to the same hash (which is really hard to reproduce). 
, wrong name for the patch file!, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12422726/MAPREDUCE-1010.patch
  against trunk revision 827854.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h3.grid.sp2.yahoo.net/85/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h3.grid.sp2.yahoo.net/85/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h3.grid.sp2.yahoo.net/85/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h3.grid.sp2.yahoo.net/85/console

This message is automatically generated., If this is intended for 0.20, please generate a patch for that branch. Naively copying the patched unit test caused a NPE:
{noformat}
java.lang.NullPointerException
        at org.apache.hadoop.tools.HadoopArchives.run(HadoopArchives.java:662)
        at org.apache.hadoop.util.ToolRunner.run(ToolRunner.java:65)
        at org.apache.hadoop.util.ToolRunner.run(ToolRunner.java:79)
        at org.apache.hadoop.tools.TestHarFileSystem.testArchivesWithMapred(TestHarFileSystem.java:192)
{noformat}, This was committed as a part of  HADOOP-6097.]