[The attached patch modifies the log line being printed in the TaskMemoryManagerThread as follows:

Memory usage of ProcessTree <pid> for task-id <tid> : <current-usage> bytes, limit : <limit> bytes

For e.g.

Memory usage of ProcessTree 20889 for task-id attempt_200910221038_0001_r_000000_0 : 371458048 bytes, limit : 2147483648 bytes

, Since this is a log line, I have not included test cases in the patch. But I manually tested this patch with the following tests:

- Ran a sleep job with a huge sleep time. While the job ran, looked at the tasktracker logs to see that the values were coming correctly.
- Ran a sleep job with a modified limit. While the job ran, verified the changed limit parameter was printed in the logs.

Can someone please review ?, +1, Trying hudson. Expecting a -1 on tests for reasons I explained., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12422873/MAPREDUCE-1090.patch
  against trunk revision 828733.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/201/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/201/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/201/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/201/console

This message is automatically generated., Since the absence of test cases is explained, I committed this to trunk., Integrated in Hadoop-Mapreduce-trunk-Commit #99 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Mapreduce-trunk-Commit/99/])
    . Modified log statement in TaskMemoryManagerThread to include task attempt id. Contributed by Hemanth Yamijala.
, Attached patch is for Hadoop 0.20 (not for committing)., Integrated in Hadoop-Mapreduce-trunk #127 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Mapreduce-trunk/127/])
    ]