[The failure comes from the following snippet. If the previous AM has started the commit, but has not succeeded or failed, we assume it is an error state. 
{code}
        if (commitSuccess) {
          shutDownMessage = "We crashed after successfully committing. Recovering.";
          forcedState = JobStateInternal.SUCCEEDED;
        } else if (commitFailure) {
          shutDownMessage = "We crashed after a commit failure.";
          forcedState = JobStateInternal.FAILED;
        } else {
          //The commit is still pending, commit error
          shutDownMessage = "We crashed durring a commit";
          forcedState = JobStateInternal.ERROR;
        }
{code}

To fix this, we can do either of
# Treat the lack of success/failure file as an artifact of the previous commit failing due to RM restart and re-attempt the commit. The only downside to this seems to be when the commit itself is buggy - we ll end up trying to commit upto the number of attempts allowed. 
# Make sure the AM deletes the commit file before failing. Given the RM/ NM kill the containers, making sure we delete the commit file before dying can be a little more involved.

[~revans2] - do you think it is reasonable to go with the first option? , This was by design to handle racing AMs in the presence of partitions. Reducing priority.

This will go away once we have work-preserving RM restart.

For the shorter term, I think it makes sense to have the AM delete the file before failing., First-cut patch that deletes the startCommitFile if the commit is interrupted. 

However, in case of two AMs running during a partition, this can lead to one AM deleting the startCommitFile created by another AM. To avoid races in case of a partition, we might have to complicate this a little more. 

How about adding a .host.pid suffix to the name of the commit file? Each AM would write its own. When a subsequent AM comes up and verifies the state of commit from previous AMs, it would look for any? [~vinodkv], [~revans2] - thoughts? , This is closely related to MAPREDUCE-5485.  The problem here is that the output committer is user-pluggable code, and we can't assume what it does or if it can be safely restarted after crashing mid-way through the commit.  This is one of the reasons job commits are not retried by the AM, and by extension we can't assume it's safe to retry in another AM attempt.  That's why the AM goes out of its way to indicate via a file that it's starting to do the job commit and avoids repeating it on an AM restart if that file is still present.  Whether the retry is because the AM crash or the AM was restarted due to RM restart, the end effect is the same -- it's not safe to retry a job commit in the general case.

If we had an API by which the output committer could tell the AM if it's safe to retry a job commit that would help., Thanks for chiming in, Jason. 

Please correct me if I am wrong. Not being able to tolerate node failures (slaves/master) seems like a major regression from MR1 which tolerates slave failures. I am wondering if there is a way to solve the crashed commits issue not just for all jobs. For MR, what do you think of committing to an intermediate location, and renaming it to the output location? If the output location is missing, the commit can be retried., bq. If we had an API by which the output committer could tell the AM if it's safe to retry a job commit that would help.
Jason, we already have the recover API in OutputCommitter. That should be enough right?

bq. Please correct me if I am wrong. Not being able to tolerate node failures (slaves/master) seems like a major regression from MR1 which tolerates slave failures.
This isn't a regression. More of an artifact of the new architecture. MR1 doesn't tolerate the master failures. AM failure is akin to the master-failure, except the master is distributed now., As I understand it, we have a task-level output recovery API in OutputCommitter but not a job-level output recovery API.  I'm not sure it's safe to assume that if an output committer supports task recovery that it also supports recovering from a partial job output commit., With work-preserving RM/NM restart, one can run into this only when the AM dies or the node running the AM dies. This is no longer a regression when moving from MR1 to MR2. 

Closing this as "Won't Fix" for now. Please re-open if needed. , This will also happen when the AM is preempted, This will also happen when the AM is preempted, Yes, it appears when we test preempting, and the job fails for "We crashed durring a commit", if crashed during a commit and if an api comes out to check if the job can fail over, then the problem will be fixed, I think we can delete the commit tmp file at init stage, {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12694551/MAPREDUCE-5718.v2.patch
  against trunk revision 8cb4731.

    {color:green}+1 @author{color}.  The patch does not contain any @author tags.

    {color:red}-1 tests included{color}.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    {color:green}+1 javac{color}.  The applied patch does not increase the total number of javac compiler warnings.

    {color:green}+1 javadoc{color}.  There were no new javadoc warning messages.

    {color:green}+1 eclipse:eclipse{color}.  The patch built with eclipse:eclipse.

    {color:green}+1 findbugs{color}.  The patch does not introduce any new Findbugs (version 2.0.3) warnings.

    {color:green}+1 release audit{color}.  The applied patch does not increase the total number of release audit warnings.

    {color:red}-1 core tests{color}.  The patch failed these unit tests in hadoop-mapreduce-project/hadoop-mapreduce-client/hadoop-mapreduce-client-app:

                  org.apache.hadoop.mapreduce.v2.app.TestMRAppMaster

Test results: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/5147//testReport/
Console output: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/5147//console

This message is automatically generated., [~yanghaogn] - initially, I was also trying to delete the startCommitFile if there is not corresponding endFile. However, we can't do that for reasons Jason described here - https://issues.apache.org/jira/browse/MAPREDUCE-5718?focusedCommentId=13872189&page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel#comment-13872189, Hi, I have read the comment twice. It may not be safe to recover under this situation. 

I'm wondering whether you are worring about missing data. But during the recovery, task output data will be moved to the new output dir, just as the normal AM failover does, then it's safe to recover

Our cluster will add this feature. Can you give more specific information on the unsafe situation? Thanks a lot, Hi, I have read the comment twice. It may not be safe to recover under this situation. 

I'm wondering whether you are worring about missing data. But during the recovery, task output data will be moved to the new output dir, just as the normal AM failover does, then it's safe to recover

Our cluster will add this feature. Can you give more specific information on the unsafe situation? Thanks a lot, The issue is that the OutputCommitter is user-specified code.  It may not be doing filesystem operations at all during the commit (e.g.: committing to a database, a REST API, etc.), and that procedure may not be restartable without the chance of corrupting or losing data.  Yes, FileOutputCommitter's commit procedure is something that can be restarted, but jobs are not required to use FileOutputCommitter nor dump their output in a file at all.  That's why MAPREDUCE-5485 was filed, because to do this safely the framework needs an indication from the output committer whether or not commit is a restartable procedure., [~yanghaogn] we follow the convention of setting the fix-version only at the time of commit by a committer. Dropping fix-version for now., Given MAPREDUCE-5485 is already commit in, shall we mark this JIRA as duplicated?]