[Current issue is different from the existing TestJobHistoryServer related JIRAs, because it has a special failure reason: 'java.lang.AssertionError: Address already in use'. BTW, in my testing, this unit test has 1 failure in 6 executions., The failures always happen in the step 'String redirectUrl = getRedirectUrl(job.getTrackingURL())' of testHistoryServerStandalone(). In the failure case, when executing into the method getRedirectUrl(job.getTrackingURL()), it always fails to execute 'Assert.assertEquals(status, HttpURLConnection.HTTP_MOVED_TEMP)' because the status value now is 200, but the HttpURLConnection.HTTP_MOVED_TEMP value is 302. In the successful cases., the status value will be 302.
If add a break(sleep 10 sec) between 'int status = client.executeMethod(method)' and 'method.setFollowRedirects(false)', this case will be stable. I tried: 10 executions with 0 failure., Just attached the patch now, but need the review of committer, Could we indent the if block properly?  In addition, could we do more to check the URL redirect method in a while loop with a maximum of 4 retries?  We can add synthetic logic to pause 1, 2, 3, and 4 seconds upon each retry.  Hence, the worst case would be delayed by 10 seconds, but it can recover earlier than 10 seconds in most cases.  This could reduce the amount of time required to execute this test case., Hi Eric, according to your suggestions, I updated the patch:
- Indent the code properly
- Set 4 retries of checking the URL redirect method, and add synthetic logic to pause 1, 2, 3, and 4 seconds upon each retry, The indentation still has problem.  In addition, could you generate a patch for branch-1, and trunk?  Thanks, Eric, I updated the patch. Thanks!, Eric, 
I updated the patch for 1.0.3 and uploaded the patch for branch-1. 
For trunk, there is no TestJobHistoryServer.java, so I did not generate another patch for trunk.
Thanks!, +1 looks good., I just committed this to 1.x branches.  JobHistoryServer doesn't exist in trunk, hence no action there., Thanks Sam., Thanks Eric! Pls let me know if there is any further action, Closed upon successful release of 1.1.2.]