[New patch to use Jetty's ant dependency. , New patch to address Hemanth's feedback on HADOOP-6800., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12447855/MAPREDUCE-1870.patch
  against trunk revision 957283.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/583/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/583/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/583/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/583/console

This message is automatically generated., I am unable to get the Hudson test report link to show up. Anyone knows how to fix it ?, Hemanth, I could open the test report. May be link was slow when you tried. Here is the report:
{noformat}
Test Result
1 failures (±0)
913 tests (±0)
Took 3 hr 37 min.
add description
All Failed Tests
Test Name   	Duration   	Age   
>>><<< org.apache.hadoop.mapred.TestSimulatorDeterministicReplay.testMain 	0.0020	35
{noformat}, Thanks, Amareshwari. So this is MAPREDUCE-1834., I've just committed this., Integrated in Hadoop-Mapreduce-trunk-Commit #523 (See [https://hudson.apache.org/hudson/job/Hadoop-Mapreduce-trunk-Commit/523/])
    ]