[This patch has HSQLDB pick a random port and try again until it gets one that's open (up to 10 retries), Talked to Aaron Kimball offline and he pointed out that HSQLDB can be run in an in-memory mode. So this new patch just uses that mode and doesn't need a port at all., Oops, left some imports in the previous patch. This one should be good, sorry for noise., +1 Changes look reasonable.

FWIW, I don't think this is going to entirely solve your problem. {{TestDBJob}} should fail for the exact same reason -- it runs the job specified in {{DBCountPageView.java}} under {{src/examples}}. So you might need to parameterize the {{DB_URL}} in that process as well and make embedded server hosting conditional on its value. (If TestDDDBIF fails and TestDBJob doesn't... that's something else worth pondering.), -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12470296/mapreduce-2301.txt
  against trunk revision 1079072.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

    +1 system test framework.  The patch passed system test framework compile.

Test results: https://hudson.apache.org/hudson/job/PreCommit-MAPREDUCE-Build/127//testReport/
Findbugs warnings: https://hudson.apache.org/hudson/job/PreCommit-MAPREDUCE-Build/127//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://hudson.apache.org/hudson/job/PreCommit-MAPREDUCE-Build/127//console

This message is automatically generated., Canceling the patch because it is almost a year old (Unlikely to still apply without an up-merge) and there are review comments still to be addressed]