[Here's a patch for this issue. I didn't include a unit test because it's a very simple fix. I'd appreciate if someone could review it!

Note that the code in the patch does not print deficits, unlike the previous code, because deficits were removed as part of MAPREDUCE-706., +1, this patch looks good to me., Thanks for the review, Scott. I'll wait to see if there are any checkstyle warnings etc and commit it if there aren't., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12428407/mapreduce-1258-1.patch
  against trunk revision 892411.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h3.grid.sp2.yahoo.net/225/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h3.grid.sp2.yahoo.net/225/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h3.grid.sp2.yahoo.net/225/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h3.grid.sp2.yahoo.net/225/console

This message is automatically generated., The test failure is unrelated, and I didn't included unit tests because this is a small logging fix, so I've committed this patch. I'm also going to check whether it's possible to commit it to 0.21., I vote that we pull this into 0.21 as well., Dhruba let me know that it's fine to commit this to 0.21 too, because it's a bug fix. I'll wait a day to see if there are any objections, and otherwise I'll commit it., I've committed this to 0.21 as well, to let this logging feature continue to work as in 0.20., Integrated in Hadoop-Mapreduce-trunk #196 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Mapreduce-trunk/196/])
    ]