[The alternative is to depend on hadoop-yarn-server-common which seems to be an overkill, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12518036/MAPREDUCE-3996.patch.txt
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 eclipse:eclipse.  The patch built with eclipse:eclipse.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed unit tests in .

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/2038//testReport/
Console output: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/2038//console

This message is automatically generated., It seems that the HA merge that happened over the weekened now pulls ZK as a dependency for common and thus makes it available in the overall hadoop-dist assembly. At this point the big issue of not having ZK artifact there at all is solved. The lesser issue of making hadoop-mapreduce assembly self-contained is still a problem, but I'm not sure whether it is worth addressing. Feel free to disregard this patch if you think hadoop-mapreduce being self-contained is not a requirement., Thanks for the update Roman.

Map/Reduce binary depends on common for other things too and so is not really 'self-contained', so we will not need this anymore. Closing this as not-a-problem since common now supplies the ZK bits.]