[The patch adds SleepJob class to the examples and also modifies ExampleDriver to add the SleepJob., Should be in hadoop-mapreduce-client-jobclient-tests.jar: 

http://svn.apache.org/viewvc/hadoop/common/trunk/hadoop-mapreduce-project/hadoop-mapreduce-client/hadoop-mapreduce-client-jobclient/src/test/java/org/apache/hadoop/SleepJob.java?view=log, Yes, it is there. But I created this issue to add it to the examples. I think it is useful to have it in the examples, especially users will be expecting it as it was present in previous versions of hadoop in the examples., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12507622/MAPREDUCE-3570.patch
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    -1 javac.  The applied patch generated 2317 javac compiler warnings (more than the trunk's current 2297 warnings).

    +1 eclipse:eclipse.  The patch built with eclipse:eclipse.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed these unit tests:
                  org.apache.hadoop.mapreduce.v2.app.TestJobEndNotifier
                  org.apache.hadoop.mapreduce.v2.app.TestStagingCleanup

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/1467//testReport/
Console output: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/1467//console

This message is automatically generated., It has been moved to test. See MAPREDUCE-973. No need to have it in 2 places., Thanks Konstantin, I saw the discussion on MAPREDUCE-973. I just think having SleepJob as part of examples was handy as the audience is different from test. 

Additionally 0.20 20x branches have it in the examples. Regarding having it in two places, WordCount is an example that is present in both test and examples in current and older hadoop versions.

Although I think we need it in the examples, I am fine if everyone agrees we shouldn't., I'm ambivalent about having it in examples. However, I'm against 2 copies of the code, I'd rather have it move back to examples than copy it.]