[Because this is not targeted for trunk, and Jenkins will try to run this against trunk here are the test-patch results

     [exec] -1 overall.  
     [exec] 
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec] 
     [exec]     +1 tests included.  The patch appears to include 4 new or modified tests.
     [exec] 
     [exec]     -1 javadoc.  The javadoc tool appears to have generated 1 warning messages.
     [exec] 
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec] 
     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs warnings.
     [exec] 
     [exec]     -1 Eclipse classpath. The patch causes the Eclipse classpath to differ from the contents of the lib directories.

I don't know why it complains about the eclipse classpath or javadocs.  Both of those are false positives.  The eclipse classpath did not change, and it is still 6 javadoc warnings. 
, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12480551/MR-2535-0.20.20X-V1.patch
  against trunk revision 1127444.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 4 new or modified tests.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/hudson/job/PreCommit-MAPREDUCE-Build/307//console

This message is automatically generated., +1

I committed this. Thanks, Robert!

I also added the test I missed from MAPREDUCE-2470, The fix is good, but it broke the system tests.  Reopening the bug to add in a patch to fix the tests., MR-2535-failures-v1.patch should apply to both 0.20.205 and security-trunk,      [exec] -1 overall.  
     [exec] 
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec] 
     [exec]     +1 tests included.  The patch appears to include 18 new or modified tests.
     [exec] 
     [exec]     -1 javadoc.  The javadoc tool appears to have generated 1 warning messages.
     [exec] 
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec] 
     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs warnings.
     [exec] 
     [exec]     -1 Eclipse classpath. The patch causes the Eclipse classpath to differ from the contents of the lib directories.


The Eclipse issue and the Javadocs issues are bogus.  I didn't even change and of the source, just tests., Committed the follow-up. Thanks for the quick fix.]