[could you provide a bit more detail from the AM logs when this occurs?  I'm not able to reproduce this with a sleep job and manually killing the AM to simulate failure.  Normally the AM tries to determine if it is the last attempt and only deletes the files if it is convinced there will be more attempts.  If you could provide steps to reproduce or details from the AM logs showing why it decided to remove the staging directory that would help clarify what's going on in this case., Did you check if AM retries were enabled to be > 1? Without that the last attempt will delete the files. If the AM is being retried by the RM then this value should already be > 1 though. So there could be a bug., I suspect that this is a case, like that discussed in YARN-243 and MAPREDUCE-4819, where the AM attempt has reached a final job state, removed the staging directory, but crashes before unregistering with the RM.  The fix for this is to remove the staging directory *after* unregistering with the RM.  It was originally located there, but then moved up earlier in shutdown to fix the race with the RM trying to kill the AM after it unregistered (and sometimes didn't cleanup the staging directory as it should).  Now that there's a FINISHING state for apps (at least in 2.x), this should give the AM sufficient time to remove the staging directory in most cases before the RM kills the app., Devaraj, could you confirm if this is a case where the AM is crashing between removal of the staging directory and unregistering from the RM?  If that's the case then this should be moved to MAPREDUCE since it's a problem in the MRAppMaster and not the RM., Would be good to open a jira for the AM crashing. Why is it crashing?, Sorry for the late response. Here AM is not crasing. 

As Jason mentioned in the above comment, AM Attempt is failing to unregister with RM due to restart of the NM where the AM launched and before unregister first AM attempt is removing the staging directory. For the next AM attempts, all are failing with FNFE due to staging files not present., Why is the NM crashing? :P Is it a know issue or new jira?
According to YARN-72 and YARN-73 NM currently does not clean up running containers. So the AM should have continued to run and unregistered from the RM (despite NM restart)?, {quote}
Why is the NM crashing?  Is it a know issue or new jira?
{quote}
It is not an issue, if suppose NM goes down and comes back due to any reason., I believe this has been fixed by MAPREDUCE-5476.  [~devaraj.k] if you agree then we can mark this is as a duplicate of that JIRA., It has been fixed by MAPREDUCE-5476, closing it as duplicate of MAPREDUCE-5476.]