[No unit test created as similar patch for HDFS didn't require one., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12515105/MAPREDUCE-3807.patch
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/1898//console

This message is automatically generated., Can someone more knowledgable than I review the patch and decide on it's suitability ?, Is there anything I've missed or need to do before this patch can be reviewed?, Forza,

Sorry for the late response. The logic is sound (and thank you for the patch!), but can you move the call out to a function inside the JobTrackerJspHelper class, and use that function here? Or we could factor out a whole new function in a common utils class and use it in both HDFS and MR to avoid duplication., Moved to 1.2.0 upon release of 1.1.0., Changed Target Version to 1.3.0 upon release of 1.2.0. Please change to 1.2.1 if you intend to submit a fix for branch-1.2., \\
\\
| (x) *{color:red}-1 overall{color}* |
\\
\\
|| Vote || Subsystem || Runtime || Comment ||
| {color:red}-1{color} | patch |   0m  0s | The patch command could not apply the patch during dryrun. |
\\
\\
|| Subsystem || Report/Notes ||
| Patch URL | http://issues.apache.org/jira/secure/attachment/12515105/MAPREDUCE-3807.patch |
| Optional Tests |  |
| git revision | trunk / f1a152c |
| Console output | https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/5517/console |


This message was automatically generated., \\
\\
| (x) *{color:red}-1 overall{color}* |
\\
\\
|| Vote || Subsystem || Runtime || Comment ||
| {color:red}-1{color} | patch |   0m  0s | The patch command could not apply the patch during dryrun. |
\\
\\
|| Subsystem || Report/Notes ||
| Patch URL | http://issues.apache.org/jira/secure/attachment/12515105/MAPREDUCE-3807.patch |
| Optional Tests |  |
| git revision | trunk / f1a152c |
| Console output | https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/5526/console |


This message was automatically generated., branch-1 is EoL. Closing this.]