[I checked and this is only a problem in the raid contrib. The others that have their own junit tasks properly propagate.

Tested this by running one of the raid tests while specifying xml format on command line -- before the patch it still generated txt output, with the patch it generated xml., +1

Should we also add missing contrib tests at the same time? E.g. the test target in src/contrib/build.xml is missing data_join and index, and mumak is commented out., I commented out mumak yesterday (see MAPREDUCE-2348)

I vote that we fix the test reporting on raid, fix the raid test, and get a green build. Then let's add back contribs one by one. It's been 10 months since a green build I think!, Committed to trunk and branch., Integrated in Hadoop-Mapreduce-trunk-Commit #634 (See [https://hudson.apache.org/hudson/job/Hadoop-Mapreduce-trunk-Commit/634/])
    MAPREDUCE-2394. JUnit output format doesn't propagate into raid contrib build. Contributed by Todd Lipcon.
, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12473928/mapreduce-2394.txt
  against trunk revision 1082400.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 1 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

    +1 system test framework.  The patch passed system test framework compile.

Test results: https://hudson.apache.org/hudson/job/PreCommit-MAPREDUCE-Build/140//testReport/
Findbugs warnings: https://hudson.apache.org/hudson/job/PreCommit-MAPREDUCE-Build/140//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://hudson.apache.org/hudson/job/PreCommit-MAPREDUCE-Build/140//console

This message is automatically generated., Integrated in Hadoop-Mapreduce-22-branch #38 (See [https://hudson.apache.org/hudson/job/Hadoop-Mapreduce-22-branch/38/])
    MAPREDUCE-2394. JUnit output format doesn't propagate into raid contrib build. Contributed by Todd Lipcon.
, Integrated in Hadoop-Mapreduce-trunk #643 (See [https://hudson.apache.org/hudson/job/Hadoop-Mapreduce-trunk/643/])
    ]