[A few questions here:

* What is {{MultipleOutputFile}}? Pardon my ignorance, but I could not find a class or type like that in my workspace, so would be good to know if its not {{MultipleOutputs}} or {{MultiFileOutputFormat}} we're talking about here.
* The output directory existence check is done by the {{OutputFormat}} class in use, and not the {{submitAndMonitorJob()}} call. The specific method to override in this case would usually be {{OutputFormat#checkOutputSpecs}}, which gets invoked pre-submit. Is this what you are talking about too?
* Does {{MultipleOutputFile}} (or if this is one of the two classes I mentioned earlier) create arbitrary directories in the HDFS? How does it ensure task commits in this case?, hi :)

sorry for my fat fingers.  to your first point, the class I was talking about is this:

  http://search-hadoop.com/c/Map/Reduce:/src/java/org/apache/hadoop/mapred/lib/MultipleOutputFormat.java

which I'm using via several layers of abstraction.

I'm sure you're right about the second point - I just googled the error and found some stale code, which I'm sure has been cleaned up by now.

as for the third point, the finer points of the implementation aren't something I'm familiar with.  but it does seem to me that the consistency check should happen later on when using multiple output formats (or at least let me run things at my own risk :)

HTH
, Geoffrey,

Thanks for the answers to those!

So your major pain point is with the OutputFormat checking if the directory already exists during submit time. This is a client-side behavior, over-ridable by your MultipleOutputFormat derivative {{(@Override checkOutputSpecs)}}. This isn't a hadoop issue per se, cause the default check to FileOutputFormat was added with safety-first principles in mind, but as I mentioned already, its over-ridable by developers. You have that flexibility already available.

Also, maybe you'd know about it already, but just for warning's sake, take a read of the default OutputCommitter behavior in Hadoop: http://wiki.apache.org/hadoop/FAQ#Can_I_write_create.2BAC8-write-to_hdfs_files_directly_from_map.2BAC8-reduce_tasks.3F, Geoffrey,

Unless you got further issues, this can be resolved I think… The problem is specifically workaroundable by the user (by design). Does my above comment answer your issue?

Probably can be resolved as 'Not a Problem' or so., Geoffrey, so taking a look at stable release today, 0.22 and trunk, I think we can close this as a 'Not a Problem' as the directory check is purely from the OutputFormat class instance itself. That said, you should be fully able to remove that check yourself in your MultipleOutputFormat derivative by overriding the checkOutputSpecs method as pointed before.

In case that doesn't resolve it for you, do reopen!]