[Test fails whenever there log4j initialization warnings.
I'm changing the test to assert whether DEBUGOUT contains the result, instead of assertEquals., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12417711/patch-687.txt
  against trunk revision 808082.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/521/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/521/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/521/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/521/console

This message is automatically generated., -1 core tests. Due to MAPREDUCE-880, I committed this to trunk and branch 0.20. Thanks Amareshwari!, Integrated in Hadoop-Mapreduce-trunk-Commit #8 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Mapreduce-trunk-Commit/8/])
    . Fix an assertion in TestMiniMRMapRedDebugScript. Contributed by Amareshwari Sriramadasu.
, Integrated in Hadoop-Mapreduce-trunk #70 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Mapreduce-trunk/70/])
    , This is happening in trunk 21 also. 

[junit] Tests run: 1, Failures: 0, Errors: 1, Time elapsed: 0 sec
[junit] Test org.apache.hadoop.mapred.TestMiniMRMapRedDebugScript FAILED

Number 30 build. Can you checking there also., Failure is because of a commit issue in MAPREDUCE-915. It is fixed now.]