[Times out in branch 0.21 also., We should fix this for 0.22., This is a regression due to HADOOP-6856, I believe. The SequenceFile.createWriter call no longer uses the {{fs}} parameter, so the signal files are getting created on the local FS instead of HDFS., In investigating this I cleaned up the test case a bit to share more code. But with the HADOOP-7087 fix in place, the test passes as is, so we don't necessarily need to commit this., The right approach IMO is to fix HADOOP-7087 and close this issue., HADOOP-7087 is now committed, this test ought to resolve itself with the next build.

Anyone feel like taking a quick look at the test cleanup here while we're at it?, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12467604/mapreduce-2121-cleanup-tests.txt
  against trunk revision 1067740.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

    +1 system test framework.  The patch passed system test framework compile.

Test results: https://hudson.apache.org/hudson/job/PreCommit-MAPREDUCE-Build/24//testReport/
Findbugs warnings: https://hudson.apache.org/hudson/job/PreCommit-MAPREDUCE-Build/24//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://hudson.apache.org/hudson/job/PreCommit-MAPREDUCE-Build/24//console

This message is automatically generated., Resolving as dup since this was fixed by HADOOP-7087]