[As Hemanth commented offline, update thread doesn't lock the JT as such. But it does lock 'taskTrackers' HashMap via getTotalSlots method. This still can get problematic and needs to  be fixed., As a temporary fix, feel free to submit a patch that scales up the interval based on cluster size or heartbeat interval. Or, if there's a way to make getTotalSlots non-synchronized or cache its result, we should do that, as there is no reason to call this method all the time.

Incidentally, if we change the fair scheduler logic to not use deficits anymore (which I'm proposing in HADOOP-4803 and seems like a better idea the more I think of it), the update thread could start running much less frequently. The reason it runs so often now is to make the deficit computations accurate so that we don't have too many tasks per job starting/finishing in-between update calls. If we removed deficits, I think the main reason we'd need periodic updates will be preemption, and that check can happen much less frequently., Agree Matei. In any case, making this configurable will only help the cause. An update - running JT with a 5 second update interval(instead of the default 500ms) on a 400 node cluster seemed to improve JT's serving of requests when compared to previous runs. Will submit a patch making the interval configurable., Is anyone from Yahoo working on this? It's pretty straightforward to add a config option., Does anybody have a patch for this one? I am seeing this issue in our cluster. I am thinking of changing running it with a value of 1000 ms (instead of 500ms)., MAPREDUCE-551 (preemption patch) introduced a conf setting for the update interval, namely mapred.fairscheduler.update.interval. For earlier versions of the scheduler, I think the best thing is to change the hardcoded value manually. Should I close this JIRA?, +1 for closing this JIRA then., Alright, closing the JIRA because it is resolved in MAPREDUCE-551., > Alright, closing the JIRA because it is resolved in MAPREDUCE-551.

In this case, the resolution probably should be "Duplicate".]