[Attaching patch to fix this issue. MySQL supports TIMESTAMP values of '0000-00-00 00:00:00' which is out-of-range for java.sql.Timestamp. MySQL allows various behaviors for handling this; the default used to be to convert this value to null; since MySQL 5 it now throws IOException when such a timestamp is retrieved.

Sqoop now sets the default behavior to be convert these values to 'null', since this is a reasonable data conversion given the imprecision available. Users can override this default by passing the {{zeroDateTimeBehavior=exception}} parameter in the connect string., patch looks good to me, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12428350/MAPREDUCE-1235.patch
  against trunk revision 892178.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h3.grid.sp2.yahoo.net/217/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h3.grid.sp2.yahoo.net/217/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h3.grid.sp2.yahoo.net/217/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h3.grid.sp2.yahoo.net/217/console

This message is automatically generated., These test failures are unrelated, I committed this. Thanks, Aaron!, Integrated in Hadoop-Mapreduce-trunk #196 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Mapreduce-trunk/196/])
    ]