[Attaching patch. With this patch, CapacityTaskScheduler assigns multiple tasks in a single heartbeat. It assigns multiple maps just like the default scheduler - multiple local tasks and at-most one off-switch tasks; and multiple reduces. It also keeps track of the tasks decided to be assigned in a particular scheduling iteration so as that high memory jobs are blocked for scheduling and user-limits are respected while giving away multiple tasks.

The patch also has test-cases. Benchmarking is in progress., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12407144/HADOOP-5090-20090504.txt
  against trunk revision 771505.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/288/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/288/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/288/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/288/console

This message is automatically generated., Updated patch., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12407314/HADOOP-5090-20090506.txt
  against trunk revision 772960.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    -1 patch.  The patch command could not apply the patch.

Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/304/console

This message is automatically generated., Updated patch. This has to be applied over the latest patch for HADOOP-5884., I'd strongly urge *against* assigning multiple reduces per task. When I did it HADOOP-3136 it caused _bad_ imbalances with reduces... for e.g. consider 2 jobs - one with 'small' reduces and other with 'heavy' reduces. If we assign multiple reduces then a portion of the cluster (tasktrackers) will run the 'small' reduces and the others will run 'heavy' reduces leading to bad imbalances in load on the machine. Given that we decided to assign only 1 reduce per heartbeat wiht HADOOP-3136 to achieve better load balance., Also, I *really* don't think having a config to control assignment of one or many tasks is a good idea. We should just stick with multiple assignments. , Updated patch for y20, incorporates MAPREDUCE-538 also., Updated patch for y20.

Highlights:

# CS assigns multiple tasks per heartbeat, at most 1 off-switch task per heartbeat.
# I've incorporated HADOOP-538 also to ensure jobs at the head of the queue do not aggressively grab tasks hurting locality for others.
## The implementation tracks 'number of scheduling opportunities' missed by a job and gets jobs to use that to prevent starvation.
## I've also added 'pace' to the back-off by getting ensuring jobs do not back-off as aggressively as they make progress.
## The patch also gets small jobs to back off less vis-a-vis larger jobs by ensuring the backoff considers the #maps in the jobs.
## The patch also ensures jobs with no locality e.g. sleep-job/randomwriter do not care about backoff since it doesn't make sense at all., Minor tweak to ensure off-switch tasks are scheduled more aggressively for high-ram maps., Updated patch to fix TestCapacityScheduler., Thanks for marking Luke!, Hadoop 0.20.204.0 was just released.]