[Patch updating the documentation, Ran ant docs both on trunk and branch 0.21, with the patch. It ran successfully., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12445045/patch-1697.txt
  against trunk revision 946578.

    +1 @author.  The patch does not contain any @author tags.

    +0 tests included.  The patch appears to be a documentation patch that doesn't require tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/540/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/540/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/540/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/540/console

This message is automatically generated., Test failures are clearly not related to the patch. They failed because of NoClassDefFoundError (MAPREDUCE-1275), Did some editorial changes to the earlier patch, suggested by Ravi offline.

Ran ant docs both in trunk and branch 0.21, it ran successfully., Latest patch looks good.
+1, Missed mentioning earlier.
In streaming.xml, under "Streaming Command Options", description about -file is as follows:
{code}
-file filename	    Optional 	      Make the mapper, reducer, or combiner executable available locally on the compute nodes
{code}

Should we change this to the description similar to that is there in StreamJob.exitUsage() instead of saying that -file option can take only mapper/reducer/combiner executables., Streaming -info (StreamJob.exitUsage) says
{code}
-file     <file>     File/dir to be shipped in the Job jar file
{code}
When I tried passing a directory through -file option, the contents of directory are added to the job jar, not the directory itself. 
After MAPREDUCE-967, because the contents of the passed directory are not added to the *jar unpack pattern*, the files/dirs inside the passed directory are not unjarred. Thus they are not symlinked from cwd of the task. I raised MAPREDUCE-1826 for this. We can update "behavior of passing a directory through -file option" in MAPREDUCE-1826 itself.

Along with documentation changes, I would like to deprecate the -file option in this jira in favor of MAPREDUCE-574.
Thoughts?


, +1 for just adding deprecation warning message and having the behavior of -file be the same as it is there now in this release. Then in next release(0.23), we can remove the option -file., Patch deprecates -file option and updates usage message with proper behavior of -file option., Patch looks good.
+1, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12446011/patch-1697-2.txt
  against trunk revision 950021.

    +1 @author.  The patch does not contain any @author tags.

    +0 tests included.  The patch appears to be a documentation patch that doesn't require tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/216/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/216/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/216/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/216/console

This message is automatically generated., bq. -1 contrib tests. 
TestSimulatorDeterministicReplay failed because of timeout. The test timedout without the patch also, on my local machine. Raised MAPREDUCE-1834 for the same.
, Ran tests in branch 0.21 also. All tests passed, except org.apache.hadoop.mapreduce.security.token.TestDelegationTokenRenewal (which passed on a re-ran) and TestSimulatorDeterministicReplay timeout (MAPREDUCE-1835 and MAPREDUCE-1834). , Patch with minor editorial changes to documentation, suggested by Vinod offline.

Ran ant docs with the patch on both trunk and branch 0.21., +1 for the patch. I built the docs and verified how it looks too. I'm going to check this into trunk and 0.21., I just committed this to trunk and 0.21. Thanks Amareshwari!]