[Attaching patch for earlier version of hadoop. Not for commit here., Attaching patch for trunk., As Amareshwari pointed offline, trunk patch would probably need more changes. Let me investigate more., Updated patch on behalf of Ravi.

The problem with the previous patch was that the test could still timeout due to setup/cleanup tasks getting done before the kill, so a single map has been added to the job., Attaching updated patch for trunk with the fix.

This patch needs to be committed only after MAPREDUCE-1727 because the testcase anyway fails becasue of MAPREDUCE-1727., Comments/javadoc added in 20 patch are not there in trunk's patch. Can you add them and make it patch available?, Attaching patch with the comments added., One minor nit : In the Javadoc ".... a long time(2000 sec)" should be modified to 2000 milli sec or 2 seconds., It is actually 2000sec. Because 2000millisec * 1000 iterations., My understanding was wrong. It is 2000sec only. I would like to increase it to at least 1 min.
Attaching new patch with the change., Earlier 2sec only. Changed it to 60sec in the latest patch uploaded., Patch looks fine. Submitting for hudson., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12443059/1606.v1.1.patch
  against trunk revision 938805.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/153/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/153/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/153/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/153/console

This message is automatically generated., Unit tests failures are because of zipException and not related to this patch.

Though I couldn't reproduce the testcase TestJobACLs without this patch on trunk, I doubt it can fail some times(may be very rare) and would like this fix to get committed.

Vinod/Amareshwari, What do you say ?, Could reproduce the issue in trunk by placing a sleep for 1 sec before killJob() call in verifyACLPersistence(). So once job is initialized, the problem of "not having slot for JOB_CLEANUP task" arises when killJob() is done.
, Attaching patch for trunk fixing the issue by 
(1) making submitJobAsUser() wait till the job goes into RUNNING state
(2) having a long running map task in the job so that job won't finish before we kill it
(3) and having 2 TaskTrackers in the cluster, Can you please upload the difference between test execution times before and after the patch? Just checking to see if we are bloating the execution time by an order of magnitude., For the whole TestJobACLs, the execution time on my local machine increased from 5 sec to 37 sec.
But Are we really worried about execution time here ? I think correctness of the testcases in TestJobACLs is the issue here and we want to have view-job, modify-job checks to be done after initialization of job is done. Right ?, I agree with Ravi that it is correctness that matters here., Here's a patch which reduces the test time down to 8-10 seconds.

Ravi, can you please look at it?, Patch looks good. Reduced the execution time to 8sec.
+1, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12446759/MAPREDUCE-1606-20100610.txt
  against trunk revision 953490.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/562/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/562/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/562/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/562/console

This message is automatically generated., TestCopyFiles failures are not related to this patch. This patch changes only testcase TestJobACLs.java., TestSimulatorDeterministicReplay failure is because of MAPREDUCE-1834.

TestCopyFiles fails consistently, tracked at MAPREDUCE-1858.

I am check this in., The test was the same in 0.21 and hence the failure too., I just committed this to trunk and 0.21. Thanks Ravi!]