[Attaching patch removing the test case., Attaching patch correcting the build.xml in streaming., +1 for removing the testcase., The testcase (introduced in HADOOP-542) is quite obscure because there is no documentation about what it is intending to test. But trying to decipher:

There are two options used in this testcase - mapsideoutput and inputtagged.

Regarding mapsideoutput, what I could guess was it was using a streaming option that caused map outputs to be written to a side effect file and verified that the output from these files was as expected. In the test case, the file was set to be a socket or a local file whose URL was passed to the 'mapsideoutput' option in Streaming. 

As Sreekanth pointed out, this option is no longer supported, and hence the test code exercising this option is no longer needed.

inputtagged is still getting added to streaming options in StreamJob. But it doesn't seem to be used anywhere. Can this be confirmed once again, please ? If confirmed to be unused, I am +1 for removing the test case. We must probably remove this option from being used in StreamJob as well, just so it doesn't cause confusion.

If we stick to course to remove the test case, I suggest we remove the target test-unix in Streaming's build.xml. Because with the patch, it is now identical to the test target., bq. inputtagged is still getting added to streaming options in StreamJob. But it doesn't seem to be used anywhere. Can this be confirmed once again, please ?
I verified that inputtagged option is not used anywhere, not documented. It is just added to the options., Patch incorporates Hemanth's suggestions., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12441925/patch-1692.txt
  against trunk revision 933441.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/115/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/115/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/115/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/115/console

This message is automatically generated., +1 for Amareshwari's last patch., I just committed this. Thanks, Sreekanth and Amareshwari !, Integrated in Hadoop-Mapreduce-trunk #289 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Mapreduce-trunk/289/])
    MAPREDUCE-1692. Removed unused testcase TestStreamedMerge. Contributed by Sreekanth Ramakrishnan and Amareshwari Sriramadasu.
, Attaching patch for yahoo! dist on behalf of Amareshwari/Sreekanth. Not for commit here.]