[With -update, since file sizes and checksums are checked in setup(), we can avoid redoing this work in mappers., Attaching patch to ignore read failures in setup() if -i option is given by user. As checkSrcPath() checks the source paths, I didn't put the try{} block for outer for loops.

Also removed  the counter SKIP(as setup() is already skipping the unnecessary files, there won't be anything for skipping by mappers) and the skippedFilesCount is displayed by setup(). My patch of MAPREDUCE-654 displays the skippedFilesCount from setup().

Please review and provide your comments., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12411793/d_ignore_read_failures.patch
  against trunk revision 808351.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/527/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/527/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/527/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/527/console

This message is automatically generated., Failed test is not related to this patch.

I don't see an easy way to add a unit test for this. Tested manually with -i option and throwing IOException from within setup()., Attaching patch that applies after MAPREDUCE-649, MAPREDUCE-654, MAPREDUCE-645 and MAPREDUCE-664.

Please review and provide your comments., Attaching new patch because MAPREDUCE-648 got committed., From previous patch, 1 Hunk failed when applying to current runk.

Attaching new patch that applies to trunk(no code changes compared to previous patch)., The current patch causes TestCopyFiles to fail, distcpv2 replaced this.]