[Screen Shot, Looks like the newly introduced task-log4j.properties is missing.

It's unfortunate, but I think we should just document MAPREDUCE-4970 and be ok with it.

[~tucu00] - Are you fine with this?, I agree with Arun. Plus, given than the message in the logs is clear folks will have a clue what to fix., We should definitely mark MAPREDUCE-4970 as an incompatible change.

Also, I think, we can maintain the compatability with little effort - tasks should read both log4j.properties and task-log4j.properties. That should do, right?, I ran a tar build and the task-log4j.properties showed up (and syslog appeared correctly).  Is there a packaging/upgrade process that updates code but not config files? 
, [~yeshavora] finally helped me understand the issue. The problem is that if there is an existing install, and people just upgrade the hadoop-core jar it breaks them and is, as such, a problem.

Maybe a simple fix is to include task-log4j.properties in the hadoop-core jar?

Something like:

{noformat}
diff --git build.xml build.xml
index a87513c..d5a3859 100644
--- build.xml
+++ build.xml
@@ -762,7 +762,7 @@
       <tarfileset dir="bin" mode="755"/>
     </tar>
     <property name="jar.properties.list"
-      value="commons-logging.properties, log4j.properties, hadoop-metrics.properties"/>
+      value="commons-logging.properties, log4j.properties, hadoop-metrics.properties, task-log4j.properties"/>
     <jar jarfile="${build.dir}/${core.final.name}.jar"
          basedir="${build.classes}">
       <manifest>
{noformat}, Uploading a candidate patch for discussion., Thanks [~yeshavora] for being persistent and patient! :), Sigh, nevermind that patch doesn't work., Spoke too soon, the patch works as expected. I was confused running from a non-tarball i.e. dev-mode build which actually didn't get hadoop-core*.jar on classpath of the MR child task.

I think the patch is good to go. 

Thoughts?, {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12582268/MAPREDUCE-5148.patch
  against trunk revision .

    {color:red}-1 patch{color}.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/3588//console

This message is automatically generated., Btw, for future reference - we need to ensure that the code has right defaults for all configs i.e. in this case it would be required to ensure TaskTracker sets correct defaults for all properties in task-log4j.properties.

Furthermore, task-log4j.properties has a bunch of stuff which shouldn't have been blindly copied from the main log4j.properties such as definitions for jobsummary log etc. 

We should minimize contents of that file and, as above, ensure that all properties defined in task-log4j.properties are correctly represented in code too., +1 patch looks good. Thanks Arun, Thanks for the review Giri. I just committed this., Thanks Arun, I verified the fix. It looks good.]