[This is a patch for Y20. The changes:
1) The JobClient and the Job constructors cache the UserGroupInformation. That UGI is used for getting the FileSystem in the JobClient and the Job classes.
2) The DelegationTokenRenewal is changed a bit. It now maintains a list of delegation tokens as opposed to a map from JobID to the tokens. This is required to support the Oozie use case better. Otherwise, we will have duplicate tokens for those cases where a task of one job launches another job. That second job uses the same tokens., Addresses some bugs in the earlier patch., I've reviewed DelegationTokenRenewal related parts.
Changes to DelegationTokenRenewal.java look fine.
In TestDTR:
1. I don't think it is a good idea to sleep for 10 seconds every time. If you feel it can take long then the currently specified time - increase the number of attempts, but not the attempt span. So in the good case we don't slow tests too much.
2. the attempt thing is really needed only in the first part of the test. In the second part we test negative case - it should never be renewed.
So one try or 3 seconds should suffice.

 
, Attaching a patch that addresses the concerns. (trunk patch coming soon), I've reviewed DelegationTokenRenewal related parts.
Changes to DelegationTokenRenewal.java look fine.
In TestDTR:
1. I don't think it is a good idea to sleep for 10 seconds every time. If you feel it can take long then the currently specified time - increase the number of attempts, but not the attempt span. So in the good case we don't slow tests too much.
2. the attempt thing is really needed only in the first part of the test. In the second part we test negative case - it should never be renewed.
So one try or 3 seconds should suffice.

 
, Patch has some javadoc and a clearer exception message in jobInProgress's constructor when it detects that the authenticated user is different from the user in the configuration., A bit updated version of the same patch., The attached patch is for trunk, A slightly updated patch. An equivalent patch for y20s has been manually tested. , +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12442031/1532.2.patch
  against trunk revision 935090.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/117/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/117/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/117/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/117/console

This message is automatically generated., +1, Thanks Chris for the review.


On 5/5/10 7:18 PM, "Chris Douglas (JIRA)" <jira@apache.org> wrote:



    [ https://issues.apache.org/jira/browse/MAPREDUCE-1532?page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel&focusedCommentId=12864621#action_12864621 ]

Chris Douglas commented on MAPREDUCE-1532:
------------------------------------------

+1


--
This message is automatically generated by JIRA.
-
You can reply to this email to add a comment to the issue online.


, I just committed this.]