[This is for the task-controller after MAPREDUCE-2178.

The test program allows the tester to pass in a username to use instead of the current user on the command line. However, there's no way to pass this from the ant task which calls "make check".

Instead I think we should use an env var which is easier to pass via make., IIRC, the history behind this was that on most UNIX and UNIX-like systems (OS X being a big exception) assigns valid user accounts uid > 1000 when using their utilities.  So this check was a safety to prevent accounts with special privileges from executing it., Here's a patch vs 0.20. Waiting on MAPREDUCE-2178 to do this for trunk., Allen - yep, makes sense. For a deployment it's configurable in taskcontroller.cfg. The issue is just that when running tests there should be a way to bypass this, since you don't always run tests as a user >1000, and the test writes its own configuration inline., On CentOS 5.5 (and possibly other systems), non-system users have id >= 500, not 1000.
The test should check that the user id is between UID_MIN and UID_MAX in /etc/login.defs of the system.
We are being bitten by this issue on our kerberos-secured cluster., I am also seeing this trying to build 0.23 under Fedora. How are others working around this?, I tried the proposed patch, but it's not changing users for me unless I'm running as root (please inform me if there is a better way to handle that), so that doesn't really help my situation either.

What would be useful would be to be able to configure the conf file used for the test to modify the minimum uid, or better yet figure it out from context.

As a workaround, I hacked DEFAULT_MIN_USERID in the various C source files to set it to 500 and it works for the moment., +1  lgtm, I've committed this for 206. Leaving open for trunk, 22 and 23., Patch for 0.22, Attachments to MAPREDUCE-2377 and MAPREDUCE-2376 were intermixed. Attaching the right one., I just committed this to branch 0.22.1. Thank you Todd and Benoy.
Will close it if not needed in other versions., Integrated in Hadoop-Mapreduce-22-branch #104 (See [https://builds.apache.org/job/Hadoop-Mapreduce-22-branch/104/])
    MAPREDUCE-2376. test-task-controller fails if run as a userid < 1000. Contributed by Todd Lipcon and Benoy Antony. (Revision 1346256)

     Result = SUCCESS
shv : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1346256
Files : 
* /hadoop/common/branches/branch-0.22/mapreduce/CHANGES.txt
* /hadoop/common/branches/branch-0.22/mapreduce/src/c++/task-controller/test/test-task-controller.c
, Made Target Versions and Fix Versions consistent.
Leaving bug open because the fix is still missing from Hadoop-2 line(s) and trunk., Hoping this will be picked up in 2.0.3-alpha.
Removed 0.23 as target, since believed moribund.]