[attaching test failure log., Attaching an example patch. The reason for failure is that MAPREDUCE-463 changes the job initialization code in RecoveryManager but failed to throw Exception upon init failure. , Saw a different  test failure in TestRecoveryManager, Looks like the issue is to do with one jobtracker is going down while the other comes up. The jobtracker that is getting shutdown tries to stop the eager-task-initializer from initializing a job which inturn disables history. The new jobtracker kindof sees the disabled history and disables recovery and the testcase fails. The only thing that doesnt make sense is that minimr.stopJobTracker() calls jobtracker.close() which makes sure that all the threads are closed/stopped/terminated and does a join. How can two jobtracker instances be active at the same time?, Looked at the logs carefully. We are stuck by HDFS-53. Both RecoveryManager and EagerTaskInitializer compete with each other to init jobs and while one is busy moving files to the done folder, the other encounters an exception. , Attaching a patch that fixes the common issue to do with jobtracker instances coming up in same minute. Result of test-patch
[exec] -1 overall.  
     [exec] 
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec] 
     [exec]     +1 tests included.  The patch appears to include 3 new or modified tests.
     [exec] 
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec] 
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec] 
     [exec]     -1 findbugs.  The patch appears to introduce 1 new Findbugs warnings.
     [exec] 
     [exec]     +1 release audit.  The applied patch does not increase the total number of release audit warnings.

The findbug warning is due to refactoring., Attaching a patch that makes the jobtracker identifier unque for testcases. Result of test-patch
[exec] -1 overall.  
     [exec] 
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec] 
     [exec]     +1 tests included.  The patch appears to include 3 new or modified tests.
     [exec] 
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec] 
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec] 
     [exec]     -1 findbugs.  The patch appears to introduce 1 new Findbugs warnings.
     [exec] 
     [exec]     +1 release audit.  The applied patch does not increase the total number of release audit warnings.

The findbugs warning is due to refactoring., Observed a test timeout in one of the hudson builds. @ http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/460/testReport/org.apache.hadoop.mapred/TestRecoveryManager/testJobTracker, Saw different assertion failure for TestRecoveryManager, Attaching a patch that provides a way to pass identifier to jobtracker. Result of test-patch
[exec] +1 overall.  
     [exec] 
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec] 
     [exec]     +1 tests included.  The patch appears to include 9 new or modified tests.
     [exec] 
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec] 
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec] 
     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs warnings.
     [exec] 
     [exec]     +1 release audit.  The applied patch does not increase the total number of release audit warnings.

Running ant tests., ant tests (mapred+contrib) passed., Attaching a patch for trunk with a minor change. Changes to JobTracker.getDateFormat() are reverted. , Attaching patches for trunk and branch-0.20, Patch for branch 0.20 with removed imports., Yesterday, there was a problem with the machine on the Apache that I use for commits. Wasn't sure whether it got committed. But it actually did get committed.
Thanks, Amar!, I committed this. Thanks, Amar!, Attaching a patch for resolving conflicts when the yahoo-hadoop-distribution is rolled forwarded to MAPREDUCE-745 (aka SVN r806173).]