[Debugged this with [~venkatnrangan] and [~sseth]. There are a few issues here.

One is the HDFS delegation token renewal issue. Oozie does not handle the auth to locals mapping configuration correctly. Furthermore, there can be multiple version of this auth to local configuration in different clusters that Oozie has (specified by the oozie configuration property oozie.service.HadoopAccessorService.hadoop.configurations). The entries are keyed by the host:port of the jt/nn host:port but there is a default catch-all configuration if specific hadoop configuration is not specified. The fix on oozie side is to use the oozie catch-all configuration (specified by *= in the oozie hadoop config mapping entry) to have the right auth to local mapping and use it in all the clusters that oozie is launching jobs.

There is MR side delegation issue to. Irrespective of the renewer principal Oozie sets, the JobTracker changes the token to a local name but then expects it to be a full principal when renewwing. So, obviously Oozie cannot satisfy this requirement and the MR delegation issue has to be fixed in Jobtracker and the HDFS delegation issue will be addressed in Oozie.
, Here's a patch from [~venkatnrangan]. With this patch and with the fix for Oozie auth_to_local issue, there are no more exceptions in the jobtracker log complaining about delegation renewal issues.
, Obviously I am +1 for the patch. Tx to [~sseth] for the discussion to corner down the real fix., {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12590921/MRDelegationIssue-MR-5375.patch
  against trunk revision .

    {color:red}-1 patch{color}.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/3832//console

This message is automatically generated., Thanks [~vinodkv] and [~sseth] for help with understanding and fixing this issue.   I had created MAPREDUCE-5249 - Resolved that was duplicate.   , I just committed this. Thanks Venkat, Vinod & Sid!]