[Attaching sanitized logs from this incident.

The event that seems to be a red flag is the lost task tracker xx05.

The null pointer exception is caused by u.getHost() being null - this URI is the taskTrackerHttpAddress in a TaskTrackerStatus. The job event output doesn't show any with a malformed URL, so I suspect some kind of race.

Aside from this issue, I find it odd that GetMapEventsThread ignores exceptions. In cases like this it will cause the ReduceTask to spin forever while still reporting progress until the user intervenes., OK, from our earlier investigations, this was primarily caused by HADOOP-4744. We were never really able to reproduce this consistently and evidently the work arounds in 4744 has not helped...

GetMapEventsThread ignoring exceptions -- you are right. We probably should catch and bail out. We did this change for MAPREDUCE-318. We probably should port it to 20 as well., Yea, I looked at HADOOP-4744 as well as a couple other JIRAs but wasn't able to figure it out. If it keeps popping up, we will instrument the code with some debug logging and see if we can track it down., Do you have the TT log -- the TT whose port was returned as -1 (or null) and where the map in question got completed. We added a log to print the port number there, Unfortunately not - by the time I realized that useful info was in there it had been rotated and deleted., Hi Jothi,

This occurred again on the same cluster - same symptoms/traces/etc, so not uploading anything new. I looked through the tasktracker logs and was unable to find anything suspicious. The patch in HADOOP-4744 (r772846) is not in 0.20.0, so we don't have the port checks or info printouts.

It does appear to be very similar to HADOOP, though - the TT with the -1 port (xx28 in this case) ran several tasks before it was eventually shut down by ops. All of the jobs that had map tasks run on xx28 eventually went into this state.

We'll apply the second patch from HADOOP-4744 on this cluster and report back whether it solves the problem. Feeling pretty good that it will., bq. 'll apply the second patch from HADOOP-4744 on this cluster and report back whether it solves the problem

Thanks. Also, if we are able to reproduce the TT returning -1 port more often, I think we should get the Jetty folks involved again. The patch in H-4744 is more of a work around rather than a solution.  , The second patch from HADOOP-4744 did indeed fix this issue. Thanks.]