[Further investigation found that it is due to the ordering of elements in the classpath., Trivial patch that fixed the problem. No tests included because the bug only affects the execution of mumak staged in build/<release> directory. Manually tested that Jetty UI works., Canceling the patch now. Need to wait for the blocking jira committed first., Making a few member variables "final" so that they will always be properly initialized., Wrong jira. The patch should go to mapreduce-1104., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12422132/mapreduce-1111.patch
  against trunk revision 825083.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/169/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/169/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/169/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/169/console

This message is automatically generated., +1 the patch looks good .... , I just committed this to both 0.21 and trunk. 

thanks hong!
, Integrated in Hadoop-Mapreduce-trunk-Commit #86 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Mapreduce-trunk-Commit/86/])
    . JT Jetty UI not working if we run mumak.sh off packaged distribution directory. (hong tang via mahadev)
, Mahadev, the CHANGES.txt in trunk has a line for this JIRA in the 'trunk' section and not the 21 section. Shouldn't it be in the 21 section per guidelines ? If yes, and you plan to fix it, can you insert the line just above MAPREDUCE-1086 ?, Integrated in Hadoop-Mapreduce-trunk #118 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Mapreduce-trunk/118/])
    . JT Jetty UI not working if we run mumak.sh off packaged distribution directory. (hong tang via mahadev)
]