[Since Gridmix doesn't use/need the groups specified in users-list-file, I am planning to remove the restriction of specifying the groups in this file for RoundRobinUserResolver.

So the new format of the users-list-file expected is

user1
user2
user3
....


Just to allow backward compatibility, the list of groups can be there after user name after comma in any/all the lines.
So each line can be of the form

username[,group]*, Because the changes for the fix of MAPREDUCE-2417 and the code changes of this JIRA are at the same place in code, the combined patch of MAPREDUCE-2416 and MAPREDUCE-2417 is uploaded to MAPREDUCE-2417., Attaching patch that removes the restriction of specifying groups of each user in the users-list-file of RoundRobinUserResolver.

With this patch, the new format of each line of the users-list-file is
{code}
username[,group]*
{code}

[,group]* is just to allow older users-list-files for backward compatibility. Later, may be in the next release, we can fully remove the groups from users-list-file.

This patch is on top of the patch of MAPREDUCE-2417., Attaching new patch making some minor changes to the comments and documentation., Patch looks good to me. +1., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12477630/2416.v1.patch
  against trunk revision 1097345.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

    +1 system test framework.  The patch passed system test framework compile.

Test results: https://builds.apache.org/hudson/job/PreCommit-MAPREDUCE-Build/193//testReport/
Findbugs warnings: https://builds.apache.org/hudson/job/PreCommit-MAPREDUCE-Build/193//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/hudson/job/PreCommit-MAPREDUCE-Build/193//console

This message is automatically generated., Failed contrib tests are not related to this patch at all. I will commit this patch., I just committed this to trunk., Integrated in Hadoop-Mapreduce-trunk-Commit #652 (See [https://builds.apache.org/hudson/job/Hadoop-Mapreduce-trunk-Commit/652/])
    MAPREDUCE-2416. Remove the restriction of specifying group names in users-list file for Gridmix in RoundRobinUserResolver mode.
, Integrated in Hadoop-Mapreduce-trunk #669 (See [https://builds.apache.org/hudson/job/Hadoop-Mapreduce-trunk/669/])
    ]