[To be clear, mapred-default in hadoop is updated to not have mapred.task.maxvmem. However, M/R applications like PIG could bundle their own mapred-default which, if not updated, would break., Attaching patch fixing this issue:

if the old key is set to disabled memory limit we fall back to new value., Attaching patch for trunk., The attached patch (mapreduce-979-2.patch) has some modifications I did as part of the review. These include:

- Refactoring the code in getMemoryForMapTask, getMemoryForReduceTask and getDeprecatedMemoryValue. Specifically the last one, I made it return only the deprecated value, or disabled value if deprecated keys are not defined.
- Fixed a bug in getDeprecatedMemoryValue to handle normalization of the config values.
- Modified getMaxVirtualMemoryForTask to behave similarly as the new APIs. So, they return the new values if the deprecated values are undefined.
- Updated Javadocs for the public APIs
- Added unit tests for the negative values in configuration.

Sreekanth, can you please check if these changes are fine ?, The changes look fine to me., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12421417/mapreduce-979-2.patch
  against trunk revision 819740.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h3.grid.sp2.yahoo.net/66/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h3.grid.sp2.yahoo.net/66/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h3.grid.sp2.yahoo.net/66/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h3.grid.sp2.yahoo.net/66/console

This message is automatically generated., Attached patch for 20 branch.

The patch applies directly on 21., Fixing a small javadoc change, changing {{org.apache.hadoop.mapred.JobConf.getMemoryForReduceTask()}} to read correctly., +1 for the changes., +1 for the 20 patch, other than the correction in the javadoc similar to what's been applied for trunk. Please upload a corresponding 20 patch once the trunk patch passes Hudson., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12421841/mapreduce-979-3.patch
  against trunk revision 824238.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/159/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/159/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/159/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/159/console

This message is automatically generated., Attaching branch 20 version of the patch., Verified the diff in the 20 patch. +1. The test failure is tracked in MAPREDUCE-1029 and unrelated to this patch. I will commit this., I committed this to trunk, branch 0.21 and branch 0.20. Thanks, Sreekanth !, Integrated in Hadoop-Mapreduce-trunk-Commit #72 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Mapreduce-trunk-Commit/72/])
    . Fixed JobConf APIs related to memory parameters to return values of new configuration variables when deprecated variables are disabled. Contributed by Sreekanth Ramakrishnan.
, Integrated in Hadoop-Mapreduce-trunk #112 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Mapreduce-trunk/112/])
    ]