[Looks like the build of this patch stalled: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/431/, This stall did not occur in anything MRUnit related; it ran through tests at a normal rate for about two hours, until it got to:

{code}
[junit] Running org.apache.hadoop.mapred.join.TestDatamerge
{code}

... and hung there. Should I just resubmit the same patch? Or does someone else need to resolve issues with the join library first?
, Recycling this in the patch to see if the issue reproduces on Apache's Hudson server again., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12414378/MAPREDUCE-799.patch
  against trunk revision 801959.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 9 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/455/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/455/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/455/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/455/console

This message is automatically generated., contrib failures are just streaming., I just committed this. Thanks Aaron!, Integrated in Hadoop-Mapreduce-trunk #46 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Mapreduce-trunk/46/])
    . Fixes so all of the MRUnit self-tests run. Contributed by Aaron Kimball.
]