[Can we use Thread.setUncaughtExceptionHandler() to resolve this?, As Qi's comment indicates, the statement in the description should be changed.

'hadoop jar' will return correct exit code depending on the handling of uncaught exceptions. If the default handler has as consequence a non-zero exit code (seems to be the case, but is this fact actually documented somewhere?), then no change is needed.

'mapred pipes' still needs modifications to return non-zero exit code for improper submission., Changed summary to reflect the fact that the issue is limited to pipes., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12413047/MAPREDUCE-421.patch
  against trunk revision 793136.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/378/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/378/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/378/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/378/console

This message is automatically generated., +1, There should be a unit test for this so that it doesn't regress in the future., I realized that this was difficult to test.

I just committed this. Thanks, Christian!

, Integrated in Hadoop-Mapreduce-trunk-Commit #3 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Mapreduce-trunk-Commit/3/])
     Pipes need to set the exit return code when something goes wrong.
(Christian Kunz via omalley)
, Hey, even if this hard to write new unit tests for, could we get a note on how it was tested?  Also a note on why we were not concerned by the failed core and contrib tests?  Thanks., 1) Tested by submitting 'mapred pipes' commands with incorrect parameters. Obviously the patch does not impact correct pipes jobs, otherwise we would have seen test failures.
2) I would interpret Amareshwari's '+1' as an indication that the tests failed for unrelated reasons (unfortunately, cannot be verified, as the link to the testReport no longer exists). That test fail for unrelated reasons is not unusual -- it is my subjective impression that it happens often., Thanks for adding the extra info on your testing.  As for the core and contrib test failures, I agree that we have tests that fail for unrelated reason.  But it is good to link those failure to the jira, so that we can get momentum to get them fixed too.  It would be nice some day to have enough confidence in all the tests that we can say a failure is most likely related to the code it is testing.  Thanks again.]