[Attaching a patch that evaluates PWD env variable before setting java.io.tmpdir., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12514026/MAPREDUCE-3844.patch
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 eclipse:eclipse.  The patch built with eclipse:eclipse.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed these unit tests:
                  org.apache.hadoop.yarn.util.TestLinuxResourceCalculatorPlugin

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/1831//testReport/
Console output: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/1831//console

This message is automatically generated., Seems like a blocker to me, this causes any Hive join query to fail when table size is larger than dfs block size (for both RCFile and text format)., The test above reported by jenkins doesn't seem to be related to this patch.
I tried the test locally and it is having the same failure with and without the patch., +1  lgtm. Agree, the test failure is unrelated., Ahmed - you want the PWD resolved at task-launch time, not in the AM itself.

So, it should look like: 

{code}
java.io.tmpdir=$PWD/foo
{code}, The patch changes the evaluation of PWD to be done in the AM, whereas the original intention is to use PWD for the container (which might be different). Could we just use a relative path? Like so:

{noformat}
Path childTmpDir = new Path(YarnConfiguration.DEFAULT_CONTAINER_TEMP_DIR);
{noformat}, Also, a simple unit test should be easy to write so we don't break it again. Thanks., Updated patch using relative path (per Tom's comment). Also updated the test case., +1 pending jenkins, I did further testing and to compare this behavior on cdh, and I am seeing conflicting results for another test job which is not throwing this exception. So please hold on this patch until I confirm what is happening. , Looks like this is a dupe of MAPREDUCE-3716?, @Eli, yes it seems like that. We are picking MAPREDUCE-3716 patch to see if it resolves this Hive issue. I'll update the ticket after testing., Confirming it is a duplicate for MAPREDUCE-3716. Closing., Thanks for confirming Ahmed. Reopening just to link the other JIRA and close this one correctly as a duplicate.]