[Patch that ports the relevant portions of HADOOP-8085 to branch-0.23.  I manually tested this by bringing up a single-node cluster and visiting the ResourceManager JMX page.  The detailed metrics for YARN interfaces like {{NodeHeartbeatNumOps}} were non-zero, whereas they were zero before applying this patch.

I also manually ran the unit tests in yarn-common, and they all passed., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12533103/MAPREDUCE-4361.patch
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 1 new or modified test files.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/2500//console

This message is automatically generated., test-patch doesn't know how to test patches that aren't based on trunk.  Manually ran test-patch on branch-0.23 and got these results:

{panel}
-1 overall.  

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 4 new or modified tests.

    -1 javadoc.  The javadoc tool appears to have generated 18 warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 eclipse:eclipse.  The patch built with eclipse:eclipse.

    +1 findbugs.  The patch does not introduce any new Findbugs (version ) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.
{panel}

The javadoc warnings are unrelated to the patch (mostly involving issues in Rumen and Hadoop Extras)., +1 lgtm.  Thanks Jason!, I committed this to branch 0.23, the change is not applicable to trunk or branch-2 since it already works there., Integrated in Hadoop-Hdfs-0.23-Build #298 (See [https://builds.apache.org/job/Hadoop-Hdfs-0.23-Build/298/])
    MAPREDUCE-4361. Fix detailed metrics for protobuf-based RPC on 0.23 (Jason Lowe via tgraves) (Revision 1353580)

     Result = SUCCESS
tgraves : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1353580
Files : 
* /hadoop/common/branches/branch-0.23/hadoop-common-project/hadoop-common/src/main/java/org/apache/hadoop/ipc/Server.java
* /hadoop/common/branches/branch-0.23/hadoop-mapreduce-project/CHANGES.txt
* /hadoop/common/branches/branch-0.23/hadoop-mapreduce-project/hadoop-yarn/hadoop-yarn-common/src/main/java/org/apache/hadoop/yarn/ipc/ProtoOverHadoopRpcEngine.java
* /hadoop/common/branches/branch-0.23/hadoop-mapreduce-project/hadoop-yarn/hadoop-yarn-common/src/test/java/org/apache/hadoop/yarn/TestRPC.java
]