[Attaching a patch containing the same fix as proposed in MAPREDUCE-714 applied to this instance of the method., +1 on this fix.  Thanks Aaron!, +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12419692/MAPREDUCE-923.patch
  against trunk revision 815483.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/83/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/83/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/83/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/83/console

This message is automatically generated., No tests included: This is a trivial fix, and it's hard to really test this with a unit test since those are based on {{.class}} files, not jars. The issue comes up when people have a {{+}} in their jar file name and they can't run Sqoop MapReduce jobs successfully. Testing just requires that you run any import and make sure it works., Kevin/Aaron, have you manually verified that this fixes the problem?, We confirmed via email that this fixes it for him., +1

I've just committed this. Thanks Aaron!, Integrated in Hadoop-Mapreduce-trunk-Commit #57 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Mapreduce-trunk-Commit/57/])
    . Sqoop classpath breaks for jar files with a plus sign in their names. Contributed by Aaron Kimball.
]