[Looks like MAPREDUCE-1853 fixed a similar issue, but in trunk, the following API still does this:

  public void write(KEYOUT key, VALUEOUT value, String baseOutputPath)
, Simple patch lazily initializes the context for the job's configured output. No tests since it's covered by existing ones., The changes lgtm., +1 from me too. Can commit once hudson comes back, Ran local test-patch:

     [exec] -1 overall.  
     [exec] 
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec] 
     [exec]     -1 tests included.  The patch doesn't appear to include any new or modified tests.
     [exec]                         Please justify why no new tests are needed for this patch.
     [exec]                         Also please list what manual steps were performed to verify this patch.
     [exec] 
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec] 
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec] 
     [exec]     -1 findbugs.  The patch appears to introduce -7 new Findbugs (version 1.3.8) warnings.
     [exec] 
     [exec]     +1 release audit.  The applied patch does not increase the total number of release audit warnings.
     [exec] 
     [exec]     +1 system test framework.  The patch passed system test framework compile.

- No tests are included since it's an optimization, and covered by original tests.
- the findbugs warning is clearly bogus -- negative 7?, I ran TestMultipleOutputs and TestMRMultipleOutputs and they pass. Those are the only tests which reference the changed code. I'll commit this to trunk momentarily, Integrated in Hadoop-Mapreduce-trunk-Commit #760 (See [https://builds.apache.org/job/Hadoop-Mapreduce-trunk-Commit/760/])
    MAPREDUCE-2740. MultipleOutputs in new API creates needless TaskAttemptContexts. Contributed by Todd Lipcon.

todd : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1152875
Files : 
* /hadoop/common/trunk/mapreduce/src/java/org/apache/hadoop/mapreduce/lib/output/MultipleOutputs.java
* /hadoop/common/trunk/mapreduce/CHANGES.txt
, Integrated in Hadoop-Mapreduce-trunk #751 (See [https://builds.apache.org/job/Hadoop-Mapreduce-trunk/751/])
    MAPREDUCE-2740. MultipleOutputs in new API creates needless TaskAttemptContexts. Contributed by Todd Lipcon.

todd : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1152875
Files : 
* /hadoop/common/trunk/mapreduce/src/java/org/apache/hadoop/mapreduce/lib/output/MultipleOutputs.java
* /hadoop/common/trunk/mapreduce/CHANGES.txt
]