[This patch adds a {{release()}} method to the ConnManager API which releases the Statement associated with a returned ResultSet. If a ConnManager provides you with a ResultSet, you are responsible for calling {{rs.close()}} on the ResultSet and then calling the ConnManager's {{release()}} method to free internal resources, since we cannot depend on timely finalization. Furthermore, using methods of ConnManager which make another database call (e.g., {{getColumnTypes()}}) may internally call {{release()}}, nullifying a prior ResultSet (e.g., as returned by {{readTable()}}).  This has always been the case, but now it is explicit in the code.

This patch does not include explicit tests. Tests using the {{release()}} API are included in MAPREDUCE-1445. I used Oracle and MySQL administration tools to verify that connections are closed in a timely fashion and that open connections do not accrue over time, as they previously did., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12434593/MAPREDUCE-1444.patch
  against trunk revision 905008.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/427/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/427/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/427/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/427/console

This message is automatically generated., test failures are unrelated, +1

I've just committed this. Thanks Aaron!, Integrated in Hadoop-Mapreduce-trunk-Commit #243 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Mapreduce-trunk-Commit/243/])
    . Sqoop ConnManager instances can leak Statement objects. Contributed by Aaron Kimball.
, Integrated in Hadoop-Mapreduce-trunk #239 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Mapreduce-trunk/239/])
    ]