[This issue would pass mrowner followed by mapreduce.cluster.administrators value to HTTP server, when HADOOP-6748 is done., Patch for Yahoo! distribution incorporating HADOOP-6748 and MAPREDUCE-1754, Patch with same changes as in Y!20S patch. 

Patch does the following :
*Removes configuration "mapred.permissions.supergroup", "mapreduce.cluster.permissions.supergroup" and "mapreduce.jobtracker.permissions.supergroup". Adds configuration "mapreduce.cluster.administrators" to specify the acl for administrators.
* Acl specified via mapreduce.cluster.administrators and mrOwner (the user who started the mapreduce cluster) has access to all jobs, queues and common servlets., test-patch and ant test passed on my machine., Looked at the patch. Mostly looks good.
 - It is still possible to provide backwards compatibility for {{mapreduce.cluster.permissions.supergroup}} by simply adding the deprecated group to the new ACL list. If we do this, we should rollback the changes to ConfigUtil.java and also add one simple test.
 - TestNodeRefresh: For the change in testMRRefreshDefault(), the comment should read as // refresh by invalid user., Patch deprecates mapreduce.cluster.permissions.supergroup instead of removing it, by adding the the group to administrator acl. Also updates the testcases., Ran test-patch and ant test. All tests passed except the known failures on trunk., Should we commit this to 0.22? Sounds like it's been ready for a while, and still applies to trunk., +1 for putting this in 0.22 if tests still pass. Can someone test-patch it?, Just triggering patch build, I ran tests and test-patch on this. Failed tests:
TestTaskTrackerLocalization
TestTrackerDistributedCacheManager

test-patch results are below:
{code}
.    [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec] 
     [exec]     +1 tests included.  The patch appears to include 9 new or modified tests.
     [exec] 
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec] 
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec] 
     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.
     [exec] 
     [exec]     +1 release audit.  The applied patch does not increase the total number of release audit warnings.
{code}

Is that good to commit?, I just committed this. Thank you Amareshwari., Integrated in Hadoop-Mapreduce-trunk-Commit #589 (See [https://hudson.apache.org/hudson/job/Hadoop-Mapreduce-trunk-Commit/589/])
    MAPREDUCE-1754. Replace mapred.persmissions.supergroup with an acl : mapreduce.cluster.administrators. Contributed by Amareshwari Sriramadasu.
, Integrated in Hadoop-Mapreduce-trunk #643 (See [https://hudson.apache.org/hudson/job/Hadoop-Mapreduce-trunk/643/])
    ]