[Added null check for allocFile instead of catching and logging NullPointerException when the allocFile is null., Looks good to me, +1, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12472960/MAPREDUCE-2307.patch
  against trunk revision 1079072.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

    +1 system test framework.  The patch passed system test framework compile.

Test results: https://hudson.apache.org/hudson/job/PreCommit-MAPREDUCE-Build/132//testReport/
Findbugs warnings: https://hudson.apache.org/hudson/job/PreCommit-MAPREDUCE-Build/132//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://hudson.apache.org/hudson/job/PreCommit-MAPREDUCE-Build/132//console

This message is automatically generated., Contrib unit tests failures are not because of the patch, those have been failing for the past 28 builds (Since #105). 

Tests are not required for this patch because null check is added instead of logging NullPointerException.
, The problem seems to be because there's no longer a fair-scheduler.xml in the conf directory by default. I believe it was created from a fair-scheduler.xml.template in the past. Rather than adding this null check and ignoring the error silently, it would be better if you added back a template so that that file gets built, if this is possible after the project split., If the allocFile is null, it is already logging the message in the initialize() method. When the reloadAllocsIfNecessary() invokes with allocFile is null, it encounters NullPointerException, catching and logging that NullPointerException may not be good., Oh OK, got it. This looks good then. I will commit it if there are no other comments., I've committed this. Thanks Devaraj!, Integrated in Hadoop-Mapreduce-trunk-Commit #637 (See [https://hudson.apache.org/hudson/job/Hadoop-Mapreduce-trunk-Commit/637/])
    MAPREDUCE-2307. Exception thrown in Jobtracker logs, when the Scheduler
configured is FairScheduler. Contributed by Devaraj K.
, Integrated in Hadoop-Mapreduce-trunk #643 (See [https://hudson.apache.org/hudson/job/Hadoop-Mapreduce-trunk/643/])
    ]