[Attached ant test and test-patch result.

This patch can be verified by running unit test TestMRWithDistributedCache in a user directory with restrictive permission (e.g. 700), so no new test is added.

Before this patch, TestMRWithDistributedCache#testLocalJobRunner could fail when the test directory - test.build.data - is in a path where any ancestor doesn't have +x permissions for others, with following exception:
java.io.FileNotFoundException: File build/test/mapred/local/archive/5659425182264546915_1878220893_1556512037/file/home/biadmin/Hadoop_upstream/branch-1/build/test/data/distributed.first does not exist.
	at org.apache.hadoop.fs.RawLocalFileSystem.getFileStatus(RawLocalFileSystem.java:402)
	at org.apache.hadoop.fs.FilterFileSystem.getFileStatus(FilterFileSystem.java:251)
	at org.apache.hadoop.filecache.TestMRWithDistributedCache$DistributedCacheChecker.setup(TestMRWithDistributedCache.java:93)
	at org.apache.hadoop.mapreduce.Mapper.run(Mapper.java:142)
	at org.apache.hadoop.mapred.MapTask.runNewMapper(MapTask.java:766)
	at org.apache.hadoop.mapred.MapTask.run(MapTask.java:370)
	at org.apache.hadoop.mapred.LocalJobRunner$Job.run(LocalJobRunner.java:212)

This results from private distributed cache not localized by LocalJobRunner. The patch adds the localization for private distributed cache, so that no matter whether the test directory permission is too restrictive or not, distributed cache (public/private) will be localized., Does trunk need a patch?, This was fixed with HADOOP-8734 in branch-1-win. Maybe just integrate the same patch to branch-1?, @[~eyang] Trunk does not have this issue., Hmm, the patch here is the same as that in HADOOP-8734 for LocalJobRunner, so either way is ok., +1 looks good., I just committed this.  Thanks Ivan and Yu., The patch for HADOOP-8734 is the same in LocalJobRunner.java.  However, that patch includes a proper unit test change in TestMRWithDistributedCache.java.  @Yu, your comment above that "This patch can be verified by running unit test TestMRWithDistributedCache in a user directory with restrictive permission (e.g. 700)" is correct, but the conclusion that therefore no new unit test is necessary is incorrect.  What's necessary is a unit test that does precisely that.  The patch from HADOOP-8734 provides such a patch.

I've merged the unit test patch to hadoop-1 and hadoop-1.1., Closed upon successful release of 1.1.2.]