[@Ralph, this was from MAPREDUCE-3880 to get the RC build unblocked but yes, the right fix would be to use an env flag that could be handled in the configure step., Hi Hitesh

Understandable - would you like me to attach a patch for the env flags?
, Ralph, please do. Assigning this to you., Attaching a patch that makes it possible to build the container-executor binary that has the default system architecture. Just add -Dcontainer-executor.arch=" " to the build and you're done. This will unblock Bigtop packaging efforts and will let us use 0.23.1 as the basis of Hadoop RPM and DEBIAN packaging.

Feel free to modify to suit your needs. Or apply as is. The (unfortunate) default behavior of pretending that every workstation is fully configured with 32bit environment is preserved., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12516009/MAPREDUCE-3890.patch.txt
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 eclipse:eclipse.  The patch built with eclipse:eclipse.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed unit tests in .

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/1935//testReport/
Console output: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/1935//console

This message is automatically generated., Fixed as part of MAPREDUCE-3922 in 0.23.2 and up., Sorry I didn't get to this sooner - had a priority issue. I've read the various comments on the referenced tickets and remain somewhat confused.

Do we still default to a 32-bit build? Or do we now default to native, but allow someone to override with the new flag?




, Not a problem, either of this or MAPREDUCE-3922 could have gone in, but I preferred that one as someone validated that patch. Hope to see more contributions from you!

bq. Do we still default to a 32-bit build? Or do we now default to native, but allow someone to override with the new flag?
The later. The summary is that, by default, the build will compile to the native arch. Can be overridden by the flag.]