[MAPREDUCE-220 provides the basic metrics for CPU/Memory usage of MapReduce Tasks., MAPREDUCE-1702 needs this feature in Rumen to be able to emulate CPU/Memory usage., Attaching a patch that extracts CPU/Memory usage information from task counters and adds it to the trace file generated by Rumen. _test-patch_ and _ant tests_ (except {{TestSequenceFileInputFormat}}) passed on my box., Some comments on the patch:

(1) Why are the variable names and method names start with the word "expected" ? Since these are the values that are already seen(and not the values expected), please remove the word "expected" everywhere.

(2) You missed making changes to HadoopLogAnalyzer.incorporateCounters().

(3) You missed making changes to LoggedTaskAttempt.deepCompare().

(4) Empty comments as javadoc are seen for the new methods. Please add some comments there.

(5) Better to change the new(and may be existing ones also ?) data members of LoggedTaskAttempt private and use setters and getters everywhere because even if I change getExpectedVirtualMemorySize() to return expectedVirtualMemorySizeInBytes-2, testcase is not failing., Attaching a new patch. test-patch and ant-tests passed on my box. This patch extracts resource usage metric values (like cpu-usage, physical memory, virtual memory and heap usage) into a separate class and provides setters/getters to access it., Attaching a modified patch adding this feature to HadoopLogsAnalyzer. Modified the testcase too. test-patch and unit tests passed. , Running through Hudson., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12481438/mapreduce-2104-v1.8.1.patch
  against trunk revision 1131265.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 7 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    -1 findbugs.  The patch appears to introduce 1 new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed these core unit tests:
                  org.apache.hadoop.cli.TestMRCLI

    +1 contrib tests.  The patch passed contrib unit tests.

    +1 system test framework.  The patch passed system test framework compile.

Test results: https://builds.apache.org/hudson/job/PreCommit-MAPREDUCE-Build/347//testReport/
Findbugs warnings: https://builds.apache.org/hudson/job/PreCommit-MAPREDUCE-Build/347//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/hudson/job/PreCommit-MAPREDUCE-Build/347//console

This message is automatically generated., The findbugs issue and the unit test failure are not related to this patch., Patch looks fine to me.
+1, I just committed the latest patch to trunk. Thanks Ravi for the review!, Integrated in Hadoop-Mapreduce-trunk-Commit #715 (See [https://builds.apache.org/hudson/job/Hadoop-Mapreduce-trunk-Commit/715/])
    MAPREDUCE-2104. [Rumen] Add Cpu, Memory and Heap usages to TraceBuilder's output. (amarrk)

amarrk : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1132529
Files : 
* /hadoop/mapreduce/trunk/src/tools/org/apache/hadoop/tools/rumen/LoggedTaskAttempt.java
* /hadoop/mapreduce/trunk/src/tools/org/apache/hadoop/tools/rumen/HadoopLogsAnalyzer.java
* /hadoop/mapreduce/trunk/CHANGES.txt
* /hadoop/mapreduce/trunk/src/test/mapred/org/apache/hadoop/tools/rumen/TestRumenJobTraces.java
* /hadoop/mapreduce/trunk/src/tools/org/apache/hadoop/tools/rumen/TaskInfo.java
* /hadoop/mapreduce/trunk/src/tools/org/apache/hadoop/tools/rumen/ResourceUsageMetrics.java
* /hadoop/mapreduce/trunk/src/test/tools/data/rumen/small-trace-test/v20-resource-usage-log.gz
* /hadoop/mapreduce/trunk/src/tools/org/apache/hadoop/tools/rumen/ZombieJob.java
, Integrated in Hadoop-Mapreduce-trunk #722 (See [https://builds.apache.org/job/Hadoop-Mapreduce-trunk/722/])
    ]