[We should also move org.apache.hadoop.util.RunJar to the map-reduce sub-project., Is there no need for a 'bin/hadoop jar' for cases where people have java code that depends on Hadoop but doesn't necessarily submit jobs? For example, a jar that requires HDFS only, but doesn't want to have to set up the various classpath stuff that common/bin/hadoop-config.sh does for you?

Certainly they can write their own wrapper script themselves that sources hadoop-config.sh out of common, but having a stock one seems somewhat useful., @Arun, can you please answer Todd's question? The answer would unblock MAPREDUCE-967 and it's related issues.

I've discussed with Sharad a bit about this and he too agrees there may be generic uses of bin/hadoop jar., bq. Is there no need for a 'bin/hadoop jar' for cases where people have java code that depends on Hadoop but doesn't necessarily submit jobs?

Couldn't applications just use 'bin/hadoop -classpath' to get the required classpath rather that 'bin/hadoop jar'?

----

OTOH this might a good opportunity to deprecate the 'jar' command in favour 'job -submit' command i.e. 'bin/hadoop job -submit ...'? 
Thoughts?, bq. Couldn't applications just use 'bin/hadoop -classpath' to get the required classpath rather that 'bin/hadoop jar'?

Yea, but then you lose out on the other goodies like java.library.path, HADOOP_ROOT_LOGGER settings, etc.

bq. OTOH this might a good opportunity to deprecate the 'jar' command in favour 'job -submit' command i.e. 'bin/hadoop job -submit ...'?

What about jars that submit multiple jobs? If there were a one-to-one correspondence there that would make more sense to me., bq. What about jars that submit multiple jobs? If there were a one-to-one correspondence there that would make more sense to me.

'bin/hadoop job -submit' would be the same functionality as 'bin/hadoop jar', hence there is no dissonance?, bq. 'bin/hadoop job -submit' would be the same functionality as 'bin/hadoop jar', hence there is no dissonance?
Currently -submit takes a conf file (.xml) and submits a job with that configuration. 
Arun, do you mean we would add more functionality to -submit, i.e. to respect a jar also?, bq. 'bin/hadoop job -submit' would be the same functionality as 'bin/hadoop jar', hence there is no dissonance?

It seems strange to me from a user's perspective since the rest of the "job" commands target single jobs, and that one could submit 0, 1, or N jobs.

Going a bit off-topic from this JIRA, I think a very useful mapred command line would be: mapred job -submit -jar foo.jar -mapper com.mycorp.FooMapper -reducer com.mycorp.FooReducer -input blah -output blah -inputformat blah -outputformat blah -numReducers 3 ...  this makes sense as a generic "always one job submitted" interface, whereas we could keep "hadoop jar foo.jar" to mean "run this jar with all of the hadoop environment stuff set up", bq. Arun, do you mean we would add more functionality to -submit, i.e. to respect a jar also?

Yes, and leave 'bin/hadoop jar' as is.

bq. Going a bit off-topic from this JIRA, I think a very useful mapred command line would be: mapred job -submit -jar foo.jar -mapper [...]

You can already do that with -Dmapred.map.tasks=5 -Dmapred.reduce.tasks=5 and so on. Are you proposing we replace them with hadoop_streaming style parameters such as -mapper, -reducer and so on? The reason that is a problem is that we will have 1:1 correspondence between those switches and config knobs anyway..., bq. Are you proposing we replace them with hadoop_streaming style parameters

Yes - the idea here is that a lot of jobs duplicate a lot of common driver code. The point here is to avoid having to write a main() at all - not currently possible with hadoop jar. Obviously this interface isn't for everyone, but might feel more familiar for some.

bq. we will have 1:1 correspondence between those switches and config knobs anyway

Yea, and I think this is long term something we should work on. There are some other JIRAs floating around about the configuration framework - we should perhaps keep in mind the idea of a "flag style name" for some configuration parameters. This is probably unrelated to this particular JIRA trhough - sorry for taking us off-topic.

What would the new functionality for mapred job -submit do, exactly? Does anyone make use of the current job -submit interface? Writing an xml jobconf is a big enough pain I don't know of anyone doing it., I'm going to close this as fixed.  mapred job -submit did come about and hadoop jar is still there in 2.x for backward compatibility.  yarn jar was added and is probably preferable in most cases.]