[HADOOP-6140 is the same bug, but in branch 0.18.x, MAPREDUCE-752.zip demontrates this bug, Attached patch fixes this problem and adds junit-test for it, Better version of patch attached: it uses Configuration instead of deprecated JobConf in junit test., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12413236/MAPREDUCE-752-ver2.patch
  against trunk revision 793457.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    -1 release audit.  The applied patch generated 316 release audit warnings (more than the trunk's current 315 warnings).

    -1 core tests.  The patch failed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/384/testReport/
Release audit warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/384/artifact/trunk/current/releaseAuditDiffWarnings.txt
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/384/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/384/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/384/console

This message is automatically generated., Changes look fine. But the test failure TestCommandLineJobSubmission should be fixed.

License header should be added to TestTaskRunner.java., This patch includes license header for TestTaskRunner.java

It seams that TestCommandLineJobSubmission is unrelated to this patch. It's failing on version without my patch., Sorry, I was wrong. Test failure caused by my patch. Will fix it., On trunk, DistributedCache related code in TaskRunner was moved to TaskDistributedCacheManager via MAPREDUCE-476 and was aggressively refactored. I am not very sure whether the bug you are pointing here exists any longer or not. Can you please check?, Fixed by MAPREDUCE-787., Is this going to get a fix for 0.20.2?  , bq. Is this going to get a fix for 0.20.2? 
No, MAPREDUCE-787 did not go into 0.20.2. Please re-open this ticket if you want a fix for 0.20. Thanks., We need a fix for 0.20, since 0.21 seems to be months away yet.

Thanks., The reality was that 0.21 did come out but no one really used it. 0.20 had this issue forever until 0.20.2xx came out.  

Closing, grumpily, as fixed.]