[Uploaded a couple of patches, one intended for hadoop-0.18, which includes changes to produce proper exit code when called from a unix command line., Christian, -jobConf option is deprecated from branch 0.19, and users are advised to use -D instead., Okay, this makes the patch for the trunk out-dated.

Is there a chance for a hadoop-0.18.4 release? Then it would be nice if the submitted patch could be added (it also ensures proper exit code of pipes jobs in case of failure, see HADOOP-6030)., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12410510/patch.HADOOP-6006.0.18
  against trunk revision 785065.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/505/console

This message is automatically generated., Reversing order of file attachments for Hadoop QA , -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12411130/patch.HADOOP-6006
  against trunk revision 786278.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no tests are needed for this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 Eclipse classpath. The patch retains Eclipse classpath integrity.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/536/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/536/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/536/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Hadoop-Patch-vesta.apache.org/536/console

This message is automatically generated., {quote}
Okay, this makes the patch for the trunk out-dated.

Is there a chance for a hadoop-0.18.4 release? Then it would be nice if the submitted patch could be added
{quote}

Unfortunately, neither patch applies to an active branch. There could be an 0.18.4 release if someone elects to [create one|http://wiki.apache.org/hadoop/HowToRelease]. There are a handful of important, unreleased [changes|https://issues.apache.org/jira/browse/HADOOP/fixforversion/12313628] committed to that branch, but nobody has rolled an official release.

This probably doesn't qualify as a blocking bug for 0.18 unless it used to work in a previous release., -jobconf be dead, yo.]