[The two aspects of making the job-history cleanup period configurable seem to be: 
# unit of time to configure it on (minutes vs days)
# directory naming to reflect the creation time

For the directory naming, we should be able to leave it as yyyy/mm/dd format. If the cleanup period is in hours/minutes, we can read the file modification time and use that to do the comparison. Trunk currently uses the modification time even for higher values of cleanup period (days) and has a TODO note that we should use the directory structure instead to reduce the load on HDFS.

With regards to the unit of time for configuration, minutes seems to be the better option.

Thoughts?, Ah, didn't see this JIRA until now.  The patch I'm working on for MAPREDUCE-4676 leaves the directory structure the same and deletes based on the modification time (only checking files in old enough directories).  For the testJobHistoryCleaner test, it would be ideal for it to be configurable to milliseconds.  What do you think?, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12546397/MAPREDUCE-4643.patch
  against trunk revision .

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/2874//console

This message is automatically generated., Thanks for your patch, Sandy.

The patch looks like it should work for (max-age > 1 day). How do we handle significantly smaller ages? We should probably address it the same it is addressed in trunk - use the modification time? Thoughts?, It should work for significantly smaller ages as well.  It uses the directory names to decide which to look in, but checks the modification times on the files inside them., I spoke with Karthik and we resolved that the patch does work for smaller ages, but that for directories older than a day, it could work more efficiently by deleting the entire directory., Thanks for the patch, Sandy. It looks like it should work.

Minor comments:
# In {{JobHistory.directoryTime()}}, the initial comments do not apply anymore and can be removed
# Do you want to add a test to verify the timely deletion of history files? (Now, I see that this test would fix MAPREDUCE-4676 as well). Do you think you can add a test here and mark the other one duplicate?

, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12546425/MAPREDUCE-4643-branch1.patch
  against trunk revision .

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/2875//console

This message is automatically generated., Uploaded a patch that fixes the comments and includes the test, {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12546557/MAPREDUCE-4643-branch1.patch
  against trunk revision .

    {color:red}-1 patch{color}.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/2877//console

This message is automatically generated., using ms as unit for a value that will normally be in days seems a bit off. I understand that for testing purposes we want something short enough, can we use seconds instead? (saving 3 digits). Ideally we should be able to specify units on the time interval (ie '2ms', '2d'), but this is completely out of scope of this JIRA. Thx, trunk already uses milliseconds.  Should branch-1 be different?, oh well. looks good, one small NIT though

{code}
+    return result.getTimeInMillis() - 
+        result.getTimeInMillis() % HistoryCleaner.ONE_DAY_IN_MS;
{code}

Assign getTimeInMillis() to a local var and then use that for the expression above.

, I uploaded a patch that makes that revision., {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12548332/MAPREDUCE-4643-branch1-2.patch
  against trunk revision .

    {color:red}-1 patch{color}.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/2918//console

This message is automatically generated., uploaded refresh patch that includes test, {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12568109/MAPREDUCE-4643-branch-1-3.patch
  against trunk revision .

    {color:red}-1 patch{color}.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/3307//console

This message is automatically generated., +1. Thanks Sandy - the latest patch looks good to me., patch looks good, 2 things though:

* mapred-default.xml should have the default values as values (instead of empty)
* The TestJobHistory test takes 333secs, this seems a bit too much., Latest patch adds the default values into mapred-default.xml and takes out the test, which will be covered in MAPREDUCE-4676., {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12568349/MAPREDUCE-4643-branch-1-4.patch
  against trunk revision .

    {color:red}-1 patch{color}.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/3315//console

This message is automatically generated., Latest patch adds test that runs in less than a second., {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12568512/MAPREDUCE-4643-branch-1-5.patch
  against trunk revision .

    {color:red}-1 patch{color}.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/3319//console

This message is automatically generated., Cool test, Sandy. The latest patch looks mostly good; minor comments:
# We should rename {{run(long now)}} to {{runCleaner(long now)}} to avoid confusion.
# The test doesn't seem to test the case where only some of the files within a directory need to be deleted. To add this case to the test, we might have to calculate the paths etc. instead of hardcoding them.  , Latest patch renames run and tests the case where only some of the files within a directory need to be deleted., {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12568649/MAPREDUCE-4643-branch-1-6.patch
  against trunk revision .

    {color:red}-1 patch{color}.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/3320//console

This message is automatically generated., +1. did a clean build and run relevant test., Thanks Sandy. Committed to trunk., The test appears to be failing occasionally due to time zone issues.  Uploading an addendum patch that fixes the failure., {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12569119/MAPREDUCE-4643-branch-1-addendum.patch
  against trunk revision .

    {color:red}-1 patch{color}.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/3330//console

This message is automatically generated., Thanks for following up Sandy, committed addendum to branch-1., Closed upon release of Hadoop 1.2.0.]