[This should fix the issues being faced because of job-name having underscore also., The current code in the job history browser claims to search job names for keyWORDS in the instructions it paints on the line beneath the search box, but it actually searches for substrings.  Therefore, if a job's job name is {{clockwork orange}} but your search key is {{work or}} , the job matches the search.

Which do you think is more desirable?  Do you people out there in cyberspace think that we should change the documentation to match the code, or the code to match the documentation?, Hi Harsh, I have patch ready for this issue and submitted the same. Please review this patch.

In trunk, search is based on user name and job id, problem is only with the user name and job id is working fine. 
, Based on on the discussion in mapreduce-dev mailing list, MRv1 is going to be replaced by MRv2 in trunk, which doesn't have this problem. I suggest that you target the fix to the "stable" 0.20.20x branches., This issue is not present in  0.20.4 branch because the history search itself is not there. It is already rectified in 0.20.204 branch.

As I understand MRV2 will be merged to trunk and still the MRV1 features will be available(may be for some time). It will be useful if we merge this patch to trunk whoever uses the current mapreduce model. The same patch can be applied to 0.21 and 0.22 branches also., Sorry to come in late, the patch has gone stale. Can you please rebase? Thanks.

Given this is not an issue with MRv2 should we still commit this? I'm happy to, but not sure it's useful. Thanks., It is not applicable to MRV2. This issue still exists with 0.22 version. Provided patch for 0.22 version. , -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12493617/MAPREDUCE-1554-0.22.patch
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/649//console

This message is automatically generated., Only applies to a dead version of Hadoop. Closing as won't fix.]