[Daniel, I can see calls to setupJob() and cleanupJob() in branch-0.20's version of LocalJobRunner, the runner that is used for running jobs in local mode. They are definitely there in 0.21 and recent versions. Can you throw more light as to what you meant by "not working in local mode"?, Hi, Vinod, 
I mean setupJob and cleanupJob does not get called in local mode. I am using 0.20.1. , I guess you are using a custom OutputCommitter. Can you show your job submission code, how you are submitting the job in local mode? And how you are setting up the client to use your custom OutputCommitter?, Hi, Vinod, 
I am a Pig developer and we are refactoring part of Pig code. We use a custom OutputCommitter. We setup our OutputCommitter through custom OutputFormat. The actually code is too big to post here, but we do not use anything fancy for job submission. Here is some the client code look like:

job.setOutputFormatClass(PigOutputFormat.class);
......
jobCtrl.addJob(job);
......
Thread jcThread = new Thread(jobCtrl);
jcThread.start();

We see everything is ok in map-reduce mode. But in local mode, we didn't see the above mentioned hooks get called. Is that because we are using 0.20.1, and this is fixed in the newer version?, You will have to explicitly set OutputCommitter using JobConf.setOuputCommitter(Class), otheriwise the default FileOutputCommitter will be used. OutputCommitter class configuration is not derived from the configured OutputFormat., Forget to mention we override OutputFormat.getOutputCommitter() to setup OuputCommitter. , I see. There in lies the problem with the local runner. LocalJobRunner gets the OutputCommitter class only from the configuration irrespective of whether it is old job API or the new job-API. In case of the real-code, OutputCommitter is obtained from OutputFormat if it new API and from configuration if it is old style job API.

I am guessing you are using the new Job/JobControl API. Can you confirm? If it is, which is what I suspect, LocalJobRunner should address the above difference.

Thanks for being patient and giving enough hints!, I work on the pig team too - yes, we are using the new Job API and old JobControl class (since there was no JobControl based on new api in hadoop 0.20.1), Resolved via MAPREDUCE-3563.]