[patch v1:

* mvn-install no longer install si test artifacts
* mvn-si-install installs si artifacts as well, apparently, this patch needs to include fix similar to [this HDFS patch|https://issues.apache.org/jira/secure/attachment/12466597/HDFS-1543.patch], Again, cos, your patch is strictly a bug fix to your "smoke-test" refactor and orthogonal to this issue., luke, this patch is a complement to yours which actually solves time issue rather than pushing it away., bq. this patch is a complement to yours which actually solves time issue rather than pushing it away. 

It doesn't solve the O( n ) aspect weaving time and more importantly It doesn't solves the coupling issue (brittle to API changes) I mentioned in the common issue., Well, aforementioned brittleness is a great benefit as well as a downside of code injection. We have embraced  it with open minds and have benefited from it. 

Besides, this MR patch doesn't decouple FI tests from test-core target. Is it intentional or just inaccurate?, bq. Well, aforementioned brittleness is a great benefit as well as a downside of code injection. We have embraced it with open minds and have benefited from it.

The cost seems to outweigh the benefit though, according to many devs.

bq. Besides, this MR patch doesn't decouple FI tests from test-core target. Is it intentional or just inaccurate?

Your own patch from MAPREDUCE-1084 didn't include the run-test-mapred-fault-inject in test-core. Needless to say, we don't miss it at all :), Whatever suites you ;), -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12466502/mr-2221-trunk-v1.patch
  against trunk revision 1074251.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://hudson.apache.org/hudson/job/PreCommit-MAPREDUCE-Build/46//console

This message is automatically generated., Sorry to come in late, the patch has gone stale. Can you please rebase? Thanks.
]