[Attaching patch which fixes this problem; now the same configuration data will flow forward through the map task. This patch also contains a test case that highlights the problem., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12435649/MAPREDUCE-1486.patch
  against trunk revision 909241.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 2 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/448/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/448/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/448/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/448/console

This message is automatically generated., I looked at the failing testcases reported by Hudson. None of them reproduced locally:

* TestNodeRefresh seems to be bit by the "Hudson doesn't get the whole classpath" issue that's been coming up recently. The NoClassDefFoundErrors are really bizarre; does anyone have any insight into why this has hit Hudson in the last couple weeks?
* TestMapReduceLazyOutput seems to have trouble initializing a MiniDFSCluster and getting the port it wants; this is unrelated to the patch, as mini-dfs initialization happens outside any MapContext.
* TestMultipleLevelCaching has a broken test; I filed MAPREDUCE-1508 to address this. Unrelated failure (looking at the code at TestMultipleLevelCaching.java:122, it's probably a MiniDFS init problem like TestMapReduceLazyOutput)
* TestJobOutputCommitter also passes locally., recycling hudson to check TestJobOutputCommitter, +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12435649/MAPREDUCE-1486.patch
  against trunk revision 911519.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 2 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h3.grid.sp2.yahoo.net/328/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h3.grid.sp2.yahoo.net/328/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h3.grid.sp2.yahoo.net/328/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h3.grid.sp2.yahoo.net/328/console

This message is automatically generated., This change means that the configuration that the map context uses does have the SKIP_RECORDS boolean parameter set correctly. More generally, do we know that job isn't updated in other places - e.g. in the output collectors? Could we pass a single Configuration instance through to all of these dependents?, Sorry, meant to say "the configuration the map context uses does *not* have the SKIP_RECORDS boolean parameter set correctly"., Cancelling while feedback is addressed.]