[Patch which fixes mapred.FileOutputFormat where a different FileAlreadyExistsException was used (from 0.20 to trunk). Also adds back some deprecated methods that were removed from TaskAttemptID and TaskID. These regressions were found using JDiff in the process of working on MAPREDUCE-1623., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12442910/MAPREDUCE-1725.patch
  against trunk revision 938249.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/143/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/143/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/143/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/143/console

This message is automatically generated., Test failure is unrelated (MAPREDUCE-1727). No new tests for adding back removed deprecated methods (they delegate to new ones) - I tested for compatibility using JDiff in MAPREDUCE-1623., Added back some more methods that were removed from 0.20., Updated to apply to trunk. I'd appreciate it if someone could review this. Thanks., This includes MAPREDUCE-1045, except for the following:
{noformat}
+  public static Path[] getInputPaths(JobConf job) throws IOException {
+    return CombineFileInputFormat.getInputPaths(new Job(job));
+  }
{noformat}
It's probably not worth restoring.

+1, I've just committed this.

BTW I can't see the getInputPaths() method on the 0.20 version of CombineFileInputFormat, so I don't think it's a compatibility issue. ]