[The original motivation of this JIRA is trying to fix the following scenario. In Azure, the default file system is set as ASV (Windows Azure Blob Storage), but we would still like the system directory to be in DFS, because we don't want to put such files in ASV that charge Azure customers fee. Thus, we want to change JobTracker.java to allow that.

The problem in the current JobTracker.java is that we want to use makeQualified() to assemble a path. But getSystemDir() uses the wrong fs object to call fs.makeQualified(), if default (e.g. Azure in our scanerio) and "mapred.system.dir" are using different file systems. In the proposed fix, we rely on FileSystem.get() to choose the appropriate file system according to "mapred.system.dir". It falls back on the default file system if the scheme is not there. 

Although the original motivation is trying to fix the problem for Azure, this fix also applies to other scenarios where the default file system and "mapred.system.dir" are supposed to use different file systems.

A unit test will follow.
, I updated the patch. It includes the unit test. I also made some change to MAPREDUCE-5224.patch because the previous one is not complete. In many places, the default file system is used to access the system directory rather than only in getSystemDir(). Thus, this requires much more changes to the original code. 

I still have some questions I am not quite sure.
1. In the constructor of JobTracker:
try {
FileStatus systemDirStatus = systemDirFs.getFileStatus(systemDir);
if (!systemDirStatus.isOwnedByUser(
mrOwner.getShortUserName(), mrOwner.getGroupNames()))
{ throw new AccessControlException("The systemdir " + systemDir + " is not owned by " + mrOwner.getShortUserName()); }
if (!systemDirStatus.getPermission().equals(SYSTEM_DIR_PERMISSION))
{ LOG.warn("Incorrect permissions on " + systemDir + ". Setting it to " + SYSTEM_DIR_PERMISSION); systemDirFs.setPermission(systemDir,new FsPermission(SYSTEM_DIR_PERMISSION)); }
} 
Basically, I have changed the file system used to access the system dir. But I am not quite sure if I should change the two IF statements, because the file permission might be a problem.
2. LocalJobRunner has a method getSystemDir() as well. It uses the default file system to access the system directory.
public String getSystemDir()
{ Path sysDir = new Path(conf.get("mapred.system.dir", "/tmp/hadoop/mapred/system")); return fs.makeQualified(sysDir).toString(); }
I am not quite sure if I need to change this as well.
Thanks!, Xi, thanks for the patch!

bq. But I am not quite sure if I should change the two if statements, because the file permission might be a problem.

These two checks should be kept as JobTracker needs to enforce correct directory owner and permissions.

I think it would be good to add an assert in the test to make sure 'correctSysDirPath' is indeed created on the local file system, and not on the HDFS.

+1 on the rest of the change., Thanks Chuan., Thanks Xi for the patch! I think this is close, have some comments below which should be easy to address. 

1. JobTracker.java: Lines should not exceed 80 chars per Hadoop coding guidelines.
{code}
FSDataOutputStream out = FileSystem.create(systemDirFs, tmpRestartFile, filePerm);
{code}
Same comment for other changes in the patch.

2. I really don't think it is necessary to introduce IOException to so many methods and interfaces for the reasons in this Jira. I would change JobTracker#getSystemDir() to fallback to the default value and log a warning in case {{FileSystem.get()}} throws.

3. Should JobTracker#RecoveryManager#checkAndAddJob() use systemDirFs?

4. I would rename the {{JobTracker#fs}} local member to {{defaultFs}} to signify its meaning and avoid possible confusion in the future. I actually don’t think you need to keep both defaultFs and systemDirFs as members. The only other place where you need defaultFs is {{JobHistory#initDone}} and you should be able to query for it locally. 

5. Let's rename the test to TestJobTrackerWithNonDefaultFS

6. What is the expected behavior for TestSysDirOnNonDefaultFS when your code changes are not applied? Looks like the setUp step is failing. I would prefer if we could have the test case fail instead. 

7. TestSysDirOnNonDefaultFS.java: Please add a more verbose comment on the intent of the test.
{code}
/**
 * Class to test jobtracker's system dir
 */
{code}

8. TestSysDirOnNonDefaultFS.java: Why not let setUp throw the IOException() in case of an error?

9. TestSysDirOnNonDefaultFS.java: Please use JUnit assertEquals method to validate that the expected and the retrieved values are equal.

10. TestSysDirOnNonDefaultFS.java: Can we also add validation that mapred system dir is created in the right place by checking for its existence. 

11. Would be good to understand if there are some changes needed to get the equivalent functionality in YARN. I would be fine with addressing this via a separate Jira.

, Thanks Ivan for the comments. That is of great help! I will check my code:), Hi Ivan, I was addressing your fourth comment. I have one question.
There are two methods:
----------------------------------------------------------------------------- 
 /**
   * Grab the local fs name
   */
  public synchronized String getFilesystemName() throws IOException {
    if (fs == null) {
      throw new IllegalStateException("FileSystem object not available yet");
    }
    return fs.getUri().toString();
  }
 --------------------------------------------------------------------------------- 
  
    /**
   * Get JobTracker's FileSystem. This is the filesystem for mapred.system.dir.
   */
  FileSystem getFileSystem() {
    return fs;
  }
--------------------------------------------------------------------------------
I am a little bit confused. I think for getFileSystem() it is clear. We still return the systemDir's file system, so we should change this fs to systemDirFs which I omitted in my previous patch.

For getFilesystemName(), what does fs stand for in this context, default fs or systemDir's file system. I guess it denotes the latter one. Right?

Thanks
, Sorry for the format! The system changed my text to something else because of the special symbols. , Thanks Xi for addressing the comments!

bq. For getFilesystemName(), what does fs stand for in this context, default fs or systemDir's file system. I guess it denotes the latter one. Right?
Right, I also see it as a systemDir., Thanks Chuan and Ivan.
1. For Chuan's comment: I added an assert to check this dir exists indeed. This also addresses Ivan's 10th comment.
2. For Ivan's comment: 
a. For comments #1, 3, 5, 7, 9, 10, I just followed the comments.
b. For comment #2: I personally think it would be better if we can throw out an exception rather than swallowing it and setting it back to default file system. As mentioned by Mostafa (offline),  for example, if someone configured the system dir as http://www.awesome.com/system, then with the fallback solution the exception saying "HTTP is not supported" will be swallowed and we'll set the system directory as just /system in the default file system, which doesn't seem like good behavior. We may want someone explicitly know/handle this at the moment  this happens.
c. For comment #4: I renamed the JobTracker#fs to defaultFs and still keep it just for possible future use/reference of this variable. 
d. For comment #6, 8: I put the initialization of MiniDFSCluster, MiniMRCluster in the test case and let setUp() just construct a configuration. In this way, we don't have to throw IOException in setUp() and test case would fail if my code changes are not applied.
, Thanks Xi, you're almost there! A few additional comments below. Once you address those, +1 from me

1. You'll have to impersonate the MR owner when you're querying for the systemDirFs (same routine as with defaultFs). Sorry, I missed this when I initially reviewed the patch.
After:
{code}
        if (defaultFs == null) {
          defaultFs = mrOwner.doAs(new PrivilegedExceptionAction<FileSystem>() {
            public FileSystem run() throws IOException {
              return FileSystem.get(conf);
          }});
        }
{code}
add the following:
{code}

        if (systemDirFs == null) {
          systemDirFs = mrOwner.doAs(new PrivilegedExceptionAction<FileSystem>() {
            public FileSystem run() throws IOException {
              Path sysDir = new Path(conf.get("mapred.system.dir",
                "/tmp/hadoop/mapred/system"));
              return FileSystem.get(sysDir.toUri(), conf);
          }});
        }
{code}

Once you implement above you should be able to simplify getSystemDir() by assuming that systemDirFs is different than null. This will allow you to get rid of the IOException (#2 comment from my initial review).

2. Nit: JobTracker.java: It seems that a tab slipped in:
{code}
      if (systemDirFs.exists(restartFile)) {
    	systemDirFs.delete(tmpRestartFile, false); // delete the tmp file
      } else if (systemDirFs.exists(tmpRestartFile)) {
{code}
I also see some invalid indentation:
{code}
        // disable recovery if this is a restart
          shouldRecover = false;
{code}
Please correct.

3. Please remove try/catch from TestJobTrackerWithNonDefaultFS#tearDown since it can possibly mask a problem. Instead you can add IOException to the throws clause of the method:
{code}
public void tearDown() throws IOException {
{code}

4. TestJobTrackerwithNonDefaultFs#testSystemDir: No need for the try/catch block in the test, please remove. The test will fail if any of its asserts fail.

5. Can you also please change TestJobTrackerWithNonDefaultFS#MAPRED_SYS_DIR to the following:
{code}
  private final String MAPRED_SYS_DIR =
      System.getProperty("test.build.data", "/tmp") + "/mapred/system";
{code}
Guideline is for all local test files to go under test.build.data folder.

6. Nit: TestJobTrackerwithNonDefaultFs: You can use assertTrue instead:
{code}
    assertEquals("Check if the system dir exists ", 
        FileSystem.get(sysDirPathURL, conf).exists(sysDirPath), true);
{code}
Btw, when you’re using assertEquals, you should place the expected value as the first arg, and the test value as the second arg. For example, assertEquals(true, fs.get().exists()).
, Thanks Ivan for your detailed comments. These are of great help!, Looks good to me. Some small comments mostly about the unit test:
# You don't have to catch(Exception) to call tearDown(), nor to print stack trace. tearDown() will always be called automatically, and the exception will be displayed by the test framework. Please remove the try..catch.
# Use assertTrue(cond) instead of assertEquals(cond, true)
# Even though this is a patch for branch-1-win, since it's a new test you should consider writing it in JUnit 4. See [http://wiki.apache.org/hadoop/HowToDevelopUnitTests] for guidance.

Other than that, +1 on my side., Above comments have been addressed. Thanks.

BTW, I changed JobTracker#defaultFs back to fs, because some other codes in the same package use this "fs" (fs was originally defined with no access modifier)., Thank Ivan for MAPREDUCE-5224.5.patch. 
Here is the reason (offline emails from Ivan) for posting this new patch.

1. Given that fs is indeed used on some other places, we have to account for that as well (these tests actually want to close the system dir fs). 
2. There is no need to use the default file system for the jobhistory. There is another (orthogonal) bug here. Job history completed location also assumes the default FS what is not correct. This should be a separate Jira. 
3. This would make the prod code change really simple.

, Thanks Xi for taking time to address all comments! Latest patch looks good to me, +1

bq. There is no need to use the default file system for the jobhistory. There is another (orthogonal) bug here. Job history completed location also assumes the default FS what is not correct. This should be a separate Jira.
I filed a Jira on this: MAPREDUCE-5277
, PS. I verified that the new test passes on Linux and on Windows., Thanks Ivan!, I already +1ed on the latest patch, will commit shortly., Fix committed to branch-1-win. Thank you Xi for the contribution!]