[Attached screenshot of the issue, Could you elaborate a bit more? What version of Hadoop are you using? What is the value of mapreduce.shuffle.port in mapred-site.xml?, Good observation!!!
 I think this kind of approach might be done(I am not convinced) intentionally to accept and download any incoming requests. 
Is this is intentional?  [~vinodkv] [~jianhe] Please share your thoughts.., 
bq.What version of Hadoop are you using?
I am using hadoop-2.4.1 in my cluster 

bq.What is the value of mapreduce.shuffle.port in mapred-site.xml?
I did not configure any value for mapreduce.shuffle.port. The port here is default shuffle port, I have uploaded a patch with the fix. Please review. I have tested the patch and attached the screenshot of the result, [~ashutosh_jindal], [~rohithsharma], so the goal is to not start it on all interfaces? Any specific reason why not?

This is too old a code for me to remember whether this was intentional or not :), [~vinodkv]  The reason here is security. In case of a dual IP machine, we can restrict shuffle port to bind to a specific IP instead of all the interfaces., [~vinodkv] another reason is saving costs. Some hosters offer servers with "internal" and "external" interfaces. You really want your services to bind to the internal interfaces, if you have to pay for any traffic on the external interface., Hi [~vinodkv] & [~messner],
In terms of security, many tools will report this as a threat too, but the fix which is given here, not sure will it have impact on existing systems (break in compatibility), so i suggest based on a new config we can to determine whether to bind on all the interfaces or the IP bound to the hostname (as per the patch).
Similar issue exists with AM's tracking url too. Based on your feed back can rework on the patch and include required changes for AM too., hi [~jianhe],[~vinodkv] & [~devaraj.k],
          If you guys have bandwidth can one of you support us with this jira ? , I think it would be good to go with user use case. One doubt I have is there are some use cases where two networks are bounded for running jobs. If shuflle port bining to specific ip and ip tables are modified for network bounding, jobs will not run. 
Any thoughts on particular use cases level? , hi [~rohithsharma], 
Well we can have a configuration such that it can be configured with following possible values : {{*/hostname-IP/<IP.pattern/subnet>}}
* ??"*" / "0.0.0.0"?? then bind to all i.e use {{0.0.0.0}} (existing implementation) which we can set as default value
* ??"hostname"?? get the first ip to which the hostname is bound to or by default what ever {{new InetSocketAddress(getLocalHostName(), port)}} can give
* ??"<IP.pattern/subnet>"?? first IP address matching the particular subnet mask/IPaddr  pattern can be taken, Hi [~jianhe],[~vinodkv], [~rohithsharma] & [~devaraj.k],
Seems like no one is responding for this jira, If its not of importance will close it after 2 days as won't fix.
, [~vvasudev] can you share your thoughts on this ?, Thanks [~vvasudev], as per our offline discussion i can conclude for this as follows :
# *Node Manager MR Shuffle IP :*  we can just have new config parameter where in we can add new NM Bind IP in the MR config which will be used by the ShuffleHandler. (as none of configurations are there to be exposed from NM to Auxillary service, i think this is the only way)
# *AM Tracking URL's IP :*Raised YARN-4119 jira which exposes NM bind address as an env and MR App master can get this Bind address from env and use it for Tracking URL., Shouldn't the fix follow the usual configurable approach as with other binding properties in Hadoop? A property X that's set to 0.0.0.0 by default, but can be set to a hostname/IP if it needs to be limited. Provide the property's value as an InetAddress (with the port property) to the bind command.

The current patch would cause a limitation of those that already are relying on the wildcard feature today., Hi [~qwertymaniac], 
As mentioned in my earlier [comment|https://issues.apache.org/jira/browse/MAPREDUCE-5938?focusedCommentId=14560669&page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel#comment-14560669] Patch was given earlier by my colleague  but as it had compatability issues did no go ahead with it. I tried to merge the focus of AM tracking URL to here because of which it got delayed. Will update the approach which i was planning shortly for AM tracing url and shall provide the patch., Any update on this issue..

As Naga suggested, can we go with new config for shuffle handler..? 
new config can be like  *mapreduce.shuffle.address* and depreciate *mapreduce.shuffle.port* 

any thoughts..?

So we can change defect summary..?

I am not able to change the summary,[~ajisakaa] can you help on this..? can you give permission to change the defect summary.
, Hi [~brahmareddy], I added admin and committer roles to you., Thanks a lot., Yes, similar to *mapreduce.shuffle.port* we can have this as an mapred-site.xml configuration in each of the NM's mapred-site.xml, they can modify to a specific value.
Note sure whether we can support *"0.0.0.0:$\{mapreduce.task.profile.params\}"*  as default value instead of deprecating *mapreduce.shuffle.port*. If it can be configured in this way then it would have better compatability
]