[Only tested with 1.0.0, Only tested on a fresh version of 1.0.0, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12516880/HADOOP-oracleDriver-src.patch
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/1988//console

This message is automatically generated., quick look at the patch
* includes diffs from other files; please strip
* system.out code. please replace with (guarded) log at debug
* lots of things commented out. Just delete them, as SVN is for rollbacks
* There seems (at a quick glance) to be a fair bit of duplication between the oracle/not oracle branches -that's going to create a lot of maintenance downstream, and complicate testing. It'd be nice to have some way of building the operations that isn't a complete fork
* Testing. Is there some way to have some tests that can be enabled/disabled for different databases. I doubt there are any now, and this could be a good time to start
* It's best to have these patches against trunk/0.23+ and then pushed back into 1.x. There must not be any fixes in that branch that aren't also in trunk.

Finally, I don't know enough about the DB classes to actually assess whether or not the code actually works. I'll leave that to others, \\
\\
| (x) *{color:red}-1 overall{color}* |
\\
\\
|| Vote || Subsystem || Runtime || Comment ||
| {color:red}-1{color} | patch |   0m  0s | The patch command could not apply the patch during dryrun. |
\\
\\
|| Subsystem || Report/Notes ||
| Patch URL | http://issues.apache.org/jira/secure/attachment/12516880/HADOOP-oracleDriver-src.patch |
| Optional Tests | javadoc javac unit findbugs checkstyle |
| git revision | trunk / f1a152c |
| Console output | https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/5489/console |


This message was automatically generated., \\
\\
| (x) *{color:red}-1 overall{color}* |
\\
\\
|| Vote || Subsystem || Runtime || Comment ||
| {color:red}-1{color} | patch |   0m  0s | The patch command could not apply the patch during dryrun. |
\\
\\
|| Subsystem || Report/Notes ||
| Patch URL | http://issues.apache.org/jira/secure/attachment/12516880/HADOOP-oracleDriver-src.patch |
| Optional Tests | javadoc javac unit findbugs checkstyle |
| git revision | trunk / f1a152c |
| Console output | https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/5492/console |


This message was automatically generated.]