[this fixes the gridmix2 build failure.

Steps:
checkout mapred trunk

ant package -Dforrest.home=<forrest.home> -Djava5.home=<java5.home>
cd build/hadoop-mapred-0.21.0-dev/src/benchmark/gridmix2
ant 

This will generate gridmix2 jar 

tnx!
, I checked outa  fresh trunk, applied this patch and compiled as mentioned. The gridmix.jar file got generated successfully after a successful compilation., For developers, it's often easier if it picks up jars in the build dir first; running the package target takes a long time., ${hadoop.dir}/build directory doesnt exist in tar.gz package.

When someone tries to build gridmix2  by untarring hadoop-mapred-0.21.0-dev.tar.gz 
${hadoop.dir}/build doesn't exit and build would fail., +1 for Chris's patch.
I did ant tar.
cd src/benchmarks/gridmix2
ant
This created gridmix.jar

With Giri's patch, though I was able to build jar, following the steps described by Giri, when I run I was facing problems with runtime ClassNotFoundException.
, ClassNotFoundException is due to bin/hadoop script after project split.  It is nothing to do with patches.
bq. For developers, it's often easier if it picks up jars in the build dir first; running the package target takes a long time.
+1
I think, we should modify gridmix2/build.xml to pickup jar files properly either it is in src directory or build directory., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12412038/659-1.patch
  against trunk revision 790543.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/336/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/336/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/336/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/336/console

This message is automatically generated., Increasing the priority as gridmix compilation is broken, To catch the compilation failures early, gridmix should be added to the binary/package target itself.

User should be able to build the jar just by doing in ant in the src/benchmarks/gridmix2 directory. If there are any dependencies with streaming and test, they should be added to build.xml, Sorry, I hadn't placed a watch on this issue.
{quote}
When someone tries to build gridmix2 by untarring hadoop-mapred-0.21.0-dev.tar.gz
$\{hadoop.dir\}/build doesn't exit and build would fail. 
{quote}

The change was a superset of the original patch; it only adds the build dir to the classpath, so gridmix2 will be linked against those classes/jars if they exist.

{quote}
To catch the compilation failures early, gridmix should be added to the binary/package target itself.

User should be able to build the jar just by doing in ant in the src/benchmarks/gridmix2 directory. If there are any dependencies with streaming and test, they should be added to build.xml
{quote}

This is reasonable, but gridmix2 shouldn't be a top-level target, it has too many dependencies to model cleanly in our current setup, and it's not a critical component. We could move it to contrib, but we don't have a way to model dependencies between contrib modules. I guess it could go into tools, but that's a stretch. For now, fixing the compilation error seems sufficient., created a different target for developers 
dev-build 

cd trunk
ant all-jars - this would create all the jars of mapreduce
cd src/benchmarks/gridmix2
ant dev-build 

this would create the gridmix2 jar.

others can continue using the same target as before.

, I just committed this.
Thanks for the comments., Integrated in Hadoop-Mapreduce-trunk #40 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Mapreduce-trunk/40/])
    . Fix gridmix2 compilation. Contributed by Giridharan Kesavan.
]