[Why not make the debs consistent with the rpms in this respect? Eg HADOOP-7459 should cover debs as well right?, For power user, it seems trivial to install Java and configure it correctly.  However, it maybe better to express our dependency for package management system to install Java for novice user.  Hence, automated deployment system like yum, apt-get can download required dependency correctly.  I am uncertain removing JDK dependency is a good idea.  I agree that deb and rpm dependencies should setup to be the same.  We should have a resolution to choose HADOOP-7483 or HADOOP-7459 before we proceed., Remove open jdk dependency., bq. I am uncertain removing JDK dependency is a good idea. I agree that deb and rpm dependencies should setup to be the same. We should have a resolution to choose HADOOP-7483 or HADOOP-7459 before we proceed.

Doesn't your +1 on HADOOP-7459 indicate you are in favor of removing the java dependency? There's no real difference between rpms and debs in this respect., Eli, thank you for point out the internal conflict in me, and I retracted my +1 on HADOOP-7459.  I think it is better to express Java dependency than without., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12487771/MAPREDUCE-2728.patch
  against trunk revision 1150926.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    -1 findbugs.  The patch appears to introduce 1 new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed these core unit tests:
                  org.apache.hadoop.cli.TestMRCLI
                  org.apache.hadoop.fs.TestFileSystem

    -1 contrib tests.  The patch failed contrib unit tests.

    +1 system test framework.  The patch passed system test framework compile.

Test results: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/503//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/503//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/503//console

This message is automatically generated., Patch staled due to mavenization., closing as won't fix. no longer building deb files
]