[Patch for 0.20-security. Unsure if required for 0.22 and for any of new components of 0.23+, will have to investigate., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12493041/0.20-MAPREDUCE-2932.r1.diff
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/607//console

This message is automatically generated., I s'pose NodeManagerMetrics is the newer equivalent of the older, pluggable instrumentation of TT. Since NodeManagerMetrics is not an interface, and nor does the framework allow things to just be plugged in (to merely override the metrics class) for this, I do not think this problem exists MR2 (0.23/trunk)., Patch looks good.   Can you add a test case similar to TestJobTrackerInstrumentation?, Eli,

Two tests added. Also noticed there was no existing testcase for TT instrumentation plugins at all?, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12495258/0.20-MAPREDUCE-2932.r2.diff
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 2 new or modified tests.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/803//console

This message is automatically generated., Mind making your new test junit4 sytle? Otherwise, looks great!, Made tests j4-style. Will keep this in mind next time and not do just a copy-paste-edit job :-), -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12496060/0.20-MAPREDUCE-2932.r3.diff
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 2 new or modified tests.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/819//console

This message is automatically generated., +1 looks good. I ran the tests locally., I've committed this. Thanks Harsh!, Closed upon release of Hadoop-1.1.0.]