[I am a bit confused about how this could be happening.  The Job History server code should be able to report back for any job that has a jhist file and conf.xml in the intermediate done directory for the given user.  These files should be in the proper directory before the AM exits.  If the AM is has not exited yet the client should direct all status requests to the AM, if it is no longer active then the requests should go to the History Server.

How reproducible is this issue?  I know that there are some serious race conditions in the History Server that I am working on fixing, and it could be related to that. MAPREDUCE-3972, @Robert, sorry for the delay following up on this.

I can reproduce it quite frequently in Ubuntu (in OSX quite seldom).

I'm running Oozie's trunk TestPigActionExecutor test using MiniCluster:

{code}
$ mvn test -Dtest=TestPigActionExecutor -Dhadoop.version=0.24.0-SNAPSHOT
{code} 

the testcase times out 1 every 2 runs.

Attached is the MiniCluster log in case this helps finding the issue.

thxs, It looks like your job, and the history server have different configuration values for where to write/read the jhist files.

I see your oozie job create the directory

/tmp/hadoop-yarn/staging/history/done_intermediate/test

But I see the history server looking for jobs under

/home/tucu/src/cloudera/oozietucu/core/target/org.apache.hadoop.mapred.MiniMRCluster/apps_staging_dir/history/done_intermediate

Which looks like the MiniCluster overriding the value for when we don't use HDFS.

So when the test passes it probably got the status from the AM before it exited, and when it fails it tried to get status from the history server, but the history server has no knowledge of your job, because the files are not where it expects them to be.  I am not super familiar with the mini cluster so I am not super sure where to look to fix this., Thxs Robert, seems like the problem is in the MiniMRClientClusterFactory initialization, digging.

I'll take care of this. 

Now the follow up question, why things go into a hang mode and make my testcase to timeout? That seems wrong., Thxs Robert, seems like the problem is in the MiniMRClientClusterFactory initialization, digging.

I'll take care of this. 

Now the follow up question, why things go into a hang mode and make my testcase to timeout? That seems wrong., Oozie testcases are not using the MiniMR configuration to submit a job, thus missing settings shared between MiniMR and the AMs.

Still it seems to be an issue when the staging HDFS directory of the AM and the JH differ and the app never ends. will verify and open JIRA if appropriate.]