[added logic to filter invalid files, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12478920/MAPREDUCE-2322.patch
  against trunk revision 1102515.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    -1 javac.  The patch appears to cause tar ant target to fail.

    -1 findbugs.  The patch appears to cause Findbugs (version 1.3.9) to fail.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed these core unit tests:


    -1 contrib tests.  The patch failed contrib unit tests.

    -1 system test framework.  The patch failed system test framework compile.

Test results: https://builds.apache.org/hudson/job/PreCommit-MAPREDUCE-Build/240//testReport/
Console output: https://builds.apache.org/hudson/job/PreCommit-MAPREDUCE-Build/240//console

This message is automatically generated., Looks like the patch you uploaded doesn't build, Andrew. Also, it would be good to add a unit test for this case., Please Code Review.  

Note no unit test associated, there is currently no framework for jsp methods., Hi Albert. A few comments:
- maybe it would make sense to move these methods and the PathFilter implementation into JobHistory.java? Then it would be really easy to write unit tests for them.
- looks like there is a hard tab character in the patch. Our code convention is to use spaces rather than tabs. Can you make sure your editor is setup for that?, Makes sense, I was actually considering that, but my newb nerves felt safer to go with the flow.  If it's appropriate for this ticket I can start moving those over and setting up unit tests for them.

I'll also make sure there's no tab when its in .java., Please Code Reviews.  Sorry for the attachment noise, please check the latest MAPREDUCE-2322.patch dated 19/May/11 00:06 and marked with the license icon.

Refactored out some of the methods from the jsp and added unit tests., Hey Albert. Nice patch. A few small comments:

- JobHistoryPathFilter should have InterfaceAudience and InterfaceStability annotations. I'd probably say @InterfaceAudience.Private and @InterfaceStability.Evolving. This will indicate better that it's only package-accessible so that the jsp can get to it.
- please add at least a brief javadoc on what the filter does.
- Similarly, the comments at the head of matchUser, matchJobId, and validJobHistory should probably be converted to JavaDoc comments with /** ... */ (I see you've just moved this code, but while we're at it, we might as well fix that)
- the javadoc for TestJobHistoryPathFilter seems to refer to some other test
- can you please use JUnit 4 for the new test cases? i.e import org.junit.Test and use @Test annotations instead of extending TestCase

Thanks!, Please Code Review latest patch.  This includes all of Todd's previous comments.]