[When we use new API, the OutputCommitter associated with the FileOutputFormat is FileOutputCommitter.
Where as for the old API, OutputCommitter is reading from the conf object.

{code}
    if (useNewApi) {
      if (LOG.isDebugEnabled()) {
        LOG.debug("using new api for output committer");
      }
      outputFormat =
        ReflectionUtils.newInstance(taskContext.getOutputFormatClass(), job);
      committer = outputFormat.getOutputCommitter(taskContext);
    } else {
      committer = conf.getOutputCommitter();
    }
{code} , here I am attaching a solution against trunk. Pls review the solution, Can someone please review the attached patch., Bh.V.S.Kamesh,

I am not an expert on the code, but I thought that this was by design.  In the older APIs the configs for output format and output committer were separate, but the committer is tied quite closely to the output format.  If I am outputting to a DB using a DB Output Format I now have to set two configs instead of just one to make this work.  What is more I may need to play some odd games to make it so that a DB output committer even works so that I can commit/roll back the results, something that the current DB output format does not implement. This comes at the expense of making it more difficult to override the OutputCommitter, but my experience with the FileOutputCommitter, it is not really designed so that it can be subclassed in a clean extensible way.

That being said I am fine with adding in the ability to override the output committer through a configuration on the newer API, I am just not sure that this is the proper way to do it.  I have not had time to really think through it.  At a minimum please upmerge the patch. It no longer applies. , Hi Robert,
 Thanks for looking into this issue. I have found the necessity of a pluggable output committer associated with FOF, when I was fixing [MAPREDUCE-3130|https://issues.apache.org/jira//browse/MAPREDUCE-3130]. I fixed [MAPREDUCE-3130|https://issues.apache.org/jira//browse/MAPREDUCE-3130] by associating [MAPREDUCE-3471|https://issues.apache.org/jira//browse/MAPREDUCE-3471] with *FOF*. I just attached the way I fixed this.

Upmerging the perviously submitted patch. Please provide your feedback

If this is not a proper way to fix, I am happy to have fix for this.:)]