[-1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12481183/MAPREDUCE-2557.patch
  against trunk revision 1130393.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    -1 findbugs.  The patch appears to introduce 1 new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed these core unit tests:
                  org.apache.hadoop.cli.TestMRCLI

    +1 contrib tests.  The patch passed contrib unit tests.

    +1 system test framework.  The patch passed system test framework compile.

Test results: https://builds.apache.org/hudson/job/PreCommit-MAPREDUCE-Build/331//testReport/
Findbugs warnings: https://builds.apache.org/hudson/job/PreCommit-MAPREDUCE-Build/331//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/hudson/job/PreCommit-MAPREDUCE-Build/331//console

This message is automatically generated., Hi William. Thanks for the bug report. Two things:
- a silly nit: can you use "1L" and "2L" instead of "1l" and "2l" in the tests? I was staring at it for 5 minutes before I realized those were 'l' ("ell") and not '1' ("one").
- what ramifications, if any, does this have on the MR framework itself? Would this cause incorrect counters in any usual use case? How'd you come across the bug?, Hey Todd,

1) No problem on that

2) I think in terms of running a MR job, there's no real effect unless the framework is re-using the same Counters reference for different jobs, which could happen if JVM re-use is enabled. I encountered this while writing an MR job that used Counters as an input value type. I had written my own InputFormat that re-used a Counters reference and found I was getting odd values when performing operations on Counter values., Made the "L" next to long's capital for easier viewing., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12481646/MAPREDUCE-2557-style.patch
  against trunk revision 1132807.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    -1 findbugs.  The patch appears to introduce 1 new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed these core unit tests:
                  org.apache.hadoop.cli.TestMRCLI
                  org.apache.hadoop.fs.TestFileSystem

    +1 contrib tests.  The patch passed contrib unit tests.

    +1 system test framework.  The patch passed system test framework compile.

Test results: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/354//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/354//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/354//console

This message is automatically generated., Hello William,

Thanks for the patch!

Can you re-up an updated patch for trunk, granting ASF permissions to use the patch? This is doable by checking the "Grant license to ASF for inclusion in ASF works" option when attaching a file via more-actions>attach-files dialog. It is required if you intend the patch to be committed into the project., Sorry to come in late, the patch has gone stale. Can you please rebase? Thanks.
, Patch to clear Counters cache for hadoop-common trunk., Five months turnaround is better than never, right? Right?!, This should be resolved via MAPREDUCE-6199 (which adds in a reset API as well)., Thanks!]