[The issue here is that hadoop-examples.jar is missing from the task's classpath since ValueAggregatorJob sets its own jar as the job jar, so hadoop-core.jar is used instead of hadoop-examples.jar. A workaround could be to explicitly add hadoop-examples.jar to the task's classpath via "-libjars" argument or the "user.jar.file" property. I'll be uploading a patch momentarily which fixes this default behavior of ValueAggregatorJob., Here is a patch that modifies the ValueAggregatorJob behavior to use the caller's jar instead of its own jar. So for the example mentioned above, the hadoop-examples.jar is set as the job jar.

I have manually tested this fix on a single node cluster and confirmed that the example runs fine., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12544911/MAPREDUCE-4652.patch
  against trunk revision .

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/2848//console

This message is automatically generated., For compatibility we should keep the existing createValueAggregatorJob() methods on ValueAggregatorJob - so add new overloaded variants rather than change the existing ones. Otherwise looks good., Many thanks Tom for the review! Here is the updated version addressing your comments., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12545623/MAPREDUCE-4652_rev2.patch
  against trunk revision .

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/2862//console

This message is automatically generated., I have locally ran test-patch and here is the result:

{code}

     [exec] BUILD SUCCESSFUL
     [exec] Total time: 5 minutes 49 seconds
     [exec] 
     [exec] 
     [exec] 
     [exec] 
     [exec] -1 overall.  
     [exec] 
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec] 
     [exec]     -1 tests included.  The patch doesn't appear to include any new or modified tests.
     [exec]                         Please justify why no tests are needed for this patch.
     [exec] 
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec] 
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec] 
     [exec]     -1 findbugs.  The patch appears to introduce 221 new Findbugs (version 2.0.1) warnings.
{code}

I have inspected the findbugs report and the warnings seem unrelated to the current patch. The number 221 seems to come from the total number of warnings in the report 432 minus the OK_FINDBUGS_WARNINGS=211 in src/test/test-patch.properties, so it doesn't seem to reflect a real number of new warnings introduced by the patch., I just committed this. Thanks Ahmed!, Closed upon release of Hadoop 1.2.0.]