[-1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12505350/MAPREDUCE-3475.patch
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/1348//console

This message is automatically generated., Actually, I think this is the wrong direction. In general the JT should renew its own tokens.

I'd suggest rather that the broken tokens from Oozie not be renewed by not trying to renew any tokens that don't have the proper user as either owner or renewer. That is a much more general fix that will handle a wider set of upstream problems., A truly general solution will require touching all components.  This patch fixes the issues for MR tokens by checking the token's renewer against the login user., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12505394/MAPREDUCE-3475-1.patch
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/1355//console

This message is automatically generated., Daryn,
  Can you look for a match with either the owner or renewer? They should both be able to do renewals., Unfortunately the secret manager only looks at renewer.  The owner isn't factored in for some reason..., Well, that is a mistake. But since the filter matches the current behavior, that is fine. The patch looks fine to me., Taking Owen's comment for a +1, I have committed this patch to 1.0.0 and branch-1.
Leaving the jira open with the expectation that this same fix is needed in v0.22.]