[Added the new patch.
All the warning messages are moved to constructor, Attached a new patch that works for trunk. It is the same as what Rahul uploaded, except I modified the method checkAndWarnDeprecation to not require a Configuration instance. Instead, it uses the current object's values itself. Running this through Hudson, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12416966/mapreduce-832.patch
  against trunk revision 805324.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/493/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/493/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/493/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/493/console

This message is automatically generated., bq. -1 tests included. The patch doesn't appear to include any new or modified tests.

The patch is adding a debug log message which is hard to write a unit test for. Our QE team has manually verified the patch by running tests on a cluster with old memory configuration and verifying that the number of WARN messages has come down drastically. Also, the scenario in MAPREDUCE-833 has been tested and found fixed.

bq. -1 core tests. The patch failed core unit tests.

org.apache.hadoop.mapred.TestRecoveryManager.testRestartCount's failure is independent of this patch. It happens with trunk and is being tracked in MAPREDUCE-880

bq. -1 contrib tests. The patch failed contrib unit tests.

The streaming test failures have been happening for a while on hudson alone. They pass locally.

On this basis, I am going to commit the patch to trunk and an equivalent patch to branch 20., Patch for Hadoop 0.20 branch. Only source paths have been changed., I just committed this to trunk and branch 0.20. Thanks, Rahul !]