[The patch involves the following :

1. correcting the name of the jar so that version and build number comes after streaming.
2. adding a template for streaming pom file
3. changes to mapreduce/build.xml to publish the jar to repo., Replace jar and jar-test with all-jars for mvn-installa and mvn-deploy. 
This is needed because streaming jar need to get built along with mapreduce jars., Attaching the patch with --no-prefix option, Patch looks good. Unfortunately, I wasn't been able to validate it is working as expected because I can't compile gridmix on my system as it aborts on some generics complication issues.

According to a multiple confirmations from other ppl. looks like that the patch actually fixes the problem in some production environments. So, I am committing this with an official 
+1, I have just committed it. Thank you, Antony!, I am going to assign the ticket to myself, as I don't see Antony in the list contributors yet., Integrated in Hadoop-Mapreduce-22-branch #102 (See [https://builds.apache.org/job/Hadoop-Mapreduce-22-branch/102/])
    MAPREDUCE-3863. 0.22 branch mvn deploy is not publishing hadoop-streaming JAR. Contributed by Benoy Antony (Revision 1330126)

     Result = SUCCESS
cos : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1330126
Files : 
* /hadoop/common/branches/branch-0.22/mapreduce/CHANGES.txt
* /hadoop/common/branches/branch-0.22/mapreduce/build.xml
* /hadoop/common/branches/branch-0.22/mapreduce/src/contrib/streaming/build.xml
, Cos, you missed the new file hadoop-streaming-template.xml in the previous commit. I just committed it. Reassigning this to Benoy., Integrated in Hadoop-Mapreduce-22-branch #103 (See [https://builds.apache.org/job/Hadoop-Mapreduce-22-branch/103/])
    MAPREDUCE-3863. hadoop-streaming-template.xml is missing in the previous commit. (Revision 1333256)

     Result = SUCCESS
shv : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1333256
Files : 
* /hadoop/common/branches/branch-0.22/mapreduce/ivy/hadoop-streaming-template.xml
]