[ The exceptions are generated by status updates sent by the child after it reports 'done' to the TaskTracker. Ideally
this should not happen.

The fix for MAPREDUCE-2429 is meant to ignore such calls (since the child jvm is effectively not supposed to exist after the done call is processed).

In previous versions - the statusUpdate RPC would return success but would ignore the request.
This exception is effectively replacing another message from previous version (Ignoring status-update since task is
'done'). With the current code - the statusUpdate RPC fails - which causes the Child to retry - effectively generating way more messages in the logs.
, I think all we want to do is get the child to exit and not generate all the log messages.  To do that we can have the TaskTracker::statusUpdate return false if the validateJVM throws.  The only catch to that is the TaskTracker::commitPending call doesn't return boolean so will have to have it still throw., This is the patch for the branch-0.20-security.  , Only adding patch for branch-0.20-security since MAPREDUCE-2429 not in trunk yet.

, Can you please add a comment to MAPREDUCE-2429 as well so that we don't miss this in trunk?

Is Sidd still working on the forward-port?, fix a couple spacing issues., Tested manually via changing code as this is hard to reproduce. , Added comment to MAPREDUCE-2429.  I'll ask Sidd about that forward-port., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12481267/MAPREDUCE-2555-20security-v2.patch
  against trunk revision 1130554.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/hudson/job/PreCommit-MAPREDUCE-Build/336//console

This message is automatically generated., Note this failed since patch is for branch-0.20-security.

, +1 lgtm to get rid of the extra logging and to kill the child process., @Todd, I am still working on the 2429 forward port., Noting dependency in trunk, I committed this to the 20-security branch. I'll leave it open to track the forward-port, Hadoop 0.20.204.0 was just released.]