[Attaching test failure log, TestTaskFail fails first 2 attempts and passes in thrid attempt. 
From the logs, it shows that before 2nd attempt could get a chance to run, third attempt is launched speculatively, which leads to job completion.
So, speculation-execution should be disabled for the test., Patch for branch 0.20 and trunk, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12417581/patch-911.txt
  against trunk revision 807543.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    -1 release audit.  The applied patch generated 202 release audit warnings (more than the trunk's current 0 warnings).

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/515/testReport/
Release audit warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/515/artifact/trunk/patchprocess/releaseAuditDiffWarnings.txt
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/515/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/515/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/515/console

This message is automatically generated., -1 core tests. Due to MAPREDUCE-880
-1 release audit. Looks spurious. Patch does not add any new files., I committed this trunk and 0.20 branch. Thanks Amareshwari!, Integrated in Hadoop-Mapreduce-trunk-Commit #7 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Mapreduce-trunk-Commit/7/])
    . Fix a bug in TestTaskFail related to speculative execution. Contributed by Amareshwari Sriramadasu.
, Integrated in Hadoop-Mapreduce-trunk #70 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Mapreduce-trunk/70/])
    ]