[Patch is submitted for branch-0.20-security-204 branch., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12492068/MAPREDUCE-2903.patch
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/551//console

This message is automatically generated., I could have sworn this (very long standing) bug had already been filed, but I can't find it..., bq. I could have sworn this (very long standing) bug had already been filed, but I can't find it...
Not unusual around here :) Here we go: MAPREDUCE-1237 and HADOOP-4160 ; can be closed as duplicates., It's not committed yet, so please only change the Target Version, not the Fixed Version., +1, almost.  This patch incorrectly creates a new unit test at: 
src/mapred/org/apache/hadoop/mapred/TestTaskGraphServlet.java
but it should be at: 
src/test/org/apache/hadoop/mapred/TestTaskGraphServlet.java

In addition there were <CR> characters ("^M") at the ends of lines in the patch file.
Please be careful what editor you use to modify source files. Assure that the settings are compatible with http://wiki.apache.org/hadoop/HowToContribute#Making_Changes

Corrected these errors and committed to hadoop-1.1 and hadoop-1.
Uploaded the corrected patch in case anyone references the patch later., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12535631/MAPREDUCE-2903.patch
  against trunk revision .

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/2559//console

This message is automatically generated., Committed to branch-1 and branch-1.1.
Thanks, Devaraj!, Closed upon release of Hadoop-1.1.0.]