[Illustrative patch for Yahoo! distribution not for commit here.

Patch does the following :
1. It changes the directory structure of the task log directory from
$hadoop.log.dir/userlogs/jobid/taskid to $hadoop.log.dir/userlogs/jobid/taskid[.cleanup]

2. Changes the index file name from log.index[.cleanup] to log.index
Did this change because log.index file need not have a suffix now, because it is going into separate directory.

3. Changes the contents of index file for LOG_DIR from
LOG_DIR:<attemptid> to LOG_DIR:<actual log location>
This change is needed for the indexing into proper directory. 
We can just add LOG_DIR:<attemptid>[.cleanup], but caller has to pass jobid also to find the actual directory. I
think that adding the actual log path will avoid any other directory structure change (like adding user) to make
changes in all the places where log location is used. One more use case for doing this is distributing logs in all the disks, similar to "mapred.local.dir".

4. Patch adds a regression test TestTaskTrackerLocalization.testCleanupTaskLocalization() which fails without the patch and passes with the patch.

5. Patch adds a Junit test to test tasklogs and indices for all the tasks of job with jvm-reuse. The existing test
TestTaskFail already tests logs of task attempts and cleanup attempts.
, Patch for trunk. Patch removes tasklog truncation changes from the yahoo! patch and all other changes are almost same., Earlier patch had minor bug because of a copy-paste. Attached patch fixes that., All linux task controller tests passed with the patch (both as tt user and some other user). I tested viewing of task logs and cleanup attempts logs on the single node machine., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12443075/patch-1607-1.txt
  against trunk revision 938805.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 21 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/152/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/152/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/152/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/152/console

This message is automatically generated., I started looking at this patch., Patch is not applying cleanly anymore to trunk:  Minor merges are needed in Application.java and TestTaskTrackerLocalization

I manually merged the patch myself to continue with the review. Mostly looks good except the following:
 - TaskRunner.java#setupLog4j(): level should not be INFO, but getLogLevel(conf).toString()
 - Tasklogservlet: The check haveTaskLog() for bypassing SYSLOG in tests will lead to missing log files from webui in case of JVMReuse. We should not do this.
 - Convert TestJvmReuse into junit 4 testcase?

Canceling patch so as to include above comments., Marking this as an incompatible change: We are changing the directory structure for cleanup-attempt log-dir and so users will not be able to look at old cleanup-attempt logs., Patch is updated to trunk and incorporates review comments., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12444103/patch-1607-2.txt
  against trunk revision 941564.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 21 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/177/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/177/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/177/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/177/console

This message is automatically generated., +1 for the patch.

This one's good to go in. Just to be sure, can you please run a sanity manual test with cleanup tasks? And also execute the linux-task-controller tests once? Thanks!, bq. Just to be sure, can you please run a sanity manual test with cleanup tasks? And also execute the linux-task-controller tests once? 
All linux task controller tests passed with the patch (both as tt user and some other user). I tested viewing of task logs and cleanup attempts logs on the single node machine. , I just committed this to trunk and branch 0.21(bug fix, so). Thanks Amareshwari!]