[While we are at it, we should ensure that nodes declared unhealthy (MAPREDUCE-211) also are removed from the list of reserved tasktrackers for jobs..., Attaching patch which fixes this issue., Looks fine. A couple of minor points:

- In FaultyTrackersInfo.blacklistTracker, the trackers we get for a hostname are in a synchronized set and we are iterating over them. The javadoc of the Collections.synchronizedSet says that when iterating we should guard it in a synchronized block.
- As far as I can see, cancelAllReservations need not be synchronized now, because all code paths seem to be coming after locking the jobtracker. Can you please verify this once ? Possibly add a comment stating the assumption on cancelAllReservations ? 
- In the test case, can we also blacklist a different tracker (with reservations) due to node health check reasons and make sure that both trackers' reservations are removed. It just makes the test case cover more scenarios with little work.
- Please add a comment for the cleanup steps in the test cases so its clear why we need to do those steps., Attaching patch incorporating Hemanths comments.

* Synchronizing on the set before iterating over it.
* modified the test case to test with Node health reasons comment.
* Added comment in TaskTracker to state the assumption., Changes look fine to me.

+1., Since hudson patch queue seems to be stuck. Output from ant test-patch

{noformat}
     [exec] +1 overall.
     [exec]
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec]
     [exec]     +1 tests included.  The patch appears to include 3 new or modified tests.
     [exec]
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec]
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec]
     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs warnings.
     [exec]
     [exec]     +1 release audit.  The applied patch does not increase the total number of release audit warnings.
     [exec]
{noformat}

Running tests., All tests passed locally, both contrib and core., I just committed this. Thanks, Sreekanth !, Attaching patch for Yahoo! distribution.]