[+1 

We were just talking about this last week, as we move from one data center to another., A patch for the first option is attached.

Now setup should not take longer than it takes to '-lsr' destination and source directories. This is the best we can do without parallelizing setup(). 

The fix is to store entries in destination directory in a map pass it to sameFile()., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12458747/MAPREDUCE-2149.patch
  against trunk revision 1074251.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    -1 findbugs.  The patch appears to introduce 1 new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

    +1 system test framework.  The patch passed system test framework compile.

Test results: https://hudson.apache.org/hudson/job/PreCommit-MAPREDUCE-Build/57//testReport/
Findbugs warnings: https://hudson.apache.org/hudson/job/PreCommit-MAPREDUCE-Build/57//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://hudson.apache.org/hudson/job/PreCommit-MAPREDUCE-Build/57//console

This message is automatically generated., https://issues.apache.org/jira/browse/MAPREDUCE-2765

This rewrite does attempt to address setup-times (as well as copy performance). , MAPREDUCE-2765 has gone in as is resolved.  If this is still enough of an issue for the 1.0 line then please upmerge the patch and resubmit it along with test patch results. , I don't appear to have rights to change the resolution status here, but note that the true resolution of this JIRA is not "Fixed" as indicated, but instead "Duplicate" (of MAPREDUCE-2765, which introduces DistCp2 for YARN/MR2).]