[Attaching a patch that fixes the NPE. test-patch and ant-tests passed on my box. Note that this patch has resulted into changes to the following files 
{noformat}
src/test/tools/data/rumen/small-trace-test/dispatch-trace-output.json.gz
src/test/tools/data/rumen/small-trace-test/counters-test-trace.json.gz
{noformat}

Attached the same. The changes are that failedMapAttemptCDFs in the earlier expected-output files were null which is no longer the case., Reattaching the expected output files., The code change looks right.

Please add the binary files to the patch, which you need to do to get the Hudson job to work correctly., Attaching a patch that includes the binary diffs of the gold-standard files., Running through hudson., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12448019/rumen-npe-v1.1-bin.patch
  against trunk revision 957772.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 9 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/268/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/268/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/268/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/268/console

This message is automatically generated., The contrib test failure is because of TestSimulatorDeterministicReplay timeout. This is a known issue, see MAPREDUCE-1834., +1

I committed this. Thanks, Amar!, patch for yahoop hadoop 20.1xx branch. Not to be committed., Integrated in Hadoop-Mapreduce-trunk-Commit #523 (See [https://hudson.apache.org/hudson/job/Hadoop-Mapreduce-trunk-Commit/523/])
    ]