[Attaching patch to suppress the warnings. The typecast can't be verified at runtime due to how Java generics / type erasure works, so suppressed warnings in the method. No new tests because it's a trivial patch., It is better to have the @SuppressWarnings right above the required code.  i.e.
{code}
-    Class inputClass = dbConf.getInputClass();
+    @SuppressWarnings("unchecked")
+    Class<T> inputClass = (Class<T>)dbConf.getInputClass();
{code}, So it is! New patch., +1 patch looks good., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12414303/MAPREDUCE-792.2.patch
  against trunk revision 799126.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/428/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/428/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/428/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/428/console

This message is automatically generated., unrelated test failures, No new tests added since the change is very simple.

I have committed this.  Thanks, Aaron!, Integrated in Hadoop-Mapreduce-trunk #35 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Mapreduce-trunk/35/])
    ]