[Attaching a early version of the patch. Added a testcase. In this patch the testcase is an end-to-end testcase. I have added a testcase in TestJobStatusPersistency. WIll file a jira to make TestJobStatusPersistency a unit test. Running test-patch. , Result of test-patch
 [exec] -1 overall.  
     [exec] 
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec] 
     [exec]     +1 tests included.  The patch appears to include 3 new or modified tests.
     [exec] 
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec] 
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec] 
     [exec]     -1 findbugs.  The patch appears to introduce 1 new Findbugs warnings.
     [exec] 
     [exec]     +1 release audit.  The applied patch does not increase the total number of release audit warnings.

The findbugs is because of the static clock variable set by JobTracker constructor. Running ant test now., All ant test passed on my box except TestJobTrackerRestartWithLostTracker FAILED (timeout), TestKillSubProcesses FAILED, TestNodeRefresh FAILED (timeout), TestReduceFetch FAILED. All of these are known issues. On contrib the following testcase failed TestStreamingBadRecords FAILED (timeout), TestStreamingExitStatus FAILED, TestStreamingStderr FAILED (timeout), TestQueueCapacities FAILED (timeout). All of these are also known issues.
, Attaching a new patch that changes the call from jobtracker.getClock() to JobTracker.getClock() as getClock() is now a static api., Result of test-patch 
 [exec] -1 overall.  
     [exec] 
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec] 
     [exec]     +1 tests included.  The patch appears to include 3 new or modified tests.
     [exec] 
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec] 
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec] 
     [exec]     -1 findbugs.  The patch appears to introduce 1 new Findbugs warnings.
     [exec] 
     [exec]     +1 release audit.  The applied patch does not increase the total number of release audit warnings.
, Attaching a patch for branch 20., I committed this to trunk and branch 0.20., The above fix does not seem to work. The job info files are not being removed from the local FS after "mapred.job.tracker.persist.jobstatus.hours" . Also "mapred.job.tracker.persist.jobstatus.hours" cannot be configured to a decimal value. Say if it has to be set to 15mins, then it is not possible to do so., bq. The job info files are not being removed from the local FS after "mapred.job.tracker.persist.jobstatus.hours" 
To be more clear, the job info files are not removed immediately after "mapred.job.tracker.persist.jobstatus.hours". Instead they get removed after some random time. So configuring the "mapred.job.tracker.persist.jobstatus.hours" is not behaving as expected., The job info files are not being removed from the hdfs also after  "mapred.job.tracker.persist.jobstatus.hours" 
I set it to 1 hour and it got deleted after 1 hour 57 minutes., Integrated in Hadoop-Mapreduce-trunk #15 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Mapreduce-trunk/15/])
    ]