[Hi [~bibinchundatt]
I checked this case, and I am able to get the page. I couldnt upload a screen shot, but I used below URL.
{{http://localhost:19888/jobhistory/attempts/job_1463495738783_0004/m/SUCCESSFUL}}. I tried in trunk, [~bibinchundatt] I dont have permission to upload screen shot, So I  will send screenshot to you or [~rohithsharma] so that it can be uploaded here., IIUC, [~bibinchundatt] was saying this is an issue only on branch-2.8, Oh ok.. Thats very interesting, we need to do some retrospection for this. I ll also check., It seems YARN-3840 was reverted from branch-2.8
This means MAPREDUCE-6419 should be reverted too.as it depends on YARN-3840.
This is why [~bibinchundatt] was getting natural js related error.

cc [~jianhe], [~rohithsharma], Refer to history :
https://github.com/apache/hadoop/commits/branch-2.8/hadoop-yarn-project/hadoop-yarn/hadoop-yarn-common/src/main/java/org/apache/hadoop/yarn/webapp/view/JQueryUI.java, I mean MAPREDUCE-6419 should be reverted from branch-2.8, You are right, it got reverted!! I am not sure why it was reverted, I wait for [~jianhe], IIRC, During December month branch-2.8 was created. When first commit of YARN-3840 happened i.e 10Nov branch-2 was pointing out to branch-2.8-snapshot and got reverted. But later in month first week of Dec, 2015 branch-2.8 got created. I think since newly created branch-2.8 was new, it got missed unknowingly. This would be the reason for missing commit in branch-2.8

Anyway I will try to backport YARN-3840 to branch-2.8. If any rebase is to be done, then this JIRA can be moved to YARN project for uploading branch-2.8 patch, It is not able to back port to branch-2.8 now since many commits have been done. [~bibinchundatt] would you mind providing rebase patch to branch-2.8 please?, Not able to backport YARN-3840 ?, The latest patch I had given on YARN-3840 was YARN-3840.reopened.001.patch
It applies cleanly on branch-2.8, ah.. I tried to cherry-pick which could not happened. Let me try applying patch directly., I have reopened the JIRA YARN-3840 and lets handle in the original JIRA only. Till YARN-3840 is closed, I will keep open this JIRA for tracking., [~rohithsharma]
{quote}
Bibin A Chundatt would you mind providing rebase patch to branch-2.8 please?
{quote}
Offline have asked Varun to  upload don't have rights for to upload in YARN-3840.
, This was commit miss in branch-2.8 for the issue YARN-3840. It is fixed by re opening the YARN-3840. 
Closing as Implemented.. 

Thanks [~bibinchundatt] for finding this issue in regression. I really appreciate it:-) It would have been downstream defect.
Thanks [~varun_saxena] for finding root cause and providing rebase patch in YARN-3840 soon.]