[In tasklog servlet, the problem is even when the task log files don't exist, the first place an error is seen is authorization check.
Avoiding authorization check for viewing task logs if job-acls.xml file doesn't exist would solve the problem., Attaching patch for earlier version of hadoop. Not for commit here.

Patch makes tasklog servlet to do authorization check only if job-acls.xml file exists. Also added a proper error message for the case of accessing task logs from tasklog servlet when the whole task log directory is not existing for a task. Added 2 testcases to TestWebUIAuthorization for (a) allowing all users to view task logs when job-acls.xml file not existing and (b) getting proper error code when the whole task log directory not existing., Attaching patch for trunk.

Please review and provide your comments., Changes look fine. Running through Hudson., +1 for the latest patch. Waiting for Hudson's blessings., bq. +1 for the latest patch. Waiting for Hudson's blessings. 
Sorry. Wrong tab., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12442846/MR1657.patch
  against trunk revision 938387.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/146/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/146/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/146/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/146/console

This message is automatically generated., unit tests failed are not related to this patch.
TestJobACLs failed because of MAPREDUCE-1727.
TestLazyOutput.testLazyOutput failed with ZipException because of MAPREDUCE-1642., I just committed this. Thanks Ravi!]