[Attached a patch fixing the said misleading string., The same holds for value class validation also. Harsh, Can you update the patch for value class also?, New patch that adds in the other pointer as requested by Amareshwari. Hope this clears up the doc issue., Patch available that fixes this minor docs issue., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12468867/MAPREDUCE-1242.r2.patch
  against trunk revision 1075216.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed these core unit tests:
                  org.apache.hadoop.mapreduce.lib.input.TestCombineFileInputFormat

    -1 contrib tests.  The patch failed contrib unit tests.

    +1 system test framework.  The patch passed system test framework compile.

Test results: https://hudson.apache.org/hudson/job/PreCommit-MAPREDUCE-Build/89//testReport/
Findbugs warnings: https://hudson.apache.org/hudson/job/PreCommit-MAPREDUCE-Build/89//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://hudson.apache.org/hudson/job/PreCommit-MAPREDUCE-Build/89//console

This message is automatically generated., Just change of strings in an exception message. No test cases should be required for that., I've just committed this. Thanks Harsh!, Integrated in Hadoop-Mapreduce-trunk-Commit #631 (See [https://hudson.apache.org/hudson/job/Hadoop-Mapreduce-trunk-Commit/631/])
    , Integrated in Hadoop-Mapreduce-trunk #643 (See [https://hudson.apache.org/hudson/job/Hadoop-Mapreduce-trunk/643/])
    ]