[Attaching a patch that uses the task-attempt-id to distinguish between map-tasktype and reduce-tasktype. Added a test for the same., Fix looks fine. I have one comment in the testcase though.
The last assert check in testcase should take TaskType as REDUCE, as we would never have a case where map attempt is run with reduce-id., Attaching a patch with Amareshwari's comment incorporated. , +1 latest patch looks fine., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12447688/mapreduce-1876-v1.2.patch
  against trunk revision 956779.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/259/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/259/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/259/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/259/console

This message is automatically generated., Failures are mostly either timeouts or MiniDFS class not found or DelegationToken errors. Doesnt seem related to this patch. Testing again on my local box., All tests passed except TestSimulatorDeterministicReplay, which is a known issue. Not sure why so many tests failed with hudson., I just committed this. Thanks Amar!, Backported to 0.21.0., Integrated in Hadoop-Mapreduce-trunk-Commit #523 (See [https://hudson.apache.org/hudson/job/Hadoop-Mapreduce-trunk-Commit/523/])
    ]