[Patch with the fixes., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12412839/717.patch
  against trunk revision 792613.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/368/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/368/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/368/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/368/console

This message is automatically generated., Apart from what I mentioned in the jira description, here are a few other fixes:
1) Changed the speculative cap to take into account the tasktype (map and reduce). In the HADOOP-2141 patch, it is a global count for maps and reduces. The problem I encountered was that in some cases, the reduce tasks would take up the slots towards the beginning of the job, and the last few maps wouldn't get any speculative slot. 
2) Changed the dispatch time for a task to be per task-attempt based. In the HADOOP-2141 patch, it is per task based.

All the unit tests & test-patch passed., Also disabled speculation for recovered jobs (jobs that are recovered after a JT restart). That part needs some more thought..., changes look fine to me, I just committed this.]