[Same is true for _TaskStatus.stateString_., It seems that all RPC api with String parameters have this problem since it does not prevent the client putting a large string into the parameter value., Does it make sense to keep it simple for now and cap the size of task-diagnostic information and state-string in TaskStatus to 1000 chars each?, +1 sounds good to me., Attaching a patch that caps the task-diagnostic-info and state-string to 1024 chars. test-patch passed. All ant tests except the following have passed :
- TestMiniMRLocalFS
- TestSubmitJob 
- TestTTResourceReporting

All these failed on trunk too., +1 patch looks good., Shall we add a log saying "Received diagnostic info: " +info in setDiagnosticInfo? This would be at least written to log file before truncation., Attaching a new patch incorporating Amareshwari's comment to do with logging of diagnostic-info and state-string. Prior to this patch, state-string info was already logged in the task-tracker and diag-info was logged at the jobtracker. With this patch, the actual state-string info and diag-info will be logged in task logs while the truncated strings will be logged in task-tracker and jobtracker.  , test-patch passed with [this|https://issues.apache.org/jira/secure/attachment/12437456/mapreduce-1482-v1.2.patch] patch. Result :
 [exec] +1 overall.  
     [exec] 
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec] 
     [exec]     +1 tests included.  The patch appears to include 3 new or modified tests.
     [exec] 
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec] 
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec] 
     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs warnings.
     [exec] 
     [exec]     +1 release audit.  The applied patch does not increase the total number of release audit warnings.

Running ant-tests., Attaching a modified patch that guards against null values being passed. test-patch passed. All ant tests except TestMiniMRLocalFS (MAPREDUCE-1520) passed on my box. , There is one nit with the latest patch :
- logging the newly set diagnostic-information or state-string would essentially mean logging in heartbeat, which is be bad. 
 , Hudson seems back.  Submitting ..., Nicholas,
I am canceling the patch as the latest patch unnecessarily logs the task state-string and diagnostic information which might affect the heartbeat. I will upload a new patch that will log only if the state-string/diag-info reachs the max limit. , Attaching a new patch for review. In this patch, the state-strings and diag-infos are logged only when they overflow and trimming is involved. Note that at the jobtracker, these strings will always be trimmed before sending and hence no info will be logged in heartbeats. test-patch and ant tests passed on my box., Changes look fine to me., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12438124/mapreduce-1482-v1.7.patch
  against trunk revision 922047.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/519/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/519/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/519/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/519/console

This message is automatically generated., I have committed this.  Thanks, Amar!, Integrated in Hadoop-Mapreduce-trunk-Commit #278 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Mapreduce-trunk-Commit/278/])
    . Truncate state string and diagnostic information in TaskStatus. Contributed by Amar Kamat
, Integrated in Hadoop-Mapreduce-trunk #263 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Mapreduce-trunk/263/])
    ]