[Patch which adds missing deprecations. No tests, since no logic has been changed., Looked at the patch. Some more missing deprecations: 
1. JobProfile should also deprecated in favor of org.apache.hadoop.mapreduce.JobStatus.
2.  public enum TIPStatus should also be deprecated. We might have to add one in mapreduce package. This is passed to user in org.apache.hadoop.mapreduce.TaskReport., Canceling patch while Amareshwari's comments are addressed.

Is this is intended for 0.21?, Thanks for the review Amareshwari. This new patch deprecates JobProfile and TipStatus. I added a new equivalent to TIPStatus called TaskReport.TaskStatus, along with a test to check the former can be converted to the latter (since you can't extend enums).

> Is this is intended for 0.21?

It should go in the next major release I think., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12439480/MAPREDUCE-1507.patch
  against trunk revision 925561.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    -1 javac.  The applied patch generated 2296 javac compiler warnings (more than the trunk's current 2219 warnings).

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/46/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/46/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/46/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/46/console

This message is automatically generated., This change necessarily increases the number of deprecation warnings since it marks existing classes as deprecated., +1 Changes look good to me.
, Cancelling since the patch has fallen out of date.]