[Giri thinks this is caused by MAPREDUCE-777. Unfortunately, since this build does not run unless -Declipse.home is set, we did not catch it when running test and test-patch., Attaching patch fixing the issue., Looks fine to me. Can you please upload test-patch results, so we can commit this and unblock Hudson. Since there are no tests for the eclipse plugin, I suppose we don't have to run tests., ant test-contrib passed.

ant test-patch gave:

     [exec] -1 overall.
     [exec]
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec]
     [exec]     -1 tests included.  The patch doesn't appear to include any new or modified tests.
     [exec]                         Please justify why no new tests are needed for this patch.
     [exec]                         Also please list what manual steps were performed to verify this patch.
     [exec]
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec]
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec]
     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs warnings.
     [exec]
     [exec]     -1 release audit.  The applied patch generated 177 release audit warnings (more than the trunk's current 0 warnings).


The release audit warnings are not related to this patch. 177 release audit warnings are seen for other patches' test-patch results also., I actually got better results with the same patch when I ran locally. Ravi, you possibly need to run ant clean on your workspace to remove the release audit warnings - that might come if you have documentation around.

{noformat}
     [exec] +1 overall.
     [exec]
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec]
     [exec]     -1 tests included.  The patch doesn't appear to include any new or modified tests.
     [exec]                         Please justify why no new tests are needed for this patch.
     [exec]                         Also please list what manual steps were performed to verify this patch.
     [exec]
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec]
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec]
     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs warnings.
     [exec]
     [exec]     +1 release audit.  The applied patch does not increase the total number of release audit warnings.
     [exec]
{noformat}

I am unaware what tests to run for the eclipse plugin. Taking an exception and committing so that hudson can get back to normal., WIth "ant clean" and then I also didnot get any releaseaudit warnings., with ant -Declipse.home=<eclipsehome> build's successful.
+1
, I just committed this. Thanks, Ravi !, Integrated in Hadoop-Mapreduce-trunk-Commit #53 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Mapreduce-trunk-Commit/53/])
    . Fix compilation problem in eclipse plugin when eclipse.home is set. Contributed by Ravi Gummadi.
, Umm, the test-path DID find this.  It was just ignored by the committer and contributor!]