[Hi Dan,

I can see two approaches to fix the problem:
a) Change the directory where Job information is getting used. Restart Recover will always search in this folder for Job Recovery.
Problem: The System Job Directory is being referenced from many places (Jobtracker, Tasktracker, Client). This approach may lead to code changes in multiple files.

b) Explicit check for *jobtracker.info* file while recovering job. This change is small and simple.

Please provide your opinion., The attached patch verifies whether the files for job recovery don't start with a name of same as restartCount file (*jobtracker.info*). This will filter out *jobtracker.info.rec* if it is present by chance., Sorry to come in late, the patch has gone stale. Can you please rebase? Thanks.

Given this is not an issue with MRv2 should we still commit this? I'm happy to, but not sure it's useful. Thanks., I see this problem in 0.22 and I think the fix is right. Unfortunately, the test does not succeed. It loops forever waiting for the job to reach 50% completion which it never does. I would like to commit it to 0.22 if the test is fixed.
I see that 0.20.security has the same problem., I was impatient. It runs for about 5 minutes. But the new test was failing, because the previous test case testJobTrackerInfoCreation() was not closing MiniDFSCluter.
I added the shutdown statement, and cleaned up some deprecations in the new test. 
Also change job completion threshold from 50% to 20%, which reduced running time from 290 sec to 150., Otherwise code looks good +1., I just committed this to 0.22 branch. Thanks Subroto.
Keeping it open until the inclusion to 0.20.security is decided., Integrated in Hadoop-Mapreduce-22-branch #91 (See [https://builds.apache.org/job/Hadoop-Mapreduce-22-branch/91/])
    MAPREDUCE-2059. RecoveryManager excludes jobtracker.info from the list of jobs to be recovered. Contributed by Subroto Sanyal.

shv : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1204275
Files : 
* /hadoop/common/branches/branch-0.22/mapreduce/CHANGES.txt
* /hadoop/common/branches/branch-0.22/mapreduce/src/java/org/apache/hadoop/mapred/JobTracker.java
* /hadoop/common/branches/branch-0.22/mapreduce/src/test/mapred/org/apache/hadoop/mapred/TestRecoveryManager.java
]