[The changes are done in reportProgress so that the numbers are between o and 100 along with the percent sign. Junit test class is also included, can someone please review the code., {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12584434/MAPREDUCE-5183.patch
  against trunk revision .

    {color:red}-1 patch{color}.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/3664//console

This message is automatically generated., Thanks for working on this, Niranjan.  The patch is looking good.  A couple stylistic comments:
* The line you changed should be broken up so that it fits within 80 characters per line
* There should be a space between the comma and the 0.
* There should be 0 or 1 blank lines at the end of the test function, and no blank lines at the end of the for loop in the test.
* Tests that run a job on a minicluster generally take over a minute.  Would it be possible to either write the test without the whole job/minicluster or put the check inside a relevant test that already exists?  Also, and others might disagree, I don't think a test is necessarily required for something cosmetic like this.

Also, I removed the fix version, as normally the person who commits the patch sets it at commit time., Thanks, Sandy Ryza for the review comments , this is my first patch so missed out on couple of coding styles
in future would see I don't missed out on anything., Fixed coding style, {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12585492/MAPREDUCE-5183.patch
  against trunk revision .

    {color:red}-1 patch{color}.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/3699//console

This message is automatically generated., +1, the updated patch looks good to me, @Sandy Ryza- Can you please let me know why Hadoop QA is generating [ -1 patch. The patch command could not apply the patch.].
Is there something I am missing out? , It's not your fault.  The QA bot only tries to apply and verify the patch against trunk.  Since your patch is for branch-1, it (understandably) does not apply., Thanks,for the clarification Sandy Ryza., +1, LGTM too. Committed to branch-1. Thanks Niranjan for the fix! Thanks Sandy for the report and review earlier!]