[Two ways to fix this for Solaris:

a) change the script to use nawk

b) make sure /usr/xpg4/bin or /usr/xpg6/bin (POSIX subsystems) appears in the path prior to /usr/bin , This is perhaps a better alternative. The script current already makes an assumption that the version information is in the second half of the first line. This changes the assumption to second half of a line starting with Hadoop. So it isn't any less maintainable. It improves readability. And doesn't require a user to manipulate paths or have nawk installed. 

The patch uses the most basic (read portable) functionality from both grep and awk.

  , +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12418270/MapReduce941.patch
  against trunk revision 815628.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h3.grid.sp2.yahoo.net/40/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h3.grid.sp2.yahoo.net/40/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h3.grid.sp2.yahoo.net/40/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h3.grid.sp2.yahoo.net/40/console

This message is automatically generated., No tests for the shell script. Did manual test., I've just committed this. Thanks Chad!, Integrated in Hadoop-Mapreduce-trunk-Commit #54 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Mapreduce-trunk-Commit/54/])
    . Vaidya script fails on Solaris. Contributed by Chad Metcalf.
]