[Patch deprecating ClusterStatus. Also adds javadoc for methods in ClusterMetrics, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12421520/patch-1076.txt
  against trunk revision 819740.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    -1 javac.  The applied patch generated 2340 javac compiler warnings (more than the trunk's current 2330 warnings).

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/146/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/146/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/146/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/146/console

This message is automatically generated., -1 javac. Is because the class ClusterStatus is deprecated.
-1 core tests. Is known issue (MAPREDUCE-1029).
-1 tests included. Tests are not included since the patch is a simple patch which deprecates one of the classes., I committed this to 0.21 and trunk. Thanks Amareshwari!, Integrated in Hadoop-Mapreduce-trunk-Commit #71 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Mapreduce-trunk-Commit/71/])
    . Deprecate ClusterStatus and add javadoc in ClusterMetrics. Contributed by Amareshwari Sriramadasu.
, Integrated in Hadoop-Mapreduce-trunk #112 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Mapreduce-trunk/112/])
    ]