[Here's a patch to move the directory structure to use blockforensics (rather than block_forensics), which is the package name that is currently being used. When committing this would be done with 

{code}
svn mv src/contrib/block_forensics/src/java/org/apache/hadoop/block_forensics src/contrib/block_forensics/src/java/org/apache/hadoop/blockforensics
{code}, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12439489/MAPREDUCE-1348.patch
  against trunk revision 925561.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h3.grid.sp2.yahoo.net/349/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h3.grid.sp2.yahoo.net/349/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h3.grid.sp2.yahoo.net/349/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h3.grid.sp2.yahoo.net/349/console

This message is automatically generated., This change is a simple move, and no tests are needed. The test failure is unrelated., +1

I committed this. Thanks, Tom!, Integrated in Hadoop-Mapreduce-trunk-Commit #290 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Mapreduce-trunk-Commit/290/])
    . Fix block forensics packaging. Contributed by Tom White
, Integrated in Hadoop-Mapreduce-trunk #270 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Mapreduce-trunk/270/])
    ]