[The issue is with the order of your arguments.  I know this is ugly, but it is difficult to fix for various backwards compatibility reasons.  The -archives and -files need to come before the -input argument.  They need to be at the beginning like with the -D arguments., I got the usage of these options, but for an user/beginner without going through the code it will be difficult to understand the usage of these options by seeing the below -info detailed usage

{code:xml}
Generic options supported are
-conf <configuration file>     specify an application configuration file
-D <property=value>            use value for given property
-fs <local|namenode:port>      specify a namenode
-jt <local|jobtracker:port>    specify a job tracker
-files <comma separated list of files>    specify comma separated files to be copied to the map reduce cluster
-libjars <comma separated list of jars>    specify comma separated jar files to include in the classpath.
-archives <comma separated list of archives>    specify comma separated archives to be unarchived on the compute machines.

{code}

I suggest to change the above messages like this

{code:xml}
Generic options supported are
-Dconf=<configuration file>     specify an application configuration file
-D <property=value>            use value for given property
-Dfs=<local|namenode:port>      specify a namenode
-Djt=<local|jobtracker:port>    specify a job tracker
-Dfiles=<comma separated list of files>    specify comma separated files to be copied to the map reduce cluster
-Dlibjars=<comma separated list of jars>    specify comma separated jar files to include in the classpath.
-Darchives=<comma separated list of archives>    specify comma separated archives to be unarchived on the compute machines.
{code}

{code:xml}
02/02/19 10:55:51 WARN streaming.StreamJob: -file option is deprecated, please use generic option -Dfiles instead.
{code}

{code:xml}
02/02/19 10:55:51 WARN streaming.StreamJob: -cacheArchive option is deprecated, please use -Darchives instead.
{code}

, It is not a -D option.  

-D conf=file.conf

will not work. It has to be -conf file.conf. But all generic options must appear on the command line before any of the non-generic options like -input, -output, etc.

The Generic Options Supported message is correct, but it does not indicate where those options are allowed on the command line and where they are not allowed.  If you want to reopen the ticket to improve the message that would be great.


 , Reopening this issue to improve the usage info.]