[I am not sure why this issue is showing up now because MAPREDUCE-2494 did not modify that part of the code, but it is correct that it should be a static inner class.  The change is simple to do, I should have a patch for it very shortly., OK I was wrong after looking at the changed I did touch that part of the code with the intention of making it static, but I guess I never did it.  This patch fixes that.  There are no new tests for it, as it is a very simple change., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12481836/MR-2573-mr-trunk-V1.patch
  against trunk revision 1133226.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed these core unit tests:
                  org.apache.hadoop.cli.TestMRCLI
                  org.apache.hadoop.fs.TestFileSystem

    -1 contrib tests.  The patch failed contrib unit tests.

    +1 system test framework.  The patch passed system test framework compile.

Test results: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/363//testReport/
Findbugs warnings: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/363//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/363//console

This message is automatically generated., I really don't know what is happening with the contrib and core tests.  I only changed a single line to make an inner class static that should be static.  Also the precommit 363 build, that Jenkins is pointing us to failed, so it must not be the correct build. , Committed to trunk. Thanks Robert., Integrated in Hadoop-Mapreduce-trunk-Commit #720 (See [https://builds.apache.org/job/Hadoop-Mapreduce-trunk-Commit/720/])
    MAPREDUCE-2573. Fix new findbugs warning introduced by MAPREDUCE-2494. Contributed by Robert Joseph Evans.

todd : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1134121
Files : 
* /hadoop/mapreduce/trunk/src/java/org/apache/hadoop/mapreduce/filecache/TrackerDistributedCacheManager.java
* /hadoop/mapreduce/trunk/CHANGES.txt
, Todd, thanks for catching this and committing it., Integrated in Hadoop-Mapreduce-trunk #722 (See [https://builds.apache.org/job/Hadoop-Mapreduce-trunk/722/])
    ]