[Is this related to MAPREDUCE-1945 which added this call to UserGroupInformation.isLoginKeytabBased() recently ?, Attach a patch. Can't run tests on it since trunk is broken., > Is this related to MAPREDUCE-1945

Yes. I manually verified the patch on a secure cluster, but forgot to check when security is turned off., +1.  This should work for both secure and unsecure., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12451174/m1992-02.patch
  against trunk revision 982087.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/349/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/349/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/349/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/349/console

This message is automatically generated., Resubmitting for hudson as there are many test failures because of NoClassDefFoundError , -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12451174/m1992-02.patch
  against trunk revision 982242.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/351/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/351/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/351/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/351/console

This message is automatically generated., This patch has been manually verified. Simply bring up a jobtracker with security turned off and check it's up properly and no NPE is thrown., Although the patch solves the issue at hand, I will like to understand how the testcases, that all have unsecure setup, are passing without the patch. Kan, could you please dig a bit deeper and get the explanation. Thanks!, I wonder about that, too. But I suggest we commit this patch now so that other people are unblocked. I'll take a look later on why existing unit tests didn't catch it and open a new jira if necessary., Okay. I have committed the fix to trunk (since the fix seems the right thing to do anyway) but please investigate why the unit tests didn't catch the problem earlier. I am not marking the issue "resolved" yet., Looks like I screwed it up when I ran tests for MAPREDUCE-1945, since the Hudson run for MAPREDUCE-1993 clearly caught this bug. I ran my local test again and caught it, too., Resolving, as the patch has been committed., Integrated in Hadoop-Mapreduce-trunk-Commit #523 (See [https://hudson.apache.org/hudson/job/Hadoop-Mapreduce-trunk-Commit/523/])
    ]