[The NPE is occurring because of not handling null return when systeminfo shell call throws exception (for any reason).
Ideally the exception would be propagated but the ResourceCalculatorPlugin interface does not support it., Attaching fix with regression test., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12545071/MAPREDUCE-4657.branch-1-win.1.patch
  against trunk revision .

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/2853//console

This message is automatically generated., Some comments:
# Why change LOG.debug to LOG.info? Why not change it to LOG.warn()?
# If sysInfo is null the method silently returns. Is there a need for printing a log?, 1) Thats because I dont want to suppress the log. This would indicate running with an incompatible version of winutils
2) There is no log when sysInfo is null. Can you apply the patch to the code and check again?, bq. Thats because I dont want to suppress the log. This would indicate running with an incompatible version of winutils
I understand that. Why LOG.info and not LOG.warn(). The logs seem like they should be warning.

bq. There is no log when sysInfo is null. Can you apply the patch to the code and check again?
I am not sure I understand your comment. Prior to your patch when sysInfo is null, a null pointer exception happened indicating an error. Now there is no log? However after closely looking at the code, the method used for getting sysInfo print LOG.error(). So it should be fine.
, I just want to prevent the log from getting lost because of logging rules. I can change it to Log.error() in fact., bq. I just want to prevent the log from getting lost because of logging rules. I can change it to Log.error() in fact.
Sorry I was not clear earlier. LOG.warn is generally higher priority than LOG.info and it will certainly get printed. LOG.warn is used to warn about things not working correctly. LOG.info is just informational and does not indicate errors/warnings.

So can you please change that LOG.info to LOG.warn., Changed the log message., {color:red}-1 overall{color}.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12547652/MAPREDUCE-4657.branch-1-win.2.patch
  against trunk revision .

    {color:red}-1 patch{color}.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/2905//console

This message is automatically generated., Canceling the patch since submit patch does not work for branch-1-win., +1 for the patch. I committed it. Thank you Bikas.]