[BTW, the job has some failed map tasks., I *think*, the following could be the reason

We are initializing remainingMaps as totalMaps. But if we configure *mapreduce.map.failures.maxpercent* as some non zero value, job will proceed to run even some maps fail (configured %). However, decrementing count of remainingMaps, only when the map output copy is sucessful. But even if a single map fails, it will not be copied and so remainingMaps will be non zero always. 

{code:title=ShuffleScheduler.java|borderStyle=solid}
 if (--remainingMaps == 0) {
        notifyAll();
 }
{code}, Shuffle phase hangs,as long as *remainingMaps > 0*. We are decrementing the count of *remainingMaps* only when the copy phase is sucessful.But for the failedmaps, we are not decrementing *remainingMaps* count. We should decrement it. Attaching the patch for the same.

Tested the patch by setting *mapreduce.map.failures.maxpercent* value as 2. Ran a job having 104 map tasks and failed 2 map tasks. Job is till passing.

Please look into the patch and provide your comments., Patch looks fine to me.
One minor comment:
What about the "progress of map tasks" when there are failed-maps ? Is it getting updated to 100% ? I see copySucceded() is updating the progress of map-tasks. So what happens when the last few maps fail ?, Seems dup of MAPREDUCE-3927., Duplicate of MAPREDUCE-3927., Thanks Ravi for taking a look into the patch

bq.What about the "progress of map tasks" when there are failed-maps ? Is it getting updated to 100% ? I see copySucceded() is updating the progress of map-tasks. So what happens when the last few maps fail ?

Suppose say a user has configured *mapreduce.map.failures.maxpercent* as 2, so job can tolerate upto  2% of map tasks failures. 
As "progress of map tasks" indicates percentage of the sucessful completion of map tasks, I *think* showing the actual *progress* may be more useful than showing 100%. 
i.e. if "progress of map tasks" indicates 99%, by this, atleast it gives an idea that 1% of map tasks have been failed and consequently may take action on that failed map tasks.

OTOH, if "progress of map tasks" should indicate the overall progress of the map phase, then patch needs to be updated to reflect the same.

As this has been duplicated, we can have our further discussion at [MAPREDUCE-3927|https://issues.apache.org/jira/browse/MAPREDUCE-3927], Dropping fix-version from 'non-fixed' (didn't have code-fixes) JIRAs.]