[This patch fixes the problem by explcitly creating the temp directory. File open operations in, e.g., hdfs, will auto-create the tmpdir. But in s3n, which expects an object with the name {{_somename_$folder$}}, this won't happen. As a result, the {{fullyDelete()}} call fails (silently) because the folder doesn't exist, even though there are objects with the tmpdir prefix in their object names.

I tested this patch manually by verifying temp dir creation during a distcp to s3n, and verifying that the temp dir object was removed at the end of the transfer., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12419248/MAPREDUCE-971.patch
  against trunk revision 813585.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h3.grid.sp2.yahoo.net/26/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h3.grid.sp2.yahoo.net/26/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h3.grid.sp2.yahoo.net/26/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h3.grid.sp2.yahoo.net/26/console

This message is automatically generated., +1, patch lgtm, I've just committed this. Thanks Aaron!, Integrated in Hadoop-Mapreduce-trunk-Commit #46 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Mapreduce-trunk-Commit/46/])
    . distcp does not always remove distcp.tmp.dir. Contributed by Aaron Kimball.
, It is good that this tested manually andit is appriciated that the manual test was outline here.  But why was no unit test added so that the fix can be verified automatically on future builds? , An automated unit test for an S3-based system would require hardcoding S3 access credentials and connecting to an S3 account (which is a for-pay resource)., Cool, thanks for the additional info., Integrated in Hadoop-Mapreduce-trunk-Commit #106 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Mapreduce-trunk-Commit/106/])
    . Document use of distcp when copying to s3, managing timeouts
in particular. Contributed by Aaron Kimball
, Integrated in Hadoop-Mapreduce-trunk #133 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Mapreduce-trunk/133/])
    ]