[We see this on our clusters too.

Attached is a script that I run from cron to cleanup old userlogs. The general idea is setting some high water mark for userlog disk space, and when passed, delete logs until passing some low water mark. Logs for running jobs are excluded from cleanup, which has infrequently caused issues but in general are worth excluding.

Posting as an example of what the replacement might look like (as an internal periodic task, of course). Also, not sure how the nextgen stuff deals with cleanup., Attached fix will delete leftover user logs which are last modified 7 days ago
and are not for any running jobs when TaskTracker restarts. 
UserLogCleaner still
takes care of normal user logs cleanup.
DEFAULT_USER_LOG_RETAIN_HOURS is 1 day, so I added new
DEFAULT_USER_LOG_RETAIN_MAX_HOURS as 7 days.

I would like to have a separate JIRA to handle cleanup old userlogs based on
userlog disk space water mark since which may deal with job configuration settings
change.
, Hi Sherry, does this issue not also affect trunk? If so, would you mind preparing a trunk patch as well?, Aaron,
I believe MAPREDUCE-1100 and related JIRAs change how task-logs work. We may not need to have this patch for trunk at this point., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12482575/MAPREDUCE-2589.patch
  against trunk revision 1145889.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/464//console

This message is automatically generated., The patch looks good.

One minor nit:

 I think the variable name below:

{quote}
  long logRetainiMillSec = DEFAULT_USER_LOG_RETAIN_MAX_HOURS * 60 * 60 * 1000;
{quote}
was supposed to be logRetainMilliSec? (spelling mistake?)

Also, can you please post the ant test results on the jira? 

THe patch lacks unit tests,  have you already verified the fix on a small cluster?, One improvement can be done in the patch, now for every file in the user log directory it is getting the jobs which are to be completed every time and checking. Instead of this it can get the jobs list once and can check for all the files in the user log directory whether it belongs to running job or not., Fixed typo.
Ant test passed by manually testing in a single node cluster.
, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12487372/MAPREDUCE-2589_1.patch
  against trunk revision 1149323.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/493//console

This message is automatically generated., Sherry,
 Sorry I looked at it again and I think its good if we make the DEFAULT_USER_LOG_RETAIN_MAX_HOURS configurable. Also, -1 should disable the feature. I think its important to be able to switch off misbehaving configuration. 

Also, why do we need a call to get jobs that are still running? I thought the call was made only on restart/reinit? We should be able to clean old user logs without calling jc.jobstocomplete? I think we should avoid adding a dependency on calling jobtracker client methods in the tasktracker itself. what do you think?, Mahadev,

Per Bharath (Mundlapudi), his change in MAPREDUCE-2415 distributes TaskTracker userlogs onto multiple
disks, it went into 0.20.204.
Changes in MAPREDUCE-2415 strengthened TaskTracker reliability with regard to disk failures, also
have addOldUserLogsForDeletion() to add the job log directories for deletion with default retain hours.

I tested with MAPREDUCE-2415 change in, all old job log directories will be deleted after default retain hours.

I think my change here is not necessary, I would like to withdraw it. Is it OK with you?
, Sherry,
 That sounds good to me! Please resolve this as WONT FIX., Closed upon release of 0.20.205.0]