[The same problem is with queue -info <queue-name> too.

Sreekanth and Chaitanya quickly debugged into this and found out the reason for this to be a missing flush of stream in the JobQueueClient., Uploading fix patch for this issue., Hmm. Do we need a flush in the case where an invalid queue is given too ?, flush seems to be required when queue is not found. Uploading patch with this case also handled., Looks good to me. +1. I don't suppose we can write a unit test for this ? Can Vinod confirm that this fixes the problem, and we can start the test-patch and test runs ?, I verified on a single node cluster that flush() call works. +1 for the fix., ran test-patch locally. It gives +1.

[exec] +1 overall.  
     [exec] 
     [exec]     +1 @author.  The patch does not contain any @author tags.
     [exec] 
     [exec]     -1 tests included.  The patch doesn't appear to include any new or modified tests.
     [exec]                         Please justify why no new tests are needed for this patch.
     [exec]                         Also please list what manual steps were performed to verify this patch.
     [exec] 
     [exec]     +1 javadoc.  The javadoc tool did not generate any warning messages.
     [exec] 
     [exec]     +1 javac.  The applied patch does not increase the total number of javac compiler warnings.
     [exec] 
     [exec]     +1 findbugs.  The patch does not introduce any new Findbugs warnings.
     [exec] 
     [exec]     +1 release audit.  The applied patch does not increase the total number of release audit warnings.
     [exec] 
     [exec] 
     [exec] 
     [exec] 
     [exec] ======================================================================
     [exec] ======================================================================
     [exec]     Finished build.
     [exec] ======================================================================
     [exec] ======================================================================
, the -1 for tests is beacuse there are no unit tests  to this patch., bq. the -1 for tests is beacuse there are no unit tests to this patch.

Given the fix is the addition of two writer.flush() calls that can't be verified more directly, and manual verification is done, I am fine with this., ran ant test and it passed successfully, I just committed this. Thanks, Chaitanya !, I don't understand why this was committed with no unit tests.  Hemanth, Chaitanya, can you guarantee this won't break again in the future?

We have cli tests in mapreduce.  Would it not have been a simple addition to that?, Nigel, we already have a test in MAPREDUCE-862 that validates output of a command like TestCLI does. The test captures the output and validates what's expected. However, the writer we use in the test case does not seem to require a flush to get the data. So, the test passes. However, when we tested on a real cluster, the flush was required with the System.out stream. 

Also, it was not a simple addition to TestCLI. IIRC, we needed to add the queue command type to the TestCLI class. And that requires a patch to common. I think that is undesirable. TestCLI should be refactored so projects can add commands without having to submit patches to common, an effort for which there was no time close to the feature freeze.]