[- When {{parent == null}}, should it be not added to {{parents}} list?

- It seems that you are not using the latest trunk., This problem is not there in the latest trunk. It is coming in 0.20.3 branch. Patch is provided for that., Hi Devaraj, if the problem is not in the latest trunk, is it already fixed by some other JIRAs?  Do you know which JIRAs have fixed it?, Hi Nicholas, I couldnot find the jira id, but the problem is rectified in the trunk., For 0.20, is it the same that when {{parent == null}}, it should not be added to parents list?, devaraj,
 the jira says that the bug affects 0.23 and the fix is for 0.23. But you mentioned above that the trunk doesnt have this issue? Do you intend to close the jira as resolved?, I have mistakenly selected the patch version as 0.23, but it is intended for 0.20.3. It would be better if we commit these changes in 0.20.3., Thanks for reviewing.

@Nicholas: 

{quote} 
is it the same that when parent == null, it should not be added to parents list?
{quote} 

Yes.

If it is unix system, for root dir it will go here and do nothing.
{code:xml} 
    Path root = new Path(Path.SEPARATOR);
    for (int i = 0; i < deepest.depth(); i++) {
      List<Path> parents = new ArrayList<Path>();
      for (Path p: justDirs) {
        if (p.compareTo(root) == 0){
          //don nothing
        }
{code} 
For windows system, when p is windows root dir (i.e. like C: ), it will go in else and parent will come as null, and causes NullPointerException.
{code:xml}
        else {
          Path parent = p.getParent();
          if (allpaths.containsKey(parent.toString())) {
            HashSet<String> children = allpaths.get(parent.toString());
            children.add(p.getName());
          }
{code} , Let me clarify my question: after the patch, the codes look like
{code}
Path parent = p.getParent();
if(null != parent) {
  ...
}
parents.add(parent);
{code}
If {{parent == null}}, we add it to {{parents}}.  Should it not be added? Otherwise, I think we will get NPE later., Sorry for late reply.

parents is assigning to justDirs and justDirs used in the for loop only. When null gets added to parents loop ends because i reaches to deepest.depth().

If we move parents.add(parent); inside null check or if we keep outside also doesnot give any functionality difference. 
, Hi Devaraj, thanks for the explanation of the codes.  I really like the following comment in the codes.
{code}
// this is tricky
{code}
Still, how about moving {{parents.add(parent)}} inside null check for easing future maintenance?

Since the 0.23 have this part of codes. let's also commit it., Hi Nicholas, I have updated the patch and also provided patch as per above comments., +1 patch look good. Thanks a lot!, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12477114/MAPREDUCE-2317-trunk.patch
  against trunk revision 1094093.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

    +1 system test framework.  The patch passed system test framework compile.

Test results: https://builds.apache.org/hudson/job/PreCommit-MAPREDUCE-Build/179//testReport/
Findbugs warnings: https://builds.apache.org/hudson/job/PreCommit-MAPREDUCE-Build/179//artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Console output: https://builds.apache.org/hudson/job/PreCommit-MAPREDUCE-Build/179//console

This message is automatically generated., The failed tests are not related; see MAPREDUCE-2448.

This is a simple change.  Devaraj has tested it manually.  No new tests needed.

I have committed this.  Thanks, Devaraj!, Integrated in Hadoop-Mapreduce-trunk-Commit #645 (See [https://builds.apache.org/hudson/job/Hadoop-Mapreduce-trunk-Commit/645/])
    , Integrated in Hadoop-Mapreduce-22-branch #42 (See [https://builds.apache.org/hudson/job/Hadoop-Mapreduce-22-branch/42/])
    , Integrated in Hadoop-Mapreduce-trunk #669 (See [https://builds.apache.org/hudson/job/Hadoop-Mapreduce-trunk/669/])
    ]