[It looks like the "file:" directory is generated in ContainerLocalizer.initDirs., Further analysis

ContainerLocalizer.initDirs qualifies (e.g. file:///tmp instead of just /tmp) all paths and then serializes the qualified path as strings into the Configuration. Qualified paths are not part of the supported interface as part of the fs LocalDirAllocator. It in turn tries to deserializes the qualified path strings directly into a java.io.File. Thus instead of testing to see whether the path is user writable, it instead recursively creates a dir name file: containing a dir named tmp in the current working directory of the local file system., No unit test were added for this one line change., Jonathan, the path is still being created when running unit tests - TestResourceLocalization seems to be the culprit.
It may make sense to generate a warning, if not an error, until LocalDirAllocator works with schemes., Good catch! It looks like it is also using qualified paths in the tests. I started a patch for the local dir allocator allowing qualified paths. My hesitation is that after starting the patch for allowing schemas, local dir allocator stopped allowing relative paths. Do you have any suggestion on what direction to go. It seems that both can help the problem. Please advise., For now, we should probably just have a utility function to figure out how to interpret paths specified by the user - this can take care of converting them to the correct format or spewing out warnings (ref: DataNode.getStorageDirs). Having a consistent format for specifying local dirs between MR and HDFS would be nice.
The LocalDirAllocator could be changed to work with and without schemes (accepting only file:) while still working with absolute and relative paths. That would be a hadoop common jira.
, -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12491544/MAPREDUCE-2757-trunk-v1.patch
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    -1 patch.  The patch command could not apply the patch.

Console output: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/543//console

This message is automatically generated., Again the Apache headers :(., Jonathan, is this ready for commit? I don't see it marked PA, thanks., @Arun

My feeling is that JIRA should be duplicated to HADOOP-7575, which fixes this problem more systematically. If you agree, I will go ahead and dupe this JIRA.

, bq. [..] should be duplicated to HADOOP-7575, which fixes this problem more systematically.
+1. Closing this., Ramya, we can verify this once HADOOP-7575 goes in. Thanks.]