[Attaching a patch for review. Changes are as follows
# FIxed TraceBuilder (regex) to consider jobhistory filenames generated using trunk
# Fixed JobBuilder to take care of RunState changes
# Added a testcase to test the following
 ## test TraceBuilder regex
 ## test JobHistoryParserFactory
 ## test if the (avro) jobhistory files are parsed by CurrentJHParser

The testcase fails without the patch.

test-patch and ant-test passed. Manually tested the patch on jobhistory files from trunk., I have a couple of code review comments on {{mapreduce-1865-v1.2.patch}} .

My small comments are:

1: In {{TestRumenJobTraces.testJobHistoryFilenameProcessing()}}, {{JobID}}'s should probably be built with the {{JobID(String jtIdentifier, int id)}} constructor.  Also, {{JobID}} jhas an {{equals(Object)}} method and the raw {{JobID}}'s can therefore be fed into {{assertEquals(String, Object, Object)}}.

My big comment is: In {{TestRumenJobTraces}} code, can the {{JobHistory}} log files be built by a minicluster running some trivial job such as a 1 second sleep job, instead of being canned in {{small-trace-test}} ?

-dk
, Hit by a bug in TaskAttemptStartedEvent. , Attaching a patch incorporating Dick's comments. Changes are as follows
- Testcase changes to run a job using MiniMRCluster and then test Rumen parsing against that as compared to having a hard-coded jobhistory file.
- Used JobID.compare instead of stringified JobIDs. 

Test-patch and ant-test passed on my box., Had a look at the code changes othe than the test cases. Changes look good.

One minor comment: Why is the new task status value "SUCCEEDED" changed to "SUCCESS" ? Can we do the other way round and changing Values.SUCCESS to Values.SUCCEEDED(and changing SUCCESS to SUCCEEDED in JobBuilder when needed, because SUCCEEDED is the new value) ?, bq.Why is the new task status value "SUCCEEDED" changed to "SUCCESS" ?
Because the method name is {{getPre21Value()}} and the expected value should be one amongst {{Pre21JobHistoryConstants.Values}}., Some minor comments on the patch:

(1) The follwoing line in the test case testJobHistoryFilenameParsing() seems to be unused code(so can be removed).
 Path inDir = new Path(rootInputDir, "test");

(2) Javadoc for the testcase testJobHistoryFilenameParsing() can be changed to something like history_file_name_parsing/JH_conf_file_name_parsing instead of just saying parsing apis sothat it will be clear that it is validating parsing of file names and not parsing content of files. Also assertion-failure messages should say 'parsing of file names' instead of 'parsing of files'.

(3) testCurrentJHParser() seems to be assuming that the SETUP & CLEANUP tasks will be launched using map slots only. To avoid this assumption, should we set "mapreduce.job.committer.setup.cleanup.needed" to false for this job ?

(4) Please add "lfs.delete(tempDir, true);"  in the finally block in testCurrentJHParser() to clean input and output directories.

(5) 2 comments in Pre21JobHistoryConstants.java have missplelt word 'jt-indentifier'.

--------------------------

Other code changes look good., Attaching a patch incorporating Ravi's comments. test-patch and ant tests passed on my box., Attaching a slightly modified patch with changes to comments and assert messages., Patch looks good.
+1, I just committed this! Thanks Amar!, Integrated in Hadoop-Mapreduce-trunk-Commit #523 (See [https://hudson.apache.org/hudson/job/Hadoop-Mapreduce-trunk-Commit/523/])
    ]