[Maximum capacity set on a container queue is not getting honored. For ex: If Queue A has Queue A1 and Queue A2 as child queues (leaf queues), and if max capacity is not set for the child queues and set only to the container queue (Queue A), then all the slots occupied by the jobs submitted to Queue A1 and Queue A2 should not exceed the maximum capacity configured for Queue A. However, it is not the case now. Tasks gets scheduled beyond Queue A's configured max capacity. , Attaching the initial patch for 22.

Thanks,
Mayank, You should work on usual formatting issues.

So the fix as I understood is to build a hierarchy of queues by setting the parent member. Then find the parent that has maxCapacity set, and verify it is not exceeded. Sounds like the right approach.
Do you need to update the current capacity for the parent, when you allocate new slots for a child queue?, This JIRA indicates that trunk is affected, but I believe this has already been addressed in trunk (and branch-2 and branch-0.23) by MAPREDUCE-3683., Jason,

I did not realize that it is already fixed in trunk will update the JIRA. Thanks for pointing this out.


Konst,

Thats already been done in when tasks been assigned any queue.

Thanks,
Mayank, Thanks Konst for your comments.

Updated the patch with formatting issues.

Thanks,
Mayank, Patch looks good. Wanted to commit it, but mumak tests are failing.
Run test-contrib target, you will see., Sorry my mistake. I had something else running on my box on port 50030, preventing SiulatorJobTracker to start for mumak. It's fine now. I'll commit the patch.
Will remove unused variable counter in the new test., I just committed this. Thank you Mayank., Integrated in Hadoop-Mapreduce-22-branch #108 (See [https://builds.apache.org/job/Hadoop-Mapreduce-22-branch/108/])
    MAPREDUCE-4360. Capacity Scheduler Hierarchical leaf queue does not honor the max capacity of container queue. Contributed by Mayank Bansal. (Revision 1355514)

     Result = SUCCESS
shv : http://svn.apache.org/viewcvs.cgi/?root=Apache-SVN&view=rev&rev=1355514
Files : 
* /hadoop/common/branches/branch-0.22/mapreduce/CHANGES.txt
* /hadoop/common/branches/branch-0.22/mapreduce/src/contrib/capacity-scheduler/src/java/org/apache/hadoop/mapred/CapacityTaskScheduler.java
* /hadoop/common/branches/branch-0.22/mapreduce/src/contrib/capacity-scheduler/src/java/org/apache/hadoop/mapred/QueueHierarchyBuilder.java
* /hadoop/common/branches/branch-0.22/mapreduce/src/contrib/capacity-scheduler/src/java/org/apache/hadoop/mapred/QueueSchedulingContext.java
* /hadoop/common/branches/branch-0.22/mapreduce/src/contrib/capacity-scheduler/src/test/org/apache/hadoop/mapred/TestContainerQueue.java
]