[Patch fixing the bug. Added a testcase which fails without the patch and passes with the patch., +1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12435570/patch-1398.txt
  against trunk revision 909241.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h3.grid.sp2.yahoo.net/317/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h3.grid.sp2.yahoo.net/317/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h3.grid.sp2.yahoo.net/317/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h3.grid.sp2.yahoo.net/317/console

This message is automatically generated., Added one more assertion to the testcase., Looks good overall. Few minor nits:

- The default value for taskMemoryManagerEnabled was changed in the patch which seemed unnecessary. Can we instead override isTaskMemoryManagerEnabled, if we just want to short circuit this in the test case ?
- We can use the setIndexCache API to initialize the index cache in the main TT also.
- It would be really helpful to add a log line where we break the TaskLauncher's loop on detecting the killed condition.

Can you please make these changes and make the patch run through Hudson ?, Patch with comments incorporated.

bq. The default value for taskMemoryManagerEnabled was changed in the patch which seemed unnecessary. Can we instead override isTaskMemoryManagerEnabled, if we just want to short circuit this in the test case ?
Instead of overriding isTaskMemoryManagerEnabled(), I made setTaskMemoryManagerEnabledFlag() method package private and called it from testcase to turn off memory management., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12435943/patch-1398-2.txt
  against trunk revision 910223.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    -1 findbugs.  The patch appears to introduce 1 new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/455/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/455/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/455/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/455/console

This message is automatically generated., bq. -1 findbugs.
The patch did not introduce any new unsynchronized code. TaskTracker.indexCache is already accessed without synchronization from MapOutputServlet. The patch introduced a method setIndexCache which is called from a synchronized method, findbugs is complaining because percentage of synchronization got modified. I raised MAPREDUCE-1497 to address the same, Patch for Yahoo! distribution. 
Ran ant test and test-patch.  test-patch failed because of MAPREDUCE-1497. All unit tests passed except TestNodeRefresh (due to MAPREDUCE-677). TestNodeRefresh passed when I reran the test., bq. The patch did not introduce any new unsynchronized code.

I verified this. Also, per comment from Chris in MAPREDUCE-1497, IndexCache is probably already thead-safe. Hence, this might be a legitimate case of suppressing findbugs warning. Based on this, I think the patch is ready for commit., I just committed this. Thanks, Amareshwari !, Integrated in Hadoop-Mapreduce-trunk-Commit #242 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Mapreduce-trunk-Commit/242/])
    . Fix TaskLauncher to stop waiting for slots on a TIP that is killed / failed. Contributed by Amareshwari Sriramadasu.
, Updated patch for earlier version of Hadoop. Not for commit here.]