[Suman tells me that she saw SUCCEEDED jobs show up in the logs with status as RUNNING, which given our code structure of JobInProgress.jobCompleted being the only entry point to mark jobs as SUCCEDED is probably indicative of a race-condition., Though I saw the issue with successful jobs but couldn't reproduce it. The issue is quite consistent for "failed" and "killed" jobs. Jobtracker log shows the status "RUNNING" for these jobs.

Log Message:
==========
2009-07-27 05:46:14,276 INFO org.apache.hadoop.mapred.JobInProgress$JobSummary: jobId=job_200907270543_0003,submitTime=1248673540705,launchTime=1248673544024,finishTime=0,numMaps=2,numSlotsPerMap=1,numReduces=1,numSlotsPerReduce=1,user=hadoopqa,queue=default,status=RUNNING,mapSlotSeconds=38,reduceSlotsSeconds=0,clusterMapCapacity=102,clusterReduceCapacity=34
2009-07-27 05:46:14,277 INFO org.apache.hadoop.mapred.JobHistory: Moving completed job from file:<log dir path>/mapred/history/<hostname>_1248673437715_job_200907270543_0003_hadoopqa_streamjob5894288556860737357.jar to file:<log dir path>/mapred/history/done/<hostname>_1248673437715_job_200907270543_0003_hadoopqa_streamjob5894288556860737357.jar
2009-07-27 05:46:14,278 INFO org.apache.hadoop.mapred.JobHistory: Moving configuration of completed job from file:<log dir path>/<hostname>_1248673437715_job_200907270543_0003_conf.xml to file:<log dir path>/mapred/history/done/<hostname>_1248673437715_job_200907270543_0003_conf.xml
, Doh! Looks like the final patch I uploaded to MAPREDUCE-740 was slighlty older which missed the current changes in these patches to correctly log the job-summary for failed jobs. The attached patches fixes my snafu... my bad.

Suman - I still don't see how SUCCEEDED jobs can be logged as RUNNING - but for a race condition I can't see yet. I'd appreciate if you could try to reproduce it and provide me the JobTracker logs. Thanks!, Patch looks good. +1, All test cases pass, 'ant test-patch' does too and I've not included any new testcases since it's essentially the same fix as MAPREDUCE-740 and I can't add more tests for the reasons elaborated there.

Also, this patch only fixes logging for FAILED/KILLED tasks and Suman hasn't been able to reproduce the error for SUCCEEDED ones, I'll commit this patch and we can open a different jira if she can reproduce it later., I just committed this., Arun, added your name in CHANGES.txt.
{noformat}
-    and KILLED jobs. 
+    and KILLED jobs.  (acmurthy)
{noformat}, Integrated in Hadoop-Mapreduce-trunk #33 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Mapreduce-trunk/33/])
    . Fix job-summary logs to correctly record status of FAILED and KILLED jobs.
]