[As someone working on higher up the stack, I have seen this {{if}} code block in all the clients. Ideally, {{jobclient}} should do it, freeing apps from this unnecessary requirement. Thanks, Harsh for picking this up! , Here's a simple attempt, which modifies JobClient's initializer method alone.

With YARNRunner involved (via JobSubmitter, which ignores conf when sought), I am unsure where to place it. I _think_ its sufficient for JobClient alone to have it, but if the code has diverged much beyond JobClient paths when using Job (new API), then this patch may not suffice., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12534118/MAPREDUCE-4324.patch
  against trunk revision .

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 eclipse:eclipse.  The patch built with eclipse:eclipse.

    +1 findbugs.  The patch does not introduce any new Findbugs (version 1.3.9) warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed unit tests in hadoop-mapreduce-project/hadoop-mapreduce-client/hadoop-mapreduce-client-core.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/2537//testReport/
Console output: https://builds.apache.org/job/PreCommit-MAPREDUCE-Build/2537//console

This message is automatically generated., I suspect doing this may break MAPREDUCE-3727?, Doing this would break (or be defunct due to) MAPREDUCE-3727 I think. Resolving as Won't Fix at this point.

Users should continue manually configuring this.]