[There's an ambiguity between sick nodes (typically due to failing hardware, either hard drive or memory or occasionally NIC/network switch) and nodes that have been rendered unresponsive due to user abuse.  The existing blacklist heuristics touch on this, but they're a bit ad hoc, and there's not much visibility on the internal state at any given time.

One improvement would be to track the per-node, per-job blacklisting history in a sliding window that's divided into buckets of some suitable granularity.  Bad hardware would tend to show up as an elevated fault level on one node (or a few nodes) for an extended period--i.e., multiple buckets--while abusive jobs would tend to show up as a spike (ideally) or at least a limited-duration jump in faults (one or a few buckets) across many nodes.

Because the heuristics are open to argument even among experts (which would not include me), and because automatic, hardcoded blacklisting has the potential to wipe out a good fraction of a cluster for the wrong reasons, it would seem best to convert the heuristic form of blacklisting to an advisory mode (i.e., "graylisting") until the behavior is better understood., Initial patch; only minimal testing so far.

Still working on TestTaskTrackerBlacklisting.java, which requires some care., "Reasonably final" patch, pending review, test-patch, etc.  I'm firing off tests in a few minutes., This change seems to be already pushed to branch-1.0, I think we can close this ticket.

{code}
commit 2670ab9a04634773659a471f42d9431ef71944cc
Author: Owen O'Malley <omalley@apache.org>
Date:   Fri Mar 4 04:33:31 2011 +0000

    commit 6939f6854b330a01cc4427f4c657df0c3c4d53ab
    Author: Arun C Murthy <acmurthy@apache.org>
    Date:   Fri Jul 23 15:39:49 2010 -0700

        MAPREDUCE-1966. Change blacklisting of tasktrackers on task failures to be a simple graylist to fingerpoint bad tasktrackers. Contributed by Gre$

        +++ b/YAHOO-CHANGES.txt
        +    MAPREDUCE-1966. Change blacklisting of tasktrackers on task failures to be
        +    a simple graylist to fingerpoint bad tasktrackers. (Greg Roelofs via
        +    acmurthy)
        +


    git-svn-id: https://svn.apache.org/repos/asf/hadoop/common/branches/branch-0.20-security-patches@1077596 13f79535-47bb-0310-9956-ffa450edef68
{code}]