[Does the attached patch provide the documentation you had in mind, Amareshwari?, For the following change can you add the link to api documentation.
{code}
+<li><code>typedbytes</code>: The "typed bytes" format as described in the API documentation for the package <code>org.apache.hadoop.typedbytes</code>.</li>
{code}
You can add the external ref in site.xml, and link it from the streaming documentation through href. 
For example, see :
{code}
<a href="ext:api/org/apache/hadoop/mapred/lib/keyfieldbasedpartitioner">KeyFieldBasedPartitioner</a>, 
{code}, Thanks Amareshwari, I've added the link. Any other comments?, Looks like there are no more comments, so I'm going to send this through hudson..., Sorry I missed the last update. Thanks Klaas for updating the patch. Changes look fine to me., I ran ant docs with the patch; and it was successful., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12439036/MAPREDUCE-889.patch
  against trunk revision 927488.

    +1 @author.  The patch does not contain any @author tags.

    +0 tests included.  The patch appears to be a documentation patch that doesn't require tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/61/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/61/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/61/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h4.grid.sp2.yahoo.net/61/console

This message is automatically generated., Obviously, the unit test failures are not related., I've just committed this. Thanks Klaas!, Integrated in Hadoop-Mapreduce-trunk #285 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Mapreduce-trunk/285/])
    MAPREDUCE-889. binary communication formats added to Streaming by HADOOP-1722 should be documented. Contributed by Klaas Bosteels.
]