[Attaching a file which enables memory monitoring if only the old configuration keys are present in the configuration file., Few comments:

- Memory allotted for slot based on old configuration should not be based on getMaxVirtualMemoryForTask(), but on JobConf.MAPRED_TASK_DEFAULT_MAXVMEM_PROPERTY. Also note that this value will be in bytes, while the system maintains everything else in MB. So, it should be converted to MB.
- testTaskMemoryMonitoringWithDeprecatedConfiguration should also set the TT configuration for JobConf.MAPRED_TASK_DEFAULT_MAXVMEM_PROPERTY in bytes instead of MAPRED_TASK_MAXVMEM_PROPERTY., Attaching patch fixing using the correct key and converting the same to MB while allotting total memory alloted to the tasks., Attaching file fixing an issue found during internal testing. Modified test case and code., Removing an unused variable from the test case., Last patch looks fine to me. +1. Running through Hudson. Let's wait for the hudson run before uploading the 20 patch., -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12417108/mapreduce-834-4.patch
  against trunk revision 806065.

    +1 @author.  The patch does not contain any @author tags.

    +1 tests included.  The patch appears to include 3 new or modified tests.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    -1 core tests.  The patch failed core unit tests.

    -1 contrib tests.  The patch failed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/496/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/496/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/496/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-vesta.apache.org/496/console

This message is automatically generated., The patch does not change any part on {{JobTracker}} or streaming api's.

The issue with {{TestRecoveryManager}} timing out is reported on MAPREDUCE-880 and the streaming test case failures are also a known reported issue on hudson.

, Attaching patch for branch 20., I just committed this to trunk and branch 0.20. Thanks, Sreekanth !, Attaching Yahoo! distribution patch.]