[+1 Looks good to me. , -1 overall.  Here are the results of testing the latest attachment 
  http://issues.apache.org/jira/secure/attachment/12431157/MAPRED-1400.txt
  against trunk revision 902272.

    +1 @author.  The patch does not contain any @author tags.

    -1 tests included.  The patch doesn't appear to include any new or modified tests.
                        Please justify why no new tests are needed for this patch.
                        Also please list what manual steps were performed to verify this patch.

    +1 javadoc.  The javadoc tool did not generate any warning messages.

    +1 javac.  The applied patch does not increase the total number of javac compiler warnings.

    +1 findbugs.  The patch does not introduce any new Findbugs warnings.

    +1 release audit.  The applied patch does not increase the total number of release audit warnings.

    +1 core tests.  The patch passed core unit tests.

    +1 contrib tests.  The patch passed contrib unit tests.

Test results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/401/testReport/
Findbugs warnings: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/401/artifact/trunk/build/test/findbugs/newPatchFindbugsWarnings.html
Checkstyle results: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/401/artifact/trunk/build/test/checkstyle-errors.html
Console output: http://hudson.zones.apache.org/hudson/job/Mapreduce-Patch-h6.grid.sp2.yahoo.net/401/console

This message is automatically generated., In some versions of {{tr}}, {{[:space:]}} only covers the space character; in others it covers vertical whitespace as well as horizontal.

The latter isn't an issue, but it looks like {{[:blank:]}} always covers spaces and tabs.  Should we use that instead?  [but it does seem unlikely that the OS name ever includes a tab]

-dk
, FWIW, Single UNIX ® Specification, Version 2, defines these as:

space
    Define characters to be classified as white-space characters. In the POSIX locale, at a minimum, the characters space, form-feed, newline, carriage-return, tab and vertical-tab are included. In a locale definition file, no character specified for the keywords upper, lower, alpha, digit, graph or xdigit can be specified. The characters space, form-feed, newline, carriage-return, tab and vertical-tab of the portable character set, and any characters included in the class blank are automatically included in this class. 

...

blank
    Define characters to be classified as blank characters. In the POSIX locale, only the space and tab characters are included. In a locale definition file, the characters space and tab are automatically included in this class. 

...

[ref: http://opengroup.org/onlinepubs/007908775/xbd/locale.html ]


Of course, if people aren't following POSIX (which /usr/bin/tr on Solaris likely doesn't, but /usr/xpg4/bin/tr definitely does), then it is a bit of gamble which way you go.

, +1

I committed this. Thanks, Allen!, Integrated in Hadoop-Mapreduce-trunk-Commit #238 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Mapreduce-trunk-Commit/238/])
    . Use tr rather than sed to effect literal substitution in
the build script. Contributed by Allen Wittenauer
, Integrated in Hadoop-Mapreduce-trunk #234 (See [http://hudson.zones.apache.org/hudson/job/Hadoop-Mapreduce-trunk/234/])
    . Use tr rather than sed to effect literal substitution in
the build script. Contributed by Allen Wittenauer
]